{"doc_id": "2025__The_future_of_biomarkers_for_vascular_contributions_to_cognitive_impairment_and___W4411519614", "source_path": "<redacted:source_path>", "chunk_id": 0, "source_chunk_idxs": [0, 1], "num_tokens": 376, "text": "The future of biomarkers for vascular contributions to cognitive impairment and dementia (VCID): proceedings of the 2025 annual workshop of the Albert research institute for white matter and cognition | GeroScience\nSkip to main content\nAdvertisement\nLog in\nMenu\nFind a journal\nPublish with us\nTrack your research\nSearch\nCart\n1. Home\n2. GeroScience\n3. Article\n\nThe future of biomarkers for vascular contributions to cognitive impairment and dementia (VCID): proceedings of the 2025 annual workshop of the Albert research institute for white matter and cognition\n- ORIGINAL ARTICLE\n- Open access\n- Published: 21 June 2025\n- ( 2025 )\n- Cite this article\nDownload PDF\nYou have full access to this\nopen access\narticle\nGeroScience\nAims and scope\nSubmit manuscript\nThe future of biomarkers for vascular contributions to cognitive impairment and dementia (VCID): proceedings of the 2025 annual workshop of the Albert research institute for white matter and cognition\nDownload PDF\n- Matthew J Lennon\nORCID: orcid.org/0000-0001-7097-3666\n1\n,\n2\nna1\n,\n- Nikolaos Karvelas\n3\nna1\n,\n- Aravind Ganesh\n4\n,\n- Shawn Whitehead\n5\n,\n- Farzaneh A Sorond\n6\n,\n- Violeta Durán Laforet\n7\n,\n- Elizabeth Head\n8\n,\n- Konstantinos Arfanakis\n9\n,\n10\n,\n11\n,\n- Vijaya B Kolachalama\n12\n,\n13\n,\n- Xiao Liu\n14\n,\n15\n,\n- Hanzhang Lu\n16\n,\n- Joel Ramirez\n17\n,\n- Keenan Walker\n18\n,\n- Erica Weekman\n19\n,\n20\n,\n- Cheryl L Wellington\n21\n,\n- Charisse Winston\n22\n,\n23\n,\n- Frank C Barone\n24\n&amp;\n- ...\n- Roderick A Corriveau\n25\nShow authors\n- 4059 Accesses\n- 2 Altmetric\n- Explore all metrics", "doc_items_refs": ["#/texts/1", "#/texts/2", "#/texts/3", "#/texts/4", "#/texts/5", "#/texts/6", "#/texts/7", "#/texts/8", "#/texts/9", "#/texts/10", "#/texts/11", "#/texts/12", "#/texts/14", "#/texts/15", "#/texts/16", "#/texts/17", "#/texts/18", "#/texts/19", "#/texts/20", "#/texts/21", "#/texts/22", "#/texts/23", "#/texts/24", "#/texts/25", "#/texts/26", "#/texts/27", "#/texts/28", "#/texts/29", "#/texts/30", "#/texts/31", "#/texts/32", "#/texts/33", "#/texts/34", "#/texts/35", "#/texts/36", "#/texts/37", "#/texts/38", "#/texts/39", "#/texts/40", "#/texts/41", "#/texts/42", "#/texts/43", "#/texts/44", "#/texts/45", "#/texts/46", "#/texts/47", "#/texts/48", "#/texts/49", "#/texts/50"], "page_nos": [], "uuid": "6a894ad2-51b6-42fc-b569-cdd34bd7824a"}
{"doc_id": "2025__The_future_of_biomarkers_for_vascular_contributions_to_cognitive_impairment_and___W4411519614", "source_path": "<redacted:source_path>", "chunk_id": 1, "source_chunk_idxs": [2], "num_tokens": 511, "text": "The future of biomarkers for vascular contributions to cognitive impairment and dementia (VCID): proceedings of the 2025 annual workshop of the Albert research institute for white matter and cognition\nAbstract\nAdvances in biomarkers and pathophysiology of vascular contributions to cognitive impairment and dementia (VCID) are expected to bring greater mechanistic insights, more targeted treatments, and potentially disease-modifying therapies. The 2025 Annual Workshop of the Albert Research Institute for White Matter and Cognition, sponsored by the Leo and Anne Albert Charitable Trust since 2015, focused on novel biomarkers for VCID. The meeting highlighted the complexity of dementia, emphasizing that the majority of cases involve multiple brain pathologies, with vascular pathology typically present. Potential novel approaches to diagnosis of disease processes and progression that may result in VCID included measures of microglial senescence and retinal changes, as well as artificial intelligence (AI) integration of multimodal datasets. Proteomic studies identified plasma proteins associated with cerebral autosomal dominant arteriopathy with subcortical infarcts and leukoencephalopathy (CADASIL; a rare genetic disorder affecting brain vessels) and age-related vascular pathology that suggested potential therapeutic targets. Blood-based microglial and brain-derived extracellular vesicles are promising tools for early detection of brain inflammation and other changes that have been associated with cognitive decline. Imaging measures of blood perfusion, oxygen extraction, and cerebrospinal fluid (CSF) flow were discussed as potential VCID biomarkers, in part because of correlations with classic pathological Alzheimer's disease (AD) biomarkers. MRI-visible perivascular spaces, which may be a novel imaging biomarker of sleep-driven glymphatic waste clearance dysfunction, are associated with vascular risk factors, lower cognitive function, and various brain pathologies including Alzheimer's, Parkinson's and cerebral amyloid angiopathy (CAA). People with Down syndrome are at high risk for dementia. Individuals with Down syndrome who develop dementia almost universally experience mixed brain pathologies, with AD pathology and cerebrovascular pathology being the most common. This follows the pattern in the general population where mixed pathologies are also predominant in the brains of people clinically diagnosed with dementia, including AD dementia. Intimate partner violence-related brain injury, hypertension's impact on dementia risk, and the promise of remote ischemic conditioning for treating VCID were additional themes.", "doc_items_refs": ["#/texts/52"], "page_nos": [], "uuid": "8e18dfb8-f6f8-4d09-b42e-d7e2d6d782d1"}
{"doc_id": "2025__The_future_of_biomarkers_for_vascular_contributions_to_cognitive_impairment_and___W4411519614", "source_path": "<redacted:source_path>", "chunk_id": 2, "source_chunk_idxs": [3, 4, 5, 6, 7], "num_tokens": 452, "text": "The future of biomarkers for vascular contributions to cognitive impairment and dementia (VCID): proceedings of the 2025 annual workshop of the Albert research institute for white matter and cognition\nAbstract\nThe Science of Vascular Contributions to Cognitive Impairment and Dementia (VCID): A Framework for Advancing Research Priorities in the Cerebrovascular Biology of Cognitive Decline\nArticle\n01 March 2016\n\nThe future of biomarkers for vascular contributions to cognitive impairment and dementia (VCID): proceedings of the 2025 annual workshop of the Albert research institute for white matter and cognition\nAbstract\nVascular Cognitive Impairment\nChapter\n© 2024\n\nThe future of biomarkers for vascular contributions to cognitive impairment and dementia (VCID): proceedings of the 2025 annual workshop of the Albert research institute for white matter and cognition\nAbstract\nMolecular biomarkers for vascular cognitive impairment and dementia\nArticle\n13 November 2023\n\nThe future of biomarkers for vascular contributions to cognitive impairment and dementia (VCID): proceedings of the 2025 annual workshop of the Albert research institute for white matter and cognition\nAbstract\nExplore related subjects\nDiscover the latest articles, books and news in related subjects, suggested using machine learning.\n- Alzheimer's disease\n- Cerebrovascular disorders\n- Dementia\n- Neuroscience\n- Neuro-vascular Interaction\n- Predictive markers\nUse our pre-submission checklist\nAvoid common mistakes on your manuscript.\n\nThe future of biomarkers for vascular contributions to cognitive impairment and dementia (VCID): proceedings of the 2025 annual workshop of the Albert research institute for white matter and cognition\nIntroduction\nThe science of vascular contributions to cognitive impairment and dementia (VCID) is a field of research investigating the hypothesis that significant dementia-related cognitive decline results from damage to brain function due to vascular injuries of any type [\n1\n]. Diagnoses that fall within the VCID scientific research framework are numerous and include common syndromes such as Alzheimer's disease (AD) dementia and vascular dementia, as well as rare diagnoses with a proven genetic cause, such as CADASIL. Examples of other relevant diagnoses with hypothesized vascular causes and contributions to dementia include vascular cognitive impairment, multi-infarct dementia, post-stroke dementia, cerebral amyloid angiopathy, and Binswanger's disease.", "doc_items_refs": ["#/texts/55", "#/texts/56", "#/texts/58", "#/texts/59", "#/texts/61", "#/texts/62", "#/texts/64", "#/texts/65", "#/texts/66", "#/texts/67", "#/texts/68", "#/texts/69", "#/texts/70", "#/texts/71", "#/texts/72", "#/texts/74", "#/texts/75", "#/texts/76"], "page_nos": [], "uuid": "10a4f61e-0fa7-4b73-98a2-3c95c638311a"}
{"doc_id": "2025__The_future_of_biomarkers_for_vascular_contributions_to_cognitive_impairment_and___W4411519614", "source_path": "<redacted:source_path>", "chunk_id": 3, "source_chunk_idxs": [8], "num_tokens": 397, "text": "The future of biomarkers for vascular contributions to cognitive impairment and dementia (VCID): proceedings of the 2025 annual workshop of the Albert research institute for white matter and cognition\nIntroduction\nDementia is a clinically defined construct typically considered the presence of significant cognitive impairment and functional decline that interferes with activities of daily living. Numerous clinical diagnoses fall under the dementia umbrella, with Alzheimer's disease dementia (ADD) being the most common. It is notable that clinically diagnosed ADD, in the absence of pathological data, is typically referred to simply as AD. The inverse is also true. When AD pathology is present, including in the absence of clinical data, a diagnosis of AD is typically assigned. For this reason, and for scientific clarity, when possible, we refer to ADD and pathological AD instead of using AD as a standalone term. Widely used dementia diagnoses also include frontotemporal dementias, Lewy body dementias, vascular dementias, and others. Over the past two decades, it has become clear that, in most cases, a clinically assigned dementia diagnosis only rarely corresponds to a pathologically \"pure\" brain state [\n2\n]. Rather, it is typical for more than one dementia-associated pathology to be present in the brain of an individual with cognitive decline. Moreover, it has also been shown that, in a small but tangible number of cases, the anticipated brain pathology based on a clinically assigned diagnosis does not match the post-mortem pathological diagnosis. This may not be surprising, however, because unless a rare autosomal dominant genetic cause of dementia is present, dementia diagnoses are syndromic, which can lead to a mistaken sense of \"knowing the cause\" when, more often than not, the root cause is not strictly known. Nonetheless, it is rigorously established that most cases of dementia are associated with some type of aggregated protein as well as, very commonly, vascular pathology.", "doc_items_refs": ["#/texts/77", "#/texts/78", "#/texts/79"], "page_nos": [], "uuid": "ba38e851-7ab8-40e8-8a73-11098017dbb5"}
{"doc_id": "2025__The_future_of_biomarkers_for_vascular_contributions_to_cognitive_impairment_and___W4411519614", "source_path": "<redacted:source_path>", "chunk_id": 4, "source_chunk_idxs": [9, 10], "num_tokens": 373, "text": "The future of biomarkers for vascular contributions to cognitive impairment and dementia (VCID): proceedings of the 2025 annual workshop of the Albert research institute for white matter and cognition\nIntroduction\nThus, it is critical to have a better understanding of cerebrovascular contributors to dementia along with the urgent need for biomarkers for the broad scope of potential causes and risk factors for dementia. The focus of this meeting was on biomarkers for VCID [\n1\n,\n3\n], with an emphasis on identifying VCID where it occurs rather than being confined by traditional clinical diagnostic boundaries. This is critical because it is increasingly reported that dementia risk increases as the number of brain pathologies increases, e.g., coexisting AD pathology and vascular pathology nearly doubles the risk of clinical dementia compared to AD pathology alone [\n4\n].\nThe 2025 Annual Workshop of the Albert Research Institute for White Matter and Cognition brought together a diverse range of subspecialty experts to consider the challenges of VCID classification, pathophysiology, and treatment. The workshop had a particular focus on novel biomarker identification, recognizing the crucial role they play in understanding disease pathogenesis, making diagnoses, monitoring treatment outcomes, and stimulating further understanding and investment into disease management.\n\nThe future of biomarkers for vascular contributions to cognitive impairment and dementia (VCID): proceedings of the 2025 annual workshop of the Albert research institute for white matter and cognition\nSummary of 6-8 January 2025-6th annual Albert research institute for white matter and cognition workshop\nThe 2025 workshop scientific program was organized into four topics: (i) novel approaches to dementia biomarkers, (ii) fluid biomarkers, (iii) imaging biomarkers, and (iiii) risk and disease management. The meeting was held in person in Clearwater, Florida.", "doc_items_refs": ["#/texts/80", "#/texts/81", "#/texts/82", "#/texts/83", "#/texts/84", "#/texts/85", "#/texts/86", "#/texts/87", "#/texts/89"], "page_nos": [], "uuid": "e4d77b7d-d43a-4b03-9c1a-97aeddb11b94"}
{"doc_id": "2025__The_future_of_biomarkers_for_vascular_contributions_to_cognitive_impairment_and___W4411519614", "source_path": "<redacted:source_path>", "chunk_id": 5, "source_chunk_idxs": [11], "num_tokens": 501, "text": "The future of biomarkers for vascular contributions to cognitive impairment and dementia (VCID): proceedings of the 2025 annual workshop of the Albert research institute for white matter and cognition\nSummary of 6-8 January 2025-6th annual Albert research institute for white matter and cognition workshop\nAs an introduction to the workshop, Dr. Roderick A. Corriveau, Director of the National Institutes of Neurological Disorders and Stroke (NINDS) Vascular Contributions to Cognitive Impairment and Dementia (VCID) portfolio, presented the rationale behind the focus of the program on vascular pathologies as mediators of cognitive decline. Post-mortem analyses have demonstrated that most common dementia cases, regardless of clinically assigned diagnosis, have multiple brain pathologies that are hypothesized to result in cognitive decline. For this reason, the National Plan to Address Alzheimer's Disease includes prioritization of multiple etiology dementias (MED). Because most dementia cases are MED, and because brain vascular pathology is present in most MED cases, the NINDS is advancing the science of VCID. In brief, the science of VCID focuses on testing the hypothesis that vascular pathologies contribute to, and in some instances are the root cause of, cognitive decline and dementia [\n1\n]. This hypothesis is being tested in more than 150 active investigator-initiated NIH awards, as well as research funded under 21 NINDS-led VCID targeted funding announcements including four major NINDS programs: MarkVCID, DiverseVCID, DISCOVERY, and the VCID Center Without Walls. The NINDS VCID portfolio aims to promote rigorous approaches to determine clinical consequences of vascular pathologies associated with dementia, interactions with other pathologies, and develop evidence-based understanding of which molecular, cellular, and physiological mechanisms cause or do not cause cognitive decline. Knowledge resulting from these programs should position the field to move toward more effective biomarkers, targets, and treatments to lessen the burden of dementia. A critical goal going forward is to further develop VCID biomarkers at all levels from early stage discovery to instrumental validation, clinical validation, and with rigorously established biomarker category and context of use in each instance, following FDA guidance with the goal of achieving agency approval and widespread use in clinical trials and, ultimately, everyday clinics. The introductory remarks by Dr. Corriveau offered a unified framework under which the different avenues of work, presented in the following sessions, coalesce to build our understanding of VCID.", "doc_items_refs": ["#/texts/90", "#/texts/91", "#/texts/92"], "page_nos": [], "uuid": "0566a168-e4cc-46fd-ba47-04dd1171ce1b"}
{"doc_id": "2025__The_future_of_biomarkers_for_vascular_contributions_to_cognitive_impairment_and___W4411519614", "source_path": "<redacted:source_path>", "chunk_id": 6, "source_chunk_idxs": [12], "num_tokens": 266, "text": "The future of biomarkers for vascular contributions to cognitive impairment and dementia (VCID): proceedings of the 2025 annual workshop of the Albert research institute for white matter and cognition\nSummary of 6-8 January 2025-6th annual Albert research institute for white matter and cognition workshop\nNovel approaches to dementia biomarkers\nThe clinical diagnosis of vascular dementia poses a challenging task, owing to the differences in diagnostic criteria and the heterogeneity of underlying mechanisms. Previous diagnostic criteria for vascular dementia have involved the establishment of cognitive impairment, sometimes exhibiting specific patterns, coexisting with cerebrovascular disorders/pathology, as identified through history, clinical examination, or imaging [\n5\n,\n6\n]. However, the above criteria rely on the co-occurrence of pathophysiological processes, which might be incidental and clinically silent, while also overlooking the potential synergistic effects of vascular pathologies with proteinopathies and other mechanisms. Accordingly, there is a growing need for the development of novel, specific, or etiologic markers for VCID. The first session of the workshop examined such avenues of work. The conference covered a select few target novel biomarkers. A more comprehensive review of potential future biomarkers has been published by Cipollini et al. [\n7\n].", "doc_items_refs": ["#/texts/94", "#/texts/95", "#/texts/96", "#/texts/97", "#/texts/98", "#/texts/99", "#/texts/100"], "page_nos": [], "uuid": "cb90d495-8322-4e34-8107-7ff93b83c034"}
{"doc_id": "2025__The_future_of_biomarkers_for_vascular_contributions_to_cognitive_impairment_and___W4411519614", "source_path": "<redacted:source_path>", "chunk_id": 7, "source_chunk_idxs": [13], "num_tokens": 348, "text": "The future of biomarkers for vascular contributions to cognitive impairment and dementia (VCID): proceedings of the 2025 annual workshop of the Albert research institute for white matter and cognition\nSummary of 6-8 January 2025-6th annual Albert research institute for white matter and cognition workshop\nNovel approaches to dementia biomarkers\nSpatial omics technologies enable an unprecedented view at the subcellular level of disease. Potential biomarkers can be identified based on their direct spatial relation to pathologies of interest. As the inaugural speaker of this session, Dr. Violeta Durán Laforet presented her work exploring the connection between senescence and inflammation in neurodegeneration through spatial transcriptomics. Cellular senescence is emerging as a key feature across several neurodegenerative diseases, with recent evidence pointing towards microglial senescence as a key mechanism [\n8\n]. Dr. Durán Laforet employed multiplexed error-robust fluorescence in situ hybridization (MERFISH) [\n9\n] to provide spatial maps of cellular senescence signatures in physiological aging and AD mouse models, based on comprehensive expression of a cassette of universal senescence-related genes. Glial cells emerged as the most pronounced senescent cell group, a finding validated in human AD dementia and shown to be exacerbated with disease severity. Through senescent microglia profiling, a microglia-derived senescence associated secretory factor, CXCL3, that drives AD dementia-relevant behavioral alterations in mouse models was identified. This work provided both mechanistic insight for the involvement of microglial senescence in neurodegeneration and provided an example of how spatial omics technologies can be implemented to derive novel diagnostic and therapeutic targets.", "doc_items_refs": ["#/texts/101", "#/texts/102", "#/texts/103", "#/texts/104", "#/texts/105"], "page_nos": [], "uuid": "f5e938f5-49d4-4b13-a184-a60e44b48e72"}
{"doc_id": "2025__The_future_of_biomarkers_for_vascular_contributions_to_cognitive_impairment_and___W4411519614", "source_path": "<redacted:source_path>", "chunk_id": 8, "source_chunk_idxs": [14], "num_tokens": 357, "text": "The future of biomarkers for vascular contributions to cognitive impairment and dementia (VCID): proceedings of the 2025 annual workshop of the Albert research institute for white matter and cognition\nSummary of 6-8 January 2025-6th annual Albert research institute for white matter and cognition workshop\nNovel approaches to dementia biomarkers\nCurrently, magnetic resonance imaging (MRI) is the most widely used technique to assess the presence, extent, location, and type of vascular lesions in cerebral small vessel disease (cSVD). However, MRI-based biomarkers still lack specificity and sensitivity for VCID, while also being costly, thus precluding regular follow-up of patients. Retinal imaging has emerged as an alternative in recent years, having the advantage of direct visualization of cerebrovascular arteries. Dr. Erica M. Weekman's work focuses on understanding the mechanisms behind the retinal changes observed in human pathological AD and cSVD that reflect brain disease. Using a mouse model of hyperhomocysteinemia (HHcy)-induced cSVD, her group aimed to identify the effects of cSVD on visual sensitivity and cognition, retinal glial and vascular cells, and neuroinflammatory and cardiovascular gene expression changes. Ultimately, HHcy led to visual deficits that specifically affected the reaction to blue and white light, decreased vascular volume, and decreased interaction of microglia with the vasculature, as well as downregulation of inflammatory and vascular genes. These results highlight retinal changes in association with cSVD, offering preclinical evidence for their translation to human biomarkers, and serve as a precaution when interpreting vision-dependent cognitive testing in cSVD models.", "doc_items_refs": ["#/texts/106"], "page_nos": [], "uuid": "70e9c82a-e63b-4e4c-a3ea-3590c9bd64f8"}
{"doc_id": "2025__The_future_of_biomarkers_for_vascular_contributions_to_cognitive_impairment_and___W4411519614", "source_path": "<redacted:source_path>", "chunk_id": 9, "source_chunk_idxs": [15, 16], "num_tokens": 491, "text": "The future of biomarkers for vascular contributions to cognitive impairment and dementia (VCID): proceedings of the 2025 annual workshop of the Albert research institute for white matter and cognition\nSummary of 6-8 January 2025-6th annual Albert research institute for white matter and cognition workshop\nNovel approaches to dementia biomarkers\nAs discussed during the meeting, despite challenges associated with current diagnostic methods, they still provide valuable information, some of which may be imperceptible to human evaluation. Dr. Vijaya B. Kolachalama's research highlighted that Artificial intelligence (AI) has the potential to process vast amounts of data and uncover previously unknown interconnections, particularly in distinguishing neurodegenerative disease patterns. AI-driven machine learning frameworks can integrate multimodal data, including neuroimaging, cognitive assessments, and clinical histories, to improve differentiation between Alzheimer's disease and non-Alzheimer's dementias [\n10\n]. Expanding on this, AI models have been applied to vascular dementia, detecting early cerebrovascular changes and analyzing cognitive profiles [\n11\n]. These advancements highlight AI's transformative potential in enhancing the differential diagnosis of dementia, improving diagnostic accuracy, and ultimately supporting better patient care [\n12\n].\nOverall, the initial session showcased state-of-the-art lines of work, with transformative potential for the VCID and dementia fields. Rapid advances in biomedical technology enable expansion of available tools for diagnosis and prognostication of VCID.\n\nThe future of biomarkers for vascular contributions to cognitive impairment and dementia (VCID): proceedings of the 2025 annual workshop of the Albert research institute for white matter and cognition\nSummary of 6-8 January 2025-6th annual Albert research institute for white matter and cognition workshop\nNovel approaches to dementia biomarkers\nFluid biomarkers\nMarkers of disease in biological fluids, including but not restricted to plasma and cerebrospinal fluid (CSF), have been gaining traction as accurate and accessible predictors of dementia, particularly AD dementia. In the case of VCID, discovery of pathophysiology-driven markers has been challenging, owing to the non-specificity of mechanisms, such as endothelial activation and hypercoagulability, to cerebrovascular injury [\n13\n]. The discovery efforts for specific and highly predictive biofluid VCID markers was the main focus of this session.", "doc_items_refs": ["#/texts/107", "#/texts/108", "#/texts/109", "#/texts/110", "#/texts/111", "#/texts/112", "#/texts/113", "#/texts/114", "#/texts/116", "#/texts/117", "#/texts/118"], "page_nos": [], "uuid": "ddb67d3e-b5e5-4609-a631-1395c9dc862f"}
{"doc_id": "2025__The_future_of_biomarkers_for_vascular_contributions_to_cognitive_impairment_and___W4411519614", "source_path": "<redacted:source_path>", "chunk_id": 10, "source_chunk_idxs": [17], "num_tokens": 396, "text": "The future of biomarkers for vascular contributions to cognitive impairment and dementia (VCID): proceedings of the 2025 annual workshop of the Albert research institute for white matter and cognition\nSummary of 6-8 January 2025-6th annual Albert research institute for white matter and cognition workshop\nNovel approaches to dementia biomarkers\nFluid biomarkers\nThe plasma proteome offers an attractive choice for molecular marker discovery, as it can reflect both brain and vascular disease. Currently, little is known about the biological processes and peripherally circulating molecular mediators that directly influence cSVD development and related phenotypes. Dr. Keenan A. Walker presented results connecting clinical and imaging phenotypes of VCID with molecular perturbations in the plasma. Using a large-scale proteomic platform to relate 4877 plasma proteins to MRI-defined SVD characteristics and VCID phenotypes, his group identified proteins associated with white matter hyperintensity (WMH) volume, motoric cognitive risk, and vascular dementia [\n14\n,\n15\n]. These relationships were replicated in one or more external cohorts and demonstrated that several of these proteins are primarily expressed by oligodendrocytes, whereas many others were found to play a role in metabolic and immune processes. A subset of these proteins was also found to be differentially expressed in the context of cerebral atherosclerosis and pathologically defined AD in publicly available datasets, providing evidence of connection between vascular and neurodegenerative disease processes. Finally, his group causally implicated a protein network enriched for complement activation in WMH development using two sample Mendelian randomization, and prioritized two plasma proteins, oligodendrocyte myelin glycoprotein (OMG) and neuronal pentraxin receptor (NPTXR), as candidate biomarkers for cSVD, white matter disease, and related clinical manifestations.", "doc_items_refs": ["#/texts/119", "#/texts/120", "#/texts/121", "#/texts/122", "#/texts/123"], "page_nos": [], "uuid": "7dda6ee6-c5e0-450b-a6b3-e1fab6cc84ed"}
{"doc_id": "2025__The_future_of_biomarkers_for_vascular_contributions_to_cognitive_impairment_and___W4411519614", "source_path": "<redacted:source_path>", "chunk_id": 11, "source_chunk_idxs": [18], "num_tokens": 340, "text": "The future of biomarkers for vascular contributions to cognitive impairment and dementia (VCID): proceedings of the 2025 annual workshop of the Albert research institute for white matter and cognition\nSummary of 6-8 January 2025-6th annual Albert research institute for white matter and cognition workshop\nNovel approaches to dementia biomarkers\nFluid biomarkers\nThe heterogeneity of underlying causes and manifestations of VCID, however, can complicate the detection of plausible markers. Monogenic forms of VCID offer a unique opportunity for the discovery of mechanisms and biomarkers that could translate to sporadic VCID. Cerebral autosomal dominant arteriopathy with subcortical infarcts and leukoencephalopathy (CADASIL) is a monogenic form of cSVD) due to mutations in the\nNOTCH3\ngene. CADASIL presents with early white matter injury, eventually leading to strokes and VCID after the 4th decade of life [\n16\n]. The known clinical trajectory of CADASIL allows for the identification of proteomic changes coinciding with the phenotypic transition from cSVD to VCID. Dr. Nikolaos Karvelas presented his findings on prognostic proteomic markers in plasma from CADASIL patients. His previous work utilizing proteomics had found robust plasma signatures of disease through machine learning methods that suggest dysregulations in fibrosis, angiogenesis, and metabolism as core features of CADASIL [\n17\n]. He had also previously shown correlations of perivascular space enlargement with white matter injury, cognitive decline, and proteomic markers of endothelial activation and inflammation [\n18", "doc_items_refs": ["#/texts/124", "#/texts/125", "#/texts/126", "#/texts/127", "#/texts/128", "#/texts/129", "#/texts/130", "#/texts/131"], "page_nos": [], "uuid": "9ae5d91a-0fcd-4e8a-a365-a5295ffd8708"}
{"doc_id": "2025__The_future_of_biomarkers_for_vascular_contributions_to_cognitive_impairment_and___W4411519614", "source_path": "<redacted:source_path>", "chunk_id": 12, "source_chunk_idxs": [19], "num_tokens": 309, "text": "The future of biomarkers for vascular contributions to cognitive impairment and dementia (VCID): proceedings of the 2025 annual workshop of the Albert research institute for white matter and cognition\nSummary of 6-8 January 2025-6th annual Albert research institute for white matter and cognition workshop\nNovel approaches to dementia biomarkers\nFluid biomarkers\n], thereby supporting potential prognostic markers. Participants with CADASIL and healthy controls were pooled from three distinct cohorts (VascBrain, Mayo Clinic, Columbia-Boston) and categorized into three major clinical stages based on the natural history of CADASIL: asymptomatic/early symptomatic (migraine), stroke without cognitive impairment, and cognitive impairment. Differential expression analysis (DEA) and weighted protein co-expression network analysis (WPCNA) were performed to derive protein signatures. Upregulation of muscle cell and inflammatory markers was evident in stroke, suggesting mural cell loss. In cognitive impairment, an increase in cell-mediated immunity markers and downregulation of metabolic processes were noted. Finally, a network of mural cell loss was associated with the clinical stage of progression and also with a network of fibrosis-coagulation with age only in CADASIL, indicating the central role of these processes in disease progression. These results suggest that blood proteomic signatures of CADASIL capture clinical progression and manifestations. Identified pathways can serve as an entry point for further diagnostic and therapeutic discovery in CADASIL and sporadic VCID.", "doc_items_refs": ["#/texts/132"], "page_nos": [], "uuid": "7b35da29-b72b-4823-9d92-3eaffc078c44"}
{"doc_id": "2025__The_future_of_biomarkers_for_vascular_contributions_to_cognitive_impairment_and___W4411519614", "source_path": "<redacted:source_path>", "chunk_id": 13, "source_chunk_idxs": [20], "num_tokens": 470, "text": "The future of biomarkers for vascular contributions to cognitive impairment and dementia (VCID): proceedings of the 2025 annual workshop of the Albert research institute for white matter and cognition\nSummary of 6-8 January 2025-6th annual Albert research institute for white matter and cognition workshop\nNovel approaches to dementia biomarkers\nFluid biomarkers\nApart from protein markers, plasma offers a reservoir for extracellular vesicles (EVs), nano- to micro-sized cell-derived lipid fluid filled particles that contain cell origin surface markers with internal cargo involved in normal and pathophysiological cellular communication [\n19\n]. Exosomes are the smallest EVs (30-150 nm) that carry proteins, lipids, and RNA that signal and mark the occurrence of cellular changes but are not restricted by the blood brain barrier. EVs provide the unique opportunity to study cell-specific molecular changes in living organisms and, thus, constitute a form of \"liquid biopsy.\" Dr. Frank C. Barone investigated exosomal RNA as a potential novel biomarker in mouse ischemic stroke. Exosomes are released from brain-infiltrating inflammatory and vascular endothelial cells in stroke and can be enriched using cell of origin surface molecules using a newly developed microfluidics system. Dr. Barone's lab described the development of a mouse stroke translational platform of differential gene expression (DGE) to discover new RNA biomarkers and mechanisms. This platform enables comparison to human stroke, through identification of DGE changes in circulating and brain cells from their released exosomes in evolving brain injury. Plasma exosomes are enriched using the following surface markers: (1) CD15, to capture changes in neutrophils, the earliest post-stroke infiltrating immune cells, and (2) VCAM-1, to capture endothelial cell activation and BBB injury as early events in the brain post-stroke. By combining data from exosomes with developing brain spatial transcriptomics in mouse brain sections, the aim is to provide information on markers and localization of activated leukocytes and vascular cells, and to expand this research to brain glia, neurons, and white matter markers and mechanisms in brain hypoperfusion, neurodegeneration, and dementia.", "doc_items_refs": ["#/texts/133", "#/texts/134", "#/texts/135"], "page_nos": [], "uuid": "fcf0f392-496a-4fa9-b0cd-5bae022a4ee7"}
{"doc_id": "2025__The_future_of_biomarkers_for_vascular_contributions_to_cognitive_impairment_and___W4411519614", "source_path": "<redacted:source_path>", "chunk_id": 14, "source_chunk_idxs": [21], "num_tokens": 493, "text": "The future of biomarkers for vascular contributions to cognitive impairment and dementia (VCID): proceedings of the 2025 annual workshop of the Albert research institute for white matter and cognition\nSummary of 6-8 January 2025-6th annual Albert research institute for white matter and cognition workshop\nNovel approaches to dementia biomarkers\nFluid biomarkers\nStroke and dementia frequently co-exist in aging populations, with overlapping risk factors and cumulative effects on cognitive decline. These conditions share age as their strongest risk factor and demonstrate significant sexual dimorphism, with females showing higher lifetime risk for both conditions. When co-occurring, these pathologies interact synergistically to accelerate cognitive deterioration, as evidenced by the Nun's Study showing that dementia patients with AD pathology who also had cortical infarcts had substantially higher rates of cognitive impairment. While microglia play crucial roles in both conditions as core pathological features, their diverse activation phenotypes present significant challenges for therapeutic development. Current methods for measuring microglial activation, such as cerebral spinal fluid sampling and positron emission tomography imaging, are either invasive or limited by cost and accessibility. Dr. Shawn N. Whitehead's lab studies circulating microglial extracellular vesicles (MEVs) and their cargo as blood-based biomarkers capable of discriminating between AD pathology and stroke pathology. In order to examine the common and unique MEV profiles in these disorders, aged wildtype and APP/PS1 transgenic rats were used to develop experimental models of aging, AD, stroke, and comorbid AD/stroke. APP/PS1 rats develop age-dependent amyloid-beta deposition and tau pathology, while focal subcortical strokes were induced using endothelin-1 injections into the striatum. Distinct microglial phenotypes and their corresponding MEV markers were identified. These markers were validated using high throughput nanoflow cytometry, which allowed detection of MEVs in as little as 10 µl of the blood plasma. Preliminary analyses focused on TMEM119-positive MEVs containing specific cargo proteins. In future work using this approach, the utility of circulating MEVs as a novel diagnostic tool for monitoring brain inflammation and predicting cognitive decline will be further investigated. The development of this blood-based platform could facilitate early detection of dementia risk and guide therapeutic interventions in patients with AD pathology, stroke, or both conditions.", "doc_items_refs": ["#/texts/136"], "page_nos": [], "uuid": "1f6f224a-f546-4fc8-bb9e-8dbb0f40cde5"}
{"doc_id": "2025__The_future_of_biomarkers_for_vascular_contributions_to_cognitive_impairment_and___W4411519614", "source_path": "<redacted:source_path>", "chunk_id": 15, "source_chunk_idxs": [22], "num_tokens": 499, "text": "The future of biomarkers for vascular contributions to cognitive impairment and dementia (VCID): proceedings of the 2025 annual workshop of the Albert research institute for white matter and cognition\nSummary of 6-8 January 2025-6th annual Albert research institute for white matter and cognition workshop\nNovel approaches to dementia biomarkers\nFluid biomarkers\nPeripherally circulating biomarkers and cargo proteins from brain-derived extracellular vesicles (BDEVs) in blood have been shown to track AD pathology progression, predicting cognitive decline and amyloid burden among cognitively normal and mild cognitive impairment (MCI) individuals. However, these biomarkers have yet to be fully explored in saliva. Novel findings presented from Dr. Charisse N. Winston assessed the feasibility and practicality of isolating plasma and saliva BDEVs to identify early predictors of disease pathogenesis and cognitive decline among healthy controls, individuals with MCI, and other age-related dementias. Saliva EVs were extracted and precipitated using a polymer-based isolation method (ExoQuick), and enriched against neuronal (L1CAM, NRXN), astrocyte (GLAST), microglial (TMEM119), and oligodendrocyte (P1P1) sources using magnetic immunocapture and fluorescence-activated cell sorting (FACS). Tetraspanin profiling, super-resolution imaging (ONI nanoimager), and immunoassay were used to characterize EVs by size, shape, and cellular origin. Concentrations of proinflammatory and ATN-related (amyloid, tau, neurodegeneration) cargo proteins were quantified using human-specific ELISAs and MSD immunoassay (V-PLEX Proinflammatory Panel 1). Preliminarily, her study determined that preanalytical storage conditions (room temperature, 4 °C or − 20 °C) and cellular origin significantly impacted EV cargo levels of pro-inflammatory and ATN biomarkers. Interestingly, significant TDP-43 accumulation was exclusive to saliva astrocyte EVs. These findings demonstrate the feasibility and practicality of isolating BDEVs from saliva. Moreover, these findings suggest that preanalytical storage conditions can impact the biomarker stability and sensitivity of BDEV cargos and require further investigations.", "doc_items_refs": ["#/texts/137"], "page_nos": [], "uuid": "2cb9e940-5df5-4f29-8e95-889f07e54b22"}
{"doc_id": "2025__The_future_of_biomarkers_for_vascular_contributions_to_cognitive_impairment_and___W4411519614", "source_path": "<redacted:source_path>", "chunk_id": 16, "source_chunk_idxs": [23], "num_tokens": 174, "text": "The future of biomarkers for vascular contributions to cognitive impairment and dementia (VCID): proceedings of the 2025 annual workshop of the Albert research institute for white matter and cognition\nSummary of 6-8 January 2025-6th annual Albert research institute for white matter and cognition workshop\nNovel approaches to dementia biomarkers\nFluid biomarkers\nThe results presented at this session demonstrated the versatility of biofluids as reservoirs of markers that can capture clinical, prognostic, and neuropathological aspects of VCID. Novel methods, such as cell-specific EV isolation, enable precise understanding of disease pathophysiology at the cellular level. The use of such markers alongside established biomarkers of neurodegeneration and AD pathology in the future may allow the distinction of VCID from other causes of cognitive decline and, therefore, appropriate therapeutic interventions.", "doc_items_refs": ["#/texts/138"], "page_nos": [], "uuid": "4bee734e-a8eb-4630-91a4-044fa0d8beb4"}
{"doc_id": "2025__The_future_of_biomarkers_for_vascular_contributions_to_cognitive_impairment_and___W4411519614", "source_path": "<redacted:source_path>", "chunk_id": 17, "source_chunk_idxs": [24], "num_tokens": 366, "text": "The future of biomarkers for vascular contributions to cognitive impairment and dementia (VCID): proceedings of the 2025 annual workshop of the Albert research institute for white matter and cognition\nSummary of 6-8 January 2025-6th annual Albert research institute for white matter and cognition workshop\nNovel approaches to dementia biomarkers\nImaging biomarkers\nThis workshop section opened with a presentation by Dr. Hanzhang Lu on the possible use of MRI oxygen extraction fraction (OEF) signal as a biomarker for VCID. Microstructural damages using diffusion MRI have also demonstrated considerable potential. A recent trend is to move the biomarker development to earlier and potentially more sensitive cerebrovascular imaging assessments. Brain perfusion and oxygenation are two important physiological parameters of vascular health. Dysfunction in small vessels is expected to affect perfusion. MRI methods can measure brain perfusion. However, perfusion can also be affected by reduced brain metabolism independent of vascular function. Oxygen extraction fraction (OEF) reflects the balance between oxygen delivery and consumption. In a longitudinal study of aging, OEF was found the increase over time [\n20\n,\n21\n,\n22\n]. The increase in OEF was more prominent in individuals with high vascular risks compared to those with low vascular risks and was associated with progression of vascular risks and the growth in WMH volume. OEF change was not related to CSF markers of AD pathology or their progression. Longitudinal OEF change in older adults is primarily related to vascular pathology. Additionally, unlike CBF which can be reduced by both AD and vascular pathology, OEF appears to be differentially affected in these conditions in that OEF is elevated by vascular pathology but diminished by AD pathology [\n23\n].\nIn another application of MRI technology, Dr. Liu presented on how infra-slow (", "doc_items_refs": ["#/texts/140", "#/texts/141", "#/texts/142", "#/texts/143", "#/texts/144", "#/texts/145", "#/texts/146", "#/texts/147", "#/texts/148", "#/texts/149"], "page_nos": [], "uuid": "694ed604-7927-4b34-86ac-92cf8b07c726"}
{"doc_id": "2025__The_future_of_biomarkers_for_vascular_contributions_to_cognitive_impairment_and___W4411519614", "source_path": "<redacted:source_path>", "chunk_id": 18, "source_chunk_idxs": [25], "num_tokens": 508, "text": "The future of biomarkers for vascular contributions to cognitive impairment and dementia (VCID): proceedings of the 2025 annual workshop of the Albert research institute for white matter and cognition\nSummary of 6-8 January 2025-6th annual Albert research institute for white matter and cognition workshop\nNovel approaches to dementia biomarkers\nImaging biomarkers\nThe importance of enlarged perivascular spaces both in dementia pathophysiology and as a possible imaging biomarker was explored in presentations by Dr. Konstantinos Arfanakis and Dr Joel Ramirez. Dr. Arfanakis identified that enlarged perivascular spaces (EPVS) are common in older adults, but their neuropathologic correlates are unclear because most work to date has relied on visual rating scales and/or clinical cohorts [\n24\n,\n25\n,\n26\n,\n27\n,\n28\n]. He presented a deep learning model for automatic segmentation, localization, and quantification of EPVS in ex vivo brain MRI and then used this model to investigate the neuropathologic, clinical, and cognitive correlates of EPVS in 817 community-based older adults that underwent autopsy [\n29\n,\n30\n]. The new method exhibited high sensitivity in detecting EPVS as small as 3 mm\n3\n, good segmentation accuracy and consistency. Most EPVS were located in the frontal lobe, but the highest density of EPVS was observed in the basal ganglia. The total number of EPVS in the cerebrum as well as in the frontal lobe were independently associated with infarcts, while temporal and occipital lobe EPVS were associated with cerebral amyloid angiopathy (CAA) severity. These findings suggest that EPVS share neurobiological pathways with infarcts and CAA and that these pathways are dependent on location within the brain. Basal ganglia EPVS were independently associated with hypertension, providing important new leads on the role of these vascular risk factors in the condition of the glymphatic system. Finally, EPVS were associated with lower level of cognition above and beyond the effects of neuropathologies, clinical variables, and demographics, suggesting that EPVS represent additional brain anomalies contributing to lower cognitive function [\n31\n]. Dr. Ramirez also acknowledged that MRI-visible perivascular spaces (mPVS) may play a crucial role in sleep-driven glymphatic clearance of brain metabolic waste, similar to lymphatic vessels in peripheral tissues [\n32", "doc_items_refs": ["#/texts/150", "#/texts/151", "#/texts/152", "#/texts/153", "#/texts/154", "#/texts/155", "#/texts/156", "#/texts/157", "#/texts/158", "#/texts/159", "#/texts/160", "#/texts/161", "#/texts/162", "#/texts/163", "#/texts/164", "#/texts/165", "#/texts/166", "#/texts/167", "#/texts/168", "#/texts/169"], "page_nos": [], "uuid": "7a55094c-b34e-4072-a287-c3f7ea5347fb"}
{"doc_id": "2025__The_future_of_biomarkers_for_vascular_contributions_to_cognitive_impairment_and___W4411519614", "source_path": "<redacted:source_path>", "chunk_id": 19, "source_chunk_idxs": [26], "num_tokens": 311, "text": "The future of biomarkers for vascular contributions to cognitive impairment and dementia (VCID): proceedings of the 2025 annual workshop of the Albert research institute for white matter and cognition\nSummary of 6-8 January 2025-6th annual Albert research institute for white matter and cognition workshop\nNovel approaches to dementia biomarkers\nImaging biomarkers\n]. In contrast to previous studies that have demonstrated mPVS burden in the white matter/centrum semiovale is associated with AD pathology and CAA pathology, in Parkinson's disease, large mPVS (&gt; 3 mm) in the basal ganglia are associated with motor symptoms and motor complications, while smaller mPVS (≤ 3 mm) are associated with motor and nonmotor aspects of experiences in daily living [\n33\n]. Lastly, complimenting Dr. Arfanakis' work relating mPVS and cognition, Dr. Ramirez found in patients with neurodegenerative disease that the effect of mPVS on speeded executive function was mediated by the presence of elevated glial fibrillary acidic protein (GFAP), a blood-based biomarker of inflammation, and of white matter hyperintensities [\n34\n].\nIn sum, this section of the workshop identified that oxygen extraction fraction may be a more specific marker of VCID, that the uncoupling of CSF flow and infra-slow activity may help us understand dementia pathology, and that enlarged perivascular spaces may be one of a suite of imaging biomarkers for VCID.", "doc_items_refs": ["#/texts/170", "#/texts/171", "#/texts/172", "#/texts/173", "#/texts/174", "#/texts/175"], "page_nos": [], "uuid": "5245c0a0-a923-48a5-8d51-0e9edfb4ec26"}
{"doc_id": "2025__The_future_of_biomarkers_for_vascular_contributions_to_cognitive_impairment_and___W4411519614", "source_path": "<redacted:source_path>", "chunk_id": 20, "source_chunk_idxs": [27], "num_tokens": 318, "text": "The future of biomarkers for vascular contributions to cognitive impairment and dementia (VCID): proceedings of the 2025 annual workshop of the Albert research institute for white matter and cognition\nSummary of 6-8 January 2025-6th annual Albert research institute for white matter and cognition workshop\nRisk and disease management\nIn the final workshop section, a diverse but connected group of presentations challenged current understandings of dementia risk factors, ranging from domestic violence, Down syndrome, and hypertension. Dr. Cheryl L. Wellington identified that one in three women worldwide experience intimate partner violence (IPV), 92% of whom report head impacts and/or strangulation that raise suspicion of brain injury (BI). Despite the high prevalence, there is insufficient understanding about long-term risks, including Alzheimer's disease and related dementias (AD/ADRD); knowledge of IPV neuropathology is scant, with vascular pathologies rather than proteinopathies observed in most cases. Dr. Wellington discussed an in-progress prospective observational study aiming to enroll 500 acute/subacute and 100 chronic survivors of IPV. The study aims to use a proteomic platform to assess plasma biomarkers as diagnostic tools, to develop a living clinical practice guideline for IPV-BI, and create trauma-informed guidance for AD/ADRD researchers to ask about IPV in clinical history. She discussed some of her team's emerging animal models of non-fatal strangulation to investigate inflicted hypoxic-ischemic injury as a potential VCID component.", "doc_items_refs": ["#/texts/177"], "page_nos": [], "uuid": "d40abb24-fa14-4552-bc0a-90ba4c27ad42"}
{"doc_id": "2025__The_future_of_biomarkers_for_vascular_contributions_to_cognitive_impairment_and___W4411519614", "source_path": "<redacted:source_path>", "chunk_id": 21, "source_chunk_idxs": [28], "num_tokens": 287, "text": "The future of biomarkers for vascular contributions to cognitive impairment and dementia (VCID): proceedings of the 2025 annual workshop of the Albert research institute for white matter and cognition\nSummary of 6-8 January 2025-6th annual Albert research institute for white matter and cognition workshop\nRisk and disease management\nIn a further presentation on another crucial but underserved population who experiences dementia, Dr. Elizabeth Head presented research for people with Down syndrome (DS) who have a 90% lifetime risk of developing dementia. Due to an extra copy of chromosome 21 and associated triplication of the amyloid precursor protein gene, almost all people with DS develop AD neuropathology by 40 years of age. Interestingly, despite being protected from vascular risk factors, such as hypertension and atherosclerosis, the same overexpression of the beta-amyloid precursor protein leads to vascular accumulation of beta-amyloid as cerebral amyloid angiopathy (CAA). Indeed, the extent of CAA in DS exceeds that observed in late-onset AD dementia. Increased CAA is associated with microhemorrhages and reduced cerebral blood flow (CBF) as measured using magnetic resonance imaging and arterial spin labeling. Whereas previously, dementia in DS was thought to be associated with a \"pure\" AD-like pathology, it is clear that cerebrovascular dysfunction is a key contributor to pathological brain aging.", "doc_items_refs": ["#/texts/178"], "page_nos": [], "uuid": "054be903-6d0b-4e0d-ac05-ceab5912ad60"}
{"doc_id": "2025__The_future_of_biomarkers_for_vascular_contributions_to_cognitive_impairment_and___W4411519614", "source_path": "<redacted:source_path>", "chunk_id": 22, "source_chunk_idxs": [29], "num_tokens": 432, "text": "The future of biomarkers for vascular contributions to cognitive impairment and dementia (VCID): proceedings of the 2025 annual workshop of the Albert research institute for white matter and cognition\nSummary of 6-8 January 2025-6th annual Albert research institute for white matter and cognition workshop\nRisk and disease management\nWhile those with DS do not commonly experience hypertension, hypertension is the most common risk factor for dementia and was the focus of the presentation by Dr. Matthew Lennon. He identified that it affects 1.3 billion persons worldwide, is the most prevalent risk factor for dementia, and in the majority of cases, it is either undiagnosed or uncontrolled [\n35\n]. He presented on a number of studies used to investigate the hypertension-dementia relationship, including a large consortium of longitudinal cohort studies and the UK Biobank. In a study utilizing the Cohort Studies of Memory in an International Consortium (COSMIC) group (\nn\nstudies = 17 and\nn\n= 34,519), individuals with untreated hypertension had a 26% (\np\n= 0.02) and 42% (\np\n= 0.0135) increased risk of AD dementia compared with individuals with treated hypertension [\n36\n,\n37\n]. Those without hypertension had no significantly different risk compared to those with treated hypertension, whereas compared to those with untreated hypertension, they had a 42% (\np\n= 0.001) and 36% (\np\n= 0.04) lower risk of dementia and AD dementia, respectively. In the UK Biobank (\nn\n= 448 575), using a Mendelian randomization approach, it was found that genetic propensity for high SBP had an approximately linear association with worsened fluid intelligence (\np\n= 0.0018) but better reaction time (\np\n38\n]. He concluded with the ideas that untreated high blood pressure increases overall dementia and AD dementia risk throughout late life, but may differentially affect cognitive domains. Providing clear education to the public that hypertension is a significant risk for dementia may change the way that clinicians and patients screen for and manage hypertension.", "doc_items_refs": ["#/texts/179", "#/texts/180", "#/texts/181", "#/texts/182", "#/texts/183", "#/texts/184", "#/texts/185", "#/texts/186", "#/texts/187", "#/texts/188", "#/texts/189", "#/texts/190", "#/texts/191", "#/texts/192", "#/texts/193", "#/texts/194", "#/texts/195", "#/texts/196", "#/texts/197", "#/texts/198", "#/texts/199", "#/texts/200", "#/texts/201", "#/texts/202", "#/texts/204", "#/texts/205"], "page_nos": [], "uuid": "5a533f79-ac43-46d6-86be-da7ed10be1e0"}
{"doc_id": "2025__The_future_of_biomarkers_for_vascular_contributions_to_cognitive_impairment_and___W4411519614", "source_path": "<redacted:source_path>", "chunk_id": 23, "source_chunk_idxs": [30, 31], "num_tokens": 503, "text": "The future of biomarkers for vascular contributions to cognitive impairment and dementia (VCID): proceedings of the 2025 annual workshop of the Albert research institute for white matter and cognition\nSummary of 6-8 January 2025-6th annual Albert research institute for white matter and cognition workshop\nRisk and disease management\nHypertension, among other risk factors, increases risk for cerebral ischemia and cerebral small vessel disease. Dr. Aravind Ganesh presented on current trials of remote ischemic conditioning (RIC) to prevent progression of cSVD and reduce the impact of cerebral ischemia. RIC [\n39\n,\n40\n] involves placing a body part, generally the arm, under ischemic conditions for several minutes at a time. It is hypothesized that such intervention may promote proteomic and transcriptional changes that are neuroprotective, making individuals more resilient to ischaemic damage. Dr. Ganesh and his team studied the safety/tolerability of RIC in patients with cSVD in TRIC-VCI (NCT04109963)-a prospective, open-label, randomized-controlled trial with blinded endpoint assessment and 14-day run-in period, after which participants were randomized to once-daily or twice-daily RIC for 30-days [\n41\n]. Among 22 patients who completed the run-in phase and were randomized, 7/11 (63.6%) in the once-daily RIC arm completed ≥ 80% of sessions versus 10/11 (90.9%) in the twice-daily arm. In parallel, they found that just 2 weeks of RIC in mice drastically modifies the central nervous system's proteomic and transcriptional landscape as seen in blood and spinal cord homogenates, with upregulation of several neuroprotective pathways. A current pilot clinical trial of a compact, automated RIC device, TRIC-SVD (NCT05967728) will enroll 24 patients with cSVD and seek to further validate the blood biomarkers of interest identified in their prior work.\n\nThe future of biomarkers for vascular contributions to cognitive impairment and dementia (VCID): proceedings of the 2025 annual workshop of the Albert research institute for white matter and cognition\nNew information and future Albert White Matter and Cognition Conferences\nThis year's Albert Research Institute workshop provided insights into diverse features of the VCID, including the following:", "doc_items_refs": ["#/texts/206", "#/texts/207", "#/texts/208", "#/texts/209", "#/texts/210", "#/texts/211", "#/texts/212", "#/texts/214"], "page_nos": [], "uuid": "0f46bb96-d8bd-4911-9c5e-114c860148db"}
{"doc_id": "2025__The_future_of_biomarkers_for_vascular_contributions_to_cognitive_impairment_and___W4411519614", "source_path": "<redacted:source_path>", "chunk_id": 24, "source_chunk_idxs": [32], "num_tokens": 499, "text": "The future of biomarkers for vascular contributions to cognitive impairment and dementia (VCID): proceedings of the 2025 annual workshop of the Albert research institute for white matter and cognition\nNew information and future Albert White Matter and Cognition Conferences\n- Vascular pathology is present in the majority of dementia cases.\n- VCID is of special interest to international neuroscientific research programs; for instance, over 150 NIH awards and 21 targeted funding announcements aim to develop effective biomarkers, targets, and treatments for dementia.\n- Microglia show pronounced senescence signatures in aging and when AD pathology is present.\n- Senescence-associated secretory factors represent potential interventional targets for neurodegenerative diseases.\n- Retinal changes offer promising biomarkers for VCID, particularly cerebral small vessel disease, with HHcy-induced models revealing specific visual deficits and vascular alterations.\n- Retinal biomarkers reflect neuroinflammatory and vascular gene expression changes, informing vision-dependent cognitive testing interpretations.\n- AI frameworks using multimodal data can enhance differentiation between AD dementia and non-Alzheimer's dementias, including vascular dementia, as well as among different dementia-associated pathologies.\n- Proteomic studies have identified plasma proteins, including oligodendrocyte myelin glycoprotein (OMG) and neuronal pentraxin receptor (NPTXR), related to white matter hyperintensity volume, motoric cognitive risk, and vascular dementia, with replication in external cohorts.\n- Plasma proteomic signatures have been identified in CADASIL indicating dysregulations in fibrosis, angiogenesis, and metabolism, with unique signatures across clinical stages.\n- Markers of mural cell loss, fibrosis-coagulation, and T cell activation are associated with disease progression in CADASIL, suggesting targets for therapeutic discovery. The development of a transcript biomarker platform using the mouse ischemic stroke will be used to identify differentially expressed transcripts from enriched exosomes as post-stroke markers of leukocyte and vascular endothelial cell changes and are being validated with human data and spatial transcriptomics to investigate new mechanisms and targets for stroke-related brain injury.\n- A method has been developed to use circulating microglial extracellular vesicles (MEVs) as blood-based biomarkers for differentiating between AD and stroke pathologies.", "doc_items_refs": ["#/texts/215", "#/texts/216", "#/texts/217", "#/texts/218", "#/texts/219", "#/texts/220", "#/texts/221", "#/texts/222", "#/texts/223", "#/texts/224", "#/texts/225"], "page_nos": [], "uuid": "929d2b7b-0bde-4ab3-ac3e-f13818775f5e"}
{"doc_id": "2025__The_future_of_biomarkers_for_vascular_contributions_to_cognitive_impairment_and___W4411519614", "source_path": "<redacted:source_path>", "chunk_id": 25, "source_chunk_idxs": [33], "num_tokens": 458, "text": "The future of biomarkers for vascular contributions to cognitive impairment and dementia (VCID): proceedings of the 2025 annual workshop of the Albert research institute for white matter and cognition\nNew information and future Albert White Matter and Cognition Conferences\n- The utility of MEVs in monitoring brain inflammation and predicting cognitive decline is being investigated to facilitate early detection and guide therapeutic interventions.\n- Plasma and saliva brain-derived extracellular vesicles (BDEVs) offer a feasible method to identify early predictors of disease pathogenesis and cognitive decline.\n- Perfusion reflects blood supply to the brain, while oxygen extraction fraction (OEF) balances oxygen delivery and consumption; both can be measured using MRI.\n- OEF changes in older adults are associated with vascular pathology and progression of vascular risks, highlighting its potential as a VCID biomarker.\n- Infra-slow (\n- A deep learning model has been developed to segment and quantify EPVS in ex vivo brain MRI, identifying neurobiological pathways shared with infarcts and CAA.\n- EPVS are linked to brain waste clearance and are associated with cerebral small vessel disease, hypertension, diabetes, poor sleep, and cognitive decline in clinical-radiological and clinical-pathological studies.\n- EPVS burden correlates with executive function and white matter hyperintensities, highlighting its potential as a biomarker for vascular health and dementia.\n- Decreases in cerebral blood flow (CBF) with aging in DS are linked to cognitive decline, highlighting the importance of cerebrovascular pathology in designing clinical trials for this population.\n- High prevalence of head impacts and strangulation in intimate partner violence (IPV) raises suspicion of brain injury (BI). The size of the contribution of IPV to vascular disease and dementia remains an open question.\n- Ongoing studies aim to improve the diagnosis of IPV-BI using blood-based biomarkers and animal models to investigate hypoxic-ischemic injury.\n- Untreated hypertension increases the risk of dementia, including AD dementia with AD pathology, emphasizing the importance of managing blood pressure.\n- Genetic predisposition to high systolic blood pressure is associated with worsened fluid intelligence but better reaction time, indicating possible differential effects on cognitive domains.", "doc_items_refs": ["#/texts/226", "#/texts/227", "#/texts/228", "#/texts/229", "#/texts/230", "#/texts/231", "#/texts/232", "#/texts/233", "#/texts/234", "#/texts/235", "#/texts/236", "#/texts/237", "#/texts/238"], "page_nos": [], "uuid": "90c527f6-5b00-4566-89a2-6fb8d22f7aad"}
{"doc_id": "2025__The_future_of_biomarkers_for_vascular_contributions_to_cognitive_impairment_and___W4411519614", "source_path": "<redacted:source_path>", "chunk_id": 26, "source_chunk_idxs": [34], "num_tokens": 209, "text": "The future of biomarkers for vascular contributions to cognitive impairment and dementia (VCID): proceedings of the 2025 annual workshop of the Albert research institute for white matter and cognition\nNew information and future Albert White Matter and Cognition Conferences\n- Remote ischemic conditioning (RIC) shows promise in preventing cerebral small vessel disease (cSVD) progression, with upregulation of neuroprotective pathways; candidate treatment-related biomarkers like VCAM1 and FABP3 have been identified.\n- Future foci for the Albert Institute Conference will include the following:\n- Molecular and imaging biophenotyping of VCID to better subtype, prognosticate, and treat disease presentations\n- Weighing the relative burden of vascular, Alzheimer's, and other neurodegenerative biomarkers to develop rational, personalized, multi-mechanism treatment of cognitive disorders\n- Better understanding trajectories of decline, treatment responsiveness, and possibility of reversal of the underlying VCID pathologies to better inform clinical management", "doc_items_refs": ["#/texts/239", "#/texts/240", "#/texts/241", "#/texts/242", "#/texts/243"], "page_nos": [], "uuid": "e474a8a7-c3f2-4a47-adcf-bd0bb648dfaa"}
{"doc_id": "2025__The_future_of_biomarkers_for_vascular_contributions_to_cognitive_impairment_and___W4411519614", "source_path": "<redacted:source_path>", "chunk_id": 27, "source_chunk_idxs": [35], "num_tokens": 480, "text": "The future of biomarkers for vascular contributions to cognitive impairment and dementia (VCID): proceedings of the 2025 annual workshop of the Albert research institute for white matter and cognition\nDiscussion and conclusions\nThe data presented during the workshop highlighted the widespread prevalence of covert and symptomatic VCID in the population and the emergence of novel prognostic and diagnostic modalities. The ensuing round-table discussion was an opportunity to identify unifying concepts across different lines of work and address open questions. A prominent challenge in designing biomarkers for VCID stems from the heterogeneity of the term, which encompasses a wide range of conditions with variable pathophysiology. As a result, each biomarker needs to be assessed as to which underlying processes it quantifies. Some biomarkers may capture processes that are common across types of VCID. Therefore, interpretation of VCID biomarkers needs to be well-defined before they become incorporated in clinical trials and clinical practice. A thorough understanding about what a diagnosis that falls under the VCID scientific framework, not limited to vascular dementia, AD dementia, CADASIL, or post-stroke dementia, would enable better communication between clinicians and patients and provide preventive or management options to patients that would otherwise not be available. In parallel, participants acknowledged that pure pathological entities, including cerebrovascular changes, are rare in clinical practice. This is in contrast to the prevailing notion in research which assigns clinical syndromes to specific disease categories with specific pathologies may or may not be present in a given individual. For example, during the presentations, the term AD was used interchangeably to denote clinical, biomarker-based, and pathology-proven forms of the disease. In reality, patients may present with specific clinical syndromes which do not exclude the co-occurrence and synergistic effects of multiple pathologies. Efforts must be undertaken to better define VCID as a driver or contributor to clinical outcomes.\nThe initiative led by the Albert Research Institute for White Matter and Cognition provided an opportunity for the advancement of the open questions surrounding diagnoses that fall under the VCID scientific framework. By examining different approaches during the course of two days, participants were able to engage regarding state-of-the-art biomarker tools and envision future directions by incorporating multidisciplinary viewpoints.", "doc_items_refs": ["#/texts/245", "#/texts/246"], "page_nos": [], "uuid": "d9a15c67-3749-4558-baa2-78d9d07e38ac"}
{"doc_id": "2025__The_future_of_biomarkers_for_vascular_contributions_to_cognitive_impairment_and___W4411519614", "source_path": "<redacted:source_path>", "chunk_id": 28, "source_chunk_idxs": [36], "num_tokens": 52, "text": "The future of biomarkers for vascular contributions to cognitive impairment and dementia (VCID): proceedings of the 2025 annual workshop of the Albert research institute for white matter and cognition\nData Availability\nThis is not applicable as we have not reported an original research study.", "doc_items_refs": ["#/texts/248"], "page_nos": [], "uuid": "41a1e124-ea25-4a39-b7b6-427ee92e0ced"}
{"doc_id": "2025__The_future_of_biomarkers_for_vascular_contributions_to_cognitive_impairment_and___W4411519614", "source_path": "<redacted:source_path>", "chunk_id": 29, "source_chunk_idxs": [37], "num_tokens": 504, "text": "The future of biomarkers for vascular contributions to cognitive impairment and dementia (VCID): proceedings of the 2025 annual workshop of the Albert research institute for white matter and cognition\nReferences\n1. Corriveau RA, Bosetti F, Emr M, Gladman JT, Koenig JI, Moy CS, et al. The science of vascular contributions to cognitive impairment and dementia (VCID): a framework for advancing research priorities in the cerebrovascular biology of cognitive decline. Cell Mol Neurobiol. 2016;36(2):281-8.\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n2. National Academies of Sciences Engineering and Medicine. Preventing and treating dementia: research priorities to accelerate progress. Washington, DC: The National Academies Press; 2025. Chapter 4.\nGoogle Scholar\n3. Gorelick PB, Scuteri A, Black SE, Decarli C, Greenberg SM, Iadecola C, et al. Vascular contributions to cognitive impairment and dementia: a statement for healthcare professionals from the american heart association/american stroke association. Stroke. 2011;42(9):2672-713.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n4. Attems J, Jellinger KA. The overlap between vascular disease and Alzheimer's disease - lessons from pathology. BMC Med. 2014;12(1):1-12.\nArticle\nGoogle Scholar\n5. Sachdev P, Kalaria R, O'Brien J, Skoog I, Alladi S, Black SE, et al. Diagnostic criteria for vascular cognitive disorders: a VASCOG statement. Alzheimer Dis Assoc Disord. 2014;28(3):206-18.\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n6. Pohjasvaara T, Mäntylä R, Ylikoski R, Kaste M, Erkinjuntti T. Comparison of different clinical criteria (DSM-III, ADDTC, ICD-10, NINDS-AIREN, DSM-IV) for the diagnosis of vascular dementia. Stroke. 2000;31(12):2952-7.\nArticle\nCAS\nPubMed\nGoogle Scholar\n7. Cipollini V, Troili F, Giubilei F. Emerging biomarkers in vascular cognitive impairment and dementia: from pathophysiological pathways to clinical application. Int J Mol Sci. 2019;20(11).", "doc_items_refs": ["#/texts/250", "#/texts/251", "#/texts/252", "#/texts/253", "#/texts/254", "#/texts/255", "#/texts/256"], "page_nos": [], "uuid": "ba5535c0-b6a6-4496-be13-74036558947f"}
{"doc_id": "2025__The_future_of_biomarkers_for_vascular_contributions_to_cognitive_impairment_and___W4411519614", "source_path": "<redacted:source_path>", "chunk_id": 30, "source_chunk_idxs": [38], "num_tokens": 501, "text": "The future of biomarkers for vascular contributions to cognitive impairment and dementia (VCID): proceedings of the 2025 annual workshop of the Albert research institute for white matter and cognition\nReferences\n8. Hu Y, Fryatt GL, Ghorbani M, Obst J, Menassa DA, Martin-Estebane M, et al. Replicative senescence dictates the emergence of disease-associated microglia and contributes to Abeta pathology. Cell Rep. 2021;35(10):109228.\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n9. Moffitt JR, Bambah-Mukku D, Eichhorn SW, Vaughn E, Shekhar K, Perez JD, et al. Molecular, spatial, and functional single-cell profiling of the hypothalamic preoptic region. Science (80- ). 20181101st ed. 2018;362(6416).\n10. Qiu S, Miller MI, Joshi PS, Lee JC, Xue C, Ni Y, et al. Multimodal deep learning for Alzheimer's disease dementia assessment. Nat Commun. 20220620th ed. 2022;13(1):3404.\n11. Xue C, Kowshik SS, Lteif D, Puducheri S, Jasodanand VH, Zhou OT, et al. AI-based differential diagnosis of dementia etiologies on multimodal data. Nat Med. 20240704th ed. 2024;30(10):2977-89.\n12. Kolachalama VB. Artificial intelligence for differential diagnosis of dementia. Nat Med. 2024;30(10):2737-8.\nArticle\nGoogle Scholar\n13. Hosoki S, Hansra GK, Jayasena T, Poljak A, Mather KA, Catts VS, et al. Molecular biomarkers for vascular cognitive impairment and dementia. Nat Rev Neurol. 20231113th ed. 2023;19(12):737-53.\n14. Gomez GT, Sathyan S, Chen J, Fornage M, Schlosser P, Peng Z, et al. Plasma proteomic characterization of motoric cognitive risk and mild cognitive impairment. Alzheimers Dement. 20250130th ed. 2025;21(2):e14429.", "doc_items_refs": ["#/texts/257", "#/texts/258", "#/texts/259", "#/texts/260", "#/texts/261", "#/texts/262", "#/texts/263"], "page_nos": [], "uuid": "9efd0b62-45a9-47c3-b339-053ede0e0919"}
{"doc_id": "2025__The_future_of_biomarkers_for_vascular_contributions_to_cognitive_impairment_and___W4411519614", "source_path": "<redacted:source_path>", "chunk_id": 31, "source_chunk_idxs": [39], "num_tokens": 473, "text": "The future of biomarkers for vascular contributions to cognitive impairment and dementia (VCID): proceedings of the 2025 annual workshop of the Albert research institute for white matter and cognition\nReferences\n15. Gomez GT, Shi L, Fohner AE, Chen J, Yang Y, Fornage M, et al. Plasma proteome-wide analysis of cerebral small vessel disease identifies novel biomarkers and disease pathways. medRxiv. 20241008th ed. 2024;\n16. Meschia JF, Worrall BB, Elahi FM, Ross OA, Wang MM, Goldstein ED, et al. Management of inherited CNS small vessel diseases: the CADASIL example: a scientific statement from the American Heart Association. Stroke. 2023;54(10).\n17. Keller JN, Radabaugh H, Karvelas N, Fitzsimons S, Treiman S, Palafox MF, et al. Plasma proteomics of genetic brain arteriosclerosis and dementia syndrome identifies signatures of fibrosis, angiogenesis, and metabolic alterations. bioRxiv. 2024;\n18. Karvelas N, Oh B, Wang E, Cobigo Y, Tsuei T, Fitzsimons S, et al. Enlarged perivascular spaces are associated with white matter injury, cognition and inflammation in cerebral autosomal dominant arteriopathy with subcortical infarcts and leukoencephalopathy. Brain Commun. 2024;6(2).\n19. Thompson AG, Gray E, Heman-Ackah SM, Mager I, Talbot K, Andaloussi SE, et al. Extracellular vesicles in neurodegenerative disease - pathogenesis to biomarkers. Nat Rev Neurol. 20160513th ed. 2016;12(6):346-57.\n20. Wei Z, Chen L, Hou X, van Zijl PCM, Xu J, Lu H. Age-related alterations in brain perfusion, venous oxygenation, and oxygen metabolic rate of mice: a 17-month longitudinal MRI study. Front Neurol. 2020;11:559.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/264", "#/texts/265", "#/texts/266", "#/texts/267", "#/texts/268", "#/texts/269"], "page_nos": [], "uuid": "0c7b7f0e-2806-459d-9123-a34be3972fe0"}
{"doc_id": "2025__The_future_of_biomarkers_for_vascular_contributions_to_cognitive_impairment_and___W4411519614", "source_path": "<redacted:source_path>", "chunk_id": 32, "source_chunk_idxs": [40], "num_tokens": 443, "text": "The future of biomarkers for vascular contributions to cognitive impairment and dementia (VCID): proceedings of the 2025 annual workshop of the Albert research institute for white matter and cognition\nReferences\n21. Peng S-L, Chen X, Li Y, Rodrigue KM, Park DC, Lu H. Age-related changes in cerebrovascular reactivity and their relationship to cognition: a four-year longitudinal study. Neuroimage. 2018;174:257-62.\nArticle\nPubMed\nGoogle Scholar\n22. Lin Z, Lim C, Jiang D, Soldan A, Pettigrew C, Oishi K, et al. Longitudinal changes in brain oxygen extraction fraction (OEF) in older adults: relationship to markers of vascular and Alzheimer's pathology. Alzheimers Dement. 20220706th ed. 2023;19(2):569-77.\n23. Jiang D, Lin Z, Liu P, Sur S, Xu C, Hazel K, et al. Brain oxygen extraction is differentially altered by Alzheimer's and vascular diseases. J Magn Reson Imaging. 20200621st ed. 2020;52(6):1829-37.\n24. Wardlaw JM, Benveniste H, Nedergaard M, Zlokovic BV, Mestre H, Lee H, et al. Perivascular spaces in the brain: anatomy, physiology and pathology. Nat Rev Neurol. 2020;16(3):137-53.\nArticle\nPubMed\nGoogle Scholar\n25. Bown CW, Carare RO, Schrag MS, Jefferson AL. Physiology and clinical relevance of enlarged perivascular spaces in the aging brain. Neurology. 2022;98(3):107-17.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n26. Ramaswamy S, Khasiyev F, Gutierrez J. Brain enlarged perivascular spaces as imaging biomarkers of cerebrovascular disease: a clinical narrative review. J Am Heart Assoc. 2022;11(24): e026601.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/270", "#/texts/271", "#/texts/272", "#/texts/273", "#/texts/274", "#/texts/275"], "page_nos": [], "uuid": "fba5ece9-85fc-4e5d-a6db-de984e29d9ab"}
{"doc_id": "2025__The_future_of_biomarkers_for_vascular_contributions_to_cognitive_impairment_and___W4411519614", "source_path": "<redacted:source_path>", "chunk_id": 33, "source_chunk_idxs": [41], "num_tokens": 465, "text": "The future of biomarkers for vascular contributions to cognitive impairment and dementia (VCID): proceedings of the 2025 annual workshop of the Albert research institute for white matter and cognition\nReferences\n27. Brown R, Benveniste H, Black SE, Charpak S, Dichgans M, Joutel A, et al. Understanding the role of the perivascular space in cerebral small vessel disease. Cardiovasc Res. 2018;114(11):1462-73.\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n28. van Veluw SJ, Arfanakis K, Schneider JA. Neuropathology of vascular brain health: insights from ex vivo magnetic resonance imaging-histopathology studies in cerebral small vessel disease. Stroke. 2022;53(2):404-15.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n29. Bennett DA, Buchman AS, Boyle PA, Barnes LL, Wilson RS, Schneider JA. Religious orders study and rush memory and aging project. J Alzheimers Dis. 2018;64(s1):S161-89.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n30. Barnes LL, Shah RC, Aggarwal NT, Bennett DA, Schneider JA. The minority aging research study: ongoing efforts to obtain brain donation in African Americans without dementia. Curr Alzheimer Res. 2012;9(6):734-45.\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n31. Javierre-Petit C, Kontzialis M, Leurgans SE, Bennett DA, Schneider JA, Arfanakis K. Quantitative assessment of enlarged perivascular spaces via deep-learning in community-based older adults reveals independent associations with vascular neuropathologies, vascular risk factors and cognition. Brain Commun. 2024;6(4):1-14.\nArticle\nGoogle Scholar\n32. Ramirez J, Berezuk C, McNeely AA, Gao F, McLaurin J, Black SE. Imaging the perivascular space as a potential biomarker of neurovascular and neurodegenerative diseases. Cell Mol Neurobiol. 20160318th ed. 2016;36(2):289-99.", "doc_items_refs": ["#/texts/276", "#/texts/277", "#/texts/278", "#/texts/279", "#/texts/280", "#/texts/281"], "page_nos": [], "uuid": "e8cb7a2b-c997-4350-a634-369689791755"}
{"doc_id": "2025__The_future_of_biomarkers_for_vascular_contributions_to_cognitive_impairment_and___W4411519614", "source_path": "<redacted:source_path>", "chunk_id": 34, "source_chunk_idxs": [42], "num_tokens": 491, "text": "The future of biomarkers for vascular contributions to cognitive impairment and dementia (VCID): proceedings of the 2025 annual workshop of the Albert research institute for white matter and cognition\nReferences\n33. Ramirez J, Berberian SA, Breen DP, Gao F, Ozzoude M, Adamo S, et al. Small and large magnetic resonance imaging-visible perivascular spaces in the basal ganglia of Parkinson's disease patients. Mov Disord. 20220411th ed. 2022;37(6):1304-9.\n34. Andriuta D, Ottoy J, Ruthirakuhan M, Feliciano G, Dilliott AA, Hegele RA, et al. Perivascular spaces, plasma GFAP, and speeded executive function in neurodegenerative diseases. Alzheimers Dement. 20240704th ed. 2024;20(8):5800-8.\n35. Schutte AE, Bennett B, Chow CK, Cloud GC, Doyle K, Girdis Z, et al. National Hypertension Taskforce of Australia: a roadmap to achieve 70% blood pressure control in Australia by 2030. Med J Aust. 2024;126-34.\n36. Lennon MJ, Lam BCP, Lipnicki DM, Crawford JD, Peters R, Schutte AE, et al. Use of antihypertensives, blood pressure, and estimated risk of dementia in late life: an individual participant data meta-analysis. JAMA Netw Open. 2023;6(9):e2333353-e2333353.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n37. Lennon MJ, Lipnicki DM, Lam BCP, Crawford JD, Schutte AE, Peters R, et al. Blood pressure, antihypertensive use, and late-life Alzheimer and non-Alzheimer dementia risk: an individual participant data meta-analysis. Neurology. 2024;103(5):e209715.\nArticle\nPubMed\nGoogle Scholar\n38. Lennon MJ, Thalamuthu A, Lam BCP, Crawford JD, Sachdev PS. Genetically predicted blood pressure and cognition in midlife: a UK Biobank study. Hypertension. 2023 Sep;0(0).", "doc_items_refs": ["#/texts/282", "#/texts/283", "#/texts/284", "#/texts/285", "#/texts/286", "#/texts/287"], "page_nos": [], "uuid": "747613d2-24b1-4e46-a045-a16d102e85a2"}
{"doc_id": "2025__The_future_of_biomarkers_for_vascular_contributions_to_cognitive_impairment_and___W4411519614", "source_path": "<redacted:source_path>", "chunk_id": 35, "source_chunk_idxs": [43, 44, 45], "num_tokens": 367, "text": "The future of biomarkers for vascular contributions to cognitive impairment and dementia (VCID): proceedings of the 2025 annual workshop of the Albert research institute for white matter and cognition\nReferences\n39. Drozdowska BA, Lam K, Doolan C, Violato E, Ganesh A. Evaluating the usability of a remote ischemic conditioning device for pre-hospital stroke management: insights from paramedic simulations. Neurol Int. 2024;16(6):1405-20.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n40. Ganesh A, Smith EE, Hill MD. Remote ischaemic conditioning for stroke prevention. Lancet Neurol. 2022;21(12):1062-3.\nArticle\nPubMed\nGoogle Scholar\n41. Ganesh A, Barber P, Black SE, Corbett D, Field TS, Frayne R, et al. Trial of remote ischaemic preconditioning in vascular cognitive impairment (TRIC-VCI): protocol. BMJ Open. 2020;10(10):e040466.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\nDownload references\n\nThe future of biomarkers for vascular contributions to cognitive impairment and dementia (VCID): proceedings of the 2025 annual workshop of the Albert research institute for white matter and cognition\nFunding\nOpen Access funding enabled and organized by CAUL and its Member Institutions. Funding for the conference and for this paper was provided by the Albert White Matter Research Institute.\n\nThe future of biomarkers for vascular contributions to cognitive impairment and dementia (VCID): proceedings of the 2025 annual workshop of the Albert research institute for white matter and cognition\nAuthor information\nAuthor notes\n1. Matthew J Lennon and Nikolaos Karvelas contributed equally to the production of this paper.", "doc_items_refs": ["#/texts/288", "#/texts/289", "#/texts/290", "#/texts/291", "#/texts/293", "#/texts/295", "#/texts/296"], "page_nos": [], "uuid": "eb0d8e31-1783-4574-8f2c-e09dd7c6d71e"}
{"doc_id": "2025__The_future_of_biomarkers_for_vascular_contributions_to_cognitive_impairment_and___W4411519614", "source_path": "<redacted:source_path>", "chunk_id": 36, "source_chunk_idxs": [46], "num_tokens": 498, "text": "The future of biomarkers for vascular contributions to cognitive impairment and dementia (VCID): proceedings of the 2025 annual workshop of the Albert research institute for white matter and cognition\nAuthor information\nAuthors and Affiliations\n1. Centre for Healthy Brain Aging (CHeBA), Discipline of Psychiatry &amp; Mental Health, School of Clinical Medicine, University of New South Wales, Sydney NSW, Australia Matthew J Lennon\n2. Northern Sydney Local Health District, NSW Health, Sydney NSW, Australia Matthew J Lennon\n3. Departments of Neurology and Neuroscience, Icahn School of Medicine at Mount Sinai, New York, NY, USA Nikolaos Karvelas\n4. Department of Clinical Neurosciences and Hotchkiss Brain Institute, Cumming School of Medicine, University of Calgary, Calgary, AB, Canada Aravind Ganesh\n5. Department of Anatomy and Cell Biology, Schulich School of Medicine and Dentistry, Western University, London, ON, N6A5C1, Canada Shawn Whitehead\n6. Department of Neurology, Division of Stroke and Neurocritical Care, Northwestern University Feinberg School of Medicine, Chicago, IL, USA Farzaneh A Sorond\n7. Department of Neurobiology, Brudnick Neuropsychiatric Research Institute, University of Massachusetts Chan Medical School, Worcester, MA, USA Violeta Durán Laforet\n8. Department of Pathology &amp; Laboratory Medicine, University of California, Irvine, CA, 92697, USA Elizabeth Head\n9. Department of Biomedical Engineering, Illinois Institute of Technology, Chicago, IL, USA Konstantinos Arfanakis\n10. Department of Diagnostic Radiology and Nuclear Medicine, Rush University Medical Center, Chicago, IL, USA Konstantinos Arfanakis\n11. Rush Alzheimer's Disease Center, Rush University Medical Center, Chicago, IL, USA Konstantinos Arfanakis\n12. Department of Medicine, Boston University Chobanian &amp; Avedisian School of Medicine, Boston, MA, 02118, USA Vijaya B Kolachalama\n13. Department of Computer Science and Faculty of Computing &amp; Data Sciences, Boston University, Boston, MA, 02215, USA Vijaya B Kolachalama\n14. Department of Biomedical Engineering, The Pennsylvania State University, University Park, PA, 16802, USA Xiao Liu\n15. Institute for Computational and Data Sciences, The Pennsylvania State University, University Park, PA, 16802, USA Xiao Liu", "doc_items_refs": ["#/texts/298", "#/texts/299", "#/texts/300", "#/texts/301", "#/texts/302", "#/texts/303", "#/texts/304", "#/texts/305", "#/texts/306", "#/texts/307", "#/texts/308", "#/texts/309", "#/texts/310", "#/texts/311", "#/texts/312"], "page_nos": [], "uuid": "b78e8a37-a6b1-4c86-8631-d77634232d46"}
{"doc_id": "2025__The_future_of_biomarkers_for_vascular_contributions_to_cognitive_impairment_and___W4411519614", "source_path": "<redacted:source_path>", "chunk_id": 37, "source_chunk_idxs": [47], "num_tokens": 291, "text": "The future of biomarkers for vascular contributions to cognitive impairment and dementia (VCID): proceedings of the 2025 annual workshop of the Albert research institute for white matter and cognition\nAuthor information\nAuthors and Affiliations\n16. Department of Radiology, Johns Hopkins University, School of Medicine, Baltimore, MD, USA Hanzhang Lu\n17. Sunnybrook Research Institute, University of Toronto, Toronto, ON, Canada Joel Ramirez\n18. Laboratory of Behavioral Neuroscience, National Institute on Aging, National Institutes of Health, Baltimore, MD, USA Keenan Walker\n19. Stark Neurosciences Research Institute, Indiana University School of Medicine, Indianapolis, IN, USA Erica Weekman\n20. Sanders-Brown Center on Aging, University of Kentucky, Lexington, KY, USA Erica Weekman\n21. Department of Pathology and Laboratory Medicine, Djavad Mowafaghian Centre for Brain Health, University of British Columbia, Vancouver, BC, Canada Cheryl L Wellington\n22. University of Southern California, Alzheimer′s Disease Therapeutic Research (ATRI), San Diego, CA, USA Charisse Winston\n23. University of California, La Jolla, San Diego, CA, USA Charisse Winston\n24. Department of Neurology, University of New York Downstate Health Sciences University, Brooklyn, NY, USA Frank C Barone\n25. Division of Neuroscience, National Institute of Neurological Disorder and Stroke (NINDS), Bethesda, MD, USA Roderick A Corriveau\nAuthors", "doc_items_refs": ["#/texts/313", "#/texts/314", "#/texts/315", "#/texts/316", "#/texts/317", "#/texts/318", "#/texts/319", "#/texts/320", "#/texts/321", "#/texts/322", "#/texts/323"], "page_nos": [], "uuid": "0aa7876a-c13d-47a2-9ab5-787ca2164513"}
{"doc_id": "2025__The_future_of_biomarkers_for_vascular_contributions_to_cognitive_impairment_and___W4411519614", "source_path": "<redacted:source_path>", "chunk_id": 38, "source_chunk_idxs": [48], "num_tokens": 349, "text": "The future of biomarkers for vascular contributions to cognitive impairment and dementia (VCID): proceedings of the 2025 annual workshop of the Albert research institute for white matter and cognition\nAuthor information\nAuthors and Affiliations\n1. Matthew J Lennon\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n2. Nikolaos Karvelas\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n3. Aravind Ganesh\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n4. Shawn Whitehead\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n5. Farzaneh A Sorond\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n6. Violeta Durán Laforet\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n7. Elizabeth Head\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n8. Konstantinos Arfanakis\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n9. Vijaya B Kolachalama\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n10. Xiao Liu\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n11. Hanzhang Lu\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n12. Joel Ramirez\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n13. Keenan Walker\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n14. Erica Weekman\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n15. Cheryl L Wellington\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n16. Charisse Winston\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n17. Frank C Barone\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n18. Roderick A Corriveau\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/324", "#/texts/325", "#/texts/326", "#/texts/327", "#/texts/328", "#/texts/329", "#/texts/330", "#/texts/331", "#/texts/332", "#/texts/333", "#/texts/334", "#/texts/335", "#/texts/336", "#/texts/337", "#/texts/338", "#/texts/339", "#/texts/340", "#/texts/341"], "page_nos": [], "uuid": "17110318-c6c0-4d31-b1f4-16c2d3e727d1"}
{"doc_id": "2025__The_future_of_biomarkers_for_vascular_contributions_to_cognitive_impairment_and___W4411519614", "source_path": "<redacted:source_path>", "chunk_id": 39, "source_chunk_idxs": [49], "num_tokens": 362, "text": "The future of biomarkers for vascular contributions to cognitive impairment and dementia (VCID): proceedings of the 2025 annual workshop of the Albert research institute for white matter and cognition\nAuthor information\nContributions\nMJL provided section on his presentation, synthesized the presenting topics, wrote the initial draft of the manuscript, and revised the later drafts of the manuscript. NK provided section on his presentation, synthesized the presenting topics, wrote the initial draft of the manuscript, and revised the later drafts of the manuscript. AG provided section on his presentation, synthesized the presenting topics, wrote the initial draft of the manuscript, and revised the later drafts of the manuscript. SW, provided section on his presentation and revised the drafts of the manuscript. FAS provided section on her presentation and revised the drafts of the manuscript. VDL provided section on her presentation and revised the drafts of the manuscript. EH provided section on her presentation and revised the drafts of the manuscript. KA provided section on his presentation and revised the drafts of the manuscript. VBK provided section on his presentation and revised the drafts of the manuscript. XL provided section on his presentation and revised the drafts of the manuscript. HL provided section on his presentation and revised the drafts of the manuscript. JR provided section on his presentation and revised the drafts of the manuscript. KW provided section on his presentation and revised the drafts of the manuscript. EW provided section on her presentation and revised the drafts of the manuscript. CLW provided section on her presentation and revised the drafts of the manuscript. CW provided section on her presentation and revised the drafts of the manuscript. FCB provided section on his presentation, provided supervision of the manuscript direction and revised the drafts of the manuscript. RAC provided section on his presentation, provided supervision of the manuscript direction and revised the drafts of the manuscript.", "doc_items_refs": ["#/texts/343"], "page_nos": [], "uuid": "95f7ddc1-fe54-484b-8244-4b87aedf1357"}
{"doc_id": "2025__The_future_of_biomarkers_for_vascular_contributions_to_cognitive_impairment_and___W4411519614", "source_path": "<redacted:source_path>", "chunk_id": 40, "source_chunk_idxs": [50, 51, 52], "num_tokens": 298, "text": "The future of biomarkers for vascular contributions to cognitive impairment and dementia (VCID): proceedings of the 2025 annual workshop of the Albert research institute for white matter and cognition\nAuthor information\nCorresponding author\nCorrespondence to\nMatthew J Lennon\n.\n\nThe future of biomarkers for vascular contributions to cognitive impairment and dementia (VCID): proceedings of the 2025 annual workshop of the Albert research institute for white matter and cognition\nEthics declarations\nCompeting interests\nAG reports consulting fees from Atheneum, Canadian Association of Neuroscience Nurses, Creative Research Designs, DeepBench, MD Analytics, Figure 1, Alexion, Biogen, Servier Canada, MyMedicalPanel, AlphaSights, and CTC Communications Corporation; stock/stock options from SnapDx and Let's Get Proof (Collavidence, Inc); has a patent application (US 17/317771) for a system for remote ischemic conditioning; and is co-leading ongoing/planned trials of remote ischemic conditioning in patients with small vessel disease (NCT04109963 and NCT05967728). The other authors do not report conflicts.\n\nThe future of biomarkers for vascular contributions to cognitive impairment and dementia (VCID): proceedings of the 2025 annual workshop of the Albert research institute for white matter and cognition\nAdditional information\nPublisher's Note\nSpringer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations.", "doc_items_refs": ["#/texts/345", "#/texts/346", "#/texts/347", "#/texts/350", "#/texts/353"], "page_nos": [], "uuid": "84a1f05a-a05f-489e-9295-ac155f307e94"}
{"doc_id": "2025__The_future_of_biomarkers_for_vascular_contributions_to_cognitive_impairment_and___W4411519614", "source_path": "<redacted:source_path>", "chunk_id": 41, "source_chunk_idxs": [53, 54], "num_tokens": 303, "text": "The future of biomarkers for vascular contributions to cognitive impairment and dementia (VCID): proceedings of the 2025 annual workshop of the Albert research institute for white matter and cognition\nRights and permissions\nThis article is published under an open access license.\nPlease check the 'Copyright Information' section either on this page or in the PDF\nfor details of this license and what re-use is permitted.\nIf your intended use exceeds what is permitted by the license or if\nyou are unable to locate the licence and re-use information,\nplease contact the\nRights and\nPermissions team\n.\n\nThe future of biomarkers for vascular contributions to cognitive impairment and dementia (VCID): proceedings of the 2025 annual workshop of the Albert research institute for white matter and cognition\nAbout this article\nCite this article\nLennon, M.J., Karvelas, N., Ganesh, A.\net al.\nThe future of biomarkers for vascular contributions to cognitive impairment and dementia (VCID): proceedings of the 2025 annual workshop of the Albert research institute for white matter and cognition.\nGeroScience\n(2025). https://doi.org/10.1007/s11357-025-01746-y\nDownload citation\n- Received : 25 March 2025\n- Accepted : 09 June 2025\n- Published : 21 June 2025\n- DOI : https://doi.org/10.1007/s11357-025-01746-y", "doc_items_refs": ["#/texts/355", "#/texts/356", "#/texts/357", "#/texts/358", "#/texts/359", "#/texts/360", "#/texts/361", "#/texts/362", "#/texts/363", "#/texts/366", "#/texts/367", "#/texts/368", "#/texts/369", "#/texts/370", "#/texts/371", "#/texts/372", "#/texts/373", "#/texts/374", "#/texts/375"], "page_nos": [], "uuid": "2da5196a-2e72-4cd6-ad6a-13e60162b2e1"}
{"doc_id": "2025__The_future_of_biomarkers_for_vascular_contributions_to_cognitive_impairment_and___W4411519614", "source_path": "<redacted:source_path>", "chunk_id": 42, "source_chunk_idxs": [55, 56, 57, 58, 59, 60, 61, 62], "num_tokens": 489, "text": "The future of biomarkers for vascular contributions to cognitive impairment and dementia (VCID): proceedings of the 2025 annual workshop of the Albert research institute for white matter and cognition\nAbout this article\nKeywords\n- Biomarkers\n- Vascular contributions to cognitive impairment and dementia\n- Cognition\n\nThe future of biomarkers for vascular contributions to cognitive impairment and dementia (VCID): proceedings of the 2025 annual workshop of the Albert research institute for white matter and cognition\nAbout this article\nProfiles\n1. Matthew J Lennon\nView author profile\n2. Nikolaos Karvelas\nView author profile\nUse our pre-submission checklist\nAvoid common mistakes on your manuscript.\nAdvertisement\n\nThe future of biomarkers for vascular contributions to cognitive impairment and dementia (VCID): proceedings of the 2025 annual workshop of the Albert research institute for white matter and cognition\nSearch\nSearch by keyword or author\nSearch\n\nThe future of biomarkers for vascular contributions to cognitive impairment and dementia (VCID): proceedings of the 2025 annual workshop of the Albert research institute for white matter and cognition\nNavigation\n- Find a journal\n- Publish with us\n- Track your research\n\nThe future of biomarkers for vascular contributions to cognitive impairment and dementia (VCID): proceedings of the 2025 annual workshop of the Albert research institute for white matter and cognition\nNavigation\nDiscover content\n- Journals A-Z\n- Books A-Z\n\nThe future of biomarkers for vascular contributions to cognitive impairment and dementia (VCID): proceedings of the 2025 annual workshop of the Albert research institute for white matter and cognition\nNavigation\nPublish with us\n- Journal finder\n- Publish your research\n- Language editing\n- Open access publishing\n\nThe future of biomarkers for vascular contributions to cognitive impairment and dementia (VCID): proceedings of the 2025 annual workshop of the Albert research institute for white matter and cognition\nNavigation\nProducts and services\n- Our products\n- Librarians\n- Societies\n- Partners and advertisers\n\nThe future of biomarkers for vascular contributions to cognitive impairment and dementia (VCID): proceedings of the 2025 annual workshop of the Albert research institute for white matter and cognition\nNavigation\nOur brands\n- Springer\n- Nature Portfolio\n- BMC\n- Palgrave Macmillan\n- Apress\n- Discover\n- Your privacy choices/Manage cookies\n- Your US state privacy rights\n- Accessibility statement\n- Terms and conditions\n- Privacy policy\n- Help and support\n- Legal notice\n- Cancel contracts here\n173.68.96.214\nNot affiliated\nImage Hyperlink.\n© 2025 Springer Nature", "doc_items_refs": ["#/texts/377", "#/texts/378", "#/texts/379", "#/texts/381", "#/texts/382", "#/texts/383", "#/texts/384", "#/texts/385", "#/texts/387", "#/texts/388", "#/texts/390", "#/texts/391", "#/texts/392", "#/texts/394", "#/texts/395", "#/texts/397", "#/texts/398", "#/texts/399", "#/texts/400", "#/texts/402", "#/texts/403", "#/texts/404", "#/texts/405", "#/texts/407", "#/texts/408", "#/texts/409", "#/texts/410", "#/texts/411", "#/texts/412", "#/texts/413", "#/texts/414", "#/texts/415", "#/texts/416", "#/texts/417", "#/texts/418", "#/texts/419", "#/texts/420", "#/texts/421", "#/texts/422", "#/texts/423", "#/texts/424"], "page_nos": [], "uuid": "7d04486c-80ff-4ea7-9954-dc076296b003"}
