{"doc_id": "2025__The_association_between_cognitive_domains_and_suicidal_ideation_in_patients_with__W4414930634", "source_path": "<redacted:source_path>", "chunk_id": 0, "source_chunk_idxs": [0, 1, 2], "num_tokens": 355, "text": "The association between cognitive domains and suicidal ideation in patients with mild dementia: the crucial role of judgement domain | BMC Geriatrics | Full Text\nSkip to main content\nAdvertisement\nSearch\n- Explore journals\n- Get published\n- About BMC\n- My account\nSearch all BMC articles\nSearch\nBMC Geriatrics\n- Home\n- About\n- Articles\n- Collections\n- Submission Guidelines\n- Join the Editorial Board\n- Submit manuscript\nThe association between cognitive domains and suicidal ideation in patients with mild dementia: the crucial role of judgement domain\nDownload PDF\nDownload PDF\n- Research\n- Open access\n- Published: 08 October 2025\n\nThe association between cognitive domains and suicidal ideation in patients with mild dementia: the crucial role of judgement domain\n- Xiaoyi Tian\n1\nna1\n,\n- Hongjun Sun\n2\nna1\n,\n- Tingting Zhang\n1\n,\n- Bo Zhang\n2\n,\n- Yuanyuna Li\n1\n,\n- Ying Cui\n2\n,\n- Peilin Xu\n1\n,\n- Wujisiguleng\n2\n,\n- Hongmei Yu\n2\n,\n- Yueqin Huang\n1\n&amp;\n- ...\n- Zhaorui Liu\n1\nShow authors\nBMC Geriatrics\nvolume 25\n, Article number: 763 ( 2025 )\nCite this article\n- 165 Accesses\n- 15 Altmetric\n- Metrics details\n\nThe association between cognitive domains and suicidal ideation in patients with mild dementia: the crucial role of judgement domain\nAbstract\nBackground\nChina, with the world's largest population of individuals with dementia, faces a significant suicide rate among older adults, which remains a public health concern. Although previous studies suggest an association between dementia and suicidal ideation, the specific role of cognitive domains in this relationship is not well understood. This study aims to fill this gap by examining the association between cognitive domains and suicidal ideation in older adults with mild dementia.", "doc_items_refs": ["#/texts/1", "#/texts/2", "#/texts/3", "#/texts/4", "#/texts/5", "#/texts/6", "#/texts/7", "#/texts/8", "#/texts/9", "#/texts/10", "#/texts/11", "#/texts/12", "#/texts/13", "#/texts/14", "#/texts/15", "#/texts/16", "#/texts/17", "#/texts/18", "#/texts/19", "#/texts/20", "#/texts/21", "#/texts/22", "#/texts/23", "#/texts/25", "#/texts/26", "#/texts/27", "#/texts/28", "#/texts/29", "#/texts/30", "#/texts/31", "#/texts/32", "#/texts/33", "#/texts/34", "#/texts/35", "#/texts/36", "#/texts/37", "#/texts/38", "#/texts/39", "#/texts/40", "#/texts/41", "#/texts/42", "#/texts/43", "#/texts/44", "#/texts/47"], "page_nos": [], "uuid": "fca41a1e-1269-4374-8d21-8cf111822d3c"}
{"doc_id": "2025__The_association_between_cognitive_domains_and_suicidal_ideation_in_patients_with__W4414930634", "source_path": "<redacted:source_path>", "chunk_id": 1, "source_chunk_idxs": [3, 4, 5], "num_tokens": 401, "text": "The association between cognitive domains and suicidal ideation in patients with mild dementia: the crucial role of judgement domain\nAbstract\nMethods\nThis cross-sectional study included 4,289 adults aged ≥ 65 years from Tongliao City, Inner Mongolia. Cognitive domains were assessed using the Clinical Dementia Rating (CDR) scale, and suicidal ideation was evaluated using the Geriatric Mental State-Automated Geriatric Examination for Computer Assisted Taxonomy (GMS-AGECAT) package. Multiple logistic regression and network analyses were conducted to examine the relationships between cognitive domains and suicidal ideation.\n\nThe association between cognitive domains and suicidal ideation in patients with mild dementia: the crucial role of judgement domain\nAbstract\nResults\nThe prevalence of suicidal ideation was significantly higher in mild dementia patients (10.6%) compared to non-dementia individuals (2.1%). Mild dementia was independently associated with suicidal ideation (adjusted OR = 3.37, 95%CI: 1.83-6.19), even after controlling for depression and anxiety. Among cognitive domains, judgment impairment showed the strongest independent association with suicidal ideation (OR = 3.44, 95%CI: 1.49-7.95). Network analysis confirmed judgment domain as the key cognitive factor linking dementia to suicidal ideation, contrasting with multiple domain associations in non-dementia individuals.\n\nThe association between cognitive domains and suicidal ideation in patients with mild dementia: the crucial role of judgement domain\nAbstract\nConclusions\nJudgment domain impairment plays a crucial and independent role in suicidal ideation among mild dementia patients, with more than half of the dementia-suicide association remaining significant even after accounting for emotional symptoms. While anxiety and depression are important concurrent factors requiring clinical attention, the fundamental role of cognitive decision-making capacity suggests that interventions targeting judgment enhancement should be considered as a primary approach in suicide prevention efforts for this population. Further research is needed to develop and validate interventions specifically targeting judgment enhancement while concurrently managing emotional symptoms in the context of dementia care.\nPeer Review reports", "doc_items_refs": ["#/texts/49", "#/texts/51", "#/texts/53", "#/texts/54"], "page_nos": [], "uuid": "3210b724-401c-483b-9eb0-d9f039cb97d0"}
{"doc_id": "2025__The_association_between_cognitive_domains_and_suicidal_ideation_in_patients_with__W4414930634", "source_path": "<redacted:source_path>", "chunk_id": 2, "source_chunk_idxs": [6], "num_tokens": 359, "text": "The association between cognitive domains and suicidal ideation in patients with mild dementia: the crucial role of judgement domain\nIntroduction\nChina has the world's largest population of individuals with dementia [\n19\n], and the suicide mortality rate among the older population aged 65 years and over remains high [\n31\n]. According to recent epidemiological data, the prevalence of dementia in Chinese older adults has reached 5.6%, with an upward trend [\n17\n,\n19\n]. This growing population faces unique challenges in mental health care, particularly in resource-limited regions where traditional family structures and cultural values remain deeply entrenched. In these areas, older adults often occupy pivotal roles as family decision-makers and moral authorities. Cognitive decline-particularly in domains such as judgment-may thus trigger profound psychological distress by undermining these culturally sanctioned roles, potentially escalating suicide risk [\n23\n,\n32\n].\nEmerging evidence underscores cognitive impairment as a critical determinant of suicide risk in older adults [\n14\n]. While studies have linked dementia to suicidal ideation [\n8\n], the specific contributions of distinct cognitive domains remain poorly understood. This gap is particularly salient in mild dementia, where patients retain sufficient awareness to experience the psychological burden of their diagnosis yet exhibit varied cognitive deficits [\n24\n]. Prevailing research has focused on global cognitive decline as a risk factor, neglecting domain-specific mechanisms [\n12\n,\n14\n]. From a biopsychosocial perspective, cognitive impairment may elevate suicide risk through multiple pathways: biologically, prefrontal cortex degeneration may directly impair decision-making; psychologically, compromised problem-solving ability may escalate feelings of helplessness; socio-culturally, the loss of family authority may trigger profound identity crises [\n23\n,\n29\n].", "doc_items_refs": ["#/texts/56", "#/texts/57", "#/texts/58", "#/texts/59", "#/texts/60", "#/texts/61", "#/texts/62", "#/texts/63", "#/texts/64", "#/texts/65", "#/texts/66", "#/texts/67", "#/texts/68", "#/texts/69", "#/texts/70", "#/texts/71", "#/texts/72", "#/texts/73", "#/texts/74", "#/texts/75", "#/texts/76", "#/texts/77", "#/texts/78", "#/texts/79", "#/texts/80", "#/texts/81", "#/texts/82", "#/texts/83"], "page_nos": [], "uuid": "f9004291-9e9a-4d72-90da-e3106c7ca147"}
{"doc_id": "2025__The_association_between_cognitive_domains_and_suicidal_ideation_in_patients_with__W4414930634", "source_path": "<redacted:source_path>", "chunk_id": 3, "source_chunk_idxs": [7], "num_tokens": 458, "text": "The association between cognitive domains and suicidal ideation in patients with mild dementia: the crucial role of judgement domain\nIntroduction\nThe role of emotional symptoms, particularly anxiety and depression, further complicates this relationship. While depression has been consistently identified as strongly associated with suicidal ideation [\n16\n,\n25\n], anxiety has emerged as an equally important but less studied factor in the dementia-suicide relationship. Both emotional symptoms are prevalent in dementia patients and show strong associations with suicidal thoughts. However, the exact role of these emotional symptoms in the relationship between cognitive impairment and suicide risk-whether as a confounder, mediator, or independent parallel pathways- remains to be clarified [\n12\n]. More importantly, it is unclear whether cognitive domain impairments show independent associations with suicide risk beyond what can be explained by emotional symptoms alone. Understanding these relationships is especially crucial given China's significant burden of geriatric suicide [\n31\n].\nExisting screening tools, such as the Mini-Mental State Examination (MMSE), lack sensitivity to domain-specific impairments [\n14\n]. The Clinical Dementia Rating (CDR) scale addresses this limitation by assessing six cognitive domains, including judgment and problem-solving-a dimension critically aligned with the decision-making demands of rural Chinese family dynamics [\n18\n]. Unlike domains measuring daily functioning (e.g., household chores), judgment deficits directly threaten the elder's symbolic role as a family decision-maker, a cornerstone of Confucian cultural values [\n18\n]. This domain-specific approach may better capture culturally relevant cognitive deficits, offering a nuanced lens to examine suicide risk pathways.\nThis study aims to bridge these gaps by investigating the domain-specific contributions of cognitive impairment to suicidal ideation in older adults with mild dementia, with a focus on resource-limited settings of China. We hypothesize that judgment domain deficits show the strongest independent association with suicide risk among cognitive factors, even after accounting for anxiety and depressive symptoms, although these emotional symptoms may demonstrate stronger overall associations with suicidal ideation. By elucidating the independent associations of cognitive domains and the mediating effects of emotional symptoms, our findings aim to inform culturally tailored screening protocols and interventions for underserved populations with limited access to specialized dementia care.", "doc_items_refs": ["#/texts/84", "#/texts/85", "#/texts/86", "#/texts/87", "#/texts/88", "#/texts/89", "#/texts/90", "#/texts/91", "#/texts/92", "#/texts/93", "#/texts/94", "#/texts/95", "#/texts/96", "#/texts/97", "#/texts/98", "#/texts/99", "#/texts/100"], "page_nos": [], "uuid": "b8c7b7d3-5c1d-4b05-a117-5c0afdb3559f"}
{"doc_id": "2025__The_association_between_cognitive_domains_and_suicidal_ideation_in_patients_with__W4414930634", "source_path": "<redacted:source_path>", "chunk_id": 4, "source_chunk_idxs": [8, 9], "num_tokens": 411, "text": "The association between cognitive domains and suicidal ideation in patients with mild dementia: the crucial role of judgement domain\nMethod\nStudy design and participants\nA representative cross-sectional survey on dementia and risk factors was carried out in Tongliao City, Inner Mongolia among residents aged 65 years and over from May to August 2023. A three-stage disproportionate sampling method was employed to ensure representativeness, covering both urban and rural districts of Tongliao City. Interviewers received standardized training on the administration of the CDR scale and suicide risk assessment, including role-playing exercises to enhance inter-rater reliability. Trained interviewers collected the data from older persons and their informants. This study was conducted in accordance with the Declaration of Helsinki and approved by the local ethics committee (Reference No.20220325001), and written informed consents were obtained from all participants.\n\nThe association between cognitive domains and suicidal ideation in patients with mild dementia: the crucial role of judgement domain\nMethod\nDiagnostic criteria and assessment\nDementia was diagnosed using instruments of the 10/66 Dementia Research Group using 10/66 criteria [\n10\n], which integrates the Geriatric Mental State assessment (GMS), Community Screening Interview for Dementia (CSI-D), and Modified CERAD 10-word list learning task through validated logistic regression equations [\n28\n]. The severity of dementia was assessed using the Clinical Dementia Rating (CDR) scale, which consisted of an evaluation of six cognitive domains, including memory, orientation, judgment and problem-solving (referred to as judgment domain), community affairs (community domain), home and hobbies (household domain), and personal care (dependence domain) [\n1\n,\n2\n,\n4\n,\n5\n,\n15\n,\n18\n]. The CDR scale evaluates six cognitive domains with scores ranging from 0 (normal) to 3 (severe impairment). Participants with moderate-to-severe dementia (CDR score ≥ 2) were excluded based on prior evidence of diminished capacity for suicidal ideation [\n9\n].", "doc_items_refs": ["#/texts/103", "#/texts/105", "#/texts/106", "#/texts/107", "#/texts/108", "#/texts/109", "#/texts/110", "#/texts/111", "#/texts/112", "#/texts/113", "#/texts/114", "#/texts/115", "#/texts/116", "#/texts/117", "#/texts/118", "#/texts/119", "#/texts/120", "#/texts/121", "#/texts/122", "#/texts/123"], "page_nos": [], "uuid": "eafbee71-397f-46ec-ac4d-435ebd718ece"}
{"doc_id": "2025__The_association_between_cognitive_domains_and_suicidal_ideation_in_patients_with__W4414930634", "source_path": "<redacted:source_path>", "chunk_id": 5, "source_chunk_idxs": [10, 11], "num_tokens": 317, "text": "The association between cognitive domains and suicidal ideation in patients with mild dementia: the crucial role of judgement domain\nMethod\nDepression and anxiety assessment\nDepressive symptoms were comprehensively evaluated using standardized ICD-10 diagnostic criteria. The assessment included both current depressive mood and historical depression documented through medical records review and informant interviews. Anxiety was identified using the GMS-AGECAT, with six levels of diagnostic confidence for anxiety that range from no symptoms (0) to very severely affected (5). Participants who reached level three in the GMS/AGECAT were considered to be anxiety cases [\n6\n,\n27\n]. Special attention was paid to establishing the temporal relationship between both depression and anxiety onset and cognitive decline. This thorough assessment approach allowed us to examine both depression and anxiety's roles as potential mediators in the relationship between cognitive impairment and suicidal ideation.\n\nThe association between cognitive domains and suicidal ideation in patients with mild dementia: the crucial role of judgement domain\nMethod\nSuicide ideation assessment\nSuicidal ideation over the past month was assessed using the standardized questions from the 10/66 protocol within the Geriatric Mental State (GMS) interview, which asks participants about the experiences of feeling suicidal or wishing to be dead over the past month. These questions are part of the (GMS-AGECAT) package [\n10\n] and have been used in previous studies of suicidal ideation in older adults [\n3\n,\n6\n,\n21\n]. Individuals with moderate-to-severe dementia were excluded, as confirmed by a neurologist's evaluation of preserved self-report capacity [\n9\n].", "doc_items_refs": ["#/texts/125", "#/texts/126", "#/texts/127", "#/texts/128", "#/texts/129", "#/texts/131", "#/texts/132", "#/texts/133", "#/texts/134", "#/texts/135", "#/texts/136", "#/texts/137", "#/texts/138", "#/texts/139", "#/texts/140", "#/texts/141"], "page_nos": [], "uuid": "36ccf86c-75de-4163-a962-fb41a8186701"}
{"doc_id": "2025__The_association_between_cognitive_domains_and_suicidal_ideation_in_patients_with__W4414930634", "source_path": "<redacted:source_path>", "chunk_id": 6, "source_chunk_idxs": [12], "num_tokens": 432, "text": "The association between cognitive domains and suicidal ideation in patients with mild dementia: the crucial role of judgement domain\nMethod\nStatistical analysis\nStatistical analysis included univariate analysis using the Pearson χ\n2\ntest for categorical variables and independent t-tests for continuous variables. Multivariate analysis was conducted using logistic regression. Due to zero variance in the suicidal ideation group, the dependence domain was excluded from multiple logistic regression analysis but was included in network analysis to provide a comprehensive view of cognitive domain interactions. Interaction terms were included in the logistic regression models to examine potential effect modification between cognitive domains and emotional symptoms (depression and anxiety).\nMediation analysis was performed using structural equation modeling (SEM) to examine the mediating roles of depression and anxiety in the relationship between dementia diagnosis and suicidal ideation. To account for the complex sampling design with clustering and weighting, we implemented a two-step approach: (1) weighted covariance matrices were calculated using the survey package in R, incorporating sampling weights and cluster design; (2) the SEM model was fitted using these weighted covariance matrices with maximum likelihood estimation in lavaan. The mediation model simultaneously tested both depression and anxiety as mediators, controlling for demographic covariates (age, sex, ethnicity, education, marital status, and residence). Indirect effects, total effects, and proportion of mediation were calculated, with standard errors estimated using the delta method.\nNetwork analysis using a sparse Gaussian model was conducted to explore the relationship between suicide ideation and related factors and Spearman correlation coefficients were calculated. In the network analysis, nodes and edges represent the variables and conditional relationships between two variables. The width of the edges reflects the strength of the association, while the color and ring of the nodes mean the probability of event occurrence and predictability. All statistical analyses were conducted using weighted data to account for the complex survey design and performed by SAS (version 9.4, SAS Institute Inc., Cary, NC, USA) and R software (version 4.3.2, R Foundation for Statistical Computing, Vienna, Austria). All tests were two-tailed, with\np", "doc_items_refs": ["#/texts/143", "#/texts/144", "#/texts/145", "#/texts/146", "#/texts/147", "#/texts/148"], "page_nos": [], "uuid": "25526f31-f81e-4b9a-8fe0-51174105b2e3"}
{"doc_id": "2025__The_association_between_cognitive_domains_and_suicidal_ideation_in_patients_with__W4414930634", "source_path": "<redacted:source_path>", "chunk_id": 7, "source_chunk_idxs": [13], "num_tokens": 450, "text": "The association between cognitive domains and suicidal ideation in patients with mild dementia: the crucial role of judgement domain\nResult\nThe study included 4,289 individuals aged ≥ 65 years (mean age 71.8 ± 5.2 years), with 53.8% female participants. Among them, 7.9% (\nn\n= 339) were diagnosed with mild dementia (CDR = 0.5-1.0), and 2.8% (\nn\n= 120) reported suicidal ideation in the past month. Participants with suicidal ideation were younger (70.9 ± 3.8 vs. 71.9 ± 5.3 years,\np\np\n1\n).\nUnivariate analysis revealed significant differences in all cognitive domains between suicidal and non-suicidal groups (all\np\np\np\np\nIn multivariate logistic regression adjusting for sociodemographic factors (Table\n2\n), mild dementia was associated with a 3.37-fold increased odds of suicidal ideation (95% CI: 1.83-6.19,\np\np\np\nWhen examining cognitive domains (Table\n3\n), judgment impairment (OR = 3.44, 95% CI: 1.49-7.95,\np\n= 0.005) and memory impairment (OR = 1.74, 95% CI: 1.34-2.25,\np\np\np\n≥ 0.05).\nMediation analysis indicated that anxiety and depressive mood together partially mediated the relationship between dementia and suicidal ideation (total proportion mediated: 48.8%). Anxiety accounted for a larger portion of the mediation effect (34.2%) compared to depression (14.6%), indicating that emotional symptoms, particularly anxiety, explain nearly half of the association between dementia and suicidal ideation (Table\n4\n, Fig.\n1\n).\nFig. 1\nNetwork analysis further revealed that judgment impairment served as the central node connecting cognitive deficits to suicidal ideation in dementia patients (Fig.\n2\n). In the general population, suicidal ideation was associated with impairments in judgment, problem-solving, memory, and orientation domains. In contrast, among dementia patients, suicidal ideation was primarily associated with impairments in the judgment and problem-solving domain.\nFig. 2", "doc_items_refs": ["#/texts/151", "#/texts/152", "#/texts/153", "#/texts/154", "#/texts/155", "#/texts/156", "#/texts/158", "#/texts/160", "#/texts/161", "#/texts/162", "#/texts/163", "#/texts/165", "#/texts/167", "#/texts/169", "#/texts/171", "#/texts/172", "#/texts/173", "#/texts/174", "#/texts/176", "#/texts/178", "#/texts/180", "#/texts/181", "#/texts/182", "#/texts/183", "#/texts/184", "#/texts/185", "#/texts/187", "#/texts/189", "#/texts/190", "#/texts/191", "#/texts/192", "#/texts/193", "#/texts/194", "#/texts/195", "#/texts/196", "#/texts/197", "#/texts/198", "#/texts/199", "#/texts/200"], "page_nos": [], "uuid": "42038666-3e4e-450b-b5f5-e047473ee55e"}
{"doc_id": "2025__The_association_between_cognitive_domains_and_suicidal_ideation_in_patients_with__W4414930634", "source_path": "<redacted:source_path>", "chunk_id": 8, "source_chunk_idxs": [14, 15], "num_tokens": 328, "text": "The association between cognitive domains and suicidal ideation in patients with mild dementia: the crucial role of judgement domain\nResult\nIn non-dementia individuals, suicidal ideation was additionally linked to deficits in the community affairs domain, suggesting a broader cognitive vulnerability. Notably, anxiety and depressive mood, though not the most central node in the network, were pivotal connectors linking various cognitive impairments with suicidal ideation, with anxiety exhibiting the strongest association with suicidal ideation. Among dementia patients, impairment in the judgment and problem-solving domain was found to occupy a central role, correlating significantly with the level of impairment in other cognitive domains and demonstrating the highest predictability for suicidal ideation (Fig.\n2\n).\n\nThe association between cognitive domains and suicidal ideation in patients with mild dementia: the crucial role of judgement domain\nDiscussion\nThis study was conducted in Tongliao City, Inner Mongolia, a region characterized by its unique geographical and economic profile. Tongliao City is situated in a semi-arid climate zone, with vast grasslands and limited industrial development. The region faces challenges in terms of economic development, infrastructure, and access to specialized healthcare services. These characteristics contribute to its status as a resource-limited setting, where the delivery of comprehensive mental health care, particularly for conditions like dementia, is constrained. This study makes a significant contribution to the existing literature by specifically examining the association between cognitive domains and suicidal ideation in older adults with mild dementia in a resource-limited setting. Our findings highlight the crucial role of the judgment domain in suicidal ideation, providing new insights into targeted interventions that could be particularly effective in regions with limited healthcare resources.", "doc_items_refs": ["#/texts/201", "#/texts/202", "#/texts/203", "#/texts/205"], "page_nos": [], "uuid": "28f1f960-1ba0-4e42-8a60-cde6253132dc"}
{"doc_id": "2025__The_association_between_cognitive_domains_and_suicidal_ideation_in_patients_with__W4414930634", "source_path": "<redacted:source_path>", "chunk_id": 9, "source_chunk_idxs": [16], "num_tokens": 352, "text": "The association between cognitive domains and suicidal ideation in patients with mild dementia: the crucial role of judgement domain\nDiscussion\nOur findings demonstrate that mild dementia is associated with a 3.37-fold increased odds for suicidal ideation compared to non-dementia individuals, even after controlling for anxiety and depressive mood. Importantly, the study reveals that anxiety emerged as the factor most strongly associated with suicidal ideation (OR = 18.02), followed by depression (OR = 7.87), while among cognitive domains, impairment in judgment and problem-solving emerges as the most strongly associated cognitive factor (OR = 3.44), aligning with recent evidence from multiple populations. One study similarly identified dysfunctional cognitive control, executive function, and problem-solving as key risk factors for attempted suicide in older people [\n22\n]. Another study demonstrated that executive dysfunction is associated with approximately seven times higher odds of suicide ideation in older adults, independent of depression, particularly in those living in disadvantaged environments, a finding highly relevant to our resource-limited setting in Tongliao City [\n26\n]. While some studies emphasize different domains, research has found that depressed patients with recent suicide attempts showed poorer executive function performance compared to both lifetime attempters and non-attempters [\n13\n]. The consistency of judgment and executive function impairments across diverse populations strengthens our conclusion that these domains represent critical intervention targets. These converging findings suggest that judgment and executive functions serve as a 'cognitive buffer' against suicidal behavior [\n7\n]. When this buffer is compromised through dementia-related deterioration, individuals become more vulnerable to suicidal thoughts, particularly under conditions of interpersonal stress. This vulnerability is further amplified by factors such as awareness of cognitive decline and anticipated loss of autonomy [\n9\n].", "doc_items_refs": ["#/texts/206", "#/texts/207", "#/texts/208", "#/texts/209", "#/texts/210", "#/texts/211", "#/texts/212", "#/texts/213", "#/texts/214", "#/texts/215", "#/texts/216"], "page_nos": [], "uuid": "c5b796bd-a824-48bd-8b50-a18ccb0fc5f8"}
{"doc_id": "2025__The_association_between_cognitive_domains_and_suicidal_ideation_in_patients_with__W4414930634", "source_path": "<redacted:source_path>", "chunk_id": 10, "source_chunk_idxs": [17], "num_tokens": 257, "text": "The association between cognitive domains and suicidal ideation in patients with mild dementia: the crucial role of judgement domain\nDiscussion\nThe neurobiological basis of judgment impairment is further substantiated by evidence linking orbitofrontal cortex (OFC) degeneration to decision-making deficits [\n20\n]. The OFC maintains crucial connections with limbic structures including the amygdala and anterior cingulate cortex, forming circuits essential for emotional regulation and value-based decision-making [\n11\n]. In dementia, disruption of these OFC-limbic circuits compromises both cognitive control and emotional processing, particularly affecting the ventromedial prefrontal cortex's role in evaluating future consequences [\n30\n]. This neural degradation impairs the ability to anticipate the consequences of suicidal acts, thus lowering the threshold for ideation. In the cultural context of Tongliao City, traditional family values and social roles play a significant part in the psychological well-being of older adults. The region's strong emphasis on family decision-making and moral authority means that cognitive decline, particularly in judgment, can have profound psychological consequences. This cultural backdrop may exacerbate feelings of isolation and distress among older adults, contributing to an increased association with suicidal ideation.", "doc_items_refs": ["#/texts/217", "#/texts/218", "#/texts/219", "#/texts/220", "#/texts/221", "#/texts/222", "#/texts/223"], "page_nos": [], "uuid": "639ccfb2-6a65-43d9-a672-8fed63994f53"}
{"doc_id": "2025__The_association_between_cognitive_domains_and_suicidal_ideation_in_patients_with__W4414930634", "source_path": "<redacted:source_path>", "chunk_id": 11, "source_chunk_idxs": [18], "num_tokens": 481, "text": "The association between cognitive domains and suicidal ideation in patients with mild dementia: the crucial role of judgement domain\nDiscussion\nOur study reveals that cognitive factors, particularly judgment impairment, maintain independent associations with suicidal ideation even after controlling for anxiety and depression. Our mediation analysis reveals that anxiety and depressive mood together account for 48.8% of the relationship between dementia and suicidal ideation, with anxiety contributing more substantially (34.2%) than depression (14.6%). This finding challenges the traditional focus on depression as the primary emotional pathway and highlights anxiety as a potentially more critical factor in the dementia-suicide relationship. The prominence of anxiety in our findings aligns with emerging research suggesting that anxiety disorders are highly prevalent in dementia and may be more directly linked to cognitive awareness and anticipatory distress about functional decline. Unlike depression, which may develop as a reactive response to loss, anxiety in dementia often reflects the individual's preserved insight into their declining capabilities and uncertain future. This distinction has important implications for intervention strategies, as anxiety-focused interventions may need to address cognitive concerns and uncertainty management, while depression interventions may focus more on mood regulation and behavioral activation. The remaining 51.2% of the association suggests that other factors, particularly cognitive impairments including judgment deficits, play crucial roles in the dementia-suicide relationship. This suggests that while emotional symptom management is crucial, cognitive-focused interventions should be integrated with, rather than secondary to, emotional symptom management.\nFrom a public health perspective, integrating judgment domain evaluations into routine dementia care protocols is crucial. Regular screenings should be prioritized for patients, particularly in resource-limited settings like Tongliao City, where healthcare access may be limited. Additionally, family-centered training programs that include role-playing modules on collaborative decision-making can help alleviate the pressure placed on elderly individuals with dementia. These training programs should be designed to help families understand the importance of adjusting expectations and reframing elders' roles as \"consultants\" rather than primary decision-makers.\nGiven the strong associations of anxiety with suicidal ideation in our study, screening protocols should give equal, if not greater, attention to anxiety symptoms alongside traditional depression screening. Anxiety management interventions, including cognitive-behavioral therapy adapted for mild cognitive impairment, mindfulness-based stress reduction, and pharmacological approaches when appropriate, should be integrated into comprehensive care plans.", "doc_items_refs": ["#/texts/224", "#/texts/225", "#/texts/226"], "page_nos": [], "uuid": "2140985c-922d-416f-be38-889c775d7b30"}
{"doc_id": "2025__The_association_between_cognitive_domains_and_suicidal_ideation_in_patients_with__W4414930634", "source_path": "<redacted:source_path>", "chunk_id": 12, "source_chunk_idxs": [19], "num_tokens": 480, "text": "The association between cognitive domains and suicidal ideation in patients with mild dementia: the crucial role of judgement domain\nDiscussion\nCommunity health systems should also focus on training village health workers to identify signs of judgment decline and anxiety symptoms and establish clear referral pathways to connect affected patients with appropriate mental health services and support. Such community-based initiatives could be pivotal in reducing suicidal ideation in resource-limited settings like Tongliao City, where access to specialized care may be limited.\nWhile this study provides valuable insights, several limitations should be acknowledged and addressed in future research. The cross-sectional design precludes causal inferences, necessitating longitudinal studies that track the evolving relationship between cognitive decline and suicidal ideation over time, potentially using structural equation modeling. Our study did not comprehensively examine mediating factors; thus, future research should explore the roles of social support systems, family dynamics, quality of life, and psychological factors such as impulsivity and emotional dysregulation. Dimensional measures of depression severity, cognitive impairment, and suicidal intent are needed to examine dose-response relationships for more nuanced risk stratification. Given the distinct neuropathological features of different dementia subtypes, examining whether judgment impairment and suicidal ideation vary across these subtypes would be valuable. Additionally, qualitative interviews with patients and caregivers should complement quantitative approaches to reveal subjective experiences of cognitive decline and its impact on suicidal thoughts. Finally, developing and testing culturally tailored interventions, particularly those targeting judgment enhancement and emotional symptoms management, would be crucial in resource-limited settings like Tongliao City and other diverse cultural contexts.\nIn conclusion, this study establishes that judgment domain impairment plays a crucial and independent role in suicidal ideation among mild dementia patients. While emotional symptoms, particularly anxiety, show the strongest overall associations and mediate nearly half (48.8%) of the dementia-suicide relationship, cognitive factors-especially judgment impairment-account for the remaining association. These findings have important implications for clinical practice and public health policy, particularly in rapidly aging societies like China. Interventions targeting both cognitive function and emotional symptom management are urgently needed to address factors associated with suicide ideation among older adults with dementia. Further research should focus on developing and validating interventions specifically targeting judgment enhancement and anxiety management, while considering the cultural context of caregiving and dementia in resource-limited settings of China.", "doc_items_refs": ["#/texts/227", "#/texts/228", "#/texts/229"], "page_nos": [], "uuid": "ada0982b-21a7-494c-a42d-d8bd23d176f8"}
{"doc_id": "2025__The_association_between_cognitive_domains_and_suicidal_ideation_in_patients_with__W4414930634", "source_path": "<redacted:source_path>", "chunk_id": 13, "source_chunk_idxs": [20], "num_tokens": 42, "text": "The association between cognitive domains and suicidal ideation in patients with mild dementia: the crucial role of judgement domain\nData availability\nThe datasets used during the current study are available from the corresponding author on reasonable request.", "doc_items_refs": ["#/texts/231"], "page_nos": [], "uuid": "2fb25341-5380-4a04-be2e-b2ec14d132cc"}
{"doc_id": "2025__The_association_between_cognitive_domains_and_suicidal_ideation_in_patients_with__W4414930634", "source_path": "<redacted:source_path>", "chunk_id": 14, "source_chunk_idxs": [21], "num_tokens": 497, "text": "The association between cognitive domains and suicidal ideation in patients with mild dementia: the crucial role of judgement domain\nReferences\n1. Albanese E, Lombardo FL, Prince MJ, Stewart R. Dementia and lower blood pressure in Latin America, India, and China: a 10/66 cross-cohort study. Neurology. 2013;81:228-35.\nhttps://doi.org/10.1212/WNL.0b013e31829bfe66\n.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n2. Albanese E, Taylor C, Siervo M, Stewart R, Prince MJ, Acosta D. Dementia severity and weight loss: a comparison across eight cohorts. The 10/66 study. Alzheimers Dement. 2013;9:649-56.\nhttps://doi.org/10.1016/j.jalz.2012.11.014\n.\nArticle\nPubMed\nGoogle Scholar\n3. Barnow S, Linden M. Epidemiology and psychiatric morbidity of suicidal ideation among the elderly. Crisis. 2000;21:171-80.\nArticle\nCAS\nPubMed\nGoogle Scholar\n4. Beeri MS, Tirosh A, Lin H-M, Golan S, Boccara E, Sano M, et al. Stability in BMI over time is associated with a better cognitive trajectory in older adults. Alzheimers Dement. 2022;18:2131-9.\nhttps://doi.org/10.1002/alz.12525\n.\nArticle\nCAS\nPubMed\nGoogle Scholar\n5. Bohnen NI, Müller MLTM, Zarzhevsky N, Koeppe RA, Bogan CW, Kilbourn MR, et al. Leucoaraiosis, nigrostriatal denervation and motor symptoms in Parkinson's disease. Brain. 2011;134:2358-65.\nhttps://doi.org/10.1093/brain/awr139\n.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n6. Borges G, Acosta I, Sosa AL. Suicide ideation, dementia and mental disorders among a community sample of older people in Mexico. Int J Geriatr Psychiatry. 2015;30:247-55.\nhttps://doi.org/10.1002/gps.4134\n.\nArticle\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/233", "#/texts/234", "#/texts/235", "#/texts/236", "#/texts/237", "#/texts/238"], "page_nos": [], "uuid": "48bd7808-30b6-4b85-8292-fde2a829755e"}
{"doc_id": "2025__The_association_between_cognitive_domains_and_suicidal_ideation_in_patients_with__W4414930634", "source_path": "<redacted:source_path>", "chunk_id": 15, "source_chunk_idxs": [22], "num_tokens": 503, "text": "The association between cognitive domains and suicidal ideation in patients with mild dementia: the crucial role of judgement domain\nReferences\n7. Burke TA, Connolly SL, Hamilton JL, Stange JP, Abramson LY, Alloy LB. Cognitive risk and protective factors for suicidal ideation: a two year longitudinal study in adolescence. J Abnorm Child Psychol. 2016;44:1145-60.\nhttps://doi.org/10.1007/s10802-015-0104-x\n.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n8. Choi JW, Lee KS, Han E. Suicide risk within 1 year of dementia diagnosis in older adults: a nationwide retrospective cohort study. J Psychiatry Neurosci. 2021;46:E119-27.\nhttps://doi.org/10.1503/jpn.190219\n.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n9. Conejero I, Navucet S, Keller J, Olié E, Courtet P, Gabelle A. A complex relationship between suicide, dementia, and amyloid: a narrative review. Front Neurosci. 2018;12:371.\nhttps://doi.org/10.3389/fnins.2018.00371\n.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n10. Copeland JR, Dewey ME, Henderson AS, Kay DW, Neal CD, Harrison MA, et al. The geriatric mental state (GMS) used in the community: replication studies of the computerized diagnosis AGECAT. Psychol Med. 1988;18:219-23.\nArticle\nCAS\nPubMed\nGoogle Scholar\n11. Dixon ML, Thiruchselvam R, Todd R, Christoff K. Emotion and the prefrontal cortex: an integrative review. Psychol Bull. 2017;143:1033-81.\nhttps://doi.org/10.1037/bul0000096\n.\nArticle\nPubMed\nGoogle Scholar\n12. Erlangsen A, Zarit SH, Conwell Y. Hospital-diagnosed dementia and suicide: a longitudinal study using prospective, nationwide register data. Am J Geriatr Psychiatry. 2008;16:220-8.\nhttps://doi.org/10.1097/JGP.0b013e3181602a12\n.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/239", "#/texts/240", "#/texts/241", "#/texts/242", "#/texts/243", "#/texts/244"], "page_nos": [], "uuid": "2c9ba04d-cd6b-4ee2-874c-5011ac1ff9d4"}
{"doc_id": "2025__The_association_between_cognitive_domains_and_suicidal_ideation_in_patients_with__W4414930634", "source_path": "<redacted:source_path>", "chunk_id": 16, "source_chunk_idxs": [23], "num_tokens": 499, "text": "The association between cognitive domains and suicidal ideation in patients with mild dementia: the crucial role of judgement domain\nReferences\n13. Fernández-Sevillano J, Alberich S, Zorrilla I, González-Ortega I, López MP, Pérez V, et al. Cognition in recent suicide attempts: altered executive function. Front Psychiatry. 2021;12:701140.\nhttps://doi.org/10.3389/fpsyt.2021.701140\n.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n14. Günak MM, Barnes DE, Yaffe K, Li Y, Byers AL. Risk of suicide attempt in patients with recent diagnosis of mild cognitive impairment or dementia. JAMA Psychiatr. 2021;78:659-66.\nhttps://doi.org/10.1001/jamapsychiatry.2021.0150\n.\nArticle\nGoogle Scholar\n15. Hajjar I, Yang Z, Okafor M, Liu C, Waligorska T, Goldstein FC, et al. Association of plasma and cerebrospinal fluid Alzheimer disease biomarkers with race and the role of genetic ancestry, vascular comorbidities, and neighborhood factors. JAMA Netw Open. 2022;5:e2235068.\nhttps://doi.org/10.1001/jamanetworkopen.2022.35068\n.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n16. Hakim A. Perspectives on the complex links between depression and dementia. Front Aging Neurosci. 2022;14:821866.\nhttps://doi.org/10.3389/fnagi.2022.821866\n.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n17. Huang Y, Wang Y, Wang H, Liu Z, Yu X, Yan J, et al. Prevalence of mental disorders in China: a cross-sectional epidemiological study. Lancet Psychiatry. 2019;6:211-24.\nhttps://doi.org/10.1016/S2215-0366(18)30511-X\n.\nArticle\nPubMed\nGoogle Scholar\n18. Hughes CP, Berg L, Danziger WL, Coben LA, Martin RL. A new clinical scale for the staging of dementia. Br J Psychiatry. 1982;140:566-72.\nArticle\nCAS\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/245", "#/texts/246", "#/texts/247", "#/texts/248", "#/texts/249", "#/texts/250"], "page_nos": [], "uuid": "3225b632-4567-47ed-b4b6-9e0893e67a55"}
{"doc_id": "2025__The_association_between_cognitive_domains_and_suicidal_ideation_in_patients_with__W4414930634", "source_path": "<redacted:source_path>", "chunk_id": 17, "source_chunk_idxs": [24], "num_tokens": 423, "text": "The association between cognitive domains and suicidal ideation in patients with mild dementia: the crucial role of judgement domain\nReferences\n19. Jia L, Quan M, Fu Y, Zhao T, Li Y, Wei C, et al. Dementia in China: epidemiology, clinical management, and research advances. Lancet Neurol. 2020;19:81-92.\nhttps://doi.org/10.1016/S1474-4422(19)30290-X\n.\nArticle\nPubMed\nGoogle Scholar\n20. Jollant F, Guillaume S, Jaussent I, Castelnau D, Malafosse A, Courtet P. Impaired decision-making in suicide attempters may increase the risk of problems in affective relationships. J Affect Disord. 2007;99:59-62.\nArticle\nPubMed\nGoogle Scholar\n21. Kim J-M, Stewart R, Kim S-Y, Kim S-W, Bae K-Y, Yang S-J, et al. Synergistic associations of depression and apolipoprotein E genotype with incidence of dementia. Int J Geriatr Psychiatry. 2011;26:893-8.\nhttps://doi.org/10.1002/gps.2621\n.\nArticle\nPubMed\nGoogle Scholar\n22. Kułak-Bejda A, Bejda G, Waszkiewicz N. Mental disorders, cognitive impairment and the risk of suicide in older adults. Front Psychiatry. 2021;12:695286.\nhttps://doi.org/10.3389/fpsyt.2021.695286\n.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n23. Kulich S, Zhang R. The multiple frames of 'Chinese' values: From tradition to modernity and beyond. M.H. Bond (ed), The Oxford Handbook of Chinese Psychology. 2012:241-278.\nhttps://doi.org/10.1093/oxfordhb/9780199541850.013.0017\n.", "doc_items_refs": ["#/texts/251", "#/texts/252", "#/texts/253", "#/texts/254", "#/texts/255"], "page_nos": [], "uuid": "df9d7440-f284-46cc-8cce-b812ab27526b"}
{"doc_id": "2025__The_association_between_cognitive_domains_and_suicidal_ideation_in_patients_with__W4414930634", "source_path": "<redacted:source_path>", "chunk_id": 18, "source_chunk_idxs": [25], "num_tokens": 485, "text": "The association between cognitive domains and suicidal ideation in patients with mild dementia: the crucial role of judgement domain\nReferences\n24. Mo M, Xu H, Hoang MT, Jurado PG, Mostafaei S, Kåreholt I, et al. External causes of death from death certificates in patients with dementia. J Am Med Dir Assoc. 2023;24:1381-8.\nhttps://doi.org/10.1016/j.jamda.2023.05.027\n.\nArticle\nPubMed\nGoogle Scholar\n25. Naismith H, Howard R, Stewart R, Pitman A, Mueller C. Suicidal ideation in dementia: associations with neuropsychiatric symptoms and subtype diagnosis. Int Psychogeriatr. 2022:1-8.\nhttps://doi.org/10.1017/S1041610222000126\n.\n26. Oh DJ, Han JW, Bae JB, Kim TH, Kwak KP, Kim BJ, et al. Executive dysfunction and risk of suicide in older adults: a population-based prospective cohort study. J Neurol Neurosurg Psychiatry. 2021;92:528-33.\nhttps://doi.org/10.1136/jnnp-2020-324390\n.\nArticle\nPubMed\nGoogle Scholar\n27. Prina AM, Ferri CP, Guerra M, Brayne C, Prince M. Co-occurrence of anxiety and depression amongst older adults in low- and middle-income countries: findings from the 10/66 study. Psychol Med. 2011;41:2047-56.\nhttps://doi.org/10.1017/S0033291711000444\n.\nArticle\nCAS\nPubMed\nGoogle Scholar\n28. Prince MJ, de Rodriguez JL, Noriega L, Lopez A, Acosta D, Albanese E, et al. The 10/66 Dementia Research Group's fully operationalised DSM-IV dementia computerized diagnostic algorithm, compared with the 10/66 dementia algorithm and a clinician diagnosis: a population validation study. BMC Public Health. 2008;8:219.\nhttps://doi.org/10.1186/1471-2458-8-219\n.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/256", "#/texts/257", "#/texts/258", "#/texts/259", "#/texts/260"], "page_nos": [], "uuid": "1e95306e-d09e-4a0e-bf9a-332d3f2737fa"}
{"doc_id": "2025__The_association_between_cognitive_domains_and_suicidal_ideation_in_patients_with__W4414930634", "source_path": "<redacted:source_path>", "chunk_id": 19, "source_chunk_idxs": [26], "num_tokens": 375, "text": "The association between cognitive domains and suicidal ideation in patients with mild dementia: the crucial role of judgement domain\nReferences\n29. Richard-Devantoy S, Szanto K, Butters MA, Kalkus J, Dombrovski AY. Cognitive inhibition in older high-lethality suicide attempters. Int J Geriatr Psychiatry. 2015;30:274-83.\nhttps://doi.org/10.1002/gps.4138\n.\nArticle\nPubMed\nGoogle Scholar\n30. Schmaal L, van Harmelen A-L, Chatzi V, Lippard ETC, Toenders YJ, Averill LA, et al. Imaging suicidal thoughts and behaviors: a comprehensive review of 2 decades of neuroimaging studies. Mol Psychiatry. 2020;25:408-27.\nhttps://doi.org/10.1038/s41380-019-0587-x\n.\nArticle\nPubMed\nGoogle Scholar\n31. Wu Y, Su B, Zhong P, Wang Y, Huang Y, Zheng X. The long-term changing patterns of suicide mortality in China from 1987 to 2020: continuing urban-rural disparity. BMC Public Health. 2024;24:1269.\nhttps://doi.org/10.1186/s12889-024-18743-z\n.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n32. Zhang J, Lyu J, Sun W, Wang L. Changes and explanations of suicide rates in China by province and gender over the past three decades. J Affect Disord. 2022;299:470-4.\nhttps://doi.org/10.1016/j.jad.2021.12.053\n.\nArticle\nPubMed\nGoogle Scholar\nDownload references", "doc_items_refs": ["#/texts/261", "#/texts/262", "#/texts/263", "#/texts/264", "#/texts/265"], "page_nos": [], "uuid": "69952b33-7fe5-4ce8-953f-9c7dd9c18311"}
{"doc_id": "2025__The_association_between_cognitive_domains_and_suicidal_ideation_in_patients_with__W4414930634", "source_path": "<redacted:source_path>", "chunk_id": 20, "source_chunk_idxs": [27, 28, 29, 30], "num_tokens": 170, "text": "The association between cognitive domains and suicidal ideation in patients with mild dementia: the crucial role of judgement domain\nAcknowledgements\nThank you to the staff of the Tongliao Third People's Hospital and interviewers in Tongliao for performing the epidemiological investigation.\n\nThe association between cognitive domains and suicidal ideation in patients with mild dementia: the crucial role of judgement domain\nAcknowledgements\nClinical trial number\nNot applicable.\n\nThe association between cognitive domains and suicidal ideation in patients with mild dementia: the crucial role of judgement domain\nFunding\nThis work was supported by the Science and Technology Program of Inner Mongolia Autonomous Region (2022YFSH0036).\n\nThe association between cognitive domains and suicidal ideation in patients with mild dementia: the crucial role of judgement domain\nAuthor information\nAuthor notes\n1. Xiaoyi Tian and Hongjun Sun contributed equally to this work.", "doc_items_refs": ["#/texts/267", "#/texts/269", "#/texts/271", "#/texts/273", "#/texts/274"], "page_nos": [], "uuid": "b5224e7e-6aae-492d-b417-bdb5611f8541"}
{"doc_id": "2025__The_association_between_cognitive_domains_and_suicidal_ideation_in_patients_with__W4414930634", "source_path": "<redacted:source_path>", "chunk_id": 21, "source_chunk_idxs": [31], "num_tokens": 357, "text": "The association between cognitive domains and suicidal ideation in patients with mild dementia: the crucial role of judgement domain\nAuthor information\nAuthors and Affiliations\n1. Peking University Sixth Hospital, Peking University Institute of Mental Health, NHC Key Laboratory of Mental Health (Peking University), National Clinical Research Center for Mental Disorders (Peking University Sixth Hospital), 51 Huayuan North Road, Haidian District, Beijing, 100083, China Xiaoyi Tian, Tingting Zhang, Yuanyuna Li, Peilin Xu, Yueqin Huang &amp; Zhaorui Liu\n2. Tongliao Third People's Hospital, No.771, East Huolinhe Street, Keerqin District, Tongliao, 028000, Inner Mongolia Autonomous Region, China Hongjun Sun, Bo Zhang, Ying Cui, Wujisiguleng &amp; Hongmei Yu\nAuthors\n1. Xiaoyi Tian\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n2. Hongjun Sun\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n3. Tingting Zhang\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n4. Bo Zhang\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n5. Yuanyuna Li\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n6. Ying Cui\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n7. Peilin Xu\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n8. Wujisiguleng\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n9. Hongmei Yu\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n10. Yueqin Huang\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n11. Zhaorui Liu\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/276", "#/texts/277", "#/texts/278", "#/texts/279", "#/texts/280", "#/texts/281", "#/texts/282", "#/texts/283", "#/texts/284", "#/texts/285", "#/texts/286", "#/texts/287", "#/texts/288", "#/texts/289"], "page_nos": [], "uuid": "41130843-cb07-4b1a-b8d7-a5b61dfc6003"}
{"doc_id": "2025__The_association_between_cognitive_domains_and_suicidal_ideation_in_patients_with__W4414930634", "source_path": "<redacted:source_path>", "chunk_id": 22, "source_chunk_idxs": [32, 33, 34], "num_tokens": 277, "text": "The association between cognitive domains and suicidal ideation in patients with mild dementia: the crucial role of judgement domain\nAuthor information\nContributions\nXiaoyi Tian conducted the analysis and wrote the first draft under the supervision of Yueqin Huang and Zhaorui Liu. All authors reviewed the manuscript and provided further contributions and suggestions. All authors approved the final version of the manuscript. Yueqin Huang, Zhaorui Liu, Hongmei Yu, Hongjun Sun, Tingting Zhang, Yuanyuna Li and Ying Cui contributed to the study design, implementation of fieldwork, and quality control of the collected data. Bo Zhang, Xiaoyi Tian, Yuanyuna Li, Ying Cui, Peilin Xu and Wujisiguleng contributed to data collection in the fieldwork.\n\nThe association between cognitive domains and suicidal ideation in patients with mild dementia: the crucial role of judgement domain\nAuthor information\nCorresponding authors\nCorrespondence to\nHongmei Yu\n,\nYueqin Huang\nor\nZhaorui Liu\n.\n\nThe association between cognitive domains and suicidal ideation in patients with mild dementia: the crucial role of judgement domain\nEthics declarations\nEthics approval and consent to participate\nThe study was conducted in accordance with the Declaration of Helsinki. Ethical approval was obtained from the Ethics committee of Tongliao Third People's Hospital (Reference No.20220325001). Informed consent was obtained from all subjects or their legal guardians.", "doc_items_refs": ["#/texts/291", "#/texts/293", "#/texts/294", "#/texts/295", "#/texts/296", "#/texts/297", "#/texts/298", "#/texts/299", "#/texts/302"], "page_nos": [], "uuid": "25028c4b-4e4e-4ee6-ae6a-335e2af18e10"}
{"doc_id": "2025__The_association_between_cognitive_domains_and_suicidal_ideation_in_patients_with__W4414930634", "source_path": "<redacted:source_path>", "chunk_id": 23, "source_chunk_idxs": [35, 36, 37, 38], "num_tokens": 349, "text": "The association between cognitive domains and suicidal ideation in patients with mild dementia: the crucial role of judgement domain\nEthics declarations\nConsent for publication\nNot applicable.\n\nThe association between cognitive domains and suicidal ideation in patients with mild dementia: the crucial role of judgement domain\nEthics declarations\nCompeting interests\nThe authors declare no competing interests.\n\nThe association between cognitive domains and suicidal ideation in patients with mild dementia: the crucial role of judgement domain\nAdditional information\nPublisher's Note\nSpringer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations.\n\nThe association between cognitive domains and suicidal ideation in patients with mild dementia: the crucial role of judgement domain\nRights and permissions\nOpen Access\nThis article is licensed under a Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International License, which permits any non-commercial use, sharing, distribution and reproduction in any medium or format, as long as you give appropriate credit to the original author(s) and the source, provide a link to the Creative Commons licence, and indicate if you modified the licensed material. You do not have permission under this licence to share adapted material derived from this article or parts of it. The images or other third party material in this article are included in the article's Creative Commons licence, unless indicated otherwise in a credit line to the material. If material is not included in the article's Creative Commons licence and your intended use is not permitted by statutory regulation or exceeds the permitted use, you will need to obtain permission directly from the copyright holder. To view a copy of this licence, visit\nhttp://creativecommons.org/licenses/by-nc-nd/4.0/\n.\nReprints and permissions", "doc_items_refs": ["#/texts/304", "#/texts/306", "#/texts/309", "#/texts/313", "#/texts/314", "#/texts/315", "#/texts/316", "#/texts/317"], "page_nos": [], "uuid": "47180351-f0d6-4f87-98c1-b87dff063b8d"}
{"doc_id": "2025__The_association_between_cognitive_domains_and_suicidal_ideation_in_patients_with__W4414930634", "source_path": "<redacted:source_path>", "chunk_id": 24, "source_chunk_idxs": [39, 40, 41, 42], "num_tokens": 282, "text": "The association between cognitive domains and suicidal ideation in patients with mild dementia: the crucial role of judgement domain\nAbout this article\nCite this article\nTian, X., Sun, H., Zhang, T.\net al.\nThe association between cognitive domains and suicidal ideation in patients with mild dementia: the crucial role of judgement domain.\nBMC Geriatr\n25\n, 763 (2025). https://doi.org/10.1186/s12877-025-06391-w\nDownload citation\n- Received : 31 January 2025\n- Accepted : 19 August 2025\n- Published : 08 October 2025\n- DOI : https://doi.org/10.1186/s12877-025-06391-w\n\nThe association between cognitive domains and suicidal ideation in patients with mild dementia: the crucial role of judgement domain\nAbout this article\nKeywords\n- Dementia\n- Suicidal ideation\n- Cognitive domains\n- Depression\nDownload PDF\nAdvertisement\n\nThe association between cognitive domains and suicidal ideation in patients with mild dementia: the crucial role of judgement domain\nAbout this article\nKeywords\nBMC Geriatrics\nISSN: 1471-2318\n\nThe association between cognitive domains and suicidal ideation in patients with mild dementia: the crucial role of judgement domain\nAbout this article\nKeywords\nContact us\n- General enquiries:\njournalsubmissions@springernature.com", "doc_items_refs": ["#/texts/320", "#/texts/321", "#/texts/322", "#/texts/323", "#/texts/324", "#/texts/325", "#/texts/326", "#/texts/327", "#/texts/328", "#/texts/329", "#/texts/330", "#/texts/332", "#/texts/333", "#/texts/334", "#/texts/335", "#/texts/336", "#/texts/337", "#/texts/339", "#/texts/341"], "page_nos": [], "uuid": "69e906c7-e689-4e12-989b-6f1640e67b86"}
