{"doc_id": "2025__Acupuncture_for_patients_with_mild_cognitive_impairment_a_randomized_patientasse__W4412521969", "source_path": "<redacted:source_path>", "chunk_id": 0, "source_chunk_idxs": [0, 1], "num_tokens": 440, "text": "Acupuncture for patients with mild cognitive impairment: a randomized, patient-assessor-blinded, sham-controlled pilot study | BMC Complementary Medicine and Therapies | Full Text\nSkip to main content\nAdvertisement\nSearch\n- Explore journals\n- Get published\n- About BMC\n- My account\nSearch all BMC articles\nSearch\nBMC Complementary Medicine and Therapies\n- Home\n- About\n- Articles\n- Submission Guidelines\n- Collections\n- Join the Board\n- Submit manuscript\nAcupuncture for patients with mild cognitive impairment: a randomized, patient-assessor-blinded, sham-controlled pilot study\nDownload PDF\nDownload PDF\n- Research\n- Open access\n- Published: 19 July 2025\n\nAcupuncture for patients with mild cognitive impairment: a randomized, patient-assessor-blinded, sham-controlled pilot study\n- Yujin Choi\nORCID: orcid.org/0000-0001-5257-2340\n1\n,\n- Pyung-Wha Kim\nORCID: orcid.org/0000-0002-8356-8392\n1\n,\n- In-Chul Jung\nORCID: orcid.org/0000-0001-7245-4990\n3\n,\n- Ae-Ran Kim\nORCID: orcid.org/0000-0003-3600-0806\n2\n,\n- Hyo-Ju Park\nORCID: orcid.org/0000-0003-1513-5701\n2\n,\n- Ojin Kwon\nORCID: orcid.org/0000-0002-7349-4596\n1\n,\n- Jun-Hwan Lee\nORCID: orcid.org/0000-0001-5730-6869\n1\n&amp;\n- ...\n- Joo-Hee Kim\nORCID: orcid.org/0000-0003-1435-5649\n4\n,\n5\nShow authors\nBMC Complementary Medicine and Therapies\nvolume 25\n, Article number: 277 ( 2025 )\nCite this article\n- 959 Accesses\n- 1 Citations\n- 22 Altmetric\n- Metrics details", "doc_items_refs": ["#/texts/1", "#/texts/2", "#/texts/3", "#/texts/4", "#/texts/5", "#/texts/6", "#/texts/7", "#/texts/8", "#/texts/9", "#/texts/10", "#/texts/11", "#/texts/12", "#/texts/13", "#/texts/14", "#/texts/15", "#/texts/16", "#/texts/17", "#/texts/18", "#/texts/19", "#/texts/20", "#/texts/21", "#/texts/22", "#/texts/23", "#/texts/25", "#/texts/26", "#/texts/27", "#/texts/28", "#/texts/29", "#/texts/30", "#/texts/31", "#/texts/32", "#/texts/33", "#/texts/34", "#/texts/35", "#/texts/36", "#/texts/37", "#/texts/38", "#/texts/39", "#/texts/40", "#/texts/41", "#/texts/42"], "page_nos": [], "uuid": "00888e13-fbdc-43c1-8d57-b82b429f9a6b"}
{"doc_id": "2025__Acupuncture_for_patients_with_mild_cognitive_impairment_a_randomized_patientasse__W4412521969", "source_path": "<redacted:source_path>", "chunk_id": 1, "source_chunk_idxs": [2, 3, 4], "num_tokens": 415, "text": "Acupuncture for patients with mild cognitive impairment: a randomized, patient-assessor-blinded, sham-controlled pilot study\nAbstract\nBackground\nMild cognitive impairment (MCI) is the transitional stage between normal aging and early dementia. Although acupuncture is a promising non-pharmacological treatment, higher-quality evidence is needed to confirm its effectiveness.\n\nAcupuncture for patients with mild cognitive impairment: a randomized, patient-assessor-blinded, sham-controlled pilot study\nAbstract\nMethods\nA randomized, patient- and assessor-blinded, sham-controlled, pilot clinical trial was conducted to evaluate the feasibility of acupuncture for treating MCI. In total, 30 participants were randomized into acupuncture and sham acupuncture groups. The participants underwent 24 treatment sessions over 12 weeks. The primary outcome was a change in the Alzheimer's Disease Assessment Scale-Cognitive Subscale (ADAS-cog) score over 12 weeks, whereas the secondary outcomes included the Seoul Neuropsychological Screening Battery (SNSB-II) score. Adverse events and the success of blinding were also assessed.\n\nAcupuncture for patients with mild cognitive impairment: a randomized, patient-assessor-blinded, sham-controlled pilot study\nAbstract\nResults\nOf the 30 participants, 28 completed the study. Participants in the acupuncture and sham acupuncture groups exhibited a decrease in ADAS-cog scores from 10.27 ± 4.03 and 11.47 ± 3.85 at baseline to 5.78 ± 3.04 and 6.27 ± 2.83 at week 12, respectively. Both groups exhibited clinically meaningful improvements, with no significant difference between groups (\nP\n= 0.6590). The SNSB-II memory domain exhibited a moderate effect size favoring acupuncture (Cohen's d = 0.57,\nP\n= 0.1317). No intervention-related adverse events were reported, and participant blinding was adequate throughout the trial.", "doc_items_refs": ["#/texts/45", "#/texts/47", "#/texts/49", "#/texts/50", "#/texts/51", "#/texts/52", "#/texts/53"], "page_nos": [], "uuid": "c2e2f659-524f-4181-aea5-4b2f97aec0b7"}
{"doc_id": "2025__Acupuncture_for_patients_with_mild_cognitive_impairment_a_randomized_patientasse__W4412521969", "source_path": "<redacted:source_path>", "chunk_id": 2, "source_chunk_idxs": [5, 6], "num_tokens": 153, "text": "Acupuncture for patients with mild cognitive impairment: a randomized, patient-assessor-blinded, sham-controlled pilot study\nAbstract\nConclusions\nThe 12-week acupuncture treatment is feasible for patients with MCI and may improve memory. Although the primary outcomes did not reach statistical significance, the secondary outcomes suggested potential benefits. Larger confirmatory trials are warranted to investigate the effectiveness of acupuncture in patients with MCI.\n\nAcupuncture for patients with mild cognitive impairment: a randomized, patient-assessor-blinded, sham-controlled pilot study\nAbstract\nTrial registration\nClinical Research Information Service (cris.nih.go.kr) KCT0001938 (Registered on June 3, 2016).\nPeer Review reports", "doc_items_refs": ["#/texts/55", "#/texts/57", "#/texts/58"], "page_nos": [], "uuid": "f4b3313a-130b-487f-a39a-e0261cd5cf5b"}
{"doc_id": "2025__Acupuncture_for_patients_with_mild_cognitive_impairment_a_randomized_patientasse__W4412521969", "source_path": "<redacted:source_path>", "chunk_id": 3, "source_chunk_idxs": [7], "num_tokens": 432, "text": "Acupuncture for patients with mild cognitive impairment: a randomized, patient-assessor-blinded, sham-controlled pilot study\nBackground\nMild cognitive impairment (MCI), a transitional state between normal cognition associated with aging and early dementia, is characterized by memory loss to the extent higher than that is considered normal with aging but with relatively intact function in other cognitive domains [\n1\n,\n2\n]. Approximately 10-15% of patients with amnestic MCI progress to annually, with more than half experiencing AD within 5 years [\n3\n,\n4\n]. Previous epidemiological studies have reported 3-19% MCI prevalence in older adults aged &gt; 65 years [\n4\n]. Notably, the prevalence of dementia increases exponentially with age, doubling every 5 years after 65 years of age [\n5\n]. Detecting and managing MCI in its early stages is crucial, as MCI is a high-risk factor for developing dementia, and most individuals who visit clinics for memory disorders likely already have dementia [\n3\n].\nAcupuncture is a promising non-pharmacological treatment for cognitive impairment [\n6\n]. Acupuncture induces changes in brain areas such as the cingulate cortex, prefrontal cortex, and hippocampus in patients with MCI [\n7\n]. An overview of systematic reviews published in 2021 suggested that acupuncture may be effective for MCI and dementia [\n8\n]. A systematic review published in 2023 reported that, compared with conventional medicine or sham acupuncture, acupuncture better improved overall cognitive function in patients with MCI [\n9\n]. Recent meta-analyses have further reported the efficacy and safety of acupuncture for cognitive impairment [\n10\n] and its modulatory effects on brain regions associated with memory and cognition [\n11\n]. However, this systematic review also reported a high risk of bias in many included studies and highlighted the requirement for high-quality evidence. Additionally, a study evaluating the reporting quality of clinical trials on acupuncture for MCI revealed low to moderate quality of published reports, indicating room for improvement [\n12\n].", "doc_items_refs": ["#/texts/60", "#/texts/61", "#/texts/62", "#/texts/63", "#/texts/64", "#/texts/65", "#/texts/66", "#/texts/67", "#/texts/68", "#/texts/69", "#/texts/70", "#/texts/71", "#/texts/72", "#/texts/73", "#/texts/74", "#/texts/75", "#/texts/76", "#/texts/77", "#/texts/78", "#/texts/79", "#/texts/80", "#/texts/81", "#/texts/82", "#/texts/83", "#/texts/84", "#/texts/85", "#/texts/86", "#/texts/87", "#/texts/88", "#/texts/89"], "page_nos": [], "uuid": "553ebd18-4395-4539-81e5-3c9171443f76"}
{"doc_id": "2025__Acupuncture_for_patients_with_mild_cognitive_impairment_a_randomized_patientasse__W4412521969", "source_path": "<redacted:source_path>", "chunk_id": 4, "source_chunk_idxs": [8, 9], "num_tokens": 356, "text": "Acupuncture for patients with mild cognitive impairment: a randomized, patient-assessor-blinded, sham-controlled pilot study\nBackground\nAlthough acupuncture exhibits potential as a treatment for MCI, the existing evidence remains insufficient because of the high risk of bias and low reporting quality of previous studies. Before conducting large-scale confirmatory trials, pilot studies are essential to establish feasibility including recruitment processes, intervention implementation, and data collection procedures. Therefore, this pilot study aimed to investigate the feasibility of a rigorously designed acupuncture trial for MCI, with secondary exploration of preliminary effectiveness and safety to provide data for future confirmatory research.\n\nAcupuncture for patients with mild cognitive impairment: a randomized, patient-assessor-blinded, sham-controlled pilot study\nMethods\nStudy protocol\nThe study protocol was approved by the Institutional Review Board of the Daejeon Korean Medicine Hospital of Daejeon University (approval number: djomc-131-1). All participants provided written informed consent before screening. The trial was registered with the Clinical Research Information Service under registration number KCT0001938 on June 3, 2016 (\nhttps://cris.nih.go.kr/cris/search/detailSearch.do?seq=5900\n). The study protocol was registered after the first participant was enrolled, and no changes were made to the research plan during the study period. The results of this clinical trial are reported in accordance with the CONSORT guidelines for randomized controlled trials [\n13\n], STRICTA checklist for acupuncture trials [\n14\n], and ACURATE checklist for sham acupuncture trials [\n15\n]. Additional files - Supplementary materials\n1\n,\n2\n, and\n3\n.", "doc_items_refs": ["#/texts/90", "#/texts/93", "#/texts/94", "#/texts/95", "#/texts/96", "#/texts/97", "#/texts/98", "#/texts/99", "#/texts/100", "#/texts/101", "#/texts/102", "#/texts/103", "#/texts/104", "#/texts/105", "#/texts/106", "#/texts/107"], "page_nos": [], "uuid": "cb8bd513-2671-402d-b916-d636c5b7aca1"}
{"doc_id": "2025__Acupuncture_for_patients_with_mild_cognitive_impairment_a_randomized_patientasse__W4412521969", "source_path": "<redacted:source_path>", "chunk_id": 5, "source_chunk_idxs": [10, 11, 12], "num_tokens": 503, "text": "Acupuncture for patients with mild cognitive impairment: a randomized, patient-assessor-blinded, sham-controlled pilot study\nMethods\nStudy design\nThis was a randomized, patient- and assessor-blinded, sham-controlled, pilot clinical trial with two parallel groups-an acupuncture group and a sham acupuncture group-with an allocation ratio of 1:1. The trial was conducted at two Korean medicine university hospitals in Daejeon, Republic of Korea.\n\nAcupuncture for patients with mild cognitive impairment: a randomized, patient-assessor-blinded, sham-controlled pilot study\nMethods\nParticipants\nInclusion criteria\nPatients with MCI aged ≥ 50 years were recruited between January 2016 and September 2016. Participants were screened at the study sites to ensure that they met the following inclusion criteria: patients who met the Peterson diagnostic criteria for MCI [\n16\n] with memory problems for at least 3 months, a Clinical Dementia Rating score of 0.5 [\n17\n], a Global Deterioration Scale (GDS) score of 2 or 3 [\n18\n], a Hachinski Ischemic Score of\n19\n], at least 6 years of education, and provided written informed consent.\n\nAcupuncture for patients with mild cognitive impairment: a randomized, patient-assessor-blinded, sham-controlled pilot study\nMethods\nParticipants\nExclusion criteria\nThe exclusion criteria were as follows: dementia diagnosed based on the Diagnostic and Statistical Manual of Mental Disorders-IV; history of cognitive impairment due to other causes such as head trauma or brain injury; history of cerebral hemorrhage or infarction; Parkinson's disease, normal pressure hydrocephalus, brain tumor, or cerebrovascular disease; psychiatric illnesses, including schizophrenia, delusional disorder, or bipolar disorder; severe medical diseases, such as diabetic complications, cardiovascular, hepatic or renal disorders, or malignancy; anemia, hypothyroidism, or vitamin deficiencies; history of drug or alcohol dependence in the past 6 months; currently on medication for cognitive function; received any treatment for MCI within the past 2 weeks; illiterate; participation in other clinical trials within the past 4 weeks; known hypersensitivity to acupuncture treatment or inability to cooperate with the acupuncture procedure; being pregnant, expecting to be pregnant, or lactating; difficulty adapting to the treatment visits or answering the questionnaire; and unwilling to comply with the study protocol.", "doc_items_refs": ["#/texts/109", "#/texts/112", "#/texts/113", "#/texts/114", "#/texts/115", "#/texts/116", "#/texts/117", "#/texts/118", "#/texts/119", "#/texts/120", "#/texts/122"], "page_nos": [], "uuid": "66d004f4-f52a-41f5-b97b-cb6d2223de8f"}
{"doc_id": "2025__Acupuncture_for_patients_with_mild_cognitive_impairment_a_randomized_patientasse__W4412521969", "source_path": "<redacted:source_path>", "chunk_id": 6, "source_chunk_idxs": [13], "num_tokens": 276, "text": "Acupuncture for patients with mild cognitive impairment: a randomized, patient-assessor-blinded, sham-controlled pilot study\nMethods\nRandomization and blinding\nEligible participants were randomized into two groups using block randomization to ensure balanced sample sizes across the groups over time. Random sequences were generated by an independent statistician using SAS\n®\nVersion 9.4 (SAS Institute Inc., Cary, NC, USA). Random numbers were assigned to the participants sequentially, and allocation according to the random number was concealed using sealed opaque envelopes. After a random number was assigned, the corresponding sealed envelope was opened, and participants were allocated to their respective groups.\nAs this trial was both participant- and assessor-blinded, outcome assessments were performed by investigators who were not involved in the randomization process or the administration of acupuncture treatments. The assessors asked only simple and necessary questions to prevent patients from deducing their treatment group. The assessments were conducted in separate rooms from treatment areas, and assessors had no access to treatment allocation information. For patient blinding, participants were informed that they would receive one of two types of acupuncture treatments: \"classical acupuncture\" or \"non-classical acupuncture.\" The success of participant blinding was evaluated using the blinding index and credibility assessment as reported in Sect.\n2.9\n.", "doc_items_refs": ["#/texts/124", "#/texts/125", "#/texts/126", "#/texts/127", "#/texts/128", "#/texts/129"], "page_nos": [], "uuid": "ccc2b0e0-246d-4061-9cdf-91fa78afce66"}
{"doc_id": "2025__Acupuncture_for_patients_with_mild_cognitive_impairment_a_randomized_patientasse__W4412521969", "source_path": "<redacted:source_path>", "chunk_id": 7, "source_chunk_idxs": [14], "num_tokens": 258, "text": "Acupuncture for patients with mild cognitive impairment: a randomized, patient-assessor-blinded, sham-controlled pilot study\nMethods\nInterventions\nAcupuncture\nParticipants in the acupuncture group received standardized acupuncture treatment by a Korean medicine doctor with at least 2 years of clinical experience. Based on previous research [\n20\n,\n21\n,\n22\n], 14 acupuncture points-GV20, EX-HN1, CV12, and the bilateral points of ST36, HT7, KI3, and SP6-were selected with consensus from five Korean medicine doctor specialists. All acupoint location were determined according to the WHO Standard acupuncture point locations in the western pacific region [\n23\n]. Sterile, disposable acupuncture needles (stainless steel, size 0.25 × 40 mm; Dongbang Medical Co., Ltd., Republic of Korea) were used. Manual stimulation was applied to elicit a \"de-qi\" sensation, defined as a feeling of heaviness around the acupoint. Each participant received 24 treatment sessions over 12 weeks (twice a week), with the needles retained for 30 min per session. Absence for up to 25% of the total treatment sessions was permitted.", "doc_items_refs": ["#/texts/132", "#/texts/133", "#/texts/134", "#/texts/135", "#/texts/136", "#/texts/137", "#/texts/138", "#/texts/139", "#/texts/140"], "page_nos": [], "uuid": "ff43aff7-f98f-424b-a531-97b3f5c88214"}
{"doc_id": "2025__Acupuncture_for_patients_with_mild_cognitive_impairment_a_randomized_patientasse__W4412521969", "source_path": "<redacted:source_path>", "chunk_id": 8, "source_chunk_idxs": [15], "num_tokens": 341, "text": "Acupuncture for patients with mild cognitive impairment: a randomized, patient-assessor-blinded, sham-controlled pilot study\nMethods\nInterventions\nSham acupuncture\nParticipants in the sham acupuncture group received sham acupuncture treatment at 14 sham acupoints using a non-penetrating Park sham device [\n24\n]. Sham acupoints were selected based on the following criteria to minimize confounding effects: (1) locations that do not correspond to recognized traditional acupoints; (2) areas without established therapeutic effects for cognitive function in the literature; and (3) considering that dermatome overlap between verum and sham acupuncture can influence clinical outcomes [\n25\n], dermatome overlap was minimized where anatomically feasible. The specific locations were as follows: the midpoint of the biceps brachii muscle belly (upper extremity 1, UE1), 2 cm above UE1 (UE2), 5 cm below the elbow crease, 1 cm lateral (UE3), 2 cm above UE3 (UE4), the upper third of the medial part of the tibia (lower extremity 1, LE1), 2 cm below LE1 (LE2), and 2 cm below LE2 (LE3), all bilaterally. The locations of points used in the acupuncture and sham acupuncture group are presented in Fig.\n1\n. The other treatment procedures were the same as those used in the acupuncture group. Participants in both groups were prohibited from receiving other treatments for MCI during the trial period.\nFig. 1", "doc_items_refs": ["#/texts/142", "#/texts/143", "#/texts/144", "#/texts/145", "#/texts/146", "#/texts/147", "#/texts/148", "#/texts/149"], "page_nos": [], "uuid": "411ce8dc-02ef-4821-a9ea-96ed923b022c"}
{"doc_id": "2025__Acupuncture_for_patients_with_mild_cognitive_impairment_a_randomized_patientasse__W4412521969", "source_path": "<redacted:source_path>", "chunk_id": 9, "source_chunk_idxs": [16], "num_tokens": 213, "text": "Acupuncture for patients with mild cognitive impairment: a randomized, patient-assessor-blinded, sham-controlled pilot study\nMethods\nOutcome measures\nPrimary outcome\nThe primary outcome was the Korean version of the Alzheimer's Disease Assessment Scale-Cognitive Subscale (ADAS-cog) [\n26\n]. The ADAS-cog consists of 11 subtests, including memory items (word recall, orientation, word recognition, and remembering word recognition test instructions), five language items (naming, word-finding ability, commands, spoken language ability, and comprehension of spoken language), and two performance items (constructional praxis and ideational praxis) [\n27\n]. The total score ranges from 0 to 70, with a higher score indicating greater cognitive impairment, as it represents the sum of errors. The ADAS-cog was assessed at baseline and at 4, 8, and 12 weeks after treatment. The primary outcome was the total ADAS-cog score at the end of the 12-week treatment period.", "doc_items_refs": ["#/texts/152", "#/texts/153", "#/texts/154", "#/texts/155", "#/texts/156"], "page_nos": [], "uuid": "f17f36b2-4e7f-4a0b-a2a7-5108c1d705de"}
{"doc_id": "2025__Acupuncture_for_patients_with_mild_cognitive_impairment_a_randomized_patientasse__W4412521969", "source_path": "<redacted:source_path>", "chunk_id": 10, "source_chunk_idxs": [17], "num_tokens": 477, "text": "Acupuncture for patients with mild cognitive impairment: a randomized, patient-assessor-blinded, sham-controlled pilot study\nMethods\nOutcome measures\nSecondary outcomes\nThe secondary outcomes included the ADAS-cog scores at 4 weeks and 8 weeks, the Korean version of the Montreal Cognitive Assessment (MoCA) [\n28\n], the 2nd edition of the Seoul Neuropsychological Screening Battery (SNSB-II) [\n29\n], and the Patient Global Impression of Change (PGIC). The MoCA is a brief cognitive screening tool with high sensitivity and specificity for detecting MCI, with a total score from 0 to 30, wherein a higher score indicates less impaired cognitive function. It includes items assessing visuospatial and executive functions, naming, attention, language, abstraction, memory, and orientation [\n30\n]. The MoCA was assessed at baseline and at 4, 8, and 12 weeks after treatment.\nThe SNSB-II is a standardized neuropsychological test battery widely used in Korea to assess cognitive functioning [\n29\n]. It includes various cognitive tasks for evaluating five cognitive domains: attention, memory, language, visuospatial function, and frontal/executive function. For example, it uses the digit span test for attention, the Boston Naming Test and calculation tasks for language and related functions, the clock drawing test and Rey Complex Figure Test (RCFT) [\n31\n] for visuospatial functions, the Seoul Verbal Learning Test Elderly's version (SVLT-E) [\n32\n] for memory, and the Color Word Stroop Test and Controlled Oral Word Association Test for frontal/executive function. The SNSB was assessed at baseline and at 12 weeks after treatment.\nThe PGIC is a self-assessment tool that allows patients to assess perceived improvement after treatment. Patients can select one of seven options to evaluate how their MCI symptoms have changed: \"Very much improved,\" \"Much improved,\" \"Minimally improved,\" \"No change,\" \"Minimally worse,\" \"Much worse,\" or \"Very much worse.\" The PGIC was assessed at baseline and at 12 weeks after treatment.\nAll assessment data were collected using an electronic case report form. Data were initially recorded by investigators, and a clinical research associate performed full source data verification for all inputted data.", "doc_items_refs": ["#/texts/158", "#/texts/159", "#/texts/160", "#/texts/161", "#/texts/162", "#/texts/163", "#/texts/164", "#/texts/165", "#/texts/166", "#/texts/167", "#/texts/168", "#/texts/169", "#/texts/170", "#/texts/171", "#/texts/172", "#/texts/173"], "page_nos": [], "uuid": "6f626b4b-8bcd-4e58-a42f-4539b626bcbd"}
{"doc_id": "2025__Acupuncture_for_patients_with_mild_cognitive_impairment_a_randomized_patientasse__W4412521969", "source_path": "<redacted:source_path>", "chunk_id": 11, "source_chunk_idxs": [18, 19, 20], "num_tokens": 429, "text": "Acupuncture for patients with mild cognitive impairment: a randomized, patient-assessor-blinded, sham-controlled pilot study\nMethods\nSample size calculation\nThis pilot clinical trial aimed to evaluate the feasibility of acupuncture treatment for MCI. Notably, a minimum of 12 participants per group are recommended for pilot studies [\n33\n]. Considering the number of participants that can be recruited, the minimum range for evaluation, and a dropout rate of 20%, the total number of participants was calculated to be 30.\n\nAcupuncture for patients with mild cognitive impairment: a randomized, patient-assessor-blinded, sham-controlled pilot study\nMethods\nAdverse events\nParticipants were instructed to report any adverse event as it occurred. The investigator monitored the occurrence of adverse events through laboratory test results and interviews. When an adverse event occurred, the date of onset and resolution, the severity and outcome of the event, any action taken related to the intervention, the causality with the intervention, any suspected medication or treatment other than the intervention, and details of any treatment for the adverse event were recorded.\n\nAcupuncture for patients with mild cognitive impairment: a randomized, patient-assessor-blinded, sham-controlled pilot study\nMethods\nBlinding test\nTo assess the success of blinding, participants were asked to guess which treatment they received after the first and last interventions [\n34\n], with the following options: \"classical acupuncture,\" \"non-classical acupuncture,\" or \"don't know which treatment I received.\" Additionally, the credibility of the treatment was evaluated at the end of the 12-week treatment period [\n35\n]. Participants rated their responses to the following four questions: \"How confident do you feel that this treatment can alleviate your complaint?\" \"How confident would you be in recommending this treatment to a friend who suffered from similar complaints?\" \"How logical does this treatment seem to you?\" and \"How successful do you think this treatment would be in alleviating other complaints?\" using a 7-point Likert scale (0 = very low to 6 = very high).", "doc_items_refs": ["#/texts/175", "#/texts/176", "#/texts/177", "#/texts/179", "#/texts/181", "#/texts/182", "#/texts/183", "#/texts/184", "#/texts/185"], "page_nos": [], "uuid": "02d81f25-36df-4178-a03f-8191936f70fd"}
{"doc_id": "2025__Acupuncture_for_patients_with_mild_cognitive_impairment_a_randomized_patientasse__W4412521969", "source_path": "<redacted:source_path>", "chunk_id": 12, "source_chunk_idxs": [21], "num_tokens": 408, "text": "Acupuncture for patients with mild cognitive impairment: a randomized, patient-assessor-blinded, sham-controlled pilot study\nMethods\nStatistical analysis\nThe primary and secondary outcomes were analyzed using an intent-to-treat dataset. However, participants with predefined major protocol violations, such as violating the inclusion/exclusion criteria, not receiving the intervention even once, or not having undergone at least one primary outcome assessment after randomization, were excluded from the analysis. For the primary outcome analysis, the null hypothesis was that there would be no difference in the ADAS-cog scores between the acupuncture and sham acupuncture groups 12 weeks after baseline. This was tested using an analysis of covariance with the 12-week ADAS-cog score as the dependent variable, the group as the fixed factor, and the baseline ADAS-cog score as the covariate. Missing values were addressed using multiple imputations. Continuous outcomes, such as MoCA and SNSB scores, were analyzed using the same method. The results of the PGIC, blinding test, and credibility assessment were analyzed using the chi-square or Fisher's exact test. Additionally, repeated measures ANOVA was performed to evaluate changes across all time points (baseline, 4 weeks, 8 weeks, and 12 weeks) for ADAS-cog and MoCA scores.\nSafety analysis was conducted using a dataset comprising participants who received the intervention at least once. The frequencies of adverse events, adverse events related to the intervention, and serious adverse events were summarized for both groups.\nThe baseline characteristics of the participants in the two groups are presented as the mean ± standard deviation or frequency (%). Comparisons between groups were performed using the t-test or Wilcoxon rank-sum test for continuous variables, and the chi-square or Fisher's exact test for categorical variables. All statistical analyses were performed using SAS\n®\nversion 9.4 (SAS Institute Inc., Cary, NC, USA).", "doc_items_refs": ["#/texts/187", "#/texts/188", "#/texts/189", "#/texts/190", "#/texts/191"], "page_nos": [], "uuid": "5ce564bc-d5d3-4485-839c-1fb2f469217e"}
{"doc_id": "2025__Acupuncture_for_patients_with_mild_cognitive_impairment_a_randomized_patientasse__W4412521969", "source_path": "<redacted:source_path>", "chunk_id": 13, "source_chunk_idxs": [22], "num_tokens": 470, "text": "Acupuncture for patients with mild cognitive impairment: a randomized, patient-assessor-blinded, sham-controlled pilot study\nResults\nParticipants\nFrom December 2015 to September 2016, 77 participants were screened for eligibility, and 30 were enrolled in the trial. The enrolled participants were randomized into two groups: acupuncture (\nn\n= 15) and sham acupuncture (\nn\n= 15). One participant in the acupuncture group declined participation 6 weeks after baseline, and one participant in the sham acupuncture group did not attend the assessment at week 12. The remaining 28 participants completed the study (Fig.\n2\n).\nFig. 2\nThe demographic and baseline clinical characteristics of the enrolled participants are presented in Table\n1\n. The mean age was 64.9 ± 7.2 and 64.6 ± 8.4 years in the acupuncture and sham acupuncture groups, respectively. Women accounted for 60.0% and 67.7% in the acupuncture and sham acupuncture groups, respectively. Education, employment, and medical histories were comparable between the two groups.\nIn both groups, the onset of cognitive problems occurred in the early 60s, and the participants had been experiencing cognitive issues for approximately 2-3 years. Baseline SNSB-II testing identified all enrolled participants with amnestic MCI and T-scores of ≤ 40 for the memory domain. In the acupuncture group, nine participants exhibited impairments only for the memory domain, with five participants exhibiting similar impairments in the sham acupuncture group. The remaining participants exhibited impairments in additional domains, such as frontal/executive function.\nAll participants exhibited Hachinski ischemic score of 0-3, excluding the possibility of vascular dementia, Clinical Dementia Rating scores of 0.5, and GDS scores of 2-3, indicating MCI. In the acupuncture group, 66.7% of the participants had GDS scores of 2 (very mild cognitive decline) compared with 46.7% in the sham acupuncture group, although the difference was not statistically significant. Additionally, participants in the acupuncture group exhibited a trend towards a lesser decline in MoCA and ADAS-cog scores, although this was not statistically significant.", "doc_items_refs": ["#/texts/194", "#/texts/195", "#/texts/196", "#/texts/197", "#/texts/198", "#/texts/199", "#/texts/200", "#/texts/201", "#/texts/202", "#/texts/203", "#/texts/204", "#/texts/205", "#/texts/206"], "page_nos": [], "uuid": "a86cd8bf-42d6-4e5a-894e-3ee1f9e1b2de"}
{"doc_id": "2025__Acupuncture_for_patients_with_mild_cognitive_impairment_a_randomized_patientasse__W4412521969", "source_path": "<redacted:source_path>", "chunk_id": 14, "source_chunk_idxs": [23], "num_tokens": 175, "text": "Acupuncture for patients with mild cognitive impairment: a randomized, patient-assessor-blinded, sham-controlled pilot study\nResults\nPrimary outcome\nThe ADAS-cog score decreased from 10.27 ± 4.03 and 11.47 ± 3.85 at baseline to 5.78 ± 3.04 and 6.27 ± 2.83 at week 12 in the acupuncture and sham acupuncture groups, respectively. After adjusting for baseline values, the mean difference between the two groups at 12 weeks was ˗0.49 (95% confidence interval [CI] ˗2.73, 1.76). Although the acupuncture group showed a slight tendency toward less cognitive decline, the difference was not statistically significant. Notably, Cohen's d of 0.17 indicated a small effect size [\n36\n] (Table\n2\n).", "doc_items_refs": ["#/texts/208", "#/texts/209", "#/texts/210", "#/texts/211", "#/texts/212"], "page_nos": [], "uuid": "f522c1b7-691f-4367-808e-8f0c9c247edf"}
{"doc_id": "2025__Acupuncture_for_patients_with_mild_cognitive_impairment_a_randomized_patientasse__W4412521969", "source_path": "<redacted:source_path>", "chunk_id": 15, "source_chunk_idxs": [24], "num_tokens": 361, "text": "Acupuncture for patients with mild cognitive impairment: a randomized, patient-assessor-blinded, sham-controlled pilot study\nResults\nSecondary outcomes\nNo difference in MoCA scores between the acupuncture and sham acupuncture groups was observed at week 12. For the SNSB-II, the baseline scores for both groups were &gt; 40 for the attention, language, and visuospatial function domains. For the memory domain, both groups showed clear impairments, with baseline T scores of approximately 20. After the 12-week intervention, the SNSB-II memory domain T score increased to 28.12 ± 5.05 and 25.30 ± 4.84 in the acupuncture and sham acupuncture groups, respectively, indicating a tendency for a greater increase in the acupuncture group. Although the P-value of 0.1317 indicated a non-statistically significant difference, Cohen's d value of 0.57 suggested a moderate effect size [\n36\n] (Table\n2\n).\nAfter the 12-week intervention, the PGIC ratings in the acupuncture group were as follows: very much improved,\nn\n= 3; much improved,\nn\n= 3; minimally improved,\nn\n= 6; no change,\nn\n= 1; and minimally worse,\nn\n= 1. In the sham acupuncture group, the PGIC ratings were as follows: very much improved,\nn\n= 3; much improved,\nn\n= 2; minimally improved,\nn\n= 7; and no change,\nn\n= 2. The difference in the PGIC between the two groups was almost negligible (\nP\n= 0.9999), with approximately half of the participants in both groups reporting minimal improvement.", "doc_items_refs": ["#/texts/214", "#/texts/215", "#/texts/216", "#/texts/217", "#/texts/218", "#/texts/219", "#/texts/220", "#/texts/221", "#/texts/222", "#/texts/223", "#/texts/224", "#/texts/225", "#/texts/226", "#/texts/227", "#/texts/228", "#/texts/229", "#/texts/230", "#/texts/231", "#/texts/232", "#/texts/233", "#/texts/234", "#/texts/235", "#/texts/236", "#/texts/237", "#/texts/238", "#/texts/239"], "page_nos": [], "uuid": "c41b4842-0915-43ad-a04c-32fbfdac93f7"}
{"doc_id": "2025__Acupuncture_for_patients_with_mild_cognitive_impairment_a_randomized_patientasse__W4412521969", "source_path": "<redacted:source_path>", "chunk_id": 16, "source_chunk_idxs": [25, 26], "num_tokens": 414, "text": "Acupuncture for patients with mild cognitive impairment: a randomized, patient-assessor-blinded, sham-controlled pilot study\nResults\nAdverse events\nIn the acupuncture group, 7 of the 15 participants reported a total of 10 adverse events, none of which were related to the intervention. Acute nasopharyngitis was the most common adverse event, accounting for six cases. In the sham acupuncture group, 4 of 15 participants reported a total of eight adverse events, which were also not related to the intervention. Acute nasopharyngitis (\nn\n= 3) was the most common adverse event. No intervention-related adverse events were observed in either group (Table\n3\n).\n\nAcupuncture for patients with mild cognitive impairment: a randomized, patient-assessor-blinded, sham-controlled pilot study\nResults\nBlinding test\nA blinding test and credibility assessment of the treatment were performed to assess the success of blinding. The blinding index for the acupuncture group was 0.73 (95% CI 0.51, 0.94) at baseline and 1.00 (95% CI 1.00, 1.00) at week 12, indicating that participants in the acupuncture group believed they received classical acupuncture. For the sham acupuncture group, the blinding index was ˗0.27 (95% CI ˗0.70, 0.17) at baseline and ˗0.50 (95% CI ˗0.93, ˗0.07) at week 12, suggesting that participants in the sham acupuncture group also believed they received classical acupuncture (Table\n4\n).\nRegarding the credibility of the treatment results, participants in both groups responded with an average score of over 4 on the 7-point Likert scale (range: 0-6) for all four questions. No significant differences were observed between the groups, and the sham acupuncture group exhibited higher scores on some questions, indicating successful blinding in the sham acupuncture group (Table\n5\n).", "doc_items_refs": ["#/texts/241", "#/texts/242", "#/texts/243", "#/texts/244", "#/texts/245", "#/texts/247", "#/texts/248", "#/texts/249", "#/texts/250", "#/texts/251", "#/texts/252"], "page_nos": [], "uuid": "05d1cebb-d2e1-4ce4-80b6-971e4f92cea0"}
{"doc_id": "2025__Acupuncture_for_patients_with_mild_cognitive_impairment_a_randomized_patientasse__W4412521969", "source_path": "<redacted:source_path>", "chunk_id": 17, "source_chunk_idxs": [27], "num_tokens": 307, "text": "Acupuncture for patients with mild cognitive impairment: a randomized, patient-assessor-blinded, sham-controlled pilot study\nDiscussion\nSummary of findings\nThis randomized pilot trial was designed to test the feasibility of a large-scale clinical trial. Notably, 30 participants were enrolled over a 10-month period, and 28 (93.3%) completed the 12-week treatment and evaluation period. All participants diagnosed with amnestic MCI, as indicated by SNSB-II memory domain T scores of ≤ 40, showed high compliance with the study protocol, with only one dropout in the acupuncture group and one missed evaluation in the sham acupuncture group. Further, a minimal mean difference in the ADAS-cog-11 score, the primary outcome, was observed between the two groups after 12 weeks of intervention. However, both groups showed clinically meaningful improvements of &gt; 4 points compared with the baseline [\n37\n]. The SNSB-II memory domain T, the secondary outcome, was higher in the acupuncture group than in the sham acupuncture group, with a moderate effect size, despite not reaching statistical significance owing to the small sample size. No intervention-related adverse events were reported in either group. In this study, blinding was attempted using sham acupuncture in the control group, and the results of the blinding test and credibility assessment of the treatment revealed that participants in both groups believed that they received classical acupuncture treatment.", "doc_items_refs": ["#/texts/255", "#/texts/256", "#/texts/257"], "page_nos": [], "uuid": "38921845-87dd-4d52-8f3c-289e9adb3cf6"}
{"doc_id": "2025__Acupuncture_for_patients_with_mild_cognitive_impairment_a_randomized_patientasse__W4412521969", "source_path": "<redacted:source_path>", "chunk_id": 18, "source_chunk_idxs": [28], "num_tokens": 378, "text": "Acupuncture for patients with mild cognitive impairment: a randomized, patient-assessor-blinded, sham-controlled pilot study\nDiscussion\nAgreement and disagreement with previous literature\nMost previous studies on acupuncture in patients with MCI have used the MoCA and MMSE as primary outcome measures [\n8\n,\n9\n,\n38\n]. However, we used MoCA as a secondary outcome, and the results revealed improvement in MoCA scores in the acupuncture and sham acupuncture groups after 12 weeks of treatment, with no significant difference between the groups. In contrast, a 2023 systematic review on acupuncture for patients with MCI, which synthesized results from seven studies using MoCA as an outcome measure, found acupuncture to be significantly more effective than control treatments [\n9\n]. Notably, all but one of these seven studies used medications such as nimodipine or donepezil as controls, with only one study employing sham acupuncture as a control. Additionally, three studies utilized manual acupuncture, similar to our study, and the others used electroacupuncture or warm acupuncture. Differences also existed in treatment frequency, with five studies administering treatments 5-6 times per week and the remaining two studies administering treatments every other day or three times per week [\n9\n]. Notably, the frequency of interventions, which was two times a week, was lower in our study. The absence of a significant difference in MoCA scores between the acupuncture and control groups in our study, unlike previous studies, may be attributed to several factors. Notably, the differences in the control groups used, the lower frequency of interventions, and the frequency of MoCA assessments (monthly in our study) may have led to learning effects, causing score improvements in both groups compared with those at the baseline [\n39\n].", "doc_items_refs": ["#/texts/259", "#/texts/260", "#/texts/261", "#/texts/262", "#/texts/263", "#/texts/264", "#/texts/265", "#/texts/266", "#/texts/267", "#/texts/268", "#/texts/269", "#/texts/270", "#/texts/271"], "page_nos": [], "uuid": "a7ee4498-8a24-4a54-9ec8-8ec64bedcb94"}
{"doc_id": "2025__Acupuncture_for_patients_with_mild_cognitive_impairment_a_randomized_patientasse__W4412521969", "source_path": "<redacted:source_path>", "chunk_id": 19, "source_chunk_idxs": [29], "num_tokens": 403, "text": "Acupuncture for patients with mild cognitive impairment: a randomized, patient-assessor-blinded, sham-controlled pilot study\nDiscussion\nAgreement and disagreement with previous literature\nMost previous acupuncture studies using the ADAS-cog have focused on patients with AD rather than those with MCI [\n40\n,\n41\n,\n42\n,\n43\n]. For instance, a clinical trial involving 87 patients with mild to moderate AD assigned to either an acupuncture treatment or a donepezil hydrochloride group showed significant improvement in ADAS-cog scores in the acupuncture group [\n40\n]. Similarly, a study comparing the effects of acupuncture and donepezil in patients with AD based on three clinical trials demonstrated more favorable results for the acupuncture group [\n41\n]. Conversely, two clinical trials using ADAS-cog for patients with MCI and employing electroacupuncture showed no significant difference compared with the control group [\n44\n,\n45\n]. Therefore, ADAS-cog-11 may not be an effective tool for assessing the efficacy of acupuncture in patients with MCI. Our clinical trial used the ADAS-cog-11, which does not include tasks for evaluating delayed recall related to memory. For MCI clinical trials, the ADAS-cog-13, which includes word list delayed recall and number cancellation, is often used [\n46\n] and is better to measure MCI [\n47\n]. Despite the limitations, the acupuncture and sham acupuncture groups in our study showed improvements of &gt; 4 points in ADAS-cog-11 scores compared with baseline. Notably, a change of 3 or 4 points on the ADAS-cog-11 is considered clinically meaningful [\n37\n,\n48\n]. Therefore, the improvements observed in our study may be clinically relevant and warrant further investigation into the potential benefits of acupuncture in patients with MCI.", "doc_items_refs": ["#/texts/272", "#/texts/273", "#/texts/274", "#/texts/275", "#/texts/276", "#/texts/277", "#/texts/278", "#/texts/279", "#/texts/280", "#/texts/281", "#/texts/282", "#/texts/283", "#/texts/284", "#/texts/285", "#/texts/286", "#/texts/287", "#/texts/288", "#/texts/289", "#/texts/290", "#/texts/291", "#/texts/292", "#/texts/293", "#/texts/294", "#/texts/295", "#/texts/296"], "page_nos": [], "uuid": "2ad8b3b8-5227-4c4f-8713-5a36a99ed6f9"}
{"doc_id": "2025__Acupuncture_for_patients_with_mild_cognitive_impairment_a_randomized_patientasse__W4412521969", "source_path": "<redacted:source_path>", "chunk_id": 20, "source_chunk_idxs": [30], "num_tokens": 425, "text": "Acupuncture for patients with mild cognitive impairment: a randomized, patient-assessor-blinded, sham-controlled pilot study\nDiscussion\nAgreement and disagreement with previous literature\nIn our study, the effects of acupuncture compared with those of sham acupuncture were most notable for the SNSB-II memory domain T score, which showed a moderate effect size despite not reaching statistical significance, owing to the small sample size. This aligns with previous research indicating that acupuncture can affect memory-related brain regions. For instance, an fMRI connectivity analysis study found significant changes in functional connectivity in brain regions associated with memory encoding and retrieval (hippocampus, amygdala) following acupuncture compared with sham acupuncture [\n49\n]. Another study on patients with MCI and AD observed functional brain changes after acupuncture at LR3 and LI4, reporting activation in memory and cognition-related temporal and frontal lobes [\n50\n]. Additionally, in animal models of cognitive impairment, acupuncture inhibited cognition-related neuronal apoptotic pathways and contributed to the functional recovery of neurons in the hippocampal region, enhancing spatial learning and memory function [\n51\n].\nThe lack of significant differences between the acupuncture and sham acupuncture groups in the present study may be attributed to the inherent limitations of sham acupuncture. Although the non-penetrating Park sham device and non-acupoint locations achieved blinding, the stimulation provided by the sham device may have produced enhanced placebo and physiological effects partially resembling those of real acupuncture [\n52\n]. This could have reduced the differences between the groups, thereby making it more difficult to detect significant differences. Notably, previous studies have reported similar limitations, with a sham acupuncture device being more effective than an inert placebo pill [\n53\n] and even skin touch creating specific effects [\n54\n]. Our findings emphasize the methodological challenges in designing acupuncture trials and the need for careful interpretation of results in sham-controlled studies.", "doc_items_refs": ["#/texts/297", "#/texts/298", "#/texts/299", "#/texts/300", "#/texts/301", "#/texts/302", "#/texts/303", "#/texts/304", "#/texts/305", "#/texts/306", "#/texts/307", "#/texts/308", "#/texts/309", "#/texts/310"], "page_nos": [], "uuid": "714e3d46-4b78-43c4-a550-eaf4bfc9ddf5"}
{"doc_id": "2025__Acupuncture_for_patients_with_mild_cognitive_impairment_a_randomized_patientasse__W4412521969", "source_path": "<redacted:source_path>", "chunk_id": 21, "source_chunk_idxs": [31], "num_tokens": 406, "text": "Acupuncture for patients with mild cognitive impairment: a randomized, patient-assessor-blinded, sham-controlled pilot study\nDiscussion\nStudy limitations\nOur study had some limitations. First, as this was a pilot feasibility trial, the results are preliminary and not conclusive. Further research with larger sample sizes and longer treatment durations is essential to comprehensively evaluate the efficacy and safety of acupuncture for MCI. Additionally, confirmatory trials are necessary to validate our hypothesis that 12 weeks of acupuncture treatment can improve memory compared with sham acupuncture.\nSecond, the study did not include a long-term follow-up period, which is essential for assessing the long-term effects of acupuncture on preventing progression to dementia [\n55\n]. Owing to time and budget constraints, the study was concluded after the 12-week treatment and assessment period, and the long-term effects of acupuncture were not evaluated.\nThird, the study used the ADAS-cog-11, which may not be the most effective tool for assessing the efficacy of acupuncture in patients with MCI, as it does not include tasks for evaluating delayed recall related to memory. The ADAS-cog-13, which includes additional tasks such as word list delayed recall and number cancellation [\n27\n], is often more appropriate for MCI clinical trials and better assesses MCI [\n56\n]. Additionally, the monthly assessments using MoCA could have led to learning effects [\n39\n], causing score improvements in both groups when compared with those at baseline and masking any potential differences between the acupuncture and sham acupuncture groups.\nFinally, the frequency of acupuncture treatment in this study was two times weekly, which is lower than the frequency used in other studies (5-6 times weekly) [\n8\n,\n9\n,\n38\n], which may have contributed to the lack of significant differences between the acupuncture and sham acupuncture groups.", "doc_items_refs": ["#/texts/312", "#/texts/313", "#/texts/314", "#/texts/315", "#/texts/316", "#/texts/317", "#/texts/318", "#/texts/319", "#/texts/320", "#/texts/321", "#/texts/322", "#/texts/323", "#/texts/324", "#/texts/325", "#/texts/326", "#/texts/327", "#/texts/328", "#/texts/329"], "page_nos": [], "uuid": "78b1b14b-a633-4052-89fd-a04d018c38d2"}
{"doc_id": "2025__Acupuncture_for_patients_with_mild_cognitive_impairment_a_randomized_patientasse__W4412521969", "source_path": "<redacted:source_path>", "chunk_id": 22, "source_chunk_idxs": [32], "num_tokens": 372, "text": "Acupuncture for patients with mild cognitive impairment: a randomized, patient-assessor-blinded, sham-controlled pilot study\nDiscussion\nImplication for further studies\nThe sample size for a confirmatory trial could be calculated based on the estimated effect size of acupuncture compared with sham acupuncture in this pilot trial. Using Cohen's d of 0.57 for the SNSB-II memory T score, the required sample size is 39 for each group [\n57\n]. Raw scores from the SVLT-E [\n32\n] and RCFT [\n31\n] used to calculate the SNSB-II memory domain T score could also be utilized (Table\n6\n). Based on the results of this pilot trial, the SNSB-II memory T score or SVLT-E delayed recall score could be considered the primary outcomes. Depending on the research objectives, the inclusion criteria could be limited to patients with amnestic MCI to recruit a more homogeneous participant group.\nThe high retention rate (93.3%) and treatment adherence (97-100%) were observed in this pilot study. While our pilot study achieved these favorable outcomes, confirmatory trials typically experience higher dropout rates due to multi-center implementation, larger sample sizes, and more diverse patient populations. Based on systematic analysis of MCI trials showing dropout rates of 8.1% for 6-month and 15.8% for 12-month studies [\n58\n], we recommend planning for a conservative 10-15% dropout rate in future confirmatory trials and can expect similar high compliance rates with twice-weekly treatment schedules. Based on these considerations, a confirmatory trial would require approximately 44-46 participants per group (accounting for 10-15% dropout) and could achieve target enrollment within 12-18 months using a multi-center approach.", "doc_items_refs": ["#/texts/331", "#/texts/332", "#/texts/333", "#/texts/334", "#/texts/335", "#/texts/336", "#/texts/337", "#/texts/338", "#/texts/339", "#/texts/340", "#/texts/341", "#/texts/342"], "page_nos": [], "uuid": "ab97eda4-de0d-4ef0-bdba-403aa6a47ba9"}
{"doc_id": "2025__Acupuncture_for_patients_with_mild_cognitive_impairment_a_randomized_patientasse__W4412521969", "source_path": "<redacted:source_path>", "chunk_id": 23, "source_chunk_idxs": [33], "num_tokens": 462, "text": "Acupuncture for patients with mild cognitive impairment: a randomized, patient-assessor-blinded, sham-controlled pilot study\nDiscussion\nImplication for further studies\nCurrently, consensus on common evaluation metrics for non-pharmacological intervention trials in MCI remains lacking [\n59\n]. The ADAS-cog remains a valuable candidate for primary outcome consideration considering its frequent use in previous MCI clinical trials [\n46\n,\n59\n]. Although the ADAS-cog-13 could also be considered, the lack of an estimated effect size for acupuncture necessitates an additional pilot trial for an accurate sample size calculation. Additionally, further studies should consider incorporating objective biomarkers [\n60\n] and neuroimaging techniques [\n61\n] to explore potential neurobiological pathways through which acupuncture influences cognitive function in patients with MCI.\nIncreasing the frequency of interventions may be beneficial in future studies. In the current setting of twice-weekly treatments, all but 2 of the 30 participants completed the planned 24 sessions. Notably, increasing the frequency may enhance the efficacy of the intervention [\n62\n,\n63\n]. Additionally, previous randomized controlled trials on the effects of acupuncture for MCI have conducted treatments 5-6 times per week [\n8\n,\n9\n,\n38\n]. However, the increased time and cost associated with more frequent sessions should be considered and adjusted for feasibility, particularly in the context of the healthcare system and clinical setting in South Korea. Higher treatment frequencies may potentially enhance the effects of acupuncture; however, the practicality of having patients attend sessions five times weekly for 3 months should be carefully considered.\nThe sham acupuncture method used in this study involved non-penetrating the skin with the Park sham device [\n24\n] and non-acupoint locations for stimulation. The adequate blinding achieved in this study, as evidenced by two separate tests, suggests that similar methods can be effectively used in future trials to establish a control group. However, the stimulation provided by the Park sham device, although helpful for blinding, may have produced physiological effects that partially resembled the effects of real acupuncture [\n52\n], reducing the observed differences between the two groups. Future studies should consider these limitations while designing sham-controlled acupuncture trials.", "doc_items_refs": ["#/texts/343", "#/texts/344", "#/texts/345", "#/texts/346", "#/texts/347", "#/texts/348", "#/texts/349", "#/texts/350", "#/texts/351", "#/texts/352", "#/texts/353", "#/texts/354", "#/texts/355", "#/texts/356", "#/texts/357", "#/texts/358", "#/texts/359", "#/texts/360", "#/texts/361", "#/texts/362", "#/texts/363", "#/texts/364", "#/texts/365", "#/texts/366", "#/texts/367", "#/texts/368", "#/texts/369"], "page_nos": [], "uuid": "4613fac6-e5e3-4b35-9e3e-28482f75054c"}
{"doc_id": "2025__Acupuncture_for_patients_with_mild_cognitive_impairment_a_randomized_patientasse__W4412521969", "source_path": "<redacted:source_path>", "chunk_id": 24, "source_chunk_idxs": [34, 35], "num_tokens": 375, "text": "Acupuncture for patients with mild cognitive impairment: a randomized, patient-assessor-blinded, sham-controlled pilot study\nDiscussion\nImplication for further studies\nFuture confirmatory trials should include sufficient follow-up periods to assess the long-term effects of acupuncture on MCI. A sham-controlled acupuncture study on knee osteoarthritis that found no significant differences between groups during the treatment period revealed that the effects of real acupuncture were better maintained during the follow-up period, whereas the effects of sham acupuncture tended to return to baseline levels [\n64\n]. Owing to the pilot nature of our study and design constraints, we did not include a follow-up period. Future studies should incorporate follow-up assessments to evaluate the potential long-term benefits of acupuncture in patients with MCI.\n\nAcupuncture for patients with mild cognitive impairment: a randomized, patient-assessor-blinded, sham-controlled pilot study\nConclusion\nThis pilot, randomized, controlled trial showed promising results regarding the feasibility of conducting a large-scale clinical trial to evaluate the efficacy and safety of acupuncture for MCI. This study observed clinically meaningful improvements in the acupuncture and sham acupuncture groups, with a moderate effect size favoring acupuncture based on the SNSB-II memory domain T score. Adequate blinding was achieved using a non-penetrating sham acupuncture device and non-acupoint locations. However, the absence of significant differences between the groups may be attributed to the limitations of sham acupuncture, lower frequency of interventions, and small sample size. Based on the preliminary findings of this pilot trial, further confirmatory trials should be planned to test the effects of acupuncture on memory in patients with MCI.", "doc_items_refs": ["#/texts/370", "#/texts/371", "#/texts/372", "#/texts/374"], "page_nos": [], "uuid": "eec5a0eb-0918-4f18-a200-01f8799d0c8a"}
{"doc_id": "2025__Acupuncture_for_patients_with_mild_cognitive_impairment_a_randomized_patientasse__W4412521969", "source_path": "<redacted:source_path>", "chunk_id": 25, "source_chunk_idxs": [36, 37], "num_tokens": 167, "text": "Acupuncture for patients with mild cognitive impairment: a randomized, patient-assessor-blinded, sham-controlled pilot study\nData availability\nThe datasets used and analysed during the current study are available from the corresponding author on reasonable request.\n\nAcupuncture for patients with mild cognitive impairment: a randomized, patient-assessor-blinded, sham-controlled pilot study\nAbbreviations\nMCI:\nMild cognitive impairment\nAD:\nAlzheimer's disease\nGDS:\nGlobal Deterioration Scale\nADAS-cog:\nAlzheimer's Disease Assessment Scale-Cognitive Subscale\nMoCA:\nMontreal Cognitive Assessment\nSNSB-II:\n2nd edition of the Seoul Neuropsychological Screening Battery\nPGIC:\nPatient Global Impression of Change\nRCFT:\nRey Complex Figure Test\nSVLT-E:\nSeoul Verbal Learning Test, elderly version", "doc_items_refs": ["#/texts/376", "#/texts/378", "#/texts/379", "#/texts/380", "#/texts/381", "#/texts/382", "#/texts/383", "#/texts/384", "#/texts/385", "#/texts/386", "#/texts/387", "#/texts/388", "#/texts/389", "#/texts/390", "#/texts/391", "#/texts/392", "#/texts/393", "#/texts/394", "#/texts/395"], "page_nos": [], "uuid": "3ea2b1e0-b4e8-46fe-87d9-4c3c3da556e1"}
{"doc_id": "2025__Acupuncture_for_patients_with_mild_cognitive_impairment_a_randomized_patientasse__W4412521969", "source_path": "<redacted:source_path>", "chunk_id": 26, "source_chunk_idxs": [38], "num_tokens": 434, "text": "Acupuncture for patients with mild cognitive impairment: a randomized, patient-assessor-blinded, sham-controlled pilot study\nReferences\n1. Petersen RC. Mild cognitive impairment as a diagnostic entity. J Intern Med. 2004;256(3):183-94.\nArticle\nCAS\nPubMed\nGoogle Scholar\n2. Petersen RC, Smith GE, Waring SC, Ivnik RJ, Kokmen E, Tangelos EG. Aging, memory, and mild cognitive impairment. Int Psychogeriatr. 1997;9(S1):65-9.\nArticle\nPubMed\nGoogle Scholar\n3. Petersen RC, Doody R, Kurz A, Mohs RC, Morris JC, Rabins PV, et al. Current concepts in mild cognitive impairment. Arch Neurol. 2001;58(12):1985-92.\nArticle\nCAS\nPubMed\nGoogle Scholar\n4. Gauthier S, Reisberg B, Zaudig M, Petersen RC, Ritchie K, Broich K, et al. Mild cognitive impairment. Lancet. 2006;367(9518):1262-70.\nArticle\nPubMed\nGoogle Scholar\n5. Hugo J, Ganguli M. Dementia and cognitive impairment: epidemiology, diagnosis, and treatment. Clin Geriatr Med. 2014;30(3):421-42.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n6. Xue H, Li Y, Xu Z. A systematic review and evaluation of Non-Pharmacological interventions for elderly patients with mild cognitive impairment. Altern Ther Health Med. 2023;29(7).\n7. Yin Z, Zhou J, Xia M, Chen Z, Li Y, Zhang X et al. Acupuncture on mild cognitive impairment: A systematic review of neuroimaging studies. Frontiers in Aging Neuroscience [Internet]. 2023 [cited 2023 Jul 27];15. Available from:\nhttps://www.frontiersin.org/articles/\nhttps://doi.org/10.3389/fnagi.2023.1007436", "doc_items_refs": ["#/texts/397", "#/texts/398", "#/texts/399", "#/texts/400", "#/texts/401", "#/texts/402", "#/texts/403"], "page_nos": [], "uuid": "f292e8c3-a836-424d-bada-8a41ef0ed678"}
{"doc_id": "2025__Acupuncture_for_patients_with_mild_cognitive_impairment_a_randomized_patientasse__W4412521969", "source_path": "<redacted:source_path>", "chunk_id": 27, "source_chunk_idxs": [39], "num_tokens": 496, "text": "Acupuncture for patients with mild cognitive impairment: a randomized, patient-assessor-blinded, sham-controlled pilot study\nReferences\n8. He W, Li M, Han X, Zhang W. Acupuncture for Mild Cognitive Impairment and Dementia: An Overview of Systematic Reviews. Front Aging Neurosci [Internet]. 2021 May 14 [cited 2021 Jun 2];13. Available from:\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC8160113/\n9. Yin Z, Li Y, Jiang C, Xia M, Chen Z, Zhang X et al. Acupuncture for mild cognitive impairment: A systematic review with meta-analysis and trial sequential analysis. Front Neurol. 2023;13.\n10. Guo R, Shen X, Ealing J, Zhou J, Lu J, Ning Y. Efficacy and safety of acupuncture for cognitive impairment in alzheimer's disease: a systematic review and meta-analysis. Front Dement. 2024;3:1380221.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n11. Ma S, Huang H, Zhong Z, Zheng H, Li M, Yao L et al. Effect of acupuncture on brain regions modulation of mild cognitive impairment: A meta-analysis of functional magnetic resonance imaging studies. Front Aging Neurosci. 2022;14.\n12. Lu X, Hongcai S, Jiaying W, Jing H, Jun X. Assessing the quality of reports about randomized controlled trials of acupuncture treatment on mild cognitive impairment. PLoS ONE. 2011;25(2):e16922.\nArticle\nGoogle Scholar\n13. Schulz KF, Altman DG, Moher D, CONSORT Group. CONSORT 2010 statement: updated guidelines for reporting parallel group randomised trials. J Clin Epidemiol. 2010;63(8):834-40.\nArticle\nPubMed\nGoogle Scholar\n14. MacPherson H, Altman DG, Hammerschlag R, Youping L, Taixiang W, White A, et al. Revised standards for reporting interventions in clinical trials of acupuncture (STRICTA): extending the CONSORT statement. PLoS Med. 2010;7(6):e1000261.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/404", "#/texts/405", "#/texts/406", "#/texts/407", "#/texts/408", "#/texts/409", "#/texts/410"], "page_nos": [], "uuid": "96b70413-6ba6-4fbf-9ff0-1a4d93be40dd"}
{"doc_id": "2025__Acupuncture_for_patients_with_mild_cognitive_impairment_a_randomized_patientasse__W4412521969", "source_path": "<redacted:source_path>", "chunk_id": 28, "source_chunk_idxs": [40], "num_tokens": 414, "text": "Acupuncture for patients with mild cognitive impairment: a randomized, patient-assessor-blinded, sham-controlled pilot study\nReferences\n15. Lee YS, Kim SY, Lee H, Chae Y, Lee MS. ACURATE: A guide for reporting Sham controls in trials using acupuncture. Integr Med Res. 2023;12(2):100955.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n16. Petersen RC, Smith GE, Waring SC, Ivnik RJ, Tangalos EG, Kokmen E. Mild cognitive impairment: clinical characterization and outcome. Arch Neurol. 1999;56(3):303-8.\nArticle\nCAS\nPubMed\nGoogle Scholar\n17. Berg L. Clinical dementia rating. Br J Psychiatry. 1984;145(3):339-339.\nArticle\nCAS\nPubMed\nGoogle Scholar\n18. Reisberg B, Ferris SH, De Leon MJ, Crook T. The global deterioration scale for assessment of primary degenerative dementia. Am J Psychiatry. 1982;139(9):1136-9.\nArticle\nCAS\nPubMed\nGoogle Scholar\n19. Pantoni L, Inzitari D. Hachinski's ischemic score and the diagnosis of vascular dementia: A review. Ital J Neuro Sci. 1993;14(7):539-46.\nArticle\nCAS\nGoogle Scholar\n20. Zhou J, Peng W, Xu M, Li W, Liu Z. The effectiveness and safety of acupuncture for patients with alzheimer disease: a systematic review and meta-analysis of randomized controlled trials. Medicine. 2015;94(22):e933.\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n21. Jia B, Liu Z, Min B, Wang Z, Zhou A, Li Y et al. The effects of acupuncture at real or sham acupoints on the intrinsic brain activity in mild cognitive impairment patients. Evidence-Based Complementary and Alternative Medicine. 2015;2015.", "doc_items_refs": ["#/texts/411", "#/texts/412", "#/texts/413", "#/texts/414", "#/texts/415", "#/texts/416", "#/texts/417"], "page_nos": [], "uuid": "b706ad95-7301-4ad4-b73b-c15565e31e95"}
{"doc_id": "2025__Acupuncture_for_patients_with_mild_cognitive_impairment_a_randomized_patientasse__W4412521969", "source_path": "<redacted:source_path>", "chunk_id": 29, "source_chunk_idxs": [41], "num_tokens": 442, "text": "Acupuncture for patients with mild cognitive impairment: a randomized, patient-assessor-blinded, sham-controlled pilot study\nReferences\n22. Leung AWN, Lam LCW, Kwan AKL, Tsang CLL, Zhang HW, Guo YQ et al. Electroacupuncture for older adults with mild cognitive impairment: study protocol for a randomized controlled trial. Trials [Internet]. 2015 May 27 [cited 2019 Sep 18];16. Available from:\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC4451728/\n23. World Health Organization. Regional Office for the Western Pacific. WHO standard acupuncture point locations in the Western Pacific region [Internet]. WHO Regional Office for the Western Pacific. 2008. Available from:\nhttps://iris.who.int/handle/10665/353407\n24. Park J, White A, Stevinson C, Ernst E, James M. Validating a new Non-Penetrating Sham acupuncture device: two randomised controlled trials. Acupunct Med. 2002;20(4):168-74.\nArticle\nPubMed\nGoogle Scholar\n25. Ots T, Kandirian A, Szilagyi I, DiGiacomo SM, Sandner-Kiesling A. The selection of dermatomes for Sham (placebo) acupuncture points is relevant for the outcome of acupuncture studies: a systematic review of Sham (placebo)-controlled randomized acupuncture trials. Acupunct Med. 2020;38(4):211-26.\nArticle\nPubMed\nGoogle Scholar\n26. Youn J, Lee D, Kim K, Lee J, Jhoo J, Lee K et al. Development of the Korean version of Alzheimer's Disease Assessment Scale (ADAS-K). International journal of geriatric psychiatry [Internet]. 2002 Sep [cited 2020 Aug 18]; Available from:\nhttps://pubmed.ncbi.nlm.nih.gov/12221651/", "doc_items_refs": ["#/texts/418", "#/texts/419", "#/texts/420", "#/texts/421", "#/texts/422"], "page_nos": [], "uuid": "dbea3ffa-b514-4525-87cc-2d4280940558"}
{"doc_id": "2025__Acupuncture_for_patients_with_mild_cognitive_impairment_a_randomized_patientasse__W4412521969", "source_path": "<redacted:source_path>", "chunk_id": 30, "source_chunk_idxs": [42], "num_tokens": 480, "text": "Acupuncture for patients with mild cognitive impairment: a randomized, patient-assessor-blinded, sham-controlled pilot study\nReferences\n27. Mohs R, Knopman D, Petersen R, Ferris S, Ernesto C, Grundman M et al. Development of cognitive instruments for use in clinical trials of antidementia drugs: additions to the Alzheimer's Disease Assessment Scale that broaden its scope. The Alzheimer's Disease Cooperative Study. Alzheimer disease and associated disorders. 1997.\n28. Lee JY, Lee DW, Cho SJ, Na DL, Jeon HJ, Kim SK, et al. Brief screening for mild cognitive impairment in elderly outpatient clinic: validation of the Korean version of the Montreal cognitive assessment. J Geriatr Psychiatry Neurol. 2008;21(2):104-10.\nArticle\nPubMed\nGoogle Scholar\n29. Ryu HJ, Yang DW. The Seoul neuropsychological screening battery (SNSB) for comprehensive neuropsychological assessment. Dement Neurocognitive Disorders. 2023;22(1):1-15.\nArticle\nGoogle Scholar\n30. Nasreddine ZS, Phillips NA, Bédirian V, Charbonneau S, Whitehead V, Collin I, et al. The Montreal cognitive assessment, moca: a brief screening tool for mild cognitive impairment. J Am Geriatr Soc. 2005;53(4):695-9.\nArticle\nPubMed\nGoogle Scholar\n31. Meyers J, Meyers KR. Rey complex figure test and recognition trial. Psychological Assessment Resources, Incorporated; 1995.\n32. Lee YM, Kim SH, Cho DH. IC-P-077: Seoul verbal learning test is a helpful early neuropsychological marker of an alzheimer's disease patient with normal MMSE score. Alzheimer's Dement. 2010;6(4SPart1):S33-33.\nGoogle Scholar\n33. Julious SA. Sample size of 12 per group rule of thumb for a pilot study. Pharm Stat. 2005;4(4):287-91.\nArticle\nGoogle Scholar\n34. Bang H, Ni L, Davis CE. Assessment of blinding in clinical trials. Control Clin Trials. 2004;25(2):143-56.\nArticle\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/423", "#/texts/424", "#/texts/425", "#/texts/426", "#/texts/427", "#/texts/428", "#/texts/429", "#/texts/430"], "page_nos": [], "uuid": "1146eafd-e4ce-4a92-8b7c-59d9a5d3ae85"}
{"doc_id": "2025__Acupuncture_for_patients_with_mild_cognitive_impairment_a_randomized_patientasse__W4412521969", "source_path": "<redacted:source_path>", "chunk_id": 31, "source_chunk_idxs": [43], "num_tokens": 483, "text": "Acupuncture for patients with mild cognitive impairment: a randomized, patient-assessor-blinded, sham-controlled pilot study\nReferences\n35. Vincent C, Lewith G. Placebo controls for acupuncture studies. J R Soc Med. 1995;88(4):199-202.\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n36. Cohen J. Statistical power analysis for the behavioral sciences [Internet]. Routledge; 2013 [cited 2024 Jun 5]. Available from:\nhttps://www.taylorfrancis.com/books/mono/10.4324/9780203771587/statistical-power-analysis-behavioral-sciences-jacob-cohen\n37. Lansdall CJ, McDougall F, Butler LM, Delmar P, Pross N, Qin S, et al. Establishing clinically meaningful change on outcome assessments frequently used in trials of mild cognitive impairment due to alzheimer's disease. J Prev Alzheimers Dis. 2023;10(1):9-18.\nArticle\nCAS\nPubMed\nGoogle Scholar\n38. Li W, Wang Q, Du S, Pu Y, Xu G. Acupuncture for mild cognitive impairment in elderly people: systematic review and meta-analyses. Medicine. 2020;99(39):e22365.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n39. Chertkow H, Nasreddine Z, Johns E, Phillips N, McHenry C. P1-143: the Montreal cognitive assessment (MoCA): validation of alternate forms and new recommendations for education corrections. Alzheimer's Dement. 2011;7:S157-157.\nArticle\nGoogle Scholar\n40. Jia Y, Zhang X, Yu J, Han J, Yu T, Shi J, et al. Acupuncture for patients with mild to moderate alzheimer's disease: a randomized controlled trial. BMC Complement Altern Med. 2017;17(1):556.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n41. Huang Q, Luo D, Chen L, Liang F, xia, Chen R. Effectiveness of acupuncture for alzheimer's disease: an updated systematic review and Meta-analysis. CURR MED SCI. 2019;39(3):500-11.\nArticle\nCAS\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/431", "#/texts/432", "#/texts/433", "#/texts/434", "#/texts/435", "#/texts/436", "#/texts/437"], "page_nos": [], "uuid": "c01aa44e-19b9-4a1b-84e5-88417d88eeb4"}
{"doc_id": "2025__Acupuncture_for_patients_with_mild_cognitive_impairment_a_randomized_patientasse__W4412521969", "source_path": "<redacted:source_path>", "chunk_id": 32, "source_chunk_idxs": [44], "num_tokens": 452, "text": "Acupuncture for patients with mild cognitive impairment: a randomized, patient-assessor-blinded, sham-controlled pilot study\nReferences\n42. Lan J, Miao J, fei, Ge S qi, Chai T qu, Tang C, zhi, Lu L. ming. Acupuncture for cognitive impairment in vascular dementia, Alzheimer's disease and mild cognitive impairment: A systematic review and meta-analysis. European Journal of Integrative Medicine. 2020;35:101085.\n43. Shin JH, Shin HJ, Kim EB, An YY, Yook TH, Choi YM, et al. The effectiveness of acupuncture treatment for patients with alzheimer's disease: A Meta-Analysis of randomized controlled trials. J Acupunct Res. 2020;37(4):209-23.\nArticle\nGoogle Scholar\n44. Kim JH, Han JY, Park GC, Lee JS. Cognitive improvement effects of electroacupuncture combined with Computer-Based cognitive rehabilitation in patients with mild cognitive impairment: A randomized controlled trial. Brain Sci. 2020;10(12):984.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n45. Choi Y, Jung IC, Kim AR, Park HJ, Kwon O, Lee JH, et al. Feasibility and effect of electroacupuncture on cognitive function domains in patients with mild cognitive impairment: A pilot exploratory randomized controlled trial. Brain Sci. 2021;11(6):756.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n46. Petersen RC, Thomas RG, Aisen PS, Mohs RC, Carrillo MC, Albert MS, et al. Randomized controlled trials in mild cognitive impairment: sources of variability. Neurology. 2017;88(18):1751-8.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n47. Grundman M, Petersen RC, Ferris SH, Thomas RG, Aisen PS, Bennett DA, et al. Mild cognitive impairment can be distinguished from alzheimer disease and normal aging for clinical trials. Arch Neurol. 2004;61(1):59-66.\nArticle\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/438", "#/texts/439", "#/texts/440", "#/texts/441", "#/texts/442", "#/texts/443"], "page_nos": [], "uuid": "61ef8e91-0d0f-46e5-83dc-6772cd9ea6d0"}
{"doc_id": "2025__Acupuncture_for_patients_with_mild_cognitive_impairment_a_randomized_patientasse__W4412521969", "source_path": "<redacted:source_path>", "chunk_id": 33, "source_chunk_idxs": [45], "num_tokens": 434, "text": "Acupuncture for patients with mild cognitive impairment: a randomized, patient-assessor-blinded, sham-controlled pilot study\nReferences\n48. Rockwood K, Howlett SE, Hoffman D, Schindler R, Mitnitski A. Clinical meaningfulness of alzheimer's disease assessment Scale-Cognitive subscale change in relation to goal attainment in patients on cholinesterase inhibitors. Alzheimers Dement. 2017;13(10):1098-106.\nArticle\nPubMed\nGoogle Scholar\n49. Feng Y, Bai L, Ren Y, Chen S, Wang H, Zhang W, et al. FMRI connectivity analysis of acupuncture effects on the whole brain network in mild cognitive impairment patients. Magn Reson Imaging. 2012;30(5):672-82.\nArticle\nPubMed\nGoogle Scholar\n50. Wang Z, Nie B, Li D, Zhao Z, Han Y, Song H, et al. Effect of acupuncture in mild cognitive impairment and alzheimer disease: A functional MRI study. PLoS ONE. 2012;20(8):e42730.\nArticle\nGoogle Scholar\n51. Zhang Z, Chen L, Guo Y, Li D, Zhang J, Liu L, et al. The neuroprotective and neural circuit mechanisms of acupoint stimulation for cognitive impairment. Chin Med. 2023;18(1):8.\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n52. Kim TH, Lee MS, Birch S, Alraek T. Plausible mechanism of Sham acupuncture based on biomarkers: A systematic review of randomized controlled trials. Front Neurosci. 2022;16:834112.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n53. Kaptchuk TJ, Stason WB, Davis RB, Legedza AR, Schnyer RN, Kerr CE, et al. Sham device v inert pill: randomised controlled trial of two placebo treatments. BMJ. 2006;332(7538):391-7.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/444", "#/texts/445", "#/texts/446", "#/texts/447", "#/texts/448", "#/texts/449"], "page_nos": [], "uuid": "52f08e0a-7107-45ac-8e0a-422ef139c88c"}
{"doc_id": "2025__Acupuncture_for_patients_with_mild_cognitive_impairment_a_randomized_patientasse__W4412521969", "source_path": "<redacted:source_path>", "chunk_id": 34, "source_chunk_idxs": [46], "num_tokens": 484, "text": "Acupuncture for patients with mild cognitive impairment: a randomized, patient-assessor-blinded, sham-controlled pilot study\nReferences\n54. Fei YT, Cao HJ, Xia RY, Chai QY, Liang CH, Feng YT et al. Methodological challenges in design and conduct of randomised controlled trials in acupuncture. Bmj [Internet]. 2022 [cited 2024 Jun 18];376. Available from:\nhttps://www.bmj.com/content/376/bmj-2021-064345.abstract\n55. Mitchell AJ, Shiri-Feshki M. Rate of progression of mild cognitive impairment to dementia- meta-analysis of 41 robust inception cohort studies. Acta Psychiatrica Scandinavica. 2009;119(4):252-65.\nArticle\nCAS\nPubMed\nGoogle Scholar\n56. Mn NR et al. S, M F, E Y, G N, M G,. The ADAS-Cog revisited: novel composite scales based on ADAS-Cog to improve efficiency in MCI and early AD trials. Alzheimer's &amp; dementia: the journal of the Alzheimer's Association [Internet]. 2013 Feb [cited 2020 Nov 3]; Available from:\nhttps://pubmed.ncbi.nlm.nih.gov/23127469/\n57. Champely S, Ekstrom C, Dalgaard P, Gill J, Weibelzahl S, Anandkumar A et al. pwr: Basic functions for power analysis. 2017 [cited 2024 Jun 6]; Available from:\nhttps://nyuscholars.nyu.edu/en/publications/pwr-basic-functions-for-power-analysis\n58. Ritchie M, Gillen DL, Grill JD. Estimating attrition in mild-to-moderate alzheimer's disease and mild cognitive impairment clinical trials. Alz Res Therapy. 2023;15(1):203.\nArticle\nGoogle Scholar\n59. Couch E, Lawrence V, Prina M. Outcomes tested in non-pharmacological interventions in mild cognitive impairment and mild dementia: A scoping review. BMJ Open. 2020;10(4):e035980.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/450", "#/texts/451", "#/texts/452", "#/texts/453", "#/texts/454", "#/texts/455"], "page_nos": [], "uuid": "29d3486f-2f67-48b9-8ae6-e038992d5ea0"}
{"doc_id": "2025__Acupuncture_for_patients_with_mild_cognitive_impairment_a_randomized_patientasse__W4412521969", "source_path": "<redacted:source_path>", "chunk_id": 35, "source_chunk_idxs": [47, 48, 49], "num_tokens": 489, "text": "Acupuncture for patients with mild cognitive impairment: a randomized, patient-assessor-blinded, sham-controlled pilot study\nReferences\n60. Lewczuk P, Mroczko B, Fagan A, Kornhuber J. Biomarkers of alzheimer's disease and mild cognitive impairment: A current perspective. Adv Med Sci. 2015;60(1):76-82.\nArticle\nPubMed\nGoogle Scholar\n61. Kim J, Lee JH. Integration of structural and functional magnetic resonance imaging improves mild cognitive impairment detection. Magn Reson Imaging. 2013;31(5):718-32.\nArticle\nPubMed\nGoogle Scholar\n62. Bauer M, McDonald JL, Saunders N. Is acupuncture dose dependent? Ramifications of acupuncture treatment dose within clinical practice and trials. Integr Med Res. 2020;9(1):21-7.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n63. Yoon DE, Lee IS, Chae Y. Identifying dose components of manual acupuncture to determine the dose-Response relationship of acupuncture treatment: A systematic review. Am J Chin Med. 2022;50(03):653-71.\nArticle\nPubMed\nGoogle Scholar\n64. Tu JF, Yang JW, Shi GX, Yu ZS, Li JL, Lin LL, et al. Efficacy of intensive acupuncture versus Sham acupuncture in knee osteoarthritis: A randomized controlled trial. Arthritis Rheumatol. 2021;73(3):448-58.\nArticle\nPubMed\nGoogle Scholar\nDownload references\n\nAcupuncture for patients with mild cognitive impairment: a randomized, patient-assessor-blinded, sham-controlled pilot study\nAcknowledgements\nWe would like to extend our gratitude to all the participants and research staff for their invaluable contributions to this study.\n\nAcupuncture for patients with mild cognitive impairment: a randomized, patient-assessor-blinded, sham-controlled pilot study\nFunding\nThis research was supported by the Korea Institute of Oriental Medicine (Grant Numbers: K16122 and KSN2122211). The funder had no role in the design of the study; in the collection, analyses, or interpretation of data; in the writing of the manuscript; or in the decision to publish the results.", "doc_items_refs": ["#/texts/456", "#/texts/457", "#/texts/458", "#/texts/459", "#/texts/460", "#/texts/461", "#/texts/463", "#/texts/465"], "page_nos": [], "uuid": "6db14690-1a88-4c37-8b5c-4d6c94df7ac1"}
{"doc_id": "2025__Acupuncture_for_patients_with_mild_cognitive_impairment_a_randomized_patientasse__W4412521969", "source_path": "<redacted:source_path>", "chunk_id": 36, "source_chunk_idxs": [50], "num_tokens": 352, "text": "Acupuncture for patients with mild cognitive impairment: a randomized, patient-assessor-blinded, sham-controlled pilot study\nAuthor information\nAuthors and Affiliations\n1. KM Science Research Division, Korea Institute of Oriental Medicine, Daejeon, Republic of Korea Yujin Choi, Pyung-Wha Kim, Ojin Kwon &amp; Jun-Hwan Lee\n2. R&amp;D Strategy Division, Korea Institute of Oriental Medicine, Daejeon, Republic of Korea Ae-Ran Kim &amp; Hyo-Ju Park\n3. Department of Neuropsychiatry, College of Korean Medicine, Daejeon University, Daejeon, Republic of Korea In-Chul Jung\n4. Department of Acupuncture and Moxibustion Medicine, College of Korean Medicine, Sangji University, 83 Sangjidae-gil, Wonju, 26339, Republic of Korea Joo-Hee Kim\n5. Research Institute of Korean Medicine, Sangji University, Wonju, Republic of Korea Joo-Hee Kim\nAuthors\n1. Yujin Choi\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n2. Pyung-Wha Kim\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n3. In-Chul Jung\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n4. Ae-Ran Kim\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n5. Hyo-Ju Park\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n6. Ojin Kwon\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n7. Jun-Hwan Lee\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n8. Joo-Hee Kim\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/468", "#/texts/469", "#/texts/470", "#/texts/471", "#/texts/472", "#/texts/473", "#/texts/474", "#/texts/475", "#/texts/476", "#/texts/477", "#/texts/478", "#/texts/479", "#/texts/480", "#/texts/481"], "page_nos": [], "uuid": "b94b14be-50ee-45c8-8118-ee0c19af1d0f"}
{"doc_id": "2025__Acupuncture_for_patients_with_mild_cognitive_impairment_a_randomized_patientasse__W4412521969", "source_path": "<redacted:source_path>", "chunk_id": 37, "source_chunk_idxs": [51, 52, 53], "num_tokens": 260, "text": "Acupuncture for patients with mild cognitive impairment: a randomized, patient-assessor-blinded, sham-controlled pilot study\nAuthor information\nContributions\nConceptualization: JHK. Formal analysis: YC and OK. Investigation: ICJ, ARK, HJP, and JHK. Data curation: OK. Writing the Original Draft: YC and PWK. Writing, Review &amp; Editing: ICJ, ARK, HJP, OK, JHL, and JHK. Supervision: JHK. Project administration: JHK. Funding acquisition: JHL and JHK.\n\nAcupuncture for patients with mild cognitive impairment: a randomized, patient-assessor-blinded, sham-controlled pilot study\nAuthor information\nCorresponding author\nCorrespondence to\nJoo-Hee Kim\n.\n\nAcupuncture for patients with mild cognitive impairment: a randomized, patient-assessor-blinded, sham-controlled pilot study\nEthics declarations\nEthics approval and consent to participate\nThis research was reviewed and approved by the Institutional Review Board of the Daejeon Korean Medicine Hospital of Daejeon University (registration number: djomc-131-1). The study was conducted in accordance with the Declaration of Helsinki. Informed consent was obtained from all the participants.", "doc_items_refs": ["#/texts/483", "#/texts/485", "#/texts/486", "#/texts/487", "#/texts/490"], "page_nos": [], "uuid": "c7e8cd13-a015-42ec-98d0-d842e1738cd4"}
{"doc_id": "2025__Acupuncture_for_patients_with_mild_cognitive_impairment_a_randomized_patientasse__W4412521969", "source_path": "<redacted:source_path>", "chunk_id": 38, "source_chunk_idxs": [54, 55, 56, 57, 58], "num_tokens": 373, "text": "Acupuncture for patients with mild cognitive impairment: a randomized, patient-assessor-blinded, sham-controlled pilot study\nEthics declarations\nConsent for publication\nNot applicable.\n\nAcupuncture for patients with mild cognitive impairment: a randomized, patient-assessor-blinded, sham-controlled pilot study\nEthics declarations\nCompeting interests\nThe authors declare no competing interests.\n\nAcupuncture for patients with mild cognitive impairment: a randomized, patient-assessor-blinded, sham-controlled pilot study\nAdditional information\nPublisher's note\nSpringer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations.\n\nAcupuncture for patients with mild cognitive impairment: a randomized, patient-assessor-blinded, sham-controlled pilot study\nElectronic supplementary material\nBelow is the link to the electronic supplementary material.\n\nAcupuncture for patients with mild cognitive impairment: a randomized, patient-assessor-blinded, sham-controlled pilot study\nRights and permissions\nOpen Access\nThis article is licensed under a Creative Commons Attribution 4.0 International License, which permits use, sharing, adaptation, distribution and reproduction in any medium or format, as long as you give appropriate credit to the original author(s) and the source, provide a link to the Creative Commons licence, and indicate if changes were made. The images or other third party material in this article are included in the article's Creative Commons licence, unless indicated otherwise in a credit line to the material. If material is not included in the article's Creative Commons licence and your intended use is not permitted by statutory regulation or exceeds the permitted use, you will need to obtain permission directly from the copyright holder. To view a copy of this licence, visit\nhttp://creativecommons.org/licenses/by/4.0/\n.\nReprints and permissions", "doc_items_refs": ["#/texts/492", "#/texts/494", "#/texts/497", "#/texts/499", "#/texts/505", "#/texts/506", "#/texts/507", "#/texts/508", "#/texts/509"], "page_nos": [], "uuid": "4981fb99-6263-4bc6-92de-ec63ae8abc9e"}
{"doc_id": "2025__Acupuncture_for_patients_with_mild_cognitive_impairment_a_randomized_patientasse__W4412521969", "source_path": "<redacted:source_path>", "chunk_id": 39, "source_chunk_idxs": [59, 60, 61, 62], "num_tokens": 323, "text": "Acupuncture for patients with mild cognitive impairment: a randomized, patient-assessor-blinded, sham-controlled pilot study\nAbout this article\nCite this article\nChoi, Y., Kim, PW., Jung, IC.\net al.\nAcupuncture for patients with mild cognitive impairment: a randomized, patient-assessor-blinded, sham-controlled pilot study.\nBMC Complement Med Ther\n25\n, 277 (2025). https://doi.org/10.1186/s12906-025-05023-5\nDownload citation\n- Received : 04 July 2024\n- Accepted : 10 July 2025\n- Published : 19 July 2025\n- DOI : https://doi.org/10.1186/s12906-025-05023-5\n\nAcupuncture for patients with mild cognitive impairment: a randomized, patient-assessor-blinded, sham-controlled pilot study\nAbout this article\nKeywords\n- Acupuncture therapy\n- Alzheimer's disease\n- Cognitive dysfunction\n- Dementia\n- Randomized controlled trial\nDownload PDF\nAdvertisement\n\nAcupuncture for patients with mild cognitive impairment: a randomized, patient-assessor-blinded, sham-controlled pilot study\nAbout this article\nKeywords\nBMC Complementary Medicine and Therapies\nISSN: 2662-7671\n\nAcupuncture for patients with mild cognitive impairment: a randomized, patient-assessor-blinded, sham-controlled pilot study\nAbout this article\nKeywords\nContact us\n- General enquiries:\njournalsubmissions@springernature.com", "doc_items_refs": ["#/texts/512", "#/texts/513", "#/texts/514", "#/texts/515", "#/texts/516", "#/texts/517", "#/texts/518", "#/texts/519", "#/texts/520", "#/texts/521", "#/texts/522", "#/texts/524", "#/texts/525", "#/texts/526", "#/texts/527", "#/texts/528", "#/texts/529", "#/texts/530", "#/texts/532", "#/texts/534"], "page_nos": [], "uuid": "d63ce7b5-6411-47a7-b7d0-f38cbc777c20"}
