{"doc_id": "2025__Impact_of_motor_symptom_asymmetry_on_non-motor_outcomes_in_Parkinsons_disease_a___W4411857849", "source_path": "<redacted:source_path>", "chunk_id": 0, "source_chunk_idxs": [0, 1, 2], "num_tokens": 324, "text": "Impact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review | npj Parkinson's Disease\nSkip to main content\nThank you for visiting nature.com. You are using a browser version with limited support for CSS. To obtain\nthe best experience, we recommend you use a more up to date browser (or turn off compatibility mode in\nInternet Explorer). In the meantime, to ensure continued support, we are displaying the site without styles\nand JavaScript.\nAdvertisement\n- View all journals\n- Search\n- Log in\n- Content Explore content\n- About the journal\n- Publish with us\n- Sign up for alerts\n- RSS feed\n1. nature\n2. npj parkinson's disease\n3. articles\n4. article\nImpact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nDownload PDF\nDownload PDF\n- Article\n- Open access\n- Published: 01 July 2025\n\nImpact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\n- P. Voruz\n1\n,\n2\n,\n- D. Guérin\n1\n&amp;\n- J. A. Péron\n1\n,\n3\nnpj Parkinson's Disease\nvolume 11\n, Article number: 188 ( 2025 )\nCite this article\n- 4939 Accesses\n- 1 Citations\n- 109 Altmetric\n- Metrics details\n\nImpact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nSubjects\n- Cognitive ageing\n- Dementia\n- Human behaviour\n- Neurodegeneration\n- Parkinson's disease\n- Psychology", "doc_items_refs": ["#/texts/1", "#/texts/2", "#/texts/3", "#/texts/4", "#/texts/5", "#/texts/6", "#/texts/7", "#/texts/8", "#/texts/9", "#/texts/10", "#/texts/11", "#/texts/12", "#/texts/13", "#/texts/14", "#/texts/15", "#/texts/16", "#/texts/17", "#/texts/18", "#/texts/19", "#/texts/20", "#/texts/21", "#/texts/22", "#/texts/23", "#/texts/24", "#/texts/26", "#/texts/27", "#/texts/28", "#/texts/29", "#/texts/30", "#/texts/31", "#/texts/32", "#/texts/33", "#/texts/34", "#/texts/35", "#/texts/36", "#/texts/38", "#/texts/39", "#/texts/40", "#/texts/41", "#/texts/42", "#/texts/43"], "page_nos": [], "uuid": "58390a46-387c-4e76-8b8a-f0a1ead94f67"}
{"doc_id": "2025__Impact_of_motor_symptom_asymmetry_on_non-motor_outcomes_in_Parkinsons_disease_a___W4411857849", "source_path": "<redacted:source_path>", "chunk_id": 1, "source_chunk_idxs": [3], "num_tokens": 262, "text": "Impact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nAbstract\nParkinson's disease (PD) presents with diverse symptoms, partly influenced by motor symptom asymmetry, which reflects hemispheric brain specialization. This systematic review of 80 studies explored how lateralized motor symptoms affect non-motor outcomes in PD, including cognition, emotion, and psychiatric health. Patients with right-sided motor symptoms (left-hemisphere pathology) show more global cognitive decline and higher dementia risk, while those with left-sided symptoms (right-hemisphere pathology) more often experience psychiatric issues like depression, anxiety, and impaired emotional recognition. Visuospatial deficits were consistently linked to left-sided symptoms, aligning with right-hemisphere dysfunction. Although findings vary across studies, this pattern suggests the relevance of brain lateralization in non-motor symptom assessment. Motor asymmetry may also affect treatment responses, such as deep brain stimulation outcomes. However, inconsistencies in study methods-definitions of asymmetry, motor subtypes, and comorbidities-limit meta-analytic conclusions. Overall, incorporating motor symptom asymmetry into PD diagnosis and treatment could enhance personalized care, warranting more standardized future research.", "doc_items_refs": ["#/texts/45"], "page_nos": [], "uuid": "5e11ccda-5379-43d4-8fe4-1cfd4362fd04"}
{"doc_id": "2025__Impact_of_motor_symptom_asymmetry_on_non-motor_outcomes_in_Parkinsons_disease_a___W4411857849", "source_path": "<redacted:source_path>", "chunk_id": 2, "source_chunk_idxs": [4, 5, 6, 7], "num_tokens": 411, "text": "Impact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nAbstract\nMotor symptom asymmetry predicts non-motor outcome and quality of life following STN DBS in Parkinson's disease\nArticle\nOpen access\n22 February 2022\n\nImpact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nAbstract\nLateralized effects of deep brain stimulation in Parkinson's disease: evidence and controversies\nArticle\nOpen access\n22 July 2021\n\nImpact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nAbstract\nImbalanced motivated behaviors according to motor sign asymmetry in drug-naïve Parkinson's disease\nArticle\nOpen access\n01 December 2023\n\nImpact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nIntroduction\nMotor symptoms in people living with Parkinson's disease (PwPD) (including resting tremor, bradykinesia, muscle rigidity, postural instability, and gait changes) typically affect one side of the body more than the other, and may eventually affect both sides of the body as the disease advances\n1\n. These asymmetries are generally associated with contralateral neurodegenerative patterns at the level of the basal ganglia (BG), measured through different imaging methods, in particular PET and DAT-SCAN\n2\n,\n3\n, but are less obvious using MRI\n4\n. Current literature lacks consensus regarding the underlying causes of motor symptom asymmetry in Parkinson's disease (PD), with various hypotheses proposed. These include histopathological mechanisms, genetic predispositions, motor practice, handedness, and the presence of structural lesions\n5\n. Moreover, the developmental trajectories of motor symptom (a)symmetry seem unclear, with some authors suggesting a persistence of asymmetry of motor symptoms over time, while others suggest a bilateralization of motor symptoms\n6\n,\n7\n,\n8\n.", "doc_items_refs": ["#/texts/48", "#/texts/49", "#/texts/50", "#/texts/52", "#/texts/53", "#/texts/54", "#/texts/56", "#/texts/57", "#/texts/58", "#/texts/60", "#/texts/61", "#/texts/62", "#/texts/63", "#/texts/64", "#/texts/65", "#/texts/66", "#/texts/67", "#/texts/68", "#/texts/69", "#/texts/70", "#/texts/71", "#/texts/72", "#/texts/73", "#/texts/74", "#/texts/75", "#/texts/76"], "page_nos": [], "uuid": "2383f7ef-c834-4815-8561-ea6afdc13082"}
{"doc_id": "2025__Impact_of_motor_symptom_asymmetry_on_non-motor_outcomes_in_Parkinsons_disease_a___W4411857849", "source_path": "<redacted:source_path>", "chunk_id": 3, "source_chunk_idxs": [8], "num_tokens": 512, "text": "Impact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nIntroduction\nWhile Braak et al.\n9\nmodel has overlooked motor symptom asymmetry as a potential variable for distinguishing distinct PD phenotypes, the recent α-Synuclein Origin and Connectome Model (SOC Model) proposed by Borghammer\n10\nsuggests the existence of two PD phenotypes based on motor symptom symmetry. Accordingly, the first so-called \"Brain-first\" phenotype would be characterized by disease development in subcortical regions, in particular in the olfactory bulb or amygdala, associated symptomatically to the presence of fewer autonomic symptoms, less Rapid Eye Movement (REM) sleep disorders, less hyposmia, as well as slower disease progression and cognitive decline; this phenotype is suggested to be more associated with lateralized motor symptoms and asymmetric dopaminergic denervation. The second phenotype, named \"Body-first PD\", characterized by pathologic processes in the enteric nervous system, would be symptomatically characterized by greater autonomic symptoms, more rapid disease progression, and cognitive decline. This latter phenotype would be more associated with symmetrical motor symptoms and equally symmetrical dopaminergic denervation\n11\n,\n12\n. A recent post-mortem study suggested a revision of the dual-hit SOC model, in particular, the Body-first phenotype (with a symmetrical onset of disease) would be more inclined to develop dementias, especially dementia with Lewy bodies\n13\n,\n14\n. Accordingly, and therefore, links are starting to be established between (a-)symmetry of motor symptoms and major cognitive impairments in PD. One of the limitations of the SOC model is that it does not specify if different expected profiles exist based on whether the disease begins on the left or right hemi-body, as well as on the spreading of pathology from one hemisphere to the other, inducing a bilateralization of the disease as described by Hobson\n1\n. Yet, studies in various neurodegenerative pathologies, but also healthy controls (HC), have consistently pointed to a greater vulnerability of the left hemisphere for neurodegenerative processes, supported by clinical, imaging, and pathogenetic evidence of cognitive decline\n15\n. In PD, data supporting a differential impact of the side of onset/asymmetry of motor symptoms on the evolutive profile are emerging\n16", "doc_items_refs": ["#/texts/77", "#/texts/78", "#/texts/79", "#/texts/80", "#/texts/81", "#/texts/82", "#/texts/83", "#/texts/84", "#/texts/85", "#/texts/86", "#/texts/87", "#/texts/88", "#/texts/89", "#/texts/90", "#/texts/91", "#/texts/92", "#/texts/93", "#/texts/94"], "page_nos": [], "uuid": "869c37cb-5549-4701-8c52-2e41889cc914"}
{"doc_id": "2025__Impact_of_motor_symptom_asymmetry_on_non-motor_outcomes_in_Parkinsons_disease_a___W4411857849", "source_path": "<redacted:source_path>", "chunk_id": 4, "source_chunk_idxs": [9], "num_tokens": 475, "text": "Impact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nIntroduction\n,\n17\n,\n18\n, reinforced by the results of a recent meta-analysis\n18\n. Some authors have even suggested that patients with predominantly right motor symptoms (RPD), as compared to patients with predominantly left motor symptoms (LPD), are at a higher risk of developing dementia associated with PD\n19\n,\n20\n. This hypothesis is supported by imaging studies: Starkstein and Leiguarda\n21\nobserved an association between RPD and contralateral brain atrophy, partially supported by Claassen et al.\n22\nwhose study revealed faster patterns of cerebral atrophy in the left hemisphere compared to the right but without a direct association with motor symptom asymmetry.\nConsidering motor symptom asymmetry seems of utmost importance given that this variable may not only have potential implications for the expression of motor symptoms\n5\n, non-motor symptoms\n5\n, and in fine survival rates\n23\n. That being said, the question of its impact, as well as distinct symptomatologic trajectories of right-dominant vs. left-dominant motor symptoms on non-motor symptoms in PD remains largely unanswered\n24\n,\n25\n. Three previous reviews of the literature evaluated the potential effects of motor symptom asymmetry (left vs. right) on neuropsychological performance\n24\n,\n25\n,\n26\n, showing no clear distinct patterns, although they did highlight that certain neuropsychological functions were specifically impaired in one or other of the subgroups. They suggested that this could be explained by cerebral lateralization of certain cognitive functions (e.g., verbal vs. visuo-spatial). These reviews focused mainly on neuropsychological deficits and very little on psychiatric aspects, none of them on emotional aspects (e.g., recognition and productive abilities). Moreover, none has systematically investigated the potential effects of interactions between pharmacological (e.g., dopaminergic replacement therapies [DRT]) or interventional therapies (e.g., deep brain stimulation [DBS]) and cognitive, psychiatric, and emotional symptoms. Finally, several methodological aspects of the studies included, which could have an influence on the interpretations, were not considered.", "doc_items_refs": ["#/texts/95", "#/texts/96", "#/texts/97", "#/texts/98", "#/texts/99", "#/texts/100", "#/texts/101", "#/texts/102", "#/texts/103", "#/texts/104", "#/texts/105", "#/texts/106", "#/texts/107", "#/texts/108", "#/texts/109", "#/texts/110", "#/texts/111", "#/texts/112", "#/texts/113", "#/texts/114", "#/texts/115", "#/texts/116", "#/texts/117", "#/texts/118", "#/texts/119", "#/texts/120", "#/texts/121", "#/texts/122", "#/texts/123", "#/texts/124", "#/texts/125", "#/texts/126"], "page_nos": [], "uuid": "1aece337-d0d1-4fd0-8c99-847eea73b5d9"}
{"doc_id": "2025__Impact_of_motor_symptom_asymmetry_on_non-motor_outcomes_in_Parkinsons_disease_a___W4411857849", "source_path": "<redacted:source_path>", "chunk_id": 5, "source_chunk_idxs": [10, 11], "num_tokens": 257, "text": "Impact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nIntroduction\nIn this context, the aim of this systematic review is threefold: (i) first, to provide a systematic review and synthesis of the literature on the impact of motor (a-)symmetry on psychiatric, cognitive and emotional disorders in PwPD, (ii) second, to explore the impact of various therapies such as DBS and/or DRT on these symptoms, (iii) third and finally, to discuss the relationship between the side of onset (left or right) in PD and the risk of developing dementia.\n\nImpact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nResults\nSelection and summary of the studies included in the review\nThe first stage of the research retrieved 11,092 articles and 50 previous citation studies. There was no time limit, and literature searches were conducted up to 3 April 2025. Two judges (PV and DG) independently evaluated the titles and abstracts, which made it possible to select 204 articles, which were then read in detail. In the end, 80 articles were selected for the review. Detailed data is shown in Fig.\n1\n.\nFig. 1", "doc_items_refs": ["#/texts/127", "#/texts/130", "#/texts/131", "#/texts/132", "#/texts/133"], "page_nos": [], "uuid": "5825b604-3a3c-4306-bc0a-df0ba037f632"}
{"doc_id": "2025__Impact_of_motor_symptom_asymmetry_on_non-motor_outcomes_in_Parkinsons_disease_a___W4411857849", "source_path": "<redacted:source_path>", "chunk_id": 6, "source_chunk_idxs": [12], "num_tokens": 286, "text": "Impact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nResults\nImpact of motor asymmetry on cognitive symptoms in PD\nComposite scales\nThe majority of studies (65 out of 80) using global cognitive efficiency scales (e.g., Mini Mental Scale Examination-MMSE\n27\n; Montreal Cognitive Assessment- MoCA\n28\n; Mattis Dementia Rating Scale-MDRS\n29\n; Dementia Rating Scale-DRS\n30\n; National Adult Reading Test-NART\n31\n; The SCales for Outcomes in PArkinson's disease-COGnition SCOPA-COG\n32\n) did not show significant differences between LPD and RPD patients, or between patient groups and healthy controls (HC). However, eight studies\n20\n,\n33\n,\n34\n,\n35\n,\n36\n,\n37\n,\n38\n,\n39\nfound reduced cognitive performance in RPD patients compared to LPD, while only two studies reported lower performance in LPD compared to HC\n37\n,\n38\n. These mixed results may stem from the fact that global cognitive scales are not sensitive enough to detect mild cognitive deficits within the PD spectrum\n40\n. Additionally, these tools are often used for screening in experimental protocols, leading to the exclusion of patients with pathological scores (e.g. refs.\n41\n,\n42\n). As results, these findings may not accurately reflect the variability of neuropsychological deficits based on motor symptom asymmetry.", "doc_items_refs": ["#/texts/136", "#/texts/137", "#/texts/138", "#/texts/139", "#/texts/140", "#/texts/141", "#/texts/142", "#/texts/143", "#/texts/144", "#/texts/145", "#/texts/146", "#/texts/147", "#/texts/148", "#/texts/149", "#/texts/150", "#/texts/151", "#/texts/152", "#/texts/153", "#/texts/154", "#/texts/155", "#/texts/156", "#/texts/157", "#/texts/158", "#/texts/159", "#/texts/160", "#/texts/161", "#/texts/162", "#/texts/163", "#/texts/164", "#/texts/165", "#/texts/166", "#/texts/167", "#/texts/168", "#/texts/169", "#/texts/170", "#/texts/171", "#/texts/172", "#/texts/173", "#/texts/174"], "page_nos": [], "uuid": "e9e3f9cb-7061-440a-b52a-9cb82369adca"}
{"doc_id": "2025__Impact_of_motor_symptom_asymmetry_on_non-motor_outcomes_in_Parkinsons_disease_a___W4411857849", "source_path": "<redacted:source_path>", "chunk_id": 7, "source_chunk_idxs": [13], "num_tokens": 512, "text": "Impact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nResults\nImpact of motor asymmetry on cognitive symptoms in PD\nComprehensive neuropsychological evaluation\nA smaller number of studies carried out comprehensive evaluations, although in the majority of studies, the neuropsychological protocols were not complete nor homogeneous, with a predominance for the evaluation of executive-attention functions (49/80 studies), and to a lesser extent memory functions (28/66 studies) and visuo-perceptive functions (22/80). In line with studies reporting significant results using composite scales, reduced cognitive performance in RPD patients has been documented, most often in comparison to LPD patients, and more consistently when compared to healthy controls. Results revealed that those deficits concerned intelligence scales, especially verbal Intellectual Quotient (IQ)\n43\n,\n44\n, long-term verbal memory\n16\n,\n21\n,\n35\n,\n43\n,\n45\n,\n46\n,\n47\n, language\n44\n,\n47\n,\n48\n,\n49\n, executive functions including mental flexibility, verbal fluency and working memory\n16\n,\n43\n,\n47\n,\n49\n,\n50\n,\n51\n,\n52\n, but also dynamic motor organization\n53\n, or perceptive errors of proprioceptive information\n42\n. That said, the results were not unanimous about the presence of greater neuropsychological deficits in RPD patients as compared to LPD patients, with studies revealing an absence of differences between LPD and RPD. Other authors, but in smaller scale, suggested higher deficits in LPD for executive functions, revealing reduced performances for working memory in LPD patients, but only if associated to depressed symptoms\n54\n, as well as reduced performances for mental flexibility\n37\n,\n55\n, working memory\n56\nand verbal fluency\n37\n. Finally, a minority of studies suggested impairments for verbal learning and episodic memory functions in LPD\n57\n,\n58\n,\n59\n, as well as for visuospatial episodic memory\n60\n. Concerning language, even if most of the studies suggested impairments in RPD patients, a minority of studies revealed more pronounced deficits in LPD patients\n61\n. This discrepancy could be explained by distinct language assessments, with Holtgraves et al.\n61\nassessing complex production, potentially requiring other cognitive processes. In contrast, for visuospatial functions (e.g., visual exploration, neglect, spatial relations) most of the literature suggested reduced performances in LPD patients\n47\n,\n57\n,\n59\n,\n60\n,\n62\n,\n63\n,", "doc_items_refs": ["#/texts/176", "#/texts/177", "#/texts/178", "#/texts/179", "#/texts/180", "#/texts/181", "#/texts/182", "#/texts/183", "#/texts/184", "#/texts/185", "#/texts/186", "#/texts/187", "#/texts/188", "#/texts/189", "#/texts/190", "#/texts/191", "#/texts/192", "#/texts/193", "#/texts/194", "#/texts/195", "#/texts/196", "#/texts/197", "#/texts/198", "#/texts/199", "#/texts/200", "#/texts/201", "#/texts/202", "#/texts/203", "#/texts/204", "#/texts/205", "#/texts/206", "#/texts/207", "#/texts/208", "#/texts/209", "#/texts/210", "#/texts/211", "#/texts/212", "#/texts/213", "#/texts/214", "#/texts/215", "#/texts/216", "#/texts/217", "#/texts/218", "#/texts/219", "#/texts/220", "#/texts/221", "#/texts/222", "#/texts/223", "#/texts/224", "#/texts/225", "#/texts/226", "#/texts/227", "#/texts/228", "#/texts/229", "#/texts/230", "#/texts/231", "#/texts/232", "#/texts/233", "#/texts/234", "#/texts/235", "#/texts/236", "#/texts/237", "#/texts/238", "#/texts/239", "#/texts/240", "#/texts/241", "#/texts/242", "#/texts/243", "#/texts/244", "#/texts/245", "#/texts/246", "#/texts/247", "#/texts/248", "#/texts/249", "#/texts/250", "#/texts/251", "#/texts/252", "#/texts/253", "#/texts/254"], "page_nos": [], "uuid": "393a8651-e286-449d-9926-9acc10b8deb2"}
{"doc_id": "2025__Impact_of_motor_symptom_asymmetry_on_non-motor_outcomes_in_Parkinsons_disease_a___W4411857849", "source_path": "<redacted:source_path>", "chunk_id": 8, "source_chunk_idxs": [14, 15], "num_tokens": 470, "text": "Impact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nResults\nImpact of motor asymmetry on cognitive symptoms in PD\nComprehensive neuropsychological evaluation\n64\n,\n65\n, as well as higher rates of exploration bias\n66\nand of unilateral spatial neglect\n41\n,\n67\n,\n68\n, while one study suggested similar performances for visuospatial functions between sub-groups\n69\n. In this context, despite these heterogeneous results for some neuropsychological functions, results potentially suggest the existence of distinct neuropsychological symptom profiles as a function of motor symptom asymmetry, with a tendency for studies evaluated to reveal more neuropsychological deficits in RPD, except for visuospatial measures, which would be more reduced in LPD.\n\nImpact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nResults\nImpact of motor asymmetry on cognitive symptoms in PD\nEffects of therapies on psychiatric symptoms as a function of motor symptom asymmetry\nRegarding the effect on cognitive symptoms as function of motor symptom asymmetry following PD-therapies, only a very small number of studies have taken an interest in this subject, with three studies evaluating the effects of DRT and five evaluating the effects of DBS\n46\n,\n51\n,\n70\n.\nConcerning DRT, Hanna-Pladdy et al.\n46\nhave demonstrated a beneficial effect on neuropsychological performance of DRT only in LPD, while RPD did not benefit, suggesting dissociated effects of DRT as a function of motor symptom asymmetry, the results of which remain to be confirmed. Moreover, Tomer et al.\n51\nhave also demonstrated specific relationships for cognitive performance between motor symptom asymmetry and dopaminergic medication, suggesting that relatively early in the disease progression, when dopamine depletion in the less-affected hemisphere remains mild, dopaminergic treatment optimized for motor symptoms may result in an over-medication of the less-affected hemisphere. Consequently, executive errors may reflect a hyperdopaminergic state that disrupts the functioning of the left hemisphere in LPD patients.", "doc_items_refs": ["#/texts/255", "#/texts/256", "#/texts/257", "#/texts/258", "#/texts/259", "#/texts/260", "#/texts/261", "#/texts/262", "#/texts/263", "#/texts/264", "#/texts/265", "#/texts/266", "#/texts/267", "#/texts/268", "#/texts/270", "#/texts/271", "#/texts/272", "#/texts/273", "#/texts/274", "#/texts/275", "#/texts/276", "#/texts/277", "#/texts/278", "#/texts/279", "#/texts/280", "#/texts/281"], "page_nos": [], "uuid": "a46a8f3f-1da2-41a0-ac17-148332e3237b"}
{"doc_id": "2025__Impact_of_motor_symptom_asymmetry_on_non-motor_outcomes_in_Parkinsons_disease_a___W4411857849", "source_path": "<redacted:source_path>", "chunk_id": 9, "source_chunk_idxs": [16], "num_tokens": 488, "text": "Impact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nResults\nImpact of motor asymmetry on cognitive symptoms in PD\nEffects of therapies on psychiatric symptoms as a function of motor symptom asymmetry\nConcerning DBS, Hershey et al.\n71\nevaluated the effects of unilateral STN-DBS (time\nmean\n= 16.2; time\nSD\n= 200 months post-DBS) on working memory depending on the hemisphere most affected, highlighting that when stimulating the hemisphere most affected (whether in LPD or RPD), there was a negative effect on performance. Of note, there was a significant difference between LPD and RPD, meaning that the effects were stronger when it was in patients with right hemisphere damage (LPD). Recently, three studies carried out by our group have explored the effects of STN-DBS (between 3 months and 60 months post-DBS) according to the asymmetry of motor symptoms on cognition\n20\n,\n39\n,\n52\n. Results revealed differential effects of DBS depending on the asymmetry of motor symptoms. Performance for executive functions was largely preserved in RPD patients, compared to the control group, at 3 months and 12 months post-DBS, with the exception of scores on the verbal executive task, where performance declined at 12 months post-DBS. On the other hand, the performance of LPD patients deteriorated post-operatively on nonverbal executive functions and on global cognitive efficiency, compared to the control group. Following this study, only one other study assessed cognitive performance one year post-DBS, but only with a global cognitive efficiency battery (in this case, the MDRS\n29\n), showing no differences between patient groups according to motor symptom asymmetry\n72\n. In the long-term (up to 60 months post-operatively), only one study has assessed the effect of the STN-DBS as function of motor symptom asymmetry\n20\n. This study, following STN-DBS surgery, specifically examined the hypothesis of more pronounced long-term cognitive decline in patients with RPD compared to those with LPD. Moreover, RPD patients had higher scores for self-reported apathy symptoms and lower scores for overall cognitive performance. Survival analyses revealed that only RPD patients exhibited subnormal performances for global cognitive efficiency.", "doc_items_refs": ["#/texts/282", "#/texts/283", "#/texts/284", "#/texts/285", "#/texts/286", "#/texts/287", "#/texts/288", "#/texts/289", "#/texts/290", "#/texts/291", "#/texts/292", "#/texts/293", "#/texts/294", "#/texts/295", "#/texts/296", "#/texts/297", "#/texts/298", "#/texts/299", "#/texts/300"], "page_nos": [], "uuid": "9acec9ea-3491-4204-9736-659d665ddb11"}
{"doc_id": "2025__Impact_of_motor_symptom_asymmetry_on_non-motor_outcomes_in_Parkinsons_disease_a___W4411857849", "source_path": "<redacted:source_path>", "chunk_id": 10, "source_chunk_idxs": [17], "num_tokens": 184, "text": "Impact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nResults\nImpact of motor asymmetry on cognitive symptoms in PD\nEffects of therapies on psychiatric symptoms as a function of motor symptom asymmetry\nFinally, Agosta et al.\n33\ndemonstrated that neurorehabilitation interventions can have dissociable effects on cognitive performance depending on motor symptom asymmetry. These findings suggest that different types of interventions may influence cognitive outcomes in Parkinson's disease, but in a subgroup-specific manner. In the same context, DeGutis et al.\n73\nhighlighted the effects of attentional training on motor functions, with particularly pronounced benefits observed in LPD patients, suggesting the involvement of specific underlying factors for rehabilitation. Replication studies are needed, whether in the context of dopaminergic treatment, DBS, or behavioral interventions.", "doc_items_refs": ["#/texts/301", "#/texts/302", "#/texts/303", "#/texts/304", "#/texts/305"], "page_nos": [], "uuid": "fa94076a-ed35-4cd0-b643-e940d9272724"}
{"doc_id": "2025__Impact_of_motor_symptom_asymmetry_on_non-motor_outcomes_in_Parkinsons_disease_a___W4411857849", "source_path": "<redacted:source_path>", "chunk_id": 11, "source_chunk_idxs": [18], "num_tokens": 453, "text": "Impact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nResults\nImpact of motor asymmetry on psychiatric symptoms in PD\nIn terms of psychiatric symptoms, most studies relied on self-assessment questionnaires, primarily evaluating depression (50 studies), anxiety (25 studies), and to a lesser extent, apathy (9 studies) and sleep disorders (11 studies), with psychosis assessed only once. Results indicated that patients with left predominant symptoms (LPD) exhibited more psychiatric symptoms compared to those with right predominant symptoms (RPD), who appeared less affected. Specifically, LPD patients showed increased depressive symptoms\n16\n,\n45\n,\n54\n,\n74\n,\n75\n,\n76\n,\n77\n, anxiety\n45\n,\n56\n,\n69\n,\n75\n,\n76\n, sleep disorders (including nocturnal hallucinations, disturbing dreams, and sleepiness)\n78\n,\n79\n,\n80\n, and psychosis\n35\n. A minority of studies reported higher rates of depression and anxiety in RPD patients\n51\n,\n79\n,\n81\n,\n82\n.\nIn contrast, RPD patients exhibited increased apathy\n19\n,\n52\n, magical ideation (i.e., belief that unrelated events are causally connected)\n56\n, sleep disorders\n83\n, hallucinations\n83\n, stress level\n19\n,\n79\n, and pathological gambling\n84\n. This suggests dissociated cerebral pathways for psychiatric symptoms, with anxio-depressive and sleep disturbance patterns prevalent in LPD patients, while apathy and gambling tendencies were more pronounced in RPD. Additionally, a recent study noted differing patterns of approach behavior, with LPD patients showing increased approach behavior, whereas avoidance behavior showed no differences between groups\n78\n. Some studies found no significant differences between LPD and RPD for various psychiatric symptoms\n42\n,\n44\n,\n48\n,\n53\n,\n57\n,\n72\n,\n73\n,\n85\n,\n86\n,\n87\n,\n88\n,\n89\n,\n90\n,\n91\n, while some studies revealed higher levels of symptoms (e.g., sleep disorders) in symmetric patients\n92\n. Most of these studies (70/80) were not cohort studies but involved selected patients with exclusion criteria for psychiatric symptoms, potentially introducing bias. In contrast, cohort studies, which include all patients, suggested significant differences\n16\n,\n35\n.", "doc_items_refs": ["#/texts/307", "#/texts/308", "#/texts/309", "#/texts/310", "#/texts/311", "#/texts/312", "#/texts/313", "#/texts/314", "#/texts/315", "#/texts/316", "#/texts/317", "#/texts/318", "#/texts/319", "#/texts/320", "#/texts/321", "#/texts/322", "#/texts/323", "#/texts/324", "#/texts/325", "#/texts/326", "#/texts/327", "#/texts/328", "#/texts/329", "#/texts/330", "#/texts/331", "#/texts/332", "#/texts/333", "#/texts/334", "#/texts/335", "#/texts/336", "#/texts/337", "#/texts/338", "#/texts/339", "#/texts/340", "#/texts/341", "#/texts/342", "#/texts/343", "#/texts/344", "#/texts/345", "#/texts/346", "#/texts/347", "#/texts/348", "#/texts/349", "#/texts/350", "#/texts/351", "#/texts/352", "#/texts/353", "#/texts/354", "#/texts/355", "#/texts/356", "#/texts/357", "#/texts/358", "#/texts/359", "#/texts/360", "#/texts/361", "#/texts/362", "#/texts/363", "#/texts/364", "#/texts/365", "#/texts/366", "#/texts/367", "#/texts/368", "#/texts/369", "#/texts/370", "#/texts/371", "#/texts/372", "#/texts/373", "#/texts/374", "#/texts/375", "#/texts/376", "#/texts/377", "#/texts/378", "#/texts/379", "#/texts/380", "#/texts/381", "#/texts/382", "#/texts/383", "#/texts/384", "#/texts/385", "#/texts/386", "#/texts/387", "#/texts/388", "#/texts/389", "#/texts/390", "#/texts/391", "#/texts/392", "#/texts/393", "#/texts/394", "#/texts/395", "#/texts/396", "#/texts/397", "#/texts/398", "#/texts/399", "#/texts/400"], "page_nos": [], "uuid": "4e0f058b-02ed-4b9d-bb24-5e96d015a83b"}
{"doc_id": "2025__Impact_of_motor_symptom_asymmetry_on_non-motor_outcomes_in_Parkinsons_disease_a___W4411857849", "source_path": "<redacted:source_path>", "chunk_id": 12, "source_chunk_idxs": [19], "num_tokens": 250, "text": "Impact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nResults\nImpact of motor asymmetry on psychiatric symptoms in PD\nEffects of therapies on psychiatric symptoms as a function of motor symptom asymmetry\nAs in the case of cognitive symptoms, only a few studies have assessed the effects of PD therapies on psychiatric symptoms (e.g., depression, anxiety, apathy). Interestingly, both short- and long-term studies have shown an impact of STN-DBS on depressive symptoms, anxiety, and apathy, with effects dissociated according to asymmetry\n20\n,\n39\n,\n52\n. In detail, these few studies seem to suggest a reduction in apathy and anxiety in RPD, while in LPD, a reduction in depression was observed. On the other hand, Bove et al.\n72\nfound no effect on depression. Long-term data suggest that patient groups tend to return to pre-DBS levels of psychiatric symptoms. As before, it is also important to bear in mind that psychiatric symptoms are part of the exclusion criteria for STN-DBS-type operations, thus inducing a recruitment bias for these studies.", "doc_items_refs": ["#/texts/402", "#/texts/403", "#/texts/404", "#/texts/405", "#/texts/406", "#/texts/407", "#/texts/408", "#/texts/409", "#/texts/410"], "page_nos": [], "uuid": "49419e20-bdd2-4217-83a2-d8eeb589b80e"}
{"doc_id": "2025__Impact_of_motor_symptom_asymmetry_on_non-motor_outcomes_in_Parkinsons_disease_a___W4411857849", "source_path": "<redacted:source_path>", "chunk_id": 13, "source_chunk_idxs": [20], "num_tokens": 281, "text": "Impact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nResults\nImpact of motor asymmetry on emotional abilities in PD\nEmotional processing as a function of motor symptom asymmetry\nIn terms of emotion abilities, the majority of studies have focused on emotion recognition abilities, in particular on the ability to recognize facial\n74\n,\n81\n,\n93\n,\n94\nor vocal\n37\n,\n39\n,\n50\n,\n93\n,\n95\nemotions. These studies highlighted reduced performance for emotion recognition abilities in LPD\n37\n,\n38\n,\n39\n,\n50\n,\n81\n,\n91\n,\n95\n,\n96\n, regardless of the valence of the emotions, with deficits for negative emotions (disgust\n50\n; anger\n50\n; sadness\n95\n), positive emotions (happiness)\n37\n,\n38\n,\n50\n, but also for the recognition of neutral stimuli\n39\n. Some studies showed no effects\n48\n,\n82\n,\n97\n, and others showed reduced performances at the same level in both groups as compared to healthy controls\n74\n,\n93\n,\n94\n, while only one study showed reduced abilities in RPD, but on measures of emotional valence of artworks\n55\n, not on stimuli with human characteristics. Concerning emotional production abilities, to date, only one study has assessed emotion production in facial modality, demonstrating, as in the case of recognition, alterations in LPD, in particular for the production of happiness and anger on patient's faces\n90\n.", "doc_items_refs": ["#/texts/413", "#/texts/414", "#/texts/415", "#/texts/416", "#/texts/417", "#/texts/418", "#/texts/419", "#/texts/420", "#/texts/421", "#/texts/422", "#/texts/423", "#/texts/424", "#/texts/425", "#/texts/426", "#/texts/427", "#/texts/428", "#/texts/429", "#/texts/430", "#/texts/431", "#/texts/432", "#/texts/433", "#/texts/434", "#/texts/435", "#/texts/436", "#/texts/437", "#/texts/438", "#/texts/439", "#/texts/440", "#/texts/441", "#/texts/442", "#/texts/443", "#/texts/444", "#/texts/445", "#/texts/446", "#/texts/447", "#/texts/448", "#/texts/449", "#/texts/450", "#/texts/451", "#/texts/452", "#/texts/453", "#/texts/454", "#/texts/455", "#/texts/456", "#/texts/457", "#/texts/458", "#/texts/459", "#/texts/460", "#/texts/461", "#/texts/462", "#/texts/463", "#/texts/464", "#/texts/465", "#/texts/466", "#/texts/467", "#/texts/468", "#/texts/469", "#/texts/470", "#/texts/471", "#/texts/472", "#/texts/473", "#/texts/474", "#/texts/475", "#/texts/476", "#/texts/477"], "page_nos": [], "uuid": "bc5e8a55-53a2-4a61-9523-1075aada3a6e"}
{"doc_id": "2025__Impact_of_motor_symptom_asymmetry_on_non-motor_outcomes_in_Parkinsons_disease_a___W4411857849", "source_path": "<redacted:source_path>", "chunk_id": 14, "source_chunk_idxs": [21, 22], "num_tokens": 422, "text": "Impact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nResults\nImpact of motor asymmetry on emotional abilities in PD\nEffects of therapies on emotional processing as a function of motor symptom asymmetry\nRegarding emotion recognition abilities, only one study\n39\nassessed changes following STN-DBS, finding that patients with LPD showed normalization in emotional prosody recognition three months postoperatively. This normalization was evident in ratings for neutral, happy, and angry stimuli\n39\n. In contrast, RPD patients exhibited a postoperative decline in recognizing emotional prosody, despite comparable preoperative performance to the control group. Notably, significant differences were observed postoperatively for the Fear recognition. As emotional deficits are not typically included in the exclusion criteria for STN-DBS, these results suggest that they could serve as a crucial metric for evaluating asymmetry effects on non-motor symptoms in pre- and post-DBS scenarios, free from selection bias. However, the limited number of studies necessitates further confirmation.\n\nImpact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nResults\nMethodological limitations of the reviewed studies\nThe systematic literature review highlights five main groups of limitations across the included studies: (i) heterogeneity in experimental designs and assessment tools, (ii) variability in patient socio-demographic and clinical characteristics, (iii) inconsistency in methods used to calculate motor symptom asymmetry, (iv) insufficient control of confounding variables such as gender, medication status, and motor symptom subtypes, and (v) lack of standardization in the reporting and interpretation of concomitant treatments. These limitations often overlap and compound one another, making it difficult to compare results across studies and draw robust, generalizable conclusions regarding non-motor symptom expression in PD. Addressing these issues will require more harmonized research protocols and more systematic consideration of clinically relevant variables.", "doc_items_refs": ["#/texts/479", "#/texts/480", "#/texts/481", "#/texts/482", "#/texts/483", "#/texts/485"], "page_nos": [], "uuid": "ef3f9256-44e9-46bb-98d8-8b4cb73397cf"}
{"doc_id": "2025__Impact_of_motor_symptom_asymmetry_on_non-motor_outcomes_in_Parkinsons_disease_a___W4411857849", "source_path": "<redacted:source_path>", "chunk_id": 15, "source_chunk_idxs": [23, 24], "num_tokens": 310, "text": "Impact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nResults\nMethodological limitations of the reviewed studies\nExperimental design and choices of tools\nMost studies employed a cross-sectional experimental design, with only a minority conducting longitudinal evaluations. As a result, observations are limited to group-level characteristics, whereas longitudinal studies allow for both group and individual-level analyses, revealing changes or developments over time. Additionally, assessment tools varied, with different tests/questionnaires used to measure similar functions, often lacking comparability in psychometric properties. Furthermore, most studies focused on comparing raw scores, rather than examining the prevalence of deficient performance, which may offer a more sensitive measure of group differences.\n\nImpact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nResults\nMethodological limitations of the reviewed studies\nPatient characteristics\nMost studies involved highly heterogeneous patient samples, particularly in terms of disease duration, which varied from diagnosis to several decades post-diagnosis. This variability was seen both between and within study samples, often with wide ranges or large standard deviations. Another key factor distinguishing studies is the presence of a control group. Studies that included a control group tended to show more sensitive results, with some detecting reduced performance in one subgroup compared to healthy controls, which wasn't apparent in patient-only comparisons. Additionally, certain studies considered other discriminant variables beyond asymmetry, such as motor symptom type\n58\nor gender\n17\n.", "doc_items_refs": ["#/texts/487", "#/texts/489", "#/texts/490", "#/texts/491", "#/texts/492", "#/texts/493"], "page_nos": [], "uuid": "01ebbf7f-6985-4941-92d2-8fadb0d35498"}
{"doc_id": "2025__Impact_of_motor_symptom_asymmetry_on_non-motor_outcomes_in_Parkinsons_disease_a___W4411857849", "source_path": "<redacted:source_path>", "chunk_id": 16, "source_chunk_idxs": [25], "num_tokens": 371, "text": "Impact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nResults\nMethodological limitations of the reviewed studies\nAsymmetry calculation\nOne significant limitation of these studies, both methodologically and conceptually, is the calculation of asymmetry. One common method uses the asymmetry index based on part III of the Unified Parkinson's Disease Rating Scale (UPDRS) motor items, subtracting left-side scores from right-side scores items\n16\n,\n20\n,\n37\n,\n38\n,\n39\n,\n52\n,\n72\n,\n78\n,\n98\n. Others use a standardized index [(Left UPDRS III symptoms-Right UPDRS III symptoms)/(Left UPDRS III symptoms + Right UPDRS III symptoms)]\n2\n,\n50\n,\n81\n. Some studies add thresholds (e.g., ±2) to define asymmetrical profiles, while others rely solely on the patient's reported side of onset\n51\n,\n59\n. This inconsistency leads to variability in results, with some studies focusing on objectively measured asymmetry, while others consider the magnitude or subjective perception of asymmetry. Recently, some researchers have assessed asymmetry using DAT-SCAN, a neuroimaging technique that measures basal ganglia (BG) denervation. They applied an asymmetry index for the striatum using the formula (asymmetry index = (right putamen - left putamen specific binding ratio (SBR))/(right putamen + left putamen specific binding ratio (SBR))), setting a 20% asymmetry threshold\n2\n,\n99\n,\n100\n. This suggests that patients with less than 20% asymmetry may have symmetrical pathology, a method not yet applied to motor symptoms. Kaasinen\n2", "doc_items_refs": ["#/texts/495", "#/texts/496", "#/texts/497", "#/texts/498", "#/texts/499", "#/texts/500", "#/texts/501", "#/texts/502", "#/texts/503", "#/texts/504", "#/texts/505", "#/texts/506", "#/texts/507", "#/texts/508", "#/texts/509", "#/texts/510", "#/texts/511", "#/texts/512", "#/texts/513", "#/texts/514", "#/texts/515", "#/texts/516", "#/texts/517", "#/texts/518", "#/texts/519", "#/texts/520", "#/texts/521", "#/texts/522", "#/texts/523", "#/texts/524", "#/texts/525", "#/texts/526", "#/texts/527", "#/texts/528", "#/texts/529", "#/texts/530"], "page_nos": [], "uuid": "ac09e65a-5160-4884-8519-2772941e1239"}
{"doc_id": "2025__Impact_of_motor_symptom_asymmetry_on_non-motor_outcomes_in_Parkinsons_disease_a___W4411857849", "source_path": "<redacted:source_path>", "chunk_id": 17, "source_chunk_idxs": [26, 27], "num_tokens": 438, "text": "Impact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nResults\nMethodological limitations of the reviewed studies\nAsymmetry calculation\nexplored the link between BG asymmetry and motor symptoms, finding that 8.1% of patients showed motor symptoms on the same side as BG denervation. DAT-SCAN-based asymmetry calculations focus on extreme asymmetry, facilitating the creation of a symmetrical group, while motor asymmetry using UPDRS lacks such thresholds. No study has established a motor-level cut-off for distinguishing symmetrical and asymmetrical groups. For instance, applying a 20% cut-off to UPDRS III could classify scores between +6 and −6 as symmetrical. Future studies comparing motor symmetry based on UPDRS-III with putamen dopaminergic asymmetry measured by DAT-SCAN are needed to address ongoing methodological debates.\n\nImpact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nResults\nMethodological limitations of the reviewed studies\nConfounding biological and clinical moderators (e.g., gender, symptom subtype, medication effects)\nAnother limitation of the presently reviewed studies is the high heterogeneity across samples and methodologies. This variability arises from several confounding factors that are often insufficiently controlled or inconsistently reported. Gender differences, for instance, have been shown to influence both the clinical presentation and progression of PD\n101\n, with men typically showing greater executive dysfunction and women more emotional dysregulation. Moreover, gender and motor symptom asymmetry may interact\n17\n. Similarly, dopaminergic medication status critically modulates cognitive and affective performance\n102\n,\n103\n, and the effects can vary depending on baseline dopamine levels in different brain regions, potentially leading to both improvements and impairments in function. Additionally, motor symptom subtypes, such as tremor-dominant versus akinetic-rigid presentations, are rarely analyzed as separate subgroups, despite evidence that they are associated with distinct cognitive and psychiatric profiles\n104\n.", "doc_items_refs": ["#/texts/531", "#/texts/533", "#/texts/534", "#/texts/535", "#/texts/536", "#/texts/537", "#/texts/538", "#/texts/539", "#/texts/540", "#/texts/541", "#/texts/542", "#/texts/543"], "page_nos": [], "uuid": "9b3f2bc0-4a28-40ec-91fa-50e73c7a7a08"}
{"doc_id": "2025__Impact_of_motor_symptom_asymmetry_on_non-motor_outcomes_in_Parkinsons_disease_a___W4411857849", "source_path": "<redacted:source_path>", "chunk_id": 18, "source_chunk_idxs": [28], "num_tokens": 180, "text": "Impact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nResults\nMethodological limitations of the reviewed studies\nInconsistent reporting of concomitant treatments and interacting pharmacological variables\nConcomitant medications, particularly antidepressants and anxiolytics, which are frequently prescribed in PD populations, can significantly alter cognitive and emotional processing\n105\n, yet their influence is rarely accounted for in study designs or statistical models. As a result, these methodological inconsistencies limit the comparability of findings and hinder the identification of robust, generalizable patterns in the cognitive, psychiatric, and emotional domains of PD as a function of motor symptom asymmetry. Future research would benefit from adopting more standardized assessment protocols and controlling for these key variables to clarify the true nature of non-motor symptom expression in PD.", "doc_items_refs": ["#/texts/545", "#/texts/546", "#/texts/547"], "page_nos": [], "uuid": "7cbba42d-9c47-44fe-a6b6-00ae60492a1a"}
{"doc_id": "2025__Impact_of_motor_symptom_asymmetry_on_non-motor_outcomes_in_Parkinsons_disease_a___W4411857849", "source_path": "<redacted:source_path>", "chunk_id": 19, "source_chunk_idxs": [29], "num_tokens": 368, "text": "Impact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nDiscussion\nThe objective of this article was to systematically review the literature on how motor symptom asymmetry in PD impacts non-motor symptoms. From diagnosis and possibly from the prodromal phase, distinct cognitive and psychiatric trajectories emerge based on motor symptom asymmetry. Patients with left-predominant motor symptoms (LPD), indicative of right-hemisphere dysfunction, are more likely to exhibit psychiatric symptoms such as anxiety, depression, emotional recognition deficits, and visuospatial impairments. In contrast, patients with right-predominant motor symptoms (RPD), reflecting left-hemisphere pathology, show a greater propensity for global cognitive decline, particularly in memory and executive functions, which may increase their risk of developing dementia over time. These lateralized patterns underscore the importance of considering hemispheric involvement when assessing non-motor symptoms in Parkinson's disease\n19\n,\n20\n.\nAsymmetry in motor symptoms not only influences the progression of PD but also interacts with therapies like DRT and DBS. The cognitive outcomes of DBS appear vary based on motor symptom asymmetry\n20\n,\n39\n,\n52\n,\n71\n. Patients with LPD may be more vulnerable to neuropsychological decline following DBS. However, they often exhibit improvements in psychiatric symptoms and emotional recognition\n39\n,\n98\n. Conversely, patients with RPD may be less prone to cognitive side effects but could experience a worsening of affective symptoms post-treatment\n20\n,\n52\n. Recent machine learning studies, offering a complementary approach to clinical data, have reinforced the hypothesis that in the context of DBS, motor symptom asymmetry is an important factor to consider\n106\n.", "doc_items_refs": ["#/texts/549", "#/texts/550", "#/texts/551", "#/texts/552", "#/texts/553", "#/texts/554", "#/texts/555", "#/texts/556", "#/texts/557", "#/texts/558", "#/texts/559", "#/texts/560", "#/texts/561", "#/texts/562", "#/texts/563", "#/texts/564", "#/texts/565", "#/texts/566", "#/texts/567", "#/texts/568", "#/texts/569", "#/texts/570", "#/texts/571", "#/texts/572"], "page_nos": [], "uuid": "6291a4cd-380c-42e8-8eb3-878176c8681b"}
{"doc_id": "2025__Impact_of_motor_symptom_asymmetry_on_non-motor_outcomes_in_Parkinsons_disease_a___W4411857849", "source_path": "<redacted:source_path>", "chunk_id": 20, "source_chunk_idxs": [30], "num_tokens": 380, "text": "Impact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nDiscussion\nRecent interest has grown in the relationship between motor symptom asymmetry and non-motor symptoms, revealing distinct patient phenotypes based on disease duration and treatment. RPD patients show pronounced deficits in memory, executive function, and language, likely linked to left hemisphere involvement in these cognitive tasks\n15\n. This hemispheric specialization may explain the variability observed in cognitive outcomes, particularly when patients are considered as a single group without being stratified based on asymmetry side or the symmetrical/asymmetrical nature of their pathology\n24\n,\n26\n. Conversely, LPD patients appear more susceptible to emotional and visuo-spatial processing deficits, aligning with the idea of right hemisphere lateralization for these functions. Moreover, LPD patients commonly report higher levels of anxiety and depressive symptoms, potentially indicating disruption of right hemisphere networks\n107\n,\n108\n. RPD patients seem more vulnerable to apathy, suggesting a link to long-term dementia risk\n19\n,\n20\n. Moreover, neuroimaging studies have identified distinct patterns of left hemispheric atrophy, either associated with motor symptom asymmetry\n109\nor occurring independently of it\n22\n. These findings suggest that left hemisphere atrophy in patients with PD may be linked to dementia, thereby supporting the hypothesis of a greater vulnerability to cognitive decline in patients with right-sided motor symptoms (RPD). Complementary evidence from biomarker studies has also shown higher concentrations of dementia-related biomarkers in RPD patients\n16\n,\n99\n. Another, non-mutually exclusive, hypothesis posits that the presence of bilateral motor symptoms may also act as a risk factor for cognitive deterioration\n10\n,\n14\n,\n110\n, without necessarily contradicting the specific contribution of left hemispheric vulnerability.", "doc_items_refs": ["#/texts/573", "#/texts/574", "#/texts/575", "#/texts/576", "#/texts/577", "#/texts/578", "#/texts/579", "#/texts/580", "#/texts/581", "#/texts/582", "#/texts/583", "#/texts/584", "#/texts/585", "#/texts/586", "#/texts/587", "#/texts/588", "#/texts/589", "#/texts/590", "#/texts/591", "#/texts/592", "#/texts/593", "#/texts/594", "#/texts/595", "#/texts/596", "#/texts/597", "#/texts/598", "#/texts/599", "#/texts/600", "#/texts/601"], "page_nos": [], "uuid": "cf171199-bb83-4eae-b315-d7e1481e084b"}
{"doc_id": "2025__Impact_of_motor_symptom_asymmetry_on_non-motor_outcomes_in_Parkinsons_disease_a___W4411857849", "source_path": "<redacted:source_path>", "chunk_id": 21, "source_chunk_idxs": [31], "num_tokens": 407, "text": "Impact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nDiscussion\nThe systematic review also highlights the emerging interest in how motor symptom asymmetry influences therapeutic management in PD, particularly concerning DBS. The findings suggest that the effects of STN-DBS on neuropsychological performance, psychiatric symptoms, and emotional processing vary based on motor symptom asymmetry\n20\n,\n39\n,\n52\n. Past studies on unilateral DBS may provide insights into these observations, revealing improved outcomes in the more affected hemisphere\n71\n. For instance, Hershey et al.\n71\nfound that unilateral stimulation of the most affected brain region yielded significant effects on working memory tasks, particularly for LPD patients, suggesting greater right hemisphere involvement. Similar findings regarding DRT indicate that LPD patients often show more significant improvements in cognitive functions compared to RPD patients\n46\n. This underscores the need for nuanced approaches to therapy based on the asymmetry of motor symptoms. However, this area of research remains in its infancy, necessitating further validation through longitudinal studies with larger cohorts.\nTo integrate the observed differences into a cohesive framework, we propose a theoretical model outlining the evolution of cognitive, psychiatric, and emotional symptoms based on motor symptom asymmetry (see Fig.\n2\n). This model visually synthesizes current evidence and illustrates two distinct trajectories emerging from the asymmetrical onset of motor symptoms. It also includes a schematic representation of cognitive symptom progression over time, highlighting the differing risks and profiles associated with right-versus left-sided motor onset. Importantly, the model emphasizes underexplored aspects, such as the role and evolution of symptomatology in patients with symmetrical motor presentations. By offering a comprehensive, asymmetry-informed perspective, this model complements traditional motor-focused frameworks and supports the development of more personalized clinical care strategies.\nFig. 2", "doc_items_refs": ["#/texts/602", "#/texts/603", "#/texts/604", "#/texts/605", "#/texts/606", "#/texts/607", "#/texts/608", "#/texts/609", "#/texts/610", "#/texts/611", "#/texts/612", "#/texts/613", "#/texts/614", "#/texts/615", "#/texts/616", "#/texts/617", "#/texts/618"], "page_nos": [], "uuid": "bd5b6b11-d81e-490b-8649-7b1bcb34ea06"}
{"doc_id": "2025__Impact_of_motor_symptom_asymmetry_on_non-motor_outcomes_in_Parkinsons_disease_a___W4411857849", "source_path": "<redacted:source_path>", "chunk_id": 22, "source_chunk_idxs": [32], "num_tokens": 462, "text": "Impact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nDiscussion\nAs extensively exposed in the Results section, significant methodological limitations exist in the studies reviewed, including heterogeneity in PD stages, socio-demographical characteristics, type of motor symptoms, medication, or psychometric tools. A lack of longitudinal evaluations, as well as epidemiological naturalistic follow-up (e.g., studies evaluating the evolution of symptoms, without exclusion/inclusion criteria's), further complicates our understanding of the relationship between non-motor symptoms and motor (a)symmetry. While motor symptom asymmetry likely contributes to performance variability, additional factors like gender may also play a crucial role in the manifestation of non-motor symptoms in PD\n17\n,\n111\n,\n112\n. In addition, although we analyzed cognitive, psychiatric, and emotional symptoms separately, it is not possible to rule out potential interactions among them, interactions that may reveal a much more complex clinical picture. While some of the referenced studies report elevated levels of depression and anxiety in patient populations, they often lack detailed information on medication use, which limits our ability to assess its impact on cognitive outcomes. Future research would benefit from incorporating standardized assessments of mood symptoms and medication to better disentangle the respective contributions of depression and neurodegenerative processes to cognitive decline.\nTo conclude, from diagnosis and possibly even in the prodromal phase, two distinct cognitive, psychiatric, and emotional trajectories are observed based on motor symptom asymmetry in PD, potentially affecting patients' daily quality of life. Patients with predominantly right motor symptoms (left brain alteration) tend to develop cognitive-apathetic non-motor symptoms and are at higher risk of long-term dementia. Conversely, patients with left motor symptoms (right brain alteration) are more likely to experience anxio-depressive symptoms, visuo-spatial disorders, and have a lower risk of developing dementia over time. These divergent profiles suggest a need to move beyond motor symptom classifications alone and consider asymmetry when tailoring interventions. Although the proposed model offers a promising structure for this purpose, further empirical validation is needed to refine and generalize its clinical relevance.", "doc_items_refs": ["#/texts/619", "#/texts/620", "#/texts/621", "#/texts/622", "#/texts/623", "#/texts/624", "#/texts/625", "#/texts/626"], "page_nos": [], "uuid": "a8989213-662a-462a-8eaa-8a14f7f4925f"}
{"doc_id": "2025__Impact_of_motor_symptom_asymmetry_on_non-motor_outcomes_in_Parkinsons_disease_a___W4411857849", "source_path": "<redacted:source_path>", "chunk_id": 23, "source_chunk_idxs": [33, 34], "num_tokens": 475, "text": "Impact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nMethods\nA literature review (not registrated) on published and reviewed articles was carried out until December 2023, using Web of Science (webofknowledge.com), based on PRISMA criteria with the following search items:\n((((((((((((((ALL\n=\n(Parkinson's disease)) OR ALL\n=\n(PD)) AND ALL\n=\n(motor asymmetry)) OR ALL\n=\n(lateralization)) OR ALL\n=\n(side of onset)) OR ALL\n=\n(hemi-park*)) OR ALL\n=\n(disconnect*)) AND ALL\n=\n(non-motor)) OR ALL\n=\n(NMS)))))))\n. Additional studies were subsequently extracted from the lists of references. The following exclusion criteria were applied during the data extraction process: (i) non-relevant topic; (ii) non-human studies; (iii) no mention of asymmetry/lateralization/side of onset/hemi-parkinsonism/disconnectivity; (iv) absence of non-motor assessment (cognition, psychiatry and/or emotion disorders); (v) not an original article (exclusion of reviews and meta-analysis). The objective was to extract from the studies the clinical data and socio-demographic characteristics of the evaluated patients (e.g., disease duration, asymmetry assessment, type of motor symptoms such as tremor, bradykinesia, or akinesia, specific anti-Parkinsonian medications, and other concomitant treatments, gender), the methodological characteristics of the studies (e.g., longitudinal or translational design), information on implemented therapies (e.g., DBS), as well as data on assessed non-motor symptoms (e.g., neuropsychological tests, psychiatric questionnaires or assessments). Tables\n1\n-\n3\n.\n\nImpact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nData availability\nAll data analysed is provided within the article (Tables\n1\n-\n3\n). Moreover, all data is available within article included in the systematic review.", "doc_items_refs": ["#/texts/628", "#/texts/629", "#/texts/630", "#/texts/631", "#/texts/632", "#/texts/633", "#/texts/634", "#/texts/635", "#/texts/636", "#/texts/637", "#/texts/638", "#/texts/639", "#/texts/640", "#/texts/641", "#/texts/642", "#/texts/643", "#/texts/644", "#/texts/645", "#/texts/646", "#/texts/647", "#/texts/648", "#/texts/649", "#/texts/650", "#/texts/651", "#/texts/652", "#/texts/654", "#/texts/655", "#/texts/656", "#/texts/657", "#/texts/658"], "page_nos": [], "uuid": "b110c29c-3928-4cab-bc0b-d96df1b3b977"}
{"doc_id": "2025__Impact_of_motor_symptom_asymmetry_on_non-motor_outcomes_in_Parkinsons_disease_a___W4411857849", "source_path": "<redacted:source_path>", "chunk_id": 24, "source_chunk_idxs": [35], "num_tokens": 507, "text": "Impact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nReferences\n1. Hobson, D. E. Asymmetry in parkinsonism, spreading pathogens and the nose.\nParkinsonism Relat. Disord.\n18\n, 1-9 (2012).\nArticle\nPubMed\nGoogle Scholar\n2. Kaasinen, V. Ipsilateral deficits of dopaminergic neurotransmission in Parkinson's disease.\nAnn. Clin. Transl. Neurol.\n3\n, 21-26 (2016).\nArticle\nCAS\nPubMed\nGoogle Scholar\n3. Kumakura, Y., Gjedde, A., Danielsen, E. H., Christensen, S. &amp; Cumming, P. Dopamine storage capacity in caudate and putamen of patients with early Parkinson's disease: correlation with asymmetry of motor symptoms.\nJ. Cereb. Blood Flow. Metab.\n26\n, 358-370 (2006).\nArticle\nCAS\nPubMed\nGoogle Scholar\n4. Gorell, J. et al. Increased iron-related MRI contrast in the substantia nigra in Parkinson's disease.\nNeurology\n45\n, 1138-1143 (1995).\n5. Djaldetti, R., Ziv, I. &amp; Melamed, E. The mystery of motor asymmetry in Parkinson's disease.\nLancet Neurol.\n5\n, 796-802 (2006).\nArticle\nPubMed\nGoogle Scholar\n6. Lee, C. et al. Patterns of asymmetry do not change over the course of idiopathic parkinsonism: implications for pathogenesis.\nNeurology\n45\n, 435-439 (1995).\n7. Morrish, P., Sawle, G. &amp; Brooks, D. Clinical and [18F] dopa PET findings in early Parkinson's disease.\nJ. Neurol. Neurosurg. Psychiatry\n59\n, 597-600 (1995).\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n8. Tatsch, K. et al. Relationship between clinical features of Parkinson's disease and presynaptic dopamine transporter binding assessed with [123 I] IPT and single-photon emission tomography.\nEur. J. Nucl. Med.\n24\n, 415-421 (1997).\nCAS\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/660", "#/texts/661", "#/texts/662", "#/texts/663", "#/texts/664", "#/texts/665", "#/texts/666", "#/texts/667"], "page_nos": [], "uuid": "eff4fb35-5326-4d3d-995c-cf0ce2459cb7"}
{"doc_id": "2025__Impact_of_motor_symptom_asymmetry_on_non-motor_outcomes_in_Parkinsons_disease_a___W4411857849", "source_path": "<redacted:source_path>", "chunk_id": 25, "source_chunk_idxs": [36], "num_tokens": 451, "text": "Impact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nReferences\n9. Braak, H., Rub, U. &amp; Del Tredici, K. Involvement of precerebellar nuclei in multiple system atrophy.\nNeuropathol. Appl. Neurobiol.\n29\n, 60-76 (2003).\nArticle\nCAS\nPubMed\nGoogle Scholar\n10. Borghammer, P. The α-synuclein origin and connectome model (SOC Model) of Parkinson's disease: explaining motor asymmetry, non-motor phenotypes, and cognitive decline.\nJ. Parkinson's Dis.\n11\n, 455-474 (2021).\nArticle\nCAS\nGoogle Scholar\n11. Knudsen, K. et al. Asymmetric dopaminergic dysfunction in brain-first versus body-first Parkinson's disease subtypes.\nJ. Parkinson's Dis.\n11\n, 1677-1687 (2021).\nArticle\nCAS\nGoogle Scholar\n12. Borghammer, P. The α-synuclein origin and connectome model (SOC Model) of parkinson's disease: explaining motor asymmetry, non-motor phenotypes, and cognitive decline.\nJ. Parkinson's Dis.\n11\n, 455 (2021).\nArticle\nCAS\nGoogle Scholar\n13. Borghammer, P. The brain-first vs. body-first model of Parkinson's disease with comparison to alternative models.\nJ. Neural Trans.\n130\n, 1-17 (2023).\n14. Borghammer, P. et al. A postmortem study suggests a revision of the dual-hit hypothesis of Parkinson's disease.\nnpj Parkinson's Dis.\n8\n, 166 (2022).\nArticle\nGoogle Scholar\n15. Lubben, N., Ensink, E., Coetzee, G. A. &amp; Labrie, V. The enigma and implications of brain hemispheric asymmetry in neurodegenerative diseases.\nBrain Commun.\n3\n, fcab211 (2021).\nArticle\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/668", "#/texts/669", "#/texts/670", "#/texts/671", "#/texts/672", "#/texts/673", "#/texts/674"], "page_nos": [], "uuid": "5aa96d27-d187-418a-a06f-7772803e614c"}
{"doc_id": "2025__Impact_of_motor_symptom_asymmetry_on_non-motor_outcomes_in_Parkinsons_disease_a___W4411857849", "source_path": "<redacted:source_path>", "chunk_id": 26, "source_chunk_idxs": [37], "num_tokens": 477, "text": "Impact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nReferences\n16. Voruz, P., Constantin, I. M. &amp; Péron, J. A. Biomarkers and non-motor symptoms as a function of motor symptom asymmetry in early Parkinson's disease.\nNeuropsychologia\n177\n, 108419 (2022).\nArticle\nPubMed\nGoogle Scholar\n17. Constantin, I. M., Voruz, P. &amp; Péron, J. A. Moderating effects of uric acid and sex on cognition and psychiatric symptoms in asymmetric Parkinson's disease.\nBiol. Sex. Differ.\n14\n, 1-11 (2023).\nArticle\nGoogle Scholar\n18. Coundouris, S. P. et al. A meta-analytic review of prospection deficits in Parkinson's disease.\nNeurosci. Biobehav. Rev.\n108\n, 34-47 (2020).\nArticle\nPubMed\nGoogle Scholar\n19. Harris, E., McNamara, P. &amp; Durso, R. Apathy in patients with Parkinson disease as a function of side of onset.\nJ. Geriatr. Psychiatry Neurol.\n26\n, 95-104 (2013).\nArticle\nPubMed\nGoogle Scholar\n20. Voruz, P. et al. Motor symptom asymmetry predicts cognitive and neuropsychiatric profile following deep brain stimulation of the subthalamic nucleus in Parkinson's disease: a 5-year longitudinal study.\nArch. Clin. Neuropsychol.\n38\n, 904-912 (2023).\n21. Starkstein, S. E. &amp; Leiguarda, R. Neuropsychological correlates of brain atrophy in Parkinson's disease: a CT-scan study.\nMov. Disord.\n8\n, 51-55 (1993).\nArticle\nCAS\nPubMed\nGoogle Scholar\n22. Claassen, D. O. et al. Cortical asymmetry in Parkinson's disease: early susceptibility of the left hemisphere.\nBrain Behav.\n6\n, e00573 (2016).\nArticle\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/675", "#/texts/676", "#/texts/677", "#/texts/678", "#/texts/679", "#/texts/680", "#/texts/681"], "page_nos": [], "uuid": "9c913940-0ef7-476e-984c-5fcc96487d73"}
{"doc_id": "2025__Impact_of_motor_symptom_asymmetry_on_non-motor_outcomes_in_Parkinsons_disease_a___W4411857849", "source_path": "<redacted:source_path>", "chunk_id": 27, "source_chunk_idxs": [38], "num_tokens": 485, "text": "Impact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nReferences\n23. Elbaz, A. et al. Survival study of Parkinson disease in Olmsted County, Minnesota.\nArch. Neurol.\n60\n, 91-96 (2003).\nArticle\nPubMed\nGoogle Scholar\n24. Riederer, P. et al. Lateralisation in Parkinson disease.\nCell tissue Res.\n373\n, 297-312 (2018).\nArticle\nCAS\nPubMed\nGoogle Scholar\n25. Steinbach, M. J., Campbell, R. W., DeVore, B. B. &amp; Harrison, D. W. Laterality in Parkinson's disease: a neuropsychological review.\nAppl. Neuropsychol. Adult\n30\n, 126-140 (2023).\nArticle\nPubMed\nGoogle Scholar\n26. Verreyt, N., Nys, G. M., Santens, P. &amp; Vingerhoets, G. Cognitive differences between patients with left-sided and right-sided Parkinson's disease. A review.\nNeuropsychol. Rev.\n21\n, 405-424 (2011).\nArticle\nPubMed\nGoogle Scholar\n27. Tombaugh, T., McDowell, I., Kristjansson, B. &amp; Hubley, A. Mini-Mental State Examination (MMSE) and the Modified MMSE (3MS): a psychometric comparison and normative data.\nPsychol. Assess.\n8\n, 48 (1996).\nArticle\nGoogle Scholar\n28. Nasreddine, Z. S. et al. The Montreal Cognitive Assessment, MoCA: a brief screening tool for mild cognitive impairment.\nJ. Am. Geriatrics Soc.\n53\n, 695-699 (2005).\nArticle\nGoogle Scholar\n29. Lucas, J. A. et al. Normative data for the Mattis dementia rating scale.\nJ. Clin. Exp. Neuropsychol.\n20\n, 536-547 (1998).\nArticle\nCAS\nPubMed\nGoogle Scholar\n30. Brown, G. G. et al. Validity of the Dementia Rating Scale in assessing cognitive function in Parkinson's disease.\nJ. Geriatr. Psychiatry Neurol.\n12\n, 180-188 (1999).\nArticle\nCAS\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/682", "#/texts/683", "#/texts/684", "#/texts/685", "#/texts/686", "#/texts/687", "#/texts/688", "#/texts/689"], "page_nos": [], "uuid": "977956a7-2b13-46af-9f37-b4119fe3830d"}
{"doc_id": "2025__Impact_of_motor_symptom_asymmetry_on_non-motor_outcomes_in_Parkinsons_disease_a___W4411857849", "source_path": "<redacted:source_path>", "chunk_id": 28, "source_chunk_idxs": [39], "num_tokens": 488, "text": "Impact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nReferences\n31. Nelson, H. &amp; Willison, J. National adult reading test (NART) manual.\nWindsor, Berkshire, UK : NFER-Nelson\n(1982).\n32. Serrano-Dueñas, M., Calero, B., Serrano, S., Serrano, M. &amp; Coronel, P. Metric properties of the mini-mental Parkinson and SCOPA-COG scales for rating cognitive deterioration in Parkinson's disease.\nMov. Disord.\n25\n, 2555-2562 (2010).\nArticle\nPubMed\nGoogle Scholar\n33. Agosta, S. et al. Lateralized cognitive functions in Parkinson's patients: a behavioral approach for the early detection of sustained attention deficits.\nBrain Res.\n1726\n, 146486 (2020).\nArticle\nCAS\nPubMed\nGoogle Scholar\n34. Cooper, C. et al. Does laterality of motor impairment tell us something about cognition in Parkinson disease?.\nParkinsonism Relat. Disord.\n15\n, 315-317 (2009).\nArticle\nCAS\nPubMed\nGoogle Scholar\n35. Cubo, E. et al. Motor laterality asymmetry and nonmotor symptoms in Parkinson's disease.\nMov. Disord.\n25\n, 70-75 (2010).\nArticle\nPubMed\nGoogle Scholar\n36. Harris, E., McNamara, P. &amp; Durso, R. Novelty seeking in patients with right-versus left-onset Parkinson disease.\nCogn. Behav. Neurol.\n28\n, 11-16 (2015).\nArticle\nPubMed\nGoogle Scholar\n37. Stirnimann, N. et al. Hemispheric specialization of the basal ganglia during vocal emotion decoding: Evidence from asymmetric Parkinson's disease and 18FDG PET.\nNeuropsychologia\n119\n, 1-11 (2018).\nArticle\nPubMed\nGoogle Scholar\n38. Thomasson, M. et al. Crossed functional specialization between the basal ganglia and cerebellum during vocal emotion decoding: insights from stroke and Parkinson's disease.\nCogn. Affect. Behav. Neurosci.\n22\n, 1030-1043 (2022).\nArticle\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/690", "#/texts/691", "#/texts/692", "#/texts/693", "#/texts/694", "#/texts/695", "#/texts/696", "#/texts/697"], "page_nos": [], "uuid": "98b51e1e-ed3f-4073-8a12-44629ea7966d"}
{"doc_id": "2025__Impact_of_motor_symptom_asymmetry_on_non-motor_outcomes_in_Parkinsons_disease_a___W4411857849", "source_path": "<redacted:source_path>", "chunk_id": 29, "source_chunk_idxs": [40], "num_tokens": 497, "text": "Impact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nReferences\n39. Voruz, P. et al. Motor symptom asymmetry in Parkinson's disease predicts emotional outcome following subthalamic nucleus deep brain stimulation.\nNeuropsychologia\n144\n, 107494 (2020).\nArticle\nPubMed\nGoogle Scholar\n40. Skorvanek, M. et al. Global scales for cognitive screening in Parkinson's disease: critique and recommendations.\nMov. Disord.\n33\n, 208-218 (2018).\nArticle\nPubMed\nGoogle Scholar\n41. Nys, G. M., Santens, P. &amp; Vingerhoets, G. Horizontal and vertical attentional orienting in Parkinson's disease.\nBrain Cogn.\n74\n, 179-185 (2010).\nArticle\nPubMed\nGoogle Scholar\n42. Smith, J. et al. Motor asymmetry and estimation of body-scaled aperture width in Parkinson's disease.\nNeuropsychologia\n49\n, 3002-3010 (2011).\nArticle\nCAS\nPubMed\nGoogle Scholar\n43. Huber, S. J., Miller, H., Bohaska, L., Christy, J. A. &amp; Bornstein, R. A. Asymmetrical cognitive differences associated with hemiparkinsonism.\nArch. Clin. Neuropsychol.\n7\n, 471-480 (1992).\nArticle\nCAS\nPubMed\nGoogle Scholar\n44. Mohr, E. et al. Neuropsychological and glucose metabolic profiles in asymmetric Parkinson's disease.\nCan. J. Neurol. Sci.\n19\n, 163-169 (1992).\nArticle\nCAS\nPubMed\nGoogle Scholar\n45. Foster, P. S. et al. Anxiety affects working memory only in left hemibody onset Parkinson disease patients.\nCogn. Behav. Neurol.\n23\n, 14-18 (2010).\nArticle\nPubMed\nGoogle Scholar\n46. Hanna-Pladdy, B., Pahwa, R. &amp; Lyons, K. E. Paradoxical effect of dopamine medication on cognition in Parkinson's disease: relationship to side of motor onset.\nJ. Int. Neuropsychol. Soc.\n21\n, 259-270 (2015).\nArticle\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/698", "#/texts/699", "#/texts/700", "#/texts/701", "#/texts/702", "#/texts/703", "#/texts/704", "#/texts/705"], "page_nos": [], "uuid": "54838849-19b8-4d53-9138-2558e15c67e5"}
{"doc_id": "2025__Impact_of_motor_symptom_asymmetry_on_non-motor_outcomes_in_Parkinsons_disease_a___W4411857849", "source_path": "<redacted:source_path>", "chunk_id": 30, "source_chunk_idxs": [41], "num_tokens": 459, "text": "Impact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nReferences\n47. Starkstein, S., Leiguarda, R., Gershanik, O. &amp; Berthier, M. Neuropsychological disturbances in hemiparkinson's disease.\nNeurology\n37\n, 1762-1762 (1987).\nArticle\nCAS\nPubMed\nGoogle Scholar\n48. Blonder, L. X., Gur, R. E. &amp; Gur, R. C. The effects of right and left hemiparkinsonism on prosody.\nBrain Lang.\n36\n, 193-207 (1989).\nArticle\nCAS\nPubMed\nGoogle Scholar\n49. Spicer, K. B., Roberts, R. J. &amp; LeWitt, P. A. Neuropsychological performance in lateralized parkinsonism.\nArch. Neurol.\n45\n, 429-432 (1988).\nArticle\nCAS\nPubMed\nGoogle Scholar\n50. Garrido-Vásquez, P. et al. An ERP study of vocal emotion processing in asymmetric Parkinson's disease.\nSoc. Cogn. Affect. Neurosci.\n8\n, 918-927 (2013).\nArticle\nPubMed\nGoogle Scholar\n51. Tomer, R., Aharon-Peretz, J. &amp; Tsitrinbaum, Z. Dopamine asymmetry interacts with medication to affect cognition in Parkinson's disease.\nNeuropsychologia\n45\n, 357-367 (2007).\nArticle\nPubMed\nGoogle Scholar\n52. Voruz, P. et al. Motor symptom asymmetry predicts non-motor outcome and quality of life following STN DBS in Parkinson's disease.\nSci. Rep.\n12\n, 3007 (2022).\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n53. Finali, G., Piccirilli, M. &amp; Rizzuto, S. Neuropsychological characteristics of parkinsonian patients with lateralized motor impairment.\nJ. Neural. Transm.\n9\n, 165-176 (1995).\nArticle\nCAS\nGoogle Scholar", "doc_items_refs": ["#/texts/706", "#/texts/707", "#/texts/708", "#/texts/709", "#/texts/710", "#/texts/711", "#/texts/712"], "page_nos": [], "uuid": "70faed2f-c630-4c47-ae59-22470d5fb863"}
{"doc_id": "2025__Impact_of_motor_symptom_asymmetry_on_non-motor_outcomes_in_Parkinsons_disease_a___W4411857849", "source_path": "<redacted:source_path>", "chunk_id": 31, "source_chunk_idxs": [42], "num_tokens": 493, "text": "Impact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nReferences\n54. Foster, P. S., Yung, R. C., Drago, V., Crucian, G. P. &amp; Heilman, K. M. Working memory in Parkinson's disease: the effects of depression and side of onset of motor symptoms.\nNeuropsychology\n27\n, 303 (2013).\nArticle\nPubMed\nGoogle Scholar\n55. Ciccarelli, N. et al. Emotional valence may influence memory performance for visual artworks in Parkinson's disease.\nNeurol. Sci.\n40\n, 2175-2178 (2019).\nArticle\nPubMed\nGoogle Scholar\n56. Modestino, E. J., Amenechi, C., Reinhofer, A. &amp; O'Toole, P. Side-of-onset of Parkinson's disease in relation to neuropsychological measures.\nBrain Behav.\n7\n, e00590 (2017).\nArticle\nPubMed\nGoogle Scholar\n57. Karádi, K. et al. Visuospatial impairment in Parkinson's disease: the role of laterality.\nLaterality Asymmetries Body Brain Cogn.\n20\n, 112-127 (2015).\nArticle\nGoogle Scholar\n58. Katzen, H. L., Levin, B. E. &amp; Weiner, W. Side and type of motor symptom influence cognition in Parkinson's disease.\nMov. Disord. Off. J. Mov. Disord. Soc.\n21\n, 1947-1953 (2006).\nArticle\nGoogle Scholar\n59. Tomer, R., Levin, B. E. &amp; Weiner, W. J. Side of onset of motor symptoms influences cognition in Parkinson's disease.\nAnn. Neurol. Off. J. Am. Neurol. Assoc. Child Neurol. Soc.\n34\n, 579-584 (1993).\nCAS\nGoogle Scholar\n60. Amick, M., Grace, J. &amp; Chou, K. Body side of motor symptom onset in Parkinson's disease is associated with memory performance.\nJ. Int. Neuropsychol. Soc.\n12\n, 736-740 (2006).\nArticle\nCAS\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/713", "#/texts/714", "#/texts/715", "#/texts/716", "#/texts/717", "#/texts/718", "#/texts/719"], "page_nos": [], "uuid": "7c0d36eb-4c64-4d45-af08-09092b81a1a2"}
{"doc_id": "2025__Impact_of_motor_symptom_asymmetry_on_non-motor_outcomes_in_Parkinsons_disease_a___W4411857849", "source_path": "<redacted:source_path>", "chunk_id": 32, "source_chunk_idxs": [43], "num_tokens": 503, "text": "Impact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nReferences\n61. Holtgraves, T., McNamara, P., Cappaert, K. &amp; Durso, R. Linguistic correlates of asymmetric motor symptom severity in Parkinson's disease.\nBrain Cogn.\n72\n, 189-196 (2010).\nArticle\nPubMed\nGoogle Scholar\n62. Agniel, A. et al. Cognition and cerebral blood flow in lateralised Parkinsonism: lack of functional lateral asymmetries.\nJ. Neurol. Neurosurg. Psychiatry\n54\n, 783-786 (1991).\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n63. Davidsdottir, S., Cronin-Golomb, A. &amp; Lee, A. Visual and spatial symptoms in Parkinson's disease.\nVis. Res.\n45\n, 1285-1296 (2005).\nArticle\nPubMed\nGoogle Scholar\n64. Ren, X. et al. Veering in hemi-Parkinson's disease: primacy of visual over motor contributions.\nVis. Res.\n115\n, 119-127 (2015).\nArticle\nPubMed\nGoogle Scholar\n65. Schendan, H. E., Amick, M. M. &amp; Cronin-Golomb, A. Role of a lateralized parietal-basal ganglia circuit in hierarchical pattern perception: evidence from Parkinson's disease.\nBehav. Neurosci.\n123\n, 125 (2009).\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n66. Ebersbach, G. et al. Directional bias of initial visual exploration: a symptom of neglect in Parkinson's disease.\nBrain\n119\n, 79-87 (1996).\nArticle\nPubMed\nGoogle Scholar\n67. Lee, A., Harris, J., Atkinson, E. &amp; Fowler, M. Evidence from a line bisection task for visuospatial neglect in left hemiparkinson's disease.\nVis. Res.\n41\n, 2677-2686 (2001).\nArticle\nCAS\nPubMed\nGoogle Scholar\n68. Villardita, C., Smirni, P. &amp; Zappalà, G. Visual neglect in Parkinson's disease.\nArch. Neurol.\n40\n, 737-739 (1983).\nArticle\nCAS\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/720", "#/texts/721", "#/texts/722", "#/texts/723", "#/texts/724", "#/texts/725", "#/texts/726", "#/texts/727"], "page_nos": [], "uuid": "4c4011db-8dd5-4134-9f61-646714b9bb13"}
{"doc_id": "2025__Impact_of_motor_symptom_asymmetry_on_non-motor_outcomes_in_Parkinsons_disease_a___W4411857849", "source_path": "<redacted:source_path>", "chunk_id": 33, "source_chunk_idxs": [44], "num_tokens": 500, "text": "Impact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nReferences\n69. Kurlawala, Z., Shadowen, P. H., McMillan, J. D., Beverly, L. J. &amp; Friedland, R. P. Progression of nonmotor symptoms in Parkinson's disease by sex and motor laterality.\nParkinson's Dis.\n2021\n, 8898887 (2021).\nGoogle Scholar\n70. Voruz, P. et al. Differential effects of disease duration and dopaminergic replacement therapy on vocal emotion recognition in asymmetric Parkinson's disease.\nNeurodegener. Dis.\n24\n, 129-140 (2025).\nArticle\nGoogle Scholar\n71. Hershey, T. et al. Unilateral vs. bilateral STN DBS effects on working memory and motor function in Parkinson disease.\nExp. Neurol.\n210\n, 402-408 (2008).\nArticle\nCAS\nPubMed\nGoogle Scholar\n72. Bove, F. et al. Does motor symptoms asymmetry predict motor outcome of subthalamic deep brain stimulation in Parkinson's disease patients?.\nFront. Hum. Neurosci.\n16\n, 931858 (2022).\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n73. DeGutis, J. et al. Side of motor symptom onset predicts sustained attention deficits and motor improvements after attention training in Parkinson's disease.\nNeuropsychologia\n190\n, 108698 (2023).\nArticle\nPubMed\nGoogle Scholar\n74. Clark, U. S., Neargarder, S. &amp; Cronin-Golomb, A. Specific impairments in the recognition of emotional facial expressions in Parkinson's disease.\nNeuropsychologia\n46\n, 2300-2309 (2008).\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n75. Fleminger, S. Left-sided Parkinson's disease is associated with greater anxiety and depression.\nPsychol. Med.\n21\n, 629-638 (1991).\nArticle\nCAS\nPubMed\nGoogle Scholar\n76. Foster, P. S. et al. Anxiety and depression severity are related to right but not left onset Parkinson's disease duration.\nJ. Neurol. Sci.\n305\n, 131-135 (2011).\nArticle\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/728", "#/texts/729", "#/texts/730", "#/texts/731", "#/texts/732", "#/texts/733", "#/texts/734", "#/texts/735"], "page_nos": [], "uuid": "d4dba665-b470-440d-8d9e-e7038a75a246"}
{"doc_id": "2025__Impact_of_motor_symptom_asymmetry_on_non-motor_outcomes_in_Parkinsons_disease_a___W4411857849", "source_path": "<redacted:source_path>", "chunk_id": 34, "source_chunk_idxs": [45], "num_tokens": 498, "text": "Impact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nReferences\n77. Pellicano, C. et al. Neuropsychiatric and cognitive symptoms and body side of onset of Parkinsonism in unmedicated Parkinson's disease patients.\nParkinsonism Relat. Disord.\n21\n, 1096-1100 (2015).\nArticle\nPubMed\nGoogle Scholar\n78. Béreau, M. et al. Imbalanced motivated behaviors according to motor sign asymmetry in drug-naïve Parkinson's disease.\nSci. Rep.\n13\n, 21234 (2023).\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n79. Stavitsky, K. et al. Hallucinations, dreaming and frequent dozing in Parkinson's disease: Impact of right-hemisphere neural networks.\nCogn. Behav. Neurol. Off. J. Soc. Behav. Cogn. Neurol.\n21\n, 143 (2008).\nArticle\nGoogle Scholar\n80. Zhu, S. et al. The association between clinical characteristics and motor symptom laterality in patients with Parkinson's disease.\nFront. Neurol.\n12\n, 663232 (2021).\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n81. Garrido-Vásquez, P., Pell, M. D., Paulmann, S., Sehm, B. &amp; Kotz, S. A. Impaired neural processing of dynamic faces in left-onset Parkinson's disease.\nNeuropsychologia\n82\n, 123-133 (2016).\nArticle\nPubMed\nGoogle Scholar\n82. St. Clair, J., Borod, J. C., Sliwinski, M., Cote, L. J. &amp; Stern, Y. Cognitive and affective functioning in Parkinson's disease patients with lateralized motor signs.\nJ. Clin. Exp. Neuropsychol.\n20\n, 320-327 (1998).\nArticle\nGoogle Scholar\n83. Rodríguez-Violante, M., Cervantes-Arriaga, A., Villar-Velarde, A. &amp; Corona, T. Relationship between the type and side of motor symptoms with the prevalence of non-motor symptoms in Parkinson's disease.\nNeurología\n26\n, 319-324 (2011).\nArticle\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/736", "#/texts/737", "#/texts/738", "#/texts/739", "#/texts/740", "#/texts/741", "#/texts/742"], "page_nos": [], "uuid": "89b62c38-9f3c-4f86-95fa-0036e28b4a7d"}
{"doc_id": "2025__Impact_of_motor_symptom_asymmetry_on_non-motor_outcomes_in_Parkinsons_disease_a___W4411857849", "source_path": "<redacted:source_path>", "chunk_id": 35, "source_chunk_idxs": [46], "num_tokens": 448, "text": "Impact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nReferences\n84. Voon, V. et al. Factors associated with dopaminergic drug-related pathological gambling in Parkinson disease.\nArch. Neurol.\n64\n, 212-216 (2007).\nArticle\nPubMed\nGoogle Scholar\n85. Adwani, S., Yadav, R., Kumar, K., Chandra, S. &amp; Pal, P. K. Neuropsychological profile in early Parkinson's disease: Comparison between patients with right side onset versus left side onset of motor symptoms.\nAnn. Indian Acad. Neurol.\n19\n, 74 (2016).\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n86. Barber, J., Tomer, R., Sroka, H. &amp; Myslobodsky, M. S. Does unilateral dopamine deficit contribute to depression?.\nPsychiatry Res.\n15\n, 17-24 (1985).\nArticle\nCAS\nPubMed\nGoogle Scholar\n87. Direnfeld, L. K. et al. Parkinson's disease: the possible relationship of laterality to dementia and neurochemical findings.\nArch. Neurol.\n41\n, 935-941 (1984).\nArticle\nCAS\nPubMed\nGoogle Scholar\n88. Elkurd, M., Wang, J. &amp; Dewey, R. B. Jr Lateralization of motor signs affects symptom progression in Parkinson disease.\nFront. Neurol.\n12\n, 711045 (2021).\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n89. Poletti, M. et al. The relationship between motor symptom lateralization and cognitive performance in newly diagnosed drug-naïve patients with Parkinson's disease.\nJ. Clin. Exp. Neuropsychol.\n35\n, 124-131 (2013).\nArticle\nPubMed\nGoogle Scholar\n90. Ratajska, A. M. et al. Laterality of motor symptom onset and facial expressivity in Parkinson disease using face digitization.\nLaterality\n27\n, 57-70 (2022).\nArticle\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/743", "#/texts/744", "#/texts/745", "#/texts/746", "#/texts/747", "#/texts/748", "#/texts/749"], "page_nos": [], "uuid": "702d2c83-d0a4-4ae1-8866-badd02f0ddc0"}
{"doc_id": "2025__Impact_of_motor_symptom_asymmetry_on_non-motor_outcomes_in_Parkinsons_disease_a___W4411857849", "source_path": "<redacted:source_path>", "chunk_id": 36, "source_chunk_idxs": [47], "num_tokens": 505, "text": "Impact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nReferences\n91. Yuvaraj, R. &amp; Murugappan, M. Hemispheric asymmetry non-linear analysis of EEG during emotional responses from idiopathic Parkinson's disease patients.\nCogn. Neurodyn.\n10\n, 225-234 (2016).\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n92. Hansen, F. O. et al. Non-motor asymmetry and dopamine degeneration in Parkinson's disease.\nBrain Commun.\n7\n, fcaf002 (2025).\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n93. Buxton, S. L., MacDonald, L. &amp; Tippett, L. J. Impaired recognition of prosody and subtle emotional facial expressions in Parkinson's disease.\nBehav. Neurosci.\n127\n, 193 (2013).\nArticle\nPubMed\nGoogle Scholar\n94. Clark, U. S., Neargarder, S. &amp; Cronin-Golomb, A. Visual exploration of emotional facial expressions in Parkinson's disease.\nNeuropsychologia\n48\n, 1901-1913 (2010).\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n95. Ventura, M. I. et al. Hemispheric asymmetries and prosodic emotion recognition deficits in Parkinson's disease.\nNeuropsychologia\n50\n, 1936-1945 (2012).\nArticle\nPubMed\nGoogle Scholar\n96. Yuvaraj, R., Murugappan, M. &amp; Palaniappan, R. The effect of lateralization of motor onset and emotional recognition in PD patients using EEG.\nBrain Topogr.\n30\n, 333-342 (2017).\nArticle\nCAS\nPubMed\nGoogle Scholar\n97. Kalampokini, S. et al. Facial emotion recognition in Parkinson's disease: association with age and olfaction.\nJ. Clin. Exp. Neuropsychol.\n40\n, 274-284 (2018).\nArticle\nCAS\nPubMed\nGoogle Scholar\n98. Benis, D. et al. Subthalamic nucleus oscillations during vocal emotion processing are dependent of the motor asymmetry of Parkinson's disease.\nNeuroImage\n222\n, 117215 (2020).\nArticle\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/750", "#/texts/751", "#/texts/752", "#/texts/753", "#/texts/754", "#/texts/755", "#/texts/756", "#/texts/757"], "page_nos": [], "uuid": "47fc895c-c001-439b-bfc3-aafaa3fa5979"}
{"doc_id": "2025__Impact_of_motor_symptom_asymmetry_on_non-motor_outcomes_in_Parkinsons_disease_a___W4411857849", "source_path": "<redacted:source_path>", "chunk_id": 37, "source_chunk_idxs": [48], "num_tokens": 493, "text": "Impact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nReferences\n99. Fiorenzato, E., Antonini, A., Bisiacchi, P., Weis, L. &amp; Biundo, R. Asymmetric dopamine transporter loss affects cognitive and motor progression in Parkinson's disease.\nMov. Disord.\n36\n, 2303-2313 (2021).\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n100. Scherfler, C. et al. Left hemispheric predominance of nigrostriatal dysfunction in Parkinson's disease.\nBrain\n135\n, 3348-3354 (2012).\nArticle\nPubMed\nGoogle Scholar\n101. Miller, I. N. &amp; Cronin-Golomb, A. Gender differences in Parkinson's disease: clinical characteristics and cognition.\nMov. Disord.\n25\n, 2695-2703 (2010).\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n102. Cools, R. et al. Role of dopamine and clinical heterogeneity in cognitive dysfunction in Parkinson's disease.\nProg. Brain Res.\n269\n, 309-343 (2022).\nArticle\nPubMed\nGoogle Scholar\n103. Aarsland, D. et al. Parkinson disease-associated cognitive impairment.\nNat. Rev. Dis. Prim.\n7\n, 47 (2021).\nArticle\nPubMed\nGoogle Scholar\n104. Burn, D. et al. Motor subtype and cognitive decline in Parkinson's disease, Parkinson's disease with dementia, and dementia with Lewy bodies.\nJ. Neurol. Neurosurg. Psychiatry\n77\n, 585-589 (2006).\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n105. Marsh, L. Depression and Parkinson's disease: current knowledge.\nCurr. Neurol. Neurosci. Rep.\n13\n, 1-9 (2013).\nArticle\nCAS\nGoogle Scholar\n106. Ferrea, E., Negahbani, F., Cebi, I., Weiss, D. &amp; Gharabaghi, A. Machine learning explains response variability of deep brain stimulation on Parkinson's disease quality of life.\nnpj Digital Med.\n7\n, 269 (2024).\nArticle\nGoogle Scholar", "doc_items_refs": ["#/texts/758", "#/texts/759", "#/texts/760", "#/texts/761", "#/texts/762", "#/texts/763", "#/texts/764", "#/texts/765"], "page_nos": [], "uuid": "57b0555c-2515-4119-b133-8c53507a6458"}
{"doc_id": "2025__Impact_of_motor_symptom_asymmetry_on_non-motor_outcomes_in_Parkinsons_disease_a___W4411857849", "source_path": "<redacted:source_path>", "chunk_id": 38, "source_chunk_idxs": [49], "num_tokens": 511, "text": "Impact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nReferences\n107. Rotenberg, V. S. The peculiarity of the right-hemisphere function in depression: solving the paradoxes.\nProg. Neuro Psychopharmacol. Biol. Psychiatry\n28\n, 1-13 (2004).\nArticle\nGoogle Scholar\n108. Wang, Q. et al. Alterations of regional spontaneous brain activities in anxiety disorders: a meta-analysis.\nJ. Affect. Disord.\n296\n, 233-240 (2022).\nArticle\nPubMed\nGoogle Scholar\n109. Danti, S. et al. Cortical thickness in de novo patients with Parkinson disease and mild cognitive impairment with consideration of clinical phenotype and motor laterality.\nEur. J. Neurol.\n22\n, 1564-1572 (2015).\nArticle\nCAS\nPubMed\nGoogle Scholar\n110. Borghammer, P. et al. Neuropathological evidence of body-first vs. brain-first Lewy body disease.\nNeurobiol. Dis.\n161\n, 105557 (2021).\nArticle\nCAS\nPubMed\nGoogle Scholar\n111. Kang, K. W., Choi, S.-M. &amp; Kim, B. C. Gender differences in motor and non-motor symptoms in early Parkinson disease.\nMedicine\n101\n, e28643 (2022).\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n112. Martinez-Martin, P. et al. Gender-related differences in the burden of non-motor symptoms in Parkinson's disease.\nJ. Neurol.\n259\n, 1639-1647 (2012).\nArticle\nPubMed\nGoogle Scholar\n113. Bowen, F. P., Hoehn, M. M. &amp; Yahr, M. D. Cerebral dominance in relation to tracking and tapping performance in patients with Parkinsonism.\nNeurology\n22\n, 32-9 (1972).\n114. Cicero, C. E. et al. Exploring the relation between REM sleep behavior disorder onset and striatal dopaminergic dysfunction in Parkinson's Disease.\nJ. Neurol.\n272\n, 1-8 (2025).\nArticle\nGoogle Scholar\n115. Cubo, E. et al. Effects of motor symptom laterality on clinical manifestations and quality of life in Parkinson's disease.\nJ. Parkinson's Dis.\n10\n, 1611-1620 (2020).\nArticle\nGoogle Scholar", "doc_items_refs": ["#/texts/766", "#/texts/767", "#/texts/768", "#/texts/769", "#/texts/770", "#/texts/771", "#/texts/772", "#/texts/773", "#/texts/774"], "page_nos": [], "uuid": "842b0fbd-5b64-497e-9494-8bddb5153571"}
{"doc_id": "2025__Impact_of_motor_symptom_asymmetry_on_non-motor_outcomes_in_Parkinsons_disease_a___W4411857849", "source_path": "<redacted:source_path>", "chunk_id": 39, "source_chunk_idxs": [50], "num_tokens": 476, "text": "Impact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nReferences\n116. Di Caprio, V., Modugno, N., Mancini, C., Olivola, E. &amp; Mirabella, G. Early-stage Parkinson's patients show selective impairment in reactive but not proactive inhibition.\nMov. Disord.\n35\n, 409-418 (2020).\nArticle\nPubMed\nGoogle Scholar\n117. Dominey, P., Decety, J., Broussolle, E., Chazot, G. &amp; Jeannerod, M. Motor imagery of a lateralized sequential task is asymmetrically slowed in hemi-Parkinson's patients.\nNeuropsychologia\n33\n, 727-741 (1995).\nArticle\nCAS\nPubMed\nGoogle Scholar\n118. Erro, R. et al. Side of onset does not influence cognition in newly diagnosed untreated Parkinson's disease patients.\nParkinsonism Relat. Disord.\n19\n, 256-259 (2013).\nArticle\nPubMed\nGoogle Scholar\n119. McNamara, P., Stavitsky, K., Harris, E., Szent-Imrey, O. &amp; Durso, R. Mood, side of motor symptom onset and pain complaints in Parkinson's disease.\nInt. J. Geriatr. Psychiatry.\n25\n, 519-524 (2010).\nArticle\nPubMed\nGoogle Scholar\n120. Mirabella, G., Fragola, M., Giannini, G., Modugno, N. &amp; Lakens, D. Inhibitory control is not lateralized in Parkinson's patients.\nNeuropsychologia\n102\n, 177-189 (2017).\nArticle\nCAS\nPubMed\nGoogle Scholar\n121. Nuber-Champier, A., Voruz, P., Constantin, I., Cionca, A. &amp; Péron, J. A. Cerebrospinal ceramides and cognition as a function of striatal asymmetry in early stage of Parkinson's disease.\nJ. Parkinson's Dis.\n1877718X251319242 (2024).", "doc_items_refs": ["#/texts/775", "#/texts/776", "#/texts/777", "#/texts/778", "#/texts/779", "#/texts/780"], "page_nos": [], "uuid": "4a2261fc-6f5c-43c6-add2-1968f48b3b11"}
{"doc_id": "2025__Impact_of_motor_symptom_asymmetry_on_non-motor_outcomes_in_Parkinsons_disease_a___W4411857849", "source_path": "<redacted:source_path>", "chunk_id": 40, "source_chunk_idxs": [51], "num_tokens": 479, "text": "Impact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nReferences\n122. Smith, J. G. et al. Perceptual bias for affective and nonaffective information in asymmetric Parkinson's disease.\nNeuropsychology\n24\n, 443 (2010).\nArticle\nPubMed\nGoogle Scholar\n123. Viitanen, M., Mortimer, J. &amp; Webster, D. Association between presenting motor symptoms and the risk of cognitive impairment in Parkinson's disease.\nJ. Neurol. Neurosurg. Psychiatry\n57\n, 1203-1207 (1994).\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n124. Wright, W. G., Gurfinkel, V., King, L. &amp; Horak, F. Parkinson's disease shows perceptuomotor asymmetry unrelated to motor symptoms.\nNeurosci. Lett.\n417\n, 10-15 (2007).\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n125. Zhang, L. et al. Aberrant changes in cortical complexity in right-onset versus left-onset parkinson's disease in early-stage.\nFront. Aging Neurosci.\n13\n, 749606 (2021).\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n126. Noone, P. Addenbrooke's cognitive examination-III.\nOccup. Med.\n65\n, 418-420 (2015).\nArticle\nGoogle Scholar\n127. Barbizet, J. &amp; Cany, E. A psychometric study of various memory deficits associated with cerebral lesions.\nPathol. Memory\n49-64 (1969).\n128. Fong, M. W., Van Patten, R. &amp; Fucetola, R. P. The factor structure of the Boston diagnostic aphasia examination.\nJ. Int. Neuropsychol. Soc.\n25\n, 772-776 (2019).\nArticle\nPubMed\nGoogle Scholar\n129. Riccio, C. A. &amp; Hynd, G. W. Validity of Benton's judgement of line orientation test.\nJ. Psychoeduc. Assess.\n10\n, 210-218 (1992).\nArticle\nGoogle Scholar", "doc_items_refs": ["#/texts/781", "#/texts/782", "#/texts/783", "#/texts/784", "#/texts/785", "#/texts/786", "#/texts/787", "#/texts/788"], "page_nos": [], "uuid": "ba25780d-06e0-46f2-93de-9175c6f02f6a"}
{"doc_id": "2025__Impact_of_motor_symptom_asymmetry_on_non-motor_outcomes_in_Parkinsons_disease_a___W4411857849", "source_path": "<redacted:source_path>", "chunk_id": 41, "source_chunk_idxs": [52], "num_tokens": 469, "text": "Impact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nReferences\n130. Welsh, K. A. et al. The Consortium to Establish a Registry for Alzheimer's Disease (CERAD). Part V. A normative study of the neuropsychological battery.\nNeurology\n44\n, 609-609 (1994).\nArticle\nCAS\nPubMed\nGoogle Scholar\n131. Benton, A., Hamsher, D. S. &amp; Sivan, A. Controlled oral word association test.\nArch. Clin. Neuropsychol.\n(1994).\n132. Norman, M. A., Evans, J. D., Miller, W. S. &amp; Heaton, R. K. Demographically corrected norms for the California verbal learning test.\nJ. Clin. Exp. Neuropsychol.\n22\n, 80-94 (2000).\nArticle\nCAS\nPubMed\nGoogle Scholar\n133. Homack, S., Lee, D. &amp; Riccio, C. A. Test review: Delis-Kaplan executive function system.\nJ. Clin. Exp. Neuropsychol.\n27\n, 599-609 (2005).\nArticle\nPubMed\nGoogle Scholar\n134. Dubois, B., Slachevsky, A., Litvan, I. &amp; Pillon, B. The FAB: a frontal assessment battery at bedside.\nNeurology\n55\n, 1621-1626 (2000).\nArticle\nCAS\nPubMed\nGoogle Scholar\n135. Benedict, R. H., Schretlen, D., Groninger, L. &amp; Brandt, J. Hopkins Verbal Learning Test-Revised: Normative data and analysis of inter-form and test-retest reliability.\nClin. Neuropsychol.\n12\n, 43-55 (1998).\nArticle\nGoogle Scholar\n136. Kawas, C., Karagiozis, H., Resau, L., Corrada, M. &amp; Brookmeyer, R. Reliability of the Blessed Telephone Information-Memory-Concentration Test.\nJ. Geriatr. Psychiatry Neurol.\n8\n, 238-242 (1995).\nArticle\nCAS\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/789", "#/texts/790", "#/texts/791", "#/texts/792", "#/texts/793", "#/texts/794", "#/texts/795"], "page_nos": [], "uuid": "1d113656-0a0e-4d7d-994d-08b34deb7e29"}
{"doc_id": "2025__Impact_of_motor_symptom_asymmetry_on_non-motor_outcomes_in_Parkinsons_disease_a___W4411857849", "source_path": "<redacted:source_path>", "chunk_id": 42, "source_chunk_idxs": [53], "num_tokens": 478, "text": "Impact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nReferences\n137. Pennebaker, J. W., Francis, M. E. &amp; Booth, R. J. Linguistic inquiry and word count: LIWC 2001.\nMahway Lawrence Erlbaum Assoc.\n71\n, 2001 (2001).\nGoogle Scholar\n138. Marra, C. et al. The Multiple Features Target Cancellation (MFTC): an attentional visual conjunction search test. Normative values for the Italian population.\nNeurol. Sci.\n34\n, 173-180 (2013).\nArticle\nCAS\nPubMed\nGoogle Scholar\n139. Blair, J. R. &amp; Spreen, O. Predicting premorbid IQ: a revision of the National Adult Reading Test.\nClin. Neuropsychol.\n3\n, 129-136 (1989).\nArticle\nGoogle Scholar\n140. Rey, A.\nL'examen clinique en psychologie\n(Presses Universitaries De France, 1958).\n141. Randolph, C.\nRepeatable Battery for the Assessment of Neuropsychological Status (RBANS)\n(Psychological Corporation, 1998).\n142. Shin, M.-S., Park, S.-Y., Park, S.-R., Seol, S.-H. &amp; Kwon, J. S. Clinical and empirical applications of the Rey-Osterrieth complex figure test.\nNat. Protoc.\n1\n, 892-899 (2006).\nArticle\nPubMed\nGoogle Scholar\n143. Jensen, A. R. &amp; Rohwer, W. D. Jr The Stroop color-word test: a review.\nActa Psychol.\n25\n, 36-93 (1966).\nArticle\nCAS\nGoogle Scholar\n144. Kortte, K. B., Horner, M. D. &amp; Windham, W. K. The trail making test, part B: cognitive flexibility or ability to maintain set?\nAppl. Neuropsychol.\n9\n, 106-109 (2002).\nArticle\nPubMed\nGoogle Scholar\n145. Langdon, D. W. &amp; Warrington, E. K.\nVESPAR: Verbal and Spatial Reasoning Test\n(Psychology Press, 1995).", "doc_items_refs": ["#/texts/796", "#/texts/797", "#/texts/798", "#/texts/799", "#/texts/800", "#/texts/801", "#/texts/802", "#/texts/803", "#/texts/804"], "page_nos": [], "uuid": "14aecad5-af86-4141-8bb5-55d4980c7ab9"}
{"doc_id": "2025__Impact_of_motor_symptom_asymmetry_on_non-motor_outcomes_in_Parkinsons_disease_a___W4411857849", "source_path": "<redacted:source_path>", "chunk_id": 43, "source_chunk_idxs": [54], "num_tokens": 460, "text": "Impact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nReferences\n146. Hartman, D. E. Wechsler Adult Intelligence Scale IV (WAIS IV): return of the gold standard.\nAppl. Neuropsychol.\n16\n, 85-87 (2009).\nArticle\nPubMed\nGoogle Scholar\n147. Mountain, M. A. &amp; Snow, W. G. Wisconsin Card Sorting Test as a measure of frontal pathology: a review.\nClin. Neuropsychol.\n7\n, 108-118 (1993).\nArticle\nGoogle Scholar\n148. Elwood, R. W. The wechsler memory scale-revised: psychometric characteristics and clinical application.\nNeuropsychol. Rev.\n2\n, 179-201 (1991).\nArticle\nCAS\nPubMed\nGoogle Scholar\n149. Ginsberg, J. Review of wechsler test of adult reading.\nJ. Psychoeduc. Assess.\n29\n, 581-586 (2003).\n150. Marin, R. S., Biedrzycki, R. C. &amp; Firinciogullari, S. Reliability and validity of the Apathy Evaluation Scale.\nPsychiatry Res.\n38\n, 143-162 (1991).\nArticle\nCAS\nPubMed\nGoogle Scholar\n151. Rieu, I. et al. International validation of a behavioral scale in Parkinson's disease without dementia.\nMov. Disord.\n30\n, 705-713 (2015).\nArticle\nPubMed\nGoogle Scholar\n152. Vasconcelos, A. G., Malloy-Diniz, L. &amp; Correa, H. Systematic review of psychometric proprieties of Barratt Impulsiveness Scale Version 11 (BIS-11).\nClin. Neuropsychiatry\n9\n, 61-74 (2012).\n153. Beck, A. T., Epstein, N., Brown, G. &amp; Steer, R. Beck anxiety inventory. Journal of consulting and clinical psychology (1993).\n154. Beck, A. T., Steer, R. A. &amp; Brown, G. K.\nBeck depression inventory\n(Harcourt Brace Jovanovich, 1987).", "doc_items_refs": ["#/texts/805", "#/texts/806", "#/texts/807", "#/texts/808", "#/texts/809", "#/texts/810", "#/texts/811", "#/texts/812", "#/texts/813"], "page_nos": [], "uuid": "22b80c21-9e74-497d-8bc3-415a07d37e07"}
{"doc_id": "2025__Impact_of_motor_symptom_asymmetry_on_non-motor_outcomes_in_Parkinsons_disease_a___W4411857849", "source_path": "<redacted:source_path>", "chunk_id": 44, "source_chunk_idxs": [55], "num_tokens": 464, "text": "Impact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nReferences\n155. Gioia, G. A., Isquith, P. K., Guy, S. C. &amp; Kenworthy, L. Test review behavior rating inventory of executive function.\nChild Neuropsychol.\n6\n, 235-238 (2000).\nArticle\nGoogle Scholar\n156. Parkitny, L. &amp; McAuley, J. The depression anxiety stress scale (DASS).\nJ. Physiother.\n56\n, 204 (2010).\nArticle\nPubMed\nGoogle Scholar\n157. Kent, L., Vostanis, P. &amp; Feehan, C. Detection of major and minor depression in children and adolescents: evaluation of the Mood and Feelings Questionnaire.\nJ. Child Psychol. Psychiatry\n38\n, 565-573 (1997).\nArticle\nCAS\nPubMed\nGoogle Scholar\n158. Montorio, I. &amp; Izal, M. The Geriatric Depression Scale: a review of its development and utility.\nInt. Psychogeriatr.\n8\n, 103-112 (1996).\nArticle\nCAS\nPubMed\nGoogle Scholar\n159. Thompson, E. Hamilton rating scale for anxiety (HAM-A).\nOccup. Med.\n65\n, 601-601 (2015).\nArticle\nGoogle Scholar\n160. Sharp, R. The Hamilton rating scale for depression.\nOccup. Med.\n65\n, 340-340 (2015).\nArticle\nGoogle Scholar\n161. Davidson, J., Turnbull, C. D., Strickland, R., Miller, R. &amp; Graves, K. The montgomery-åsberg depression scale: reliability and validity.\nActa Psychiatr. Scandinavica\n73\n, 544-548 (1986).\nArticle\nCAS\nGoogle Scholar\n162. Jenkinson, C., Fitzpatrick, R., Peto, V., Greenhall, R. &amp; Hyman, N. The Parkinson's Disease Questionnaire (PDQ-39): development and validation of a Parkinson's disease summary index score.\nAge Ageing\n26\n, 353-357 (1997).\nArticle\nCAS\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/814", "#/texts/815", "#/texts/816", "#/texts/817", "#/texts/818", "#/texts/819", "#/texts/820", "#/texts/821"], "page_nos": [], "uuid": "cabbd65a-c395-481b-a596-0e8e37b1c1d8"}
{"doc_id": "2025__Impact_of_motor_symptom_asymmetry_on_non-motor_outcomes_in_Parkinsons_disease_a___W4411857849", "source_path": "<redacted:source_path>", "chunk_id": 45, "source_chunk_idxs": [56], "num_tokens": 366, "text": "Impact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nReferences\n163. Trenkwalder, C. et al. Parkinson's disease sleep scale-validation of the revised version PDSS-2.\nMov. Disord.\n26\n, 644-652 (2011).\nArticle\nPubMed\nGoogle Scholar\n164. Wing, J. K., Mann, S. A., Leff, J. P. &amp; Nixon, J. M. The concept of a 'case' in psychiatric population surveys.\nPsychol. Med.\n8\n, 203-217 (1978).\nArticle\nCAS\nPubMed\nGoogle Scholar\n165. Buysse, D. J., Reynolds, C. F. III, Monk, T. H., Berman, S. R. &amp; Kupfer, D. J. The Pittsburgh Sleep Quality Index: a new instrument for psychiatric practice and research.\nPsychiatry Res.\n28\n, 193-213 (1989).\nArticle\nCAS\nPubMed\nGoogle Scholar\n166. Jenkins, R., Mann, A. &amp; Belsey, E. The background, design and use of a short interview to assess social stress and support in research and clinical settings.\nSoc. Sci. Med. Part E Med. Psychol.\n15\n, 195-203 (1981).\nArticle\nCAS\nGoogle Scholar\n167. Spielberger, C. D.\nState-Trait Anxiety Inventory For Adults\n(Consulting Psychologists Press, 1983).\n168. Biggs, J. T., Wylie, L. T. &amp; Ziegler, V. E. Validity of the Zung self-rating depression scale.\nBr. J. Psychiatry\n132\n, 381-385 (1978).\nArticle\nCAS\nPubMed\nGoogle Scholar\nDownload references", "doc_items_refs": ["#/texts/822", "#/texts/823", "#/texts/824", "#/texts/825", "#/texts/826", "#/texts/827", "#/texts/828"], "page_nos": [], "uuid": "017850f8-ea1f-4768-a81e-64a447d72edc"}
{"doc_id": "2025__Impact_of_motor_symptom_asymmetry_on_non-motor_outcomes_in_Parkinsons_disease_a___W4411857849", "source_path": "<redacted:source_path>", "chunk_id": 46, "source_chunk_idxs": [57, 58], "num_tokens": 319, "text": "Impact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nAcknowledgements\nThe present study was performed at the Clinical and Experimental Neuropsychology Laboratory (CENLab) within the Faculty of Psychology and Educational Sciences (FPSE) of the University of Geneva (UNIGE). The first author was funded by Institutional Funds of the State of Geneva (PI: Péron) and by Swiss National Science Foundation (SNSF) Project grant to J.A.P. (PI) (grant no. 105314\\_215015). The funders had no role in data collection, discussion of content, preparation of the manuscript, or decision to publish.\n\nImpact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nAuthor information\nAuthors and Affiliations\n1. Clinical and Experimental Neuropsychology Laboratory, Faculty of Psychology, Geneva, Switzerland P. Voruz, D. Guérin &amp; J. A. Péron\n2. Neurosurgery Department, Geneva University Hospitals and Faculty of Medicine, Geneva, Switzerland P. Voruz\n3. Neurology Department, Geneva University Hospitals and Faculty of Medicine, Geneva, Switzerland J. A. Péron\nAuthors\n1. P. Voruz\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n2. D. Guérin\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n3. J. A. Péron\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/830", "#/texts/833", "#/texts/834", "#/texts/835", "#/texts/836", "#/texts/837", "#/texts/838", "#/texts/839"], "page_nos": [], "uuid": "59722324-725d-47f4-b996-d027b69dc5df"}
{"doc_id": "2025__Impact_of_motor_symptom_asymmetry_on_non-motor_outcomes_in_Parkinsons_disease_a___W4411857849", "source_path": "<redacted:source_path>", "chunk_id": 47, "source_chunk_idxs": [59, 60, 61, 62, 63], "num_tokens": 446, "text": "Impact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nAuthor information\nContributions\nP.V.: writing-original draft preparation; data curation; formal analysis D.G.: data curation; review and editing J.A.P.: formal analysis; data curation; resources; investigation; project administration; writing-review and editing; funding acquisition.\n\nImpact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nAuthor information\nCorresponding author\nCorrespondence to\nJ. A. Péron\n.\n\nImpact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nEthics declarations\nCompeting interests\nThe authors declare no competing interests.\n\nImpact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nAdditional information\nPublisher's note\nSpringer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations.\n\nImpact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nRights and permissions\nOpen Access\nThis article is licensed under a Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International License, which permits any non-commercial use, sharing, distribution and reproduction in any medium or format, as long as you give appropriate credit to the original author(s) and the source, provide a link to the Creative Commons licence, and indicate if you modified the licensed material. You do not have permission under this licence to share adapted material derived from this article or parts of it. The images or other third party material in this article are included in the article's Creative Commons licence, unless indicated otherwise in a credit line to the material. If material is not included in the article's Creative Commons licence and your intended use is not permitted by statutory regulation or exceeds the permitted use, you will need to obtain permission directly from the copyright holder. To view a copy of this licence, visit\nhttp://creativecommons.org/licenses/by-nc-nd/4.0/\n.\nReprints and permissions", "doc_items_refs": ["#/texts/841", "#/texts/843", "#/texts/844", "#/texts/845", "#/texts/848", "#/texts/850", "#/texts/851", "#/texts/855", "#/texts/856", "#/texts/857", "#/texts/858", "#/texts/859"], "page_nos": [], "uuid": "94b97a1d-79aa-4800-a008-fce6371df909"}
{"doc_id": "2025__Impact_of_motor_symptom_asymmetry_on_non-motor_outcomes_in_Parkinsons_disease_a___W4411857849", "source_path": "<redacted:source_path>", "chunk_id": 48, "source_chunk_idxs": [64, 65, 66], "num_tokens": 309, "text": "Impact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nAbout this article\nCite this article\nVoruz, P., Guérin, D. &amp; Péron, J.A. Impact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review.\nnpj Parkinsons Dis.\n11\n, 188 (2025). https://doi.org/10.1038/s41531-025-01046-4\nDownload citation\n- Received : 30 September 2024\n- Accepted : 09 June 2025\n- Published : 01 July 2025\n- DOI : https://doi.org/10.1038/s41531-025-01046-4\nDownload PDF\nAdvertisement\n\nImpact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nExplore content\n- Research articles\n- Reviews &amp; Analysis\n- News &amp; Comment\n- Collections\n- Follow us on Facebook\n- Follow us on Twitter\n- Sign up for alerts\n- RSS feed\n\nImpact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nAbout the journal\n- Aims &amp; Scope\n- Content types\n- Journal Information\n- About the Editors\n- Open Access\n- Contact\n- Calls for Papers\n- Article Processing Charges\n- Editorial policies\n- Journal Metrics\n- About the Partner\n- 5 Questions with Our Editor-in-Chief", "doc_items_refs": ["#/texts/862", "#/texts/863", "#/texts/864", "#/texts/865", "#/texts/866", "#/texts/867", "#/texts/868", "#/texts/869", "#/texts/870", "#/texts/871", "#/texts/872", "#/texts/874", "#/texts/875", "#/texts/876", "#/texts/877", "#/texts/878", "#/texts/879", "#/texts/880", "#/texts/881", "#/texts/883", "#/texts/884", "#/texts/885", "#/texts/886", "#/texts/887", "#/texts/888", "#/texts/889", "#/texts/890", "#/texts/891", "#/texts/892", "#/texts/893", "#/texts/894"], "page_nos": [], "uuid": "4d4947c8-08b7-4167-b5ef-254a2d173064"}
{"doc_id": "2025__Impact_of_motor_symptom_asymmetry_on_non-motor_outcomes_in_Parkinsons_disease_a___W4411857849", "source_path": "<redacted:source_path>", "chunk_id": 49, "source_chunk_idxs": [67, 68, 69, 70, 71, 72], "num_tokens": 280, "text": "Impact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nPublish with us\n- For Authors and Referees\n- Language editing services\n- Open access funding\n- Submit manuscript\n\nImpact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nSearch\nSearch articles by subject, keyword or author\nShow results from\nAll journals\nThis journal\nSearch\nAdvanced search\n\nImpact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nSearch\nQuick links\n- Explore articles by subject\n- Find a job\n- Guide to authors\n- Editorial policies\nnpj Parkinson's Disease (\nnpj Parkinsons Dis.\n)\nISSN 2373-8057 (online)\n\nImpact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nnature.com sitemap\nAbout Nature Portfolio\n- About us\n- Press releases\n- Press office\n- Contact us\n\nImpact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nnature.com sitemap\nDiscover content\n- Journals A-Z\n- Articles by subject\n- protocols.io\n- Nature Index\n\nImpact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nnature.com sitemap\nPublishing policies\n- Nature portfolio policies\n- Open access", "doc_items_refs": ["#/texts/896", "#/texts/897", "#/texts/898", "#/texts/899", "#/texts/901", "#/texts/902", "#/texts/903", "#/texts/904", "#/texts/905", "#/texts/906", "#/texts/908", "#/texts/909", "#/texts/910", "#/texts/911", "#/texts/912", "#/texts/913", "#/texts/914", "#/texts/915", "#/texts/918", "#/texts/919", "#/texts/920", "#/texts/921", "#/texts/923", "#/texts/924", "#/texts/925", "#/texts/926", "#/texts/928", "#/texts/929"], "page_nos": [], "uuid": "7a38b375-9e5b-4254-8b5b-48448f22f6c5"}
{"doc_id": "2025__Impact_of_motor_symptom_asymmetry_on_non-motor_outcomes_in_Parkinsons_disease_a___W4411857849", "source_path": "<redacted:source_path>", "chunk_id": 50, "source_chunk_idxs": [73, 74, 75, 76, 77], "num_tokens": 354, "text": "Impact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nnature.com sitemap\nAuthor & Researcher services\n- Reprints &amp; permissions\n- Research data\n- Language editing\n- Scientific editing\n- Nature Masterclasses\n- Research Solutions\n\nImpact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nnature.com sitemap\nLibraries & institutions\n- Librarian service &amp; tools\n- Librarian portal\n- Open research\n- Recommend to library\n\nImpact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nnature.com sitemap\nAdvertising & partnerships\n- Advertising\n- Partnerships &amp; Services\n- Media kits\n- Branded content\n\nImpact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nnature.com sitemap\nProfessional development\n- Nature Awards\n- Nature Careers\n- Nature Conferences\n\nImpact of motor symptom asymmetry on non-motor outcomes in Parkinson's disease: a systematic review\nnature.com sitemap\nRegional websites\n- Nature Africa\n- Nature China\n- Nature India\n- Nature Japan\n- Nature Middle East\n- Privacy Policy\n- Use of cookies\n- Your privacy choices/Manage cookies\n- Legal notice\n- Accessibility statement\n- Terms &amp; Conditions\n- Your US state privacy rights\nImage Hyperlink.\n© 2025 Springer Nature Limited\nClose banner\nClose\nNature Briefing\nSign up for the\nNature Briefing\nnewsletter - what matters in science, free to your inbox daily.\nEmail address\nSign up\nI agree my information will be processed in accordance with the\nNature\nand Springer Nature Limited\nPrivacy Policy\n.\nClose banner\nClose\nGet the most important science stories of the day, free in your inbox.\nSign up for Nature Briefing", "doc_items_refs": ["#/texts/931", "#/texts/932", "#/texts/933", "#/texts/934", "#/texts/935", "#/texts/936", "#/texts/938", "#/texts/939", "#/texts/940", "#/texts/941", "#/texts/943", "#/texts/944", "#/texts/945", "#/texts/946", "#/texts/948", "#/texts/949", "#/texts/950", "#/texts/952", "#/texts/953", "#/texts/954", "#/texts/955", "#/texts/956", "#/texts/957", "#/texts/958", "#/texts/959", "#/texts/960", "#/texts/961", "#/texts/962", "#/texts/963", "#/texts/964", "#/texts/965", "#/texts/966", "#/texts/967", "#/texts/968", "#/texts/969", "#/texts/970", "#/texts/971", "#/texts/972", "#/texts/973", "#/texts/974", "#/texts/975", "#/texts/976", "#/texts/977", "#/texts/978", "#/texts/979", "#/texts/980", "#/texts/981", "#/texts/982"], "page_nos": [], "uuid": "ff43affd-fc55-4f4b-aab1-7684456ba924"}
