{"doc_id": "2025__Development_of_a_predictive_model_for_long-term_care_and_support_eligibility_cer__W4413368004", "source_path": "<redacted:source_path>", "chunk_id": 0, "source_chunk_idxs": [0, 1], "num_tokens": 328, "text": "Development of a predictive model for long-term care and support eligibility certification associated with dementia-related functional impairments: the IRIDE cohort study | BMC Public Health | Full Text\nSkip to main content\nAdvertisement\nSearch\n- Explore journals\n- Get published\n- About BMC\n- My account\nSearch all BMC articles\nSearch\nBMC Public Health\n- Home\n- About\n- Articles\n- Submission Guidelines\n- Collections\n- Join the Editorial Board\n- Submit manuscript\nDevelopment of a predictive model for long-term care and support eligibility certification associated with dementia-related functional impairments: the IRIDE cohort study\nDownload PDF\nDownload PDF\n- Research\n- Open access\n- Published: 21 August 2025\n\nDevelopment of a predictive model for long-term care and support eligibility certification associated with dementia-related functional impairments: the IRIDE cohort study\n- Daichi Yamashiro\n1\n,\n2\n,\n- Hiroyuki Suzuki\n1\n,\n2\n,\n- Susumu Ogawa\n1\n,\n2\n,\n- Mari Yamashita\n1\n,\n3\n,\n- Hiroki Moriya\n4\n,\n- Hiroyuki Sasai\n3\n,\n- Shuichi P. Obuchi\n5\n,\n- Takumi Abe\n2\n,\n6\n,\n- Hiroshi Murayama\n2\n,\n- Takumi Hirata\n5\n,\n- Yoshinori Fujiwara\n1\n,\n7\n,\n- Shuichi Awata\n1\n,\n7\n,\n- Masahiro Akishita\n1\n,\n7\n,\n- Kenji Toba\n1\n,\n7\n&amp;\n- IRIDE Cohort Study Investigators\nShow authors\nBMC Public Health\nvolume 25\n, Article number: 2867 ( 2025 )\nCite this article\n- 599 Accesses\n- 1 Altmetric\n- Metrics details", "doc_items_refs": ["#/texts/1", "#/texts/2", "#/texts/3", "#/texts/4", "#/texts/5", "#/texts/6", "#/texts/7", "#/texts/8", "#/texts/9", "#/texts/10", "#/texts/11", "#/texts/12", "#/texts/13", "#/texts/14", "#/texts/15", "#/texts/16", "#/texts/17", "#/texts/18", "#/texts/19", "#/texts/20", "#/texts/21", "#/texts/22", "#/texts/23", "#/texts/25", "#/texts/26", "#/texts/27", "#/texts/28", "#/texts/29", "#/texts/30", "#/texts/31", "#/texts/32", "#/texts/33", "#/texts/34", "#/texts/35", "#/texts/36", "#/texts/37", "#/texts/38", "#/texts/39", "#/texts/40", "#/texts/41", "#/texts/42", "#/texts/43", "#/texts/44", "#/texts/45", "#/texts/46", "#/texts/47"], "page_nos": [], "uuid": "317b4a70-71ec-4e47-9b46-8e29fc0eba63"}
{"doc_id": "2025__Development_of_a_predictive_model_for_long-term_care_and_support_eligibility_cer__W4413368004", "source_path": "<redacted:source_path>", "chunk_id": 1, "source_chunk_idxs": [2], "num_tokens": 506, "text": "Development of a predictive model for long-term care and support eligibility certification associated with dementia-related functional impairments: the IRIDE cohort study\nAbstract\nAbstractSection Background\nThe Long-Term Care Insurance (LTCI) system in Japan provides a framework for assessing dementia-related functional decline, enabling the development of predictive models based on daily functional independence. This study aimed to develop and validate risk prediction models for dementia-related functional impairments using data from the Integrated Research Initiative for Living Well with Dementia Cohort Study (IRIDE-CS), integrating multiple cohort studies conducted in urban Japan.\nAbstractSection Methods\nData, including participant characteristics and dementia-related functional impairments, were collected from 3678 participants in the IRIDE-CS aged 65 and older. These data were separated into a derivation set (\nn\n= 2764) and a validation set (\nn\n= 914) for model development and validation, based on the independent cohorts that constitute the IRIDE-CS. Dementia-related functional impairments was defined as the first certification of cognitive impairment at Level I or higher in the LTCI system, with follow-up from April 2018 to August 2023. Two models were developed: Model 1, focused on dementia-related functional impairments factors in Japan, whereas Model 2, prioritized social implementation by limiting predictors to self-reportable items. The predictive performance of each model was evaluated using the concordance index (C-index).\nAbstractSection Results\nDuring follow-up, dementia-related functional impairments occurred in 16.9% of the derivation set and 16.3% of the validation set. Model 1, which included eight predictors (age, history of stroke, visual impairment, hearing impairment, exercise habits, gait speed, grip strength, and albumin), achieved a C-index of 0.75 (95% confidence interval [CI]: 0.73-0.77) in the derivation dataset and 0.78 (95% CI: 0.74-0.82) in the validation dataset. Model 2, which included six predictors (age, history of stroke, history of heart disease, visual impairment, hearing impairment, and exercise habits), achieved a C-index of 0.73 (95% CI: 0.70-0.75) in the derivation dataset and 0.77 (95% CI: 0.73-0.81) in the validation dataset.\nAbstractSection Conclusions", "doc_items_refs": ["#/texts/49", "#/texts/50", "#/texts/51", "#/texts/52", "#/texts/53", "#/texts/54", "#/texts/55", "#/texts/56", "#/texts/57", "#/texts/58", "#/texts/59"], "page_nos": [], "uuid": "02d7796e-fdf9-4e34-97c1-99bef61d1ed5"}
{"doc_id": "2025__Development_of_a_predictive_model_for_long-term_care_and_support_eligibility_cer__W4413368004", "source_path": "<redacted:source_path>", "chunk_id": 2, "source_chunk_idxs": [3, 4], "num_tokens": 401, "text": "Development of a predictive model for long-term care and support eligibility certification associated with dementia-related functional impairments: the IRIDE cohort study\nAbstract\nWe developed and validated two predictive models for assessing the risk of dementia-related functional impairments using cohort data from urban Japan, demonstrating comparable performance to existing models. Further studies are needed to assess the applicability of these models in non-urban areas and middle-aged populations to enhance generalizability.\nPeer Review reports\n\nDevelopment of a predictive model for long-term care and support eligibility certification associated with dementia-related functional impairments: the IRIDE cohort study\nBackground\nEstimates in 2019 revealed that approximately 57 million older adults worldwide were living with dementia; this number is projected to rise to approximately 152 million by 2050 [\n1\n]. The global cost of dementia was 1.3 trillion USD in 2019, with current projections estimating an increase to 2.8 trillion USD by 2030, caused predominantly by increasing caregiving costs [\n2\n]. Therefore, the importance of preventive efforts to delay the onset of dementia, as a key strategy in dementia countermeasures, has recently been highlighted. Identifying individuals at high risk of dementia would enable more efficient implementation of currently available preventive measures.\nA substantial body of research has identified factors associated with the onset of dementia, including sex [\n3\n,\n4\n], years of education [\n5\n], living alone [\n6\n], and a medical history of specific conditions, including hyperlipidemia, hypertension, diabetes, stroke, and heart failure [\n7\n,\n8\n,\n9\n,\n10\n,\n11\n]. Physical characteristics, such as low body mass index (BMI) [\n12\n,\n13\n], slow gait speed [\n14\n,\n15\n], reduced grip strength [\n14\n,\n16\n], and fewer remaining teeth [\n17\n,\n18\n], have also been identified as important contributing factors. Furthermore, adopting healthy lifestyle habits is associated with a reduced risk of dementia [\n19\n].", "doc_items_refs": ["#/texts/60", "#/texts/61", "#/texts/63", "#/texts/64", "#/texts/65", "#/texts/66", "#/texts/67", "#/texts/68", "#/texts/69", "#/texts/70", "#/texts/71", "#/texts/72", "#/texts/73", "#/texts/74", "#/texts/75", "#/texts/76", "#/texts/77", "#/texts/78", "#/texts/79", "#/texts/80", "#/texts/81", "#/texts/82", "#/texts/83", "#/texts/84", "#/texts/85", "#/texts/86", "#/texts/87", "#/texts/88", "#/texts/89", "#/texts/90", "#/texts/91", "#/texts/92", "#/texts/93", "#/texts/94", "#/texts/95", "#/texts/96", "#/texts/97", "#/texts/98", "#/texts/99", "#/texts/100", "#/texts/101", "#/texts/102", "#/texts/103", "#/texts/104"], "page_nos": [], "uuid": "f84e1294-098b-4787-92c5-1a881ed9a4f3"}
{"doc_id": "2025__Development_of_a_predictive_model_for_long-term_care_and_support_eligibility_cer__W4413368004", "source_path": "<redacted:source_path>", "chunk_id": 3, "source_chunk_idxs": [5], "num_tokens": 416, "text": "Development of a predictive model for long-term care and support eligibility certification associated with dementia-related functional impairments: the IRIDE cohort study\nBackground\nPredictive models have been developed to assess the future risk of dementia based on individual risk factors. Representative models include the Cardiovascular Risk Factors, Aging, and Incidence of Dementia (CAIDE) [\n20\n], which predicts the risk of developing dementia approximately 20 years later using midlife vascular risk factors such as age, years of education, sex, blood pressure, BMI, total cholesterol levels, physical activity, and smoking habits. Another example is the Australian National University Alzheimer's Disease Risk Index (ANU-ADRI) [\n21\n], which is based on self-reported data, incorporating 11 risk factors (e.g., age, sex, low educational attainment, diabetes, traumatic brain injury, depressive symptoms, smoking, and limited social networks) and four protective factors (cognitive stimulation activities, alcohol consumption, physical activity, and fish intake). Additionally, the Lifestyle for Brain Health (LIBRA) emphasizes modifiable midlife risk factors, including depression, hypertension, obesity, smoking, high cholesterol, diabetes, physical inactivity, coronary artery disease, alcohol consumption, and kidney disease [\n22\n]. Although slight differences are observed in the factors included in these risk assessment models, many share a common focus on vascular health indicators, such as hypertension, high cholesterol, and diabetes; physical factors such as BMI; and lifestyle-related factors including physical activity, smoking, and alcohol consumption.\nAssessing future dementia risk may facilitate early preventive interventions against dementia onset. However, research on predictive models for dementia risk remains insufficient in the Asian region, and further investigation is needed to determine whether the variables used in existing models contribute similarly to prediction across different cultural backgrounds. Additionally, developing predictive models that consider not only the risk of dementia onset but also the degree of independence in daily life may contribute to more practical and early-stage dementia prevention strategies.", "doc_items_refs": ["#/texts/105", "#/texts/106", "#/texts/107", "#/texts/108", "#/texts/109", "#/texts/110", "#/texts/111", "#/texts/112"], "page_nos": [], "uuid": "02f24e99-3ffb-4648-a7ba-f38c5c07b8fa"}
{"doc_id": "2025__Development_of_a_predictive_model_for_long-term_care_and_support_eligibility_cer__W4413368004", "source_path": "<redacted:source_path>", "chunk_id": 4, "source_chunk_idxs": [6], "num_tokens": 236, "text": "Development of a predictive model for long-term care and support eligibility certification associated with dementia-related functional impairments: the IRIDE cohort study\nBackground\nJapan's Long-Term Care Insurance (LTCI) system supports older adults with daily functional impairments [\n23\n]. This system assesses the level of care required, including evaluations of functional impairments and dementia severity, for older adults who have received care certification (see Methods for details). Developing a model to predict dementia-related functional impairments enables the early identification of high-risk individuals in community and clinical settings. Such predictions may also provide valuable feedback to encourage behavioral changes that reduce the risk of functional decline and delay the need for long-term care. In this context, this study aimed to develop predictive models for the risk of dementia-related functional impairments using data from multiple cohort studies conducted in urban areas of Japan. To achieve this, two models were constructed: Model 1, which focuses on identifying factors associated with dementia-related functional impairments in Japan, and Model 2, which prioritizes social implementation by limiting predictors to items that can be self-reported by older adults.", "doc_items_refs": ["#/texts/113", "#/texts/114", "#/texts/115"], "page_nos": [], "uuid": "b6ff446b-581f-46b9-8f42-ce23456871ac"}
{"doc_id": "2025__Development_of_a_predictive_model_for_long-term_care_and_support_eligibility_cer__W4413368004", "source_path": "<redacted:source_path>", "chunk_id": 5, "source_chunk_idxs": [7], "num_tokens": 466, "text": "Development of a predictive model for long-term care and support eligibility certification associated with dementia-related functional impairments: the IRIDE cohort study\nMethods\nParticipants\nThis study used data from the Integrated Research Initiative for Living Well with Dementia Cohort Study (IRIDE-CS), an integrated cohort encompassing data from five community-dwelling older adult cohorts in Japan (Otassha study 2011, Otassha study 2017, Otassha study 2019, Takashimadaira study, Septuagenarians, Octogenarians, Nonagenarians Investigation with Centenarians [SONIC] study, Hatoyama study, and Kusatsu study), primarily located in the Tokyo metropolitan area and its surrounding regions (see [\n24\n] for details). Although each cohort conducts periodic follow-up surveys, IRIDE-CS integrates data from participants'initial enrollment. The most recent total sample size is 8180 individuals (Otassha study 2011:\nn\n= 1213 [data provision for the IRIDE-CS: 2015-2018]; Otassha study 2017:\nn\n= 1363 [2017-2018]; Otassha study 2019:\nn\n= 850 [2019-2020]; Takashimadaira study:\nn\n= 2053 [2016]; SONIC study:\nn\n= 567 [2011-2013]; Hatoyama study:\nn\n= 742 [2010]; and Kusatsu study:\nn\n= 1392 [2010-2019]). Written and verbal explanations were given to participants in each cohort, and consent was obtained. The aim of the IRIDE-CS, a combined cohort for secondary analysis, was announced on a dedicated website, and participants were allowed to opt out.\nFor this analysis, we included cohorts in Itabashi City, Tokyo, where long-term care certification data (as described later) were available. Itabashi City, with a population of approximately 590,000, is an urban area and the seventh most populous among Tokyo's 62 wards, towns, and villages. This study used data from the Otassha study 2011, the Otassha study 2017, the Otassha study 2019, and the Takashimadaira Study within IRIDE-CS, which were surveyed between 2015 and 2020.", "doc_items_refs": ["#/texts/118", "#/texts/119", "#/texts/120", "#/texts/121", "#/texts/122", "#/texts/123", "#/texts/124", "#/texts/125", "#/texts/126", "#/texts/127", "#/texts/128", "#/texts/129", "#/texts/130", "#/texts/131", "#/texts/132", "#/texts/133", "#/texts/134", "#/texts/135"], "page_nos": [], "uuid": "7f830e36-4e55-4d95-b045-7af279176adf"}
{"doc_id": "2025__Development_of_a_predictive_model_for_long-term_care_and_support_eligibility_cer__W4413368004", "source_path": "<redacted:source_path>", "chunk_id": 6, "source_chunk_idxs": [8], "num_tokens": 349, "text": "Development of a predictive model for long-term care and support eligibility certification associated with dementia-related functional impairments: the IRIDE cohort study\nMethods\nLTCI System\nThe LTCI system is designed to support individuals requiring care to lead independent lives, thereby reducing the burden on family caregivers [\n25\n]. As one of Japan's national insurance systems, the LTCI is available to all individuals aged 65 and older who require care. Applicants must apply for LTCI services with their local municipal government, after which a care manager assesses their level of care needs. The municipality subsequently grants a care certification based on this assessment. Care certification is classified into seven levels, reflecting the degree of support required: Support Levels 1 and 2, and Care Levels 1 to 5. These levels range from a minimal level of assistance (Support Level 1) to a stage requiring constant care for all activities of daily living (Care Level 5).\nThe LTCI system evaluates the level of care certification and the grade of cognitive disability, which reflects the degree of independence in daily life. The levels include\"Independent\"as well as the following classifications: Level I (having some degree of dementia but being almost independent in daily life, at home and socially), Level IIa/IIb (experiencing some symptoms, behaviors, or communication difficulties that interfere with daily life but maintaining independence with supervision), Level IIIa/IIIb (exhibiting symptoms, behaviors, or communication difficulties that interfere with daily life and requiring care), Level IV (frequently experiencing symptoms, behaviors, or communication difficulties that interfere with daily life and requiring constant care), and Level M (requiring specialized medical care owing to severe psychiatric symptoms, behavioral problems, or serious physical illness).", "doc_items_refs": ["#/texts/137", "#/texts/138", "#/texts/139", "#/texts/140"], "page_nos": [], "uuid": "28748e42-60ab-4bd0-9547-065eceeb0e86"}
{"doc_id": "2025__Development_of_a_predictive_model_for_long-term_care_and_support_eligibility_cer__W4413368004", "source_path": "<redacted:source_path>", "chunk_id": 7, "source_chunk_idxs": [9], "num_tokens": 361, "text": "Development of a predictive model for long-term care and support eligibility certification associated with dementia-related functional impairments: the IRIDE cohort study\nMethods\nOutcome variable\nIn this study, dementia-related functional impairments were defined as daily functional impairments attributable to cognitive impairment, as recognized in the long-term care certification process. To identify earlier stages of dementia-related functional impairments, we defined the impairments as the first time an individual was certified at Level I or higher in the cognitive disability grading system, which has been reported to have a sensitivity of 65% and a specificity of 93% for detecting dementia diagnosed by neuropsychiatrists [\n26\n]. This grading system reflects the degree of daily functional independence in older adults with dementia symptoms and can therefore be considered a proxy indicator of dementia-related disability. Its focus on cognitive symptoms helps minimize the inclusion of functional impairments caused by other conditions.　The long-term care certification data from Itabashi City, Tokyo, were available from April 2018 to August 2023. Therefore, for data before April 2018, we verified through subsequent follow-up surveys of each cohort that participants had no history of dementia and were not taking dementia medication. This helped confirm, as much as possible, that dementia onset had not occurred before the certification period.\nSurvival time was defined as the number of days from participation in the health survey to the development of an event (dementia-related functional impairments) or censoring, including cases of relocation, death, or other reasons. Participants were censored at events such as death or relocation if these occurred during the follow-up period. The follow-up period in the data used in this study ranged from a minimum of 371 days to a maximum of 2870 days.", "doc_items_refs": ["#/texts/142", "#/texts/143", "#/texts/144", "#/texts/145"], "page_nos": [], "uuid": "286df90b-e2c9-40ac-80a3-ad29038224c4"}
{"doc_id": "2025__Development_of_a_predictive_model_for_long-term_care_and_support_eligibility_cer__W4413368004", "source_path": "<redacted:source_path>", "chunk_id": 8, "source_chunk_idxs": [10], "num_tokens": 499, "text": "Development of a predictive model for long-term care and support eligibility certification associated with dementia-related functional impairments: the IRIDE cohort study\nMethods\nCandidate variables\nThe following variables were selected as candidate variables for Model 1: age; sex (men/women); living arrangement (living alone/not living alone); years of education; BMI; visual and hearing impairments in daily life (impaired/not impaired); history of hypertension, hyperlipidemia, diabetes, stroke, or heart disease (yes/no); the presence of exercise habits at least once a week (yes/no); frequency of outings (0-2 days/week, 3-6 days/week, every day); drinking and smoking habits (current/withdrawal/never); physical function indicators (grip strength, gait speed, body fat mass, fat-free mass, skeletal muscle mass index [SMI] Mean arterial pressure [MAP], and number of teeth); and blood biomarkers (hemoglobin, albumin, and estimated glomerular filtration rate [eGFR]). These variables were chosen from the predictors of dementia-related functional impairments that could be integrated into the IRIDE-CS dataset. Information on medical history (e.g., hypertension, stroke, diabetes), visual and hearing impairments in daily life, lifestyle factors (smoking and alcohol habits), exercise habits, and outing frequency was collected through self-administered questionnaires in each cohort. Visual and hearing impairments were assessed based on participants' usual sensory function, including the use of corrective devices such as eyeglasses and hearing aids. For vision, participants who reported either (1) almost no ability to see or (2) the ability to recognize a person's face at approximately 1 m but not to read were categorized as having visual impairment. For hearing, participants who reported either (1) almost no ability to hear or (2) difficulty engaging in conversation unless others spoke loudly were categorized as having hearing impairment. Exercise habits were assessed by asking participants whether they engaged in physical activities, including exercise or walking, on a regular basis. Participants who reported engaging in such activities at least once per week on a regular basis were classified as having exercise habits. Outing frequency was assessed by asking how often participants usually went out for purposes such as work, shopping, walking, or visiting healthcare facilities.", "doc_items_refs": ["#/texts/147"], "page_nos": [], "uuid": "c39ebb77-be0f-44bc-9157-359b27ddd5a0"}
{"doc_id": "2025__Development_of_a_predictive_model_for_long-term_care_and_support_eligibility_cer__W4413368004", "source_path": "<redacted:source_path>", "chunk_id": 9, "source_chunk_idxs": [11], "num_tokens": 209, "text": "Development of a predictive model for long-term care and support eligibility certification associated with dementia-related functional impairments: the IRIDE cohort study\nMethods\nCandidate variables\nAmong these variables, some continuous variables were categorized based on previous studies [\n18\n,\n24\n,\n27\n], including years of education (&gt; 12 years, 10-12 years, 0-9 years), BMI (\n2\n), number of teeth (≤ 20 teeth, &gt; 20 teeth), gait speed (\n28\n,\n29\n].\nAdditionally, among the variables mentioned above, age, sex, years of education, living arrangement, BMI (which can be calculated from self-reported height and weight), presence of visual and hearing impairments in daily life, history of hypertension, diabetes, hyperlipidemia, stroke, or heart disease, drinking and smoking habits, exercise habits, and frequency of outings were considered suitable for self-report as single-item measures. Therefore, these variables were selected as candidate variables for Model 2.", "doc_items_refs": ["#/texts/148", "#/texts/149", "#/texts/150", "#/texts/151", "#/texts/152", "#/texts/153", "#/texts/154", "#/texts/155", "#/texts/156", "#/texts/157", "#/texts/158", "#/texts/159", "#/texts/160", "#/texts/161"], "page_nos": [], "uuid": "127130a1-0b03-461c-9ee7-4a5792271b96"}
{"doc_id": "2025__Development_of_a_predictive_model_for_long-term_care_and_support_eligibility_cer__W4413368004", "source_path": "<redacted:source_path>", "chunk_id": 10, "source_chunk_idxs": [12], "num_tokens": 360, "text": "Development of a predictive model for long-term care and support eligibility certification associated with dementia-related functional impairments: the IRIDE cohort study\nMethods\nExclusion criteria\nIn this study, the following criteria were sequentially applied to exclude participants. First, participants who could not be matched to long-term care certification data were excluded (\nn\n= 366). Next, participants with insufficient information on the determination of their need for nursing care and the date of change were excluded (\nn\n= 5). Then, participants who had already experienced the event (onset of dementia) at the time of entry into the cohort study were excluded (\nn\n= 67). After that, participants with a history of dementia or prior use of anti-dementia medication between the time of participation in the cohort studies and the start of LTCI data collection, or those for whom such information was uncertain (verified through follow-up data from each cohort), were excluded (\nn\n= 162). Furthermore, participants who experienced dementia-related functional impairments or whose follow-up was interrupted owing to relocation, death, or other reasons within one year of the cohort study were excluded (\nn\n= 106). Finally, participants with missing data on variables used in the analysis were excluded (\nn\n= 1095). After applying these exclusion criteria, data from 3678 participants were included in the analysis, accounting for 67% of the four cohorts'dataset. The breakdown of participants by cohort was as follows: Otassha study 2011 (\nn\n= 914), Otassha study 2017 (\nn\n= 1217), Otassha study 2019 (\nn\n= 617), and Takashimadaira study (\nn\n= 930) (Fig.\n1\n).\nFig. 1", "doc_items_refs": ["#/texts/163", "#/texts/164", "#/texts/165", "#/texts/166", "#/texts/167", "#/texts/168", "#/texts/169", "#/texts/170", "#/texts/171", "#/texts/172", "#/texts/173", "#/texts/174", "#/texts/175", "#/texts/176", "#/texts/177", "#/texts/178", "#/texts/179", "#/texts/180", "#/texts/181", "#/texts/182", "#/texts/183", "#/texts/184", "#/texts/185", "#/texts/186"], "page_nos": [], "uuid": "8d7405b7-7a5b-45b6-a302-95aba522943e"}
{"doc_id": "2025__Development_of_a_predictive_model_for_long-term_care_and_support_eligibility_cer__W4413368004", "source_path": "<redacted:source_path>", "chunk_id": 11, "source_chunk_idxs": [13], "num_tokens": 361, "text": "Development of a predictive model for long-term care and support eligibility certification associated with dementia-related functional impairments: the IRIDE cohort study\nMethods\nStatistical analysis\nA Cox proportional hazards model was estimated to predict survival time from study initiation to event occurrence, based on the features of the candidate variables. To evaluate the model's generalization performance, the dataset was categorized into derivation and validation datasets. The derivation dataset included data from the Takashimadaira study, the Otassha study 2017, and the Otassha study 2019, whereas the validation dataset included data from the Otassha study 2011. The Otassha study 2011 was selected as the validation dataset because it included participants aged 65 to 84 years, representing a broader and more diverse age range compared to the other cohorts (see [\n24\n] for details on each cohort). We considered this cohort appropriate for evaluating the generalizability of the model under conditions approximating external validation. The model was developed using the derivation dataset, and its generalization performance was assessed by comparing the predicted and observed survival times in the validation dataset (details provided below). For Model 1 and Model 2, dimensionality reduction was applied using a stepwise selection method (forward and backward) based on the Akaike Information Criterion (AIC) to identify effective features for estimation. The final parsimonious model was evaluated for its performance on the validation dataset. The proportional hazards assumption of the final parsimonious model was assessed using Schoenfeld residuals. If a violation of the proportional hazards assumption was detected, the following adjustments were made: categorical variables that violated the assumption were stratified, whereas quantitative variables were transformed into nonlinear terms using penalized smoothing splines.", "doc_items_refs": ["#/texts/188", "#/texts/189", "#/texts/190"], "page_nos": [], "uuid": "de2b9923-81fc-4976-8fbe-094af3611295"}
{"doc_id": "2025__Development_of_a_predictive_model_for_long-term_care_and_support_eligibility_cer__W4413368004", "source_path": "<redacted:source_path>", "chunk_id": 12, "source_chunk_idxs": [14], "num_tokens": 399, "text": "Development of a predictive model for long-term care and support eligibility certification associated with dementia-related functional impairments: the IRIDE cohort study\nMethods\nStatistical analysis\nTo compare the predictive accuracy of Model 1 and Model 2, each model's concordance index (C-index) was calculated using the derivation dataset. The C-index was used to measure the sensitivity and specificity of variables in the model, where values of 1.00 and 0.50 indicate perfect prediction and prediction no better than random chance, respectively [\n30\n]. Although no definitive threshold has been established for the C-index, reference values from existing dementia risk prediction models indicate that CAIDE reported a C-index of 0.60 for predicting dementia onset in older adults aged 65 and above, whereas ANU-ADRI reported a C-index of 0.74 [\n31\n]. To further assess the discriminatory capacity of each model in a clinically interpretable manner, individual risk scores were calculated from the linear predictors of the Cox model. Participants were then categorized into quartile groups (Q1-Q4) based on these scores. A separate Cox proportional hazards model was subsequently fitted using the quartile groups as categorical predictors, with Q1 (lowest risk) as the reference group. Hazard ratios for Q2 to Q4 were estimated to quantify the gradient of risk for dementia-related functional impairments across quartiles.\nAll statistical analyses were conducted using R version 4.4.2 [\n32\n]. The survival package [\n33\n,\n34\n] was used for Cox proportional hazards model estimation. The survcomp package [\n35\n,\n36\n] was used to calculate C-index and their 95% confidence intervals (95% CI) using the\nconcordance.index\nfunction based on Noether's method, and to statistically compare C-index values between models using the\ncindex.comp\nfunction. Statistical significance was set at\np", "doc_items_refs": ["#/texts/191", "#/texts/192", "#/texts/193", "#/texts/194", "#/texts/195", "#/texts/196", "#/texts/197", "#/texts/198", "#/texts/199", "#/texts/200", "#/texts/201", "#/texts/202", "#/texts/203", "#/texts/204", "#/texts/205", "#/texts/206", "#/texts/207", "#/texts/208", "#/texts/209", "#/texts/210", "#/texts/211"], "page_nos": [], "uuid": "9bce44d6-b2b9-4fe4-bb79-79456c744517"}
{"doc_id": "2025__Development_of_a_predictive_model_for_long-term_care_and_support_eligibility_cer__W4413368004", "source_path": "<redacted:source_path>", "chunk_id": 13, "source_chunk_idxs": [15], "num_tokens": 208, "text": "Development of a predictive model for long-term care and support eligibility certification associated with dementia-related functional impairments: the IRIDE cohort study\nResults\nParticipant characteristics\nIn this study, we analyzed data from 3678 participants, divided into the derivation (\nn\n= 2764) and validation (\nn\n= 914) datasets. In the derivation dataset, 16.9% (\nn\n= 467) of participants developed dementia-related functional impairments during the follow-up period, with a median time to dementia-related functional impairments of 1220 days (interquartile range = 874-1710). In the validation dataset, 16.3% (\nn\n= 149) of participants developed dementia-related functional impairments, with a median time to event of 1727 days (interquartile range = 1235-2382). Table\n1\nsummarizes the characteristics of participants in the derivation dataset, whereas the characteristics of participants in the validation dataset are provided in Supplementary Table 1.", "doc_items_refs": ["#/texts/215", "#/texts/216", "#/texts/217", "#/texts/218", "#/texts/219", "#/texts/220", "#/texts/221", "#/texts/222", "#/texts/223", "#/texts/224", "#/texts/225"], "page_nos": [], "uuid": "399a6ddf-86b1-4748-b0f0-0fb7006e0cfa"}
{"doc_id": "2025__Development_of_a_predictive_model_for_long-term_care_and_support_eligibility_cer__W4413368004", "source_path": "<redacted:source_path>", "chunk_id": 14, "source_chunk_idxs": [16], "num_tokens": 325, "text": "Development of a predictive model for long-term care and support eligibility certification associated with dementia-related functional impairments: the IRIDE cohort study\nResults\nModel 1: exploratory model identifying risk factors for dementia-related functional impairments\nIn Model 1, a stepwise dimensionality reduction method identified the following predictors: age, years of education, hearing impairment, visual impairment, history of stroke, exercise habits, gait speed, grip strength, and albumin levels. Excluded variables based on AIC were sex, living arrangement, BMI, history of hypertension, diabetes, hyperlipidemia, heart disease, drinking and smoking habits, SMI, number of teeth, fat-free mass, eGFR, and hemoglobin. Among the identified predictors, years of education violated the proportional hazards assumption (Supplementary Table 2) and was stratified accordingly. Significant predictors included age (hazard ratio (HR) = 1.14, 95% CI: 1.12-1.16), visual impairment (HR = 1.65, 95% CI: 1.08-2.51), hearing impairment (HR = 1.36, 95% CI: 1.00-1.83), exercise habits (HR = 1.35, 95% CI: 1.05-1.74), gait speed (HR = 1.79, 95% CI: 1.41-2.27), and grip strength (HR = 1.61, 95% CI: 1.31-1.98) (Table\n2\n).", "doc_items_refs": ["#/texts/227", "#/texts/228", "#/texts/229"], "page_nos": [], "uuid": "53c9a502-0f40-4d87-be24-d3b8a9d7e01d"}
{"doc_id": "2025__Development_of_a_predictive_model_for_long-term_care_and_support_eligibility_cer__W4413368004", "source_path": "<redacted:source_path>", "chunk_id": 15, "source_chunk_idxs": [17, 18], "num_tokens": 486, "text": "Development of a predictive model for long-term care and support eligibility certification associated with dementia-related functional impairments: the IRIDE cohort study\nResults\nModel 2: practical model for community use based on self-reported items\nIn Model 2, stepwise selection identified age, years of education, history of stroke, history of heart disease, visual impairment, hearing impairment, and exercise habits as predictors (Table\n2\n). Similar to Model 1, excluded variables based on AIC were sex, living arrangement, BMI, history of hypertension, diabetes, hyperlipidemia, drinking and smoking habits, and frequency of going outdoors. As in Model 1, years of education violated the proportional hazards assumption (Supplementary Table 2) and was stratified. Statistically significant predictors were age (HR = 1.16, 95% CI: 1.14-1.18), history of stroke (HR = 1.42, 95% CI: 1.04-1.94), visual impairment (HR = 1.96, 95% CI: 1.29-2.98), hearing impairment (HR = 1.50, 95% CI: 1.11-2.02), and exercise habits (HR = 1.51, 95% CI: 1.18-1.94).\n\nDevelopment of a predictive model for long-term care and support eligibility certification associated with dementia-related functional impairments: the IRIDE cohort study\nResults\nPerformance of the two models\nTo assess the predictive performance of the two developed models, we calculated their C-index values using both the derivation and validation datasets (Table\n3\n). In the derivation dataset, Model 1 demonstrated significantly better performance than Model 2 (C-index = 0.75, 95% CI: 0.73-0.77 vs. C-index = 0.73, 95% CI: 0.70-0.75,\np\np\n= 0.118).\nFigure\n2\npresents cumulative incidence curves by risk score quartiles (Q1-Q4), illustrating a progressive increase in the risk of dementia-related functional impairments over time across the quartiles. For Model 1, the hazard ratios for Q2 to Q4 were 2.44 (95% CI: 1.58-3.75,\np\np\np\np\np\np\nFig. 2", "doc_items_refs": ["#/texts/231", "#/texts/232", "#/texts/233", "#/texts/235", "#/texts/236", "#/texts/237", "#/texts/238", "#/texts/240", "#/texts/241", "#/texts/242", "#/texts/243", "#/texts/244", "#/texts/245", "#/texts/247", "#/texts/249", "#/texts/251", "#/texts/253", "#/texts/255", "#/texts/257"], "page_nos": [], "uuid": "94f4cf02-62df-49df-9274-371254fc4f98"}
{"doc_id": "2025__Development_of_a_predictive_model_for_long-term_care_and_support_eligibility_cer__W4413368004", "source_path": "<redacted:source_path>", "chunk_id": 16, "source_chunk_idxs": [19], "num_tokens": 327, "text": "Development of a predictive model for long-term care and support eligibility certification associated with dementia-related functional impairments: the IRIDE cohort study\nDiscussion\nIn this study, we developed predictive models for the onset of functional impairments related to dementia using data from multiple cohort studies conducted in urban areas of Japan. Model 1 incorporated a wide range of physiological and physical indicators, focusing on identifying factors associated with dementia-related functional impairments in Japan. Model 2 was designed to prioritize social implementation by limiting variables to self-assessable items.\nIn Model 1, eight variables were identified as predictors: age, history of stroke, visual impairment, hearing impairment, exercise habits, gait speed, grip strength, and albumin levels. In Model 2, six variables were identified as predictors of dementia dementia-related functional impairments: age, history of stroke, history of heart disease, visual impairment, hearing impairment, and exercise habits. Although both models shared many common variables, Model 1 demonstrated higher predictive performance than Model 2. This may be attributed to the inclusion of gait speed, grip strength, and albumin levels, which are indicators of physical function and blood biomarkers. The variables age, history of stroke, visual impairment, hearing impairment, and exercise habits, which were selected in both models, have been reported in previous studies as being associated with dementia risk, reinforcing the validity of our model selection. In particular, visual impairment, hearing impairment, and exercise habits align with the Lancet Commission's proposed modifiable risk factors, reaffirming their importance [\n37\n].", "doc_items_refs": ["#/texts/259", "#/texts/260", "#/texts/261", "#/texts/262"], "page_nos": [], "uuid": "ccac1dfe-6676-4dfd-9d6a-353f1dbc6cae"}
{"doc_id": "2025__Development_of_a_predictive_model_for_long-term_care_and_support_eligibility_cer__W4413368004", "source_path": "<redacted:source_path>", "chunk_id": 17, "source_chunk_idxs": [20], "num_tokens": 450, "text": "Development of a predictive model for long-term care and support eligibility certification associated with dementia-related functional impairments: the IRIDE cohort study\nDiscussion\nRisk factors such as smoking, alcohol consumption, and diabetes, which were included in ANU-ADRI and LIBRA, were not incorporated into the predictive models in the present study. These variables are linked to stroke history [\n38\n,\n39\n,\n40\n] and may have been indirectly reflected through cerebrovascular risk factors. In the validation dataset, the C-index values were 0.77 for Model 1 and 0.78 for Model 2. The ANU-ADRI model has been reported to have a C-index of 0.74 [\n31\n] for cohorts aged 65 and older, suggesting that our model demonstrates a predictive accuracy comparable to previously developed risk models for older adults aged 65 and above. Furthermore, in both models, when participants were stratified into quartiles based on their estimated risk scores, the hazard ratios increased progressively across quartiles, with the highest-risk group (Q4) exhibiting a markedly elevated risk compared to the lowest-risk group (Q1). These clear gradients in hazard across quartiles support the predictive validity of both models in identifying individuals at higher risk for dementia-related functional impairments.\nIn both models of this study, sex was not selected as a predictor. A notable characteristic of the derivation dataset is that, despite previous studies indicating a higher risk of dementia onset in women, the incidence of daily functional impairments associated with dementia was higher in men. This study did not limit its scope to specific underlying diseases but also focused on cognitive impairment's impact on daily functional abilities. As a result, the dataset may have included a higher proportion of cases of vascular dementia, which is known to have a pronounced impact on daily life. Vascular dementia is reported to be more prevalent in men [\n4\n], which may explain the higher incidence of dementia among men in our study. Furthermore, the exclusion of sex as a significant predictor in the models may be attributed to the imbalance in sample size between sexes and/or the emphasis on daily functional impairments.", "doc_items_refs": ["#/texts/263", "#/texts/264", "#/texts/265", "#/texts/266", "#/texts/267", "#/texts/268", "#/texts/269", "#/texts/270", "#/texts/271", "#/texts/272", "#/texts/273", "#/texts/274"], "page_nos": [], "uuid": "af95f6ae-8ad3-45a7-b27c-99b59f0f78ce"}
{"doc_id": "2025__Development_of_a_predictive_model_for_long-term_care_and_support_eligibility_cer__W4413368004", "source_path": "<redacted:source_path>", "chunk_id": 18, "source_chunk_idxs": [21], "num_tokens": 213, "text": "Development of a predictive model for long-term care and support eligibility certification associated with dementia-related functional impairments: the IRIDE cohort study\nDiscussion\nConsidering its applicability in public health settings, Model 2 developed in this study has the potential to be implemented as a self-assessment tool that allows individuals concerned about cognitive decline to estimate their future risk of dementia-related functional impairments, as all its variables are limited to self-reportable measures. However, directly applying the hazard ratio coefficients from the model for risk prediction requires complex calculations. Therefore, instead of being used as a paper-based checklist, it would be more practical to integrate the model into a computer-based system capable of automatically calculating risk scores. As of 2023, approximately 70% of Japanese households with adults aged 65 and older own a smartphone [\n41\n]. Given this trend, developing a web-based application could enhance accessibility and facilitate its widespread adoption as a self-assessment tool for community-dwelling older adults to evaluate their dementia-related functional impairments risk more easily.", "doc_items_refs": ["#/texts/275", "#/texts/276", "#/texts/277"], "page_nos": [], "uuid": "7b5fed9d-c15a-4224-8ec0-85d204aab786"}
{"doc_id": "2025__Development_of_a_predictive_model_for_long-term_care_and_support_eligibility_cer__W4413368004", "source_path": "<redacted:source_path>", "chunk_id": 19, "source_chunk_idxs": [22], "num_tokens": 447, "text": "Development of a predictive model for long-term care and support eligibility certification associated with dementia-related functional impairments: the IRIDE cohort study\nDiscussion\nThis study has several limitations. The dataset used in this study was constructed based on data from older adults residing in urban areas of Japan, where living environments, including transportation options, housing conditions, and social support systems, are relatively uniform. This study defined an outcome that considers the impact of cognitive impairment on daily life, making the dataset suitable for this purpose. Additionally, considering that approximately half of Japan's older adult population resides in prefectures classified as major urban areas [\n42\n], this model can be considered relatively representative of the Japanese older population. However, as living environments in non-urban areas differ significantly, careful consideration is required when generalizing this model. To address this limitation, future research should examine the applicability of this model in predicting dementia-related functional impairments in non-urban areas, where cognitive impairment risk factors may differ. Furthermore, this study focused on older adults aged 65 and older, and its applicability to middle-aged populations (under 65) has not been examined. Since the impact of aging-related risk factors may vary across age groups, future research should assess this model's applicability to middle-aged populations and evaluate its generalizability. Another limitation is that detailed information on the severity of underlying diseases (e.g., stroke, heart disease) was not available. These variables were incorporated into the model only as binary self-reported items indicating the presence or absence of each condition. Although this approach allows for simple and scalable data collection in population-based studies, it may limit the model's capacity to capture variations in risk associated with disease severity. Finally, the sex distribution in the derivation dataset was imbalanced, with a higher proportion of women. Although sex was not selected as a significant predictor in the final models, this imbalance may have influenced the process of variable selection and risk estimation. Therefore, the sex disparity in the analytic sample should be considered a limitation, and future studies should aim for a more balanced representation to examine potential sex-specific risk patterns.", "doc_items_refs": ["#/texts/278", "#/texts/279", "#/texts/280"], "page_nos": [], "uuid": "db46c4b0-366a-4d64-8c71-8b962fa38452"}
{"doc_id": "2025__Development_of_a_predictive_model_for_long-term_care_and_support_eligibility_cer__W4413368004", "source_path": "<redacted:source_path>", "chunk_id": 20, "source_chunk_idxs": [23, 24, 25], "num_tokens": 369, "text": "Development of a predictive model for long-term care and support eligibility certification associated with dementia-related functional impairments: the IRIDE cohort study\nConclusions\nIn this study, we developed and evaluated two predictive models for assessing the risk of dementia-related functional decline using data from multiple cohort studies conducted in urban areas of Japan, demonstrating predictive performance comparable to existing models. Model 1 incorporated a broad range of physiological and physical indicators to identify factors associated with dementia-related functional impairments, whereas Model 2 prioritized social implementation by limiting variables to self-assessable items. The common predictors selected in both models-age, history of stroke, visual impairment, hearing impairment, and exercise habits-have also been reported in previous studies as dementia risk factors, supporting the validity of our model selection. Implementing these models as web applications or digital tools to visualize risk could contribute to dementia prevention among community-dwelling older adults. Further research is needed to evaluate the applicability of these models in non-urban areas and among middle-aged populations.\n\nDevelopment of a predictive model for long-term care and support eligibility certification associated with dementia-related functional impairments: the IRIDE cohort study\nData availability\nThe raw data supporting the conclusions of this article will be made available by the corresponding author, without undue reservation.\n\nDevelopment of a predictive model for long-term care and support eligibility certification associated with dementia-related functional impairments: the IRIDE cohort study\nAbbreviations\nAIC:\nAkaike Information Criterion\nBMI:\nBody mass index\nIRIDE-CS:\nThe Integrated Research Initiative for Living Well with Dementia Cohort Study\nLTCI:\nLong-Term Care Insurance\nMAP:\nMean arterial pressure\nSMI:\nSkeletal muscle mass index\nSONIC:\nSeptuagenarians, Octogenarians, Nonagenarians Investigation with Centenarians", "doc_items_refs": ["#/texts/282", "#/texts/284", "#/texts/286", "#/texts/287", "#/texts/288", "#/texts/289", "#/texts/290", "#/texts/291", "#/texts/292", "#/texts/293", "#/texts/294", "#/texts/295", "#/texts/296", "#/texts/297", "#/texts/298", "#/texts/299"], "page_nos": [], "uuid": "3eeb4a31-0671-48b5-84d9-ff61da40b065"}
{"doc_id": "2025__Development_of_a_predictive_model_for_long-term_care_and_support_eligibility_cer__W4413368004", "source_path": "<redacted:source_path>", "chunk_id": 21, "source_chunk_idxs": [26], "num_tokens": 474, "text": "Development of a predictive model for long-term care and support eligibility certification associated with dementia-related functional impairments: the IRIDE cohort study\nReferences\n1. GBD Dementia Forecasting Collaborators. Estimation of the global prevalence of dementia in 2019 and forecasted prevalence in 2050: an analysis for the global burden of disease study 2019. Lancet Public Health. 2022;7(2):e105-25.\nArticle\nGoogle Scholar\n2. World health Organaization. Global status report on the public health response to dementia. 1st ed. Geneva: World Health Organization; 2021.\nGoogle Scholar\n3. Podcasy JL, Epperson CN. Considering sex and gender in Alzheimer disease and other dementias. Dialogues Clin Neurosci. 2016;18:437-46.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n4. Gao S, Hendrie HC, Hall KS, Hui S. The relationships between age, sex, and the incidence of dementia and Alzheimer disease: a meta-analysis. Arch Gen Psychiatry. 1998;55:809-15.\nArticle\nCAS\nPubMed\nGoogle Scholar\n5. Maccora J, Peters R, Anstey KJ. What does (low) education mean in terms of dementia risk? A systematic review and meta-analysis highlighting inconsistency in measuring and operationalising education. SSM. 2020;12:100654.\nGoogle Scholar\n6. Desai R, John A, Stott J, Charlesworth G. Living alone and risk of dementia: a systematic review and meta-analysis. Ageing Res Rev. 2020;62:101122.\nArticle\nPubMed\nGoogle Scholar\n7. Wee J, Sukudom S, Bhat S, Marklund M, Peiris NJ, Hoyos CM, et al. The relationship between midlife dyslipidemia and lifetime incidence of dementia: A systematic review and meta-analysis of cohort studies. Alz Dem Diag Ass Dis Mo. 2023;15.\n8. Liang X, Shan Y, Ding D, Zhao Q, Guo Q, Zheng L, et al. Hypertension and high blood pressure are associated with dementia among Chinese dwelling elderly: the Shanghai aging study. Front Neurol. 2018;9:664.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/301", "#/texts/302", "#/texts/303", "#/texts/304", "#/texts/305", "#/texts/306", "#/texts/307", "#/texts/308"], "page_nos": [], "uuid": "b50419a6-2c46-4ae0-af9c-17e0047f525a"}
{"doc_id": "2025__Development_of_a_predictive_model_for_long-term_care_and_support_eligibility_cer__W4413368004", "source_path": "<redacted:source_path>", "chunk_id": 22, "source_chunk_idxs": [27], "num_tokens": 507, "text": "Development of a predictive model for long-term care and support eligibility certification associated with dementia-related functional impairments: the IRIDE cohort study\nReferences\n9. Gudala K, Bansal D, Schifano F, Bhansali A. Diabetes mellitus and risk of dementia: a meta-analysis of prospective observational studies. J Diabetes Investig. 2013;4:640-50.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n10. Kuźma E, Lourida I, Moore SF, Levine DA, Ukoumunne OC, Llewellyn DJ. Stroke and dementia risk: a systematic review and meta-analysis. Alzheimers Dement. 2018;14:1416-26.\nArticle\nPubMed\nGoogle Scholar\n11. Wolters FJ, Segufa RA, Darweesh SKL, Bos D, Ikram MA, Sabayan B, et al. Coronary heart disease, heart failure, and the risk of dementia: a systematic review and meta-analysis. Alzheimers Dement. 2018;14:1493-504.\nArticle\nPubMed\nGoogle Scholar\n12. Qizilbash N, Gregson J, Johnson ME, Pearce N, Douglas I, Wing K, et al. BMI and risk of dementia in two million people over two decades: a retrospective cohort study. Lancet Diabetes Endocrinol. 2015;3:431-6.\nArticle\nPubMed\nGoogle Scholar\n13. Peters R, Peters J, Booth A, Anstey KJ. Trajectory of blood pressure, body mass index, cholesterol and incident dementia: systematic review. Br J Psychiatry. 2020;216:16-28.\nArticle\nPubMed\nGoogle Scholar\n14. Orchard SG, Polekhina G, Ryan J, Shah RC, Storey E, Chong TT -J., et al. Combination of gait speed and grip strength to predict cognitive decline and dementia. Alzheimers Dement: Diagn Assess Dis Monit. 2022;14.\n15. Dumurgier J, Artaud F, Touraine C, Rouaud O, Tavernier B, Dufouil C, et al. Gait speed and decline in gait speed as predictors of incident dementia. J Gerontol A Biol Sci Med Sci. 2017.\nhttps://doi.org/10.1093/gerona/glw110\n.\nArticle\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/309", "#/texts/310", "#/texts/311", "#/texts/312", "#/texts/313", "#/texts/314", "#/texts/315"], "page_nos": [], "uuid": "610a0dfb-4874-464b-bff8-7061da924aac"}
{"doc_id": "2025__Development_of_a_predictive_model_for_long-term_care_and_support_eligibility_cer__W4413368004", "source_path": "<redacted:source_path>", "chunk_id": 23, "source_chunk_idxs": [28], "num_tokens": 446, "text": "Development of a predictive model for long-term care and support eligibility certification associated with dementia-related functional impairments: the IRIDE cohort study\nReferences\n16. Cui M, Zhang S, Liu Y, Gang X, Wang G. Grip strength and the risk of cognitive decline and dementia: a systematic review and meta-analysis of longitudinal cohort studies. Front Aging Neurosci. 2021;13: 625551.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n17. Tsuneishi M, Yamamoto T, Yamaguchi T, Kodama T, Sato T. Association between number of teeth and Alzheimer's disease using the National Database of Health Insurance Claims and Specific Health Checkups of Japan. PLoS ONE. 2021;16:e0251056.\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n18. Takeuchi K, Ohara T, Furuta M, Takeshita T, Shibata Y, Hata J, et al. Tooth loss and risk of dementia in the community: the Hisayama study. J Am Geriatr Soc. 2017;65:e95-100.\nArticle\nPubMed\nGoogle Scholar\n19. Lourida I, Hannon E, Littlejohns TJ, Langa KM, Hyppönen E, Kuźma E, et al. Association of lifestyle and genetic risk with incidence of dementia. JAMA. 2019;322:430-7.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n20. Kivipelto M, Ngandu T, Laatikainen T, Winblad B, Soininen H, Tuomilehto J. Risk score for the prediction of dementia risk in 20 years among middle aged people: a longitudinal, population-based study. Lancet Neurol. 2006;5:735-41.\nArticle\nPubMed\nGoogle Scholar\n21. Anstey KJ, Cherbuin N, Herath PM. Development of a new method for assessing global risk of Alzheimer's disease for use in population health approaches to prevention. Prev Sci. 2013;14(4):411-21.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/316", "#/texts/317", "#/texts/318", "#/texts/319", "#/texts/320", "#/texts/321"], "page_nos": [], "uuid": "f47e552f-1cd7-4b8b-8224-3778a2e064c4"}
{"doc_id": "2025__Development_of_a_predictive_model_for_long-term_care_and_support_eligibility_cer__W4413368004", "source_path": "<redacted:source_path>", "chunk_id": 24, "source_chunk_idxs": [29], "num_tokens": 471, "text": "Development of a predictive model for long-term care and support eligibility certification associated with dementia-related functional impairments: the IRIDE cohort study\nReferences\n22. Deckers K, van Boxtel MP, Schiepers OJ, de Vugt M, Munoz Sanchez JL, Anstey KJ, et al. Target risk factors for dementia prevention: a systematic review and Delphi consensus study on the evidence from observational studies. Int J Geriatr Psychiatry. 2015;30(3):234-46.\nArticle\nPubMed\nGoogle Scholar\n23. Tsutsui T, Muramatsu N. Care-needs certification in the long-term care insurance system of Japan. J Am Geriatr Soc. 2005;53:522-7.\nArticle\nPubMed\nGoogle Scholar\n24. Abe T, Kitamura A, Yamashita M, Kim H, Obuchi SP, Ishizaki T, et al. Simple screening models for cognitive impairment in community settings: the IRIDE cohort study. Geriatr Gerontol Int. 2022;22:292-7.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n25. Tamiya N, Noguchi H, Nishi A, Reich MR, Ikegami N, Hashimoto H, et al. Population ageing and wellbeing: lessons from Japan's long-term care insurance policy. Lancet. 2011;378:1183-92.\nArticle\nPubMed\nGoogle Scholar\n26. Noda H, Yamagishi K, Ikeda A, Asada T, Iso H. Identifcation of dementia using standard clinical assessments by primary care physicians in Japan. Geriatr Gerontol Int. 2018;18(5):738-44.\nArticle\nPubMed\nGoogle Scholar\n27. Satake S, Arai H. The revised Japanese version of the Cardiovascular Health Study criteria (revised J-CHS criteria). Geriatr Gerontol Int. 2020;20:992-3.\nArticle\nPubMed\nGoogle Scholar\n28. Wezler K, Böger A. Die Dynamik des arteriellen systems. Ergeb Physiol Biol Chem Exp Pharmakol. 1939;41:292-606.\nArticle\nGoogle Scholar", "doc_items_refs": ["#/texts/322", "#/texts/323", "#/texts/324", "#/texts/325", "#/texts/326", "#/texts/327", "#/texts/328"], "page_nos": [], "uuid": "b5fd90c6-9ca7-4d5c-966e-d3c3a2ee501e"}
{"doc_id": "2025__Development_of_a_predictive_model_for_long-term_care_and_support_eligibility_cer__W4413368004", "source_path": "<redacted:source_path>", "chunk_id": 25, "source_chunk_idxs": [30], "num_tokens": 468, "text": "Development of a predictive model for long-term care and support eligibility certification associated with dementia-related functional impairments: the IRIDE cohort study\nReferences\n29. Papaioannou TG, Protogerou AD, Vrachatis D, Konstantonis G, Aissopou E, Argyris A, et al. Mean arterial pressure values calculated using seven different methods and their associations with target organ deterioration in a single-center study of 1878 individuals. Hypertens Res. 2016;39:640-7.\nArticle\nPubMed\nGoogle Scholar\n30. Pencina MJ, D'Agostino RB Sr. Evaluating discrimination of risk prediction models: the C statistic. JAMA. 2015;314:1063-4.\nArticle\nCAS\nPubMed\nGoogle Scholar\n31. Anstey KJ, Cherbuin N, Herath PM, Qiu C, Kuller LH, Lopez OL, et al. A self-report risk index to predict occurrence of dementia in three independent cohorts of older adults: the ANU-ADRI. PLoS ONE. 2014;9:e86141.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n32. R Core Team. R: A language and environment for statistical computing. R Foundation for Statistical Computing. 2024.\n33. Therneau T. A package for survival analysis in R. R package version 3.8-3. 2024.\n34. Therneau TM, Grambsch PM. Modeling survival data: extending the Cox model. New York: Springer; 2000.\nBook\nGoogle Scholar\n35. Schröder MS, Culhane AC, Quackenbush J, Haibe-Kains B. Survcomp: an R/Bioconductor package for performance assessment and comparison of survival models. Bioinformatics. 2011;27:3206-8.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n36. Haibe-Kains B, Desmedt C, Sotiriou C, Bontempi G. A comparative study of survival models for breast cancer prognostication based on microarray data: does a single gene beat them all? Bioinformatics. 2008;24:2200-8.\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/329", "#/texts/330", "#/texts/331", "#/texts/332", "#/texts/333", "#/texts/334", "#/texts/335", "#/texts/336"], "page_nos": [], "uuid": "3284e160-f332-4552-a581-f36e7d8dec1f"}
{"doc_id": "2025__Development_of_a_predictive_model_for_long-term_care_and_support_eligibility_cer__W4413368004", "source_path": "<redacted:source_path>", "chunk_id": 26, "source_chunk_idxs": [31], "num_tokens": 350, "text": "Development of a predictive model for long-term care and support eligibility certification associated with dementia-related functional impairments: the IRIDE cohort study\nReferences\n37. Livingston G, Huntley J, Liu KY, Costafreda SG, Selbæk G, Alladi S, et al. Dementia prevention, intervention, and care: 2024 report of the Lancet standing Commission. Lancet. 2024;404:572-628.\nArticle\nPubMed\nGoogle Scholar\n38. Reynolds K, Lewis B, Nolen JDL, Kinney GL, Sathya B, He J. Alcohol consumption and risk of stroke: a meta-analysis. JAMA. 2003;289:579-88.\nArticle\nPubMed\nGoogle Scholar\n39. Shah RS, Cole JW. Smoking and stroke: the more you smoke the more you stroke. Expert Rev Cardiovasc Ther. 2010;8:917-32.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n40. Chan JCN, Malik V, Jia W, Kadowaki T, Yajnik CS, Yoon K-H, et al. Diabetes in Asia: epidemiology, risk factors, and pathophysiology. JAMA. 2009;301:2129-40.\nArticle\nCAS\nPubMed\nGoogle Scholar\n41. Ministry of Internal Affairs and Communications. The communications usage trend survey of 2023.\nhttps://www.soumu.go.jp/johotsusintokei/statistics/statistics05b1.html\n. Accessed 20 Feb 2025.\n42. National Institute of Population and Social Security Research. Regional Population Projections for Japan: 2020-2050. 2024.\nDownload references", "doc_items_refs": ["#/texts/337", "#/texts/338", "#/texts/339", "#/texts/340", "#/texts/341", "#/texts/342", "#/texts/343"], "page_nos": [], "uuid": "403d6ce0-d2dd-4f3a-8d4b-e6ec2d89d3fb"}
{"doc_id": "2025__Development_of_a_predictive_model_for_long-term_care_and_support_eligibility_cer__W4413368004", "source_path": "<redacted:source_path>", "chunk_id": 27, "source_chunk_idxs": [32, 33, 34], "num_tokens": 434, "text": "Development of a predictive model for long-term care and support eligibility certification associated with dementia-related functional impairments: the IRIDE cohort study\nAcknowledgements\nWe thank all the participants, the staff at the Tokyo Metropolitan Institute for Gerontology, and the staff of Itabashi City for their cooperation in providing long-term care certification data. We also thank Editage (\nwww.editage.jp\n) for English language editing.\n\nDevelopment of a predictive model for long-term care and support eligibility certification associated with dementia-related functional impairments: the IRIDE cohort study\nFunding\nThis work was supported by the Tokyo Metropolitan government.\n\nDevelopment of a predictive model for long-term care and support eligibility certification associated with dementia-related functional impairments: the IRIDE cohort study\nAuthor information\nAuthors and Affiliations\n1. Integrated Research Initiative for Living Well with Dementia, Tokyo Metropolitan Institute for Geriatrics and Gerontology, Tokyo, Japan Daichi Yamashiro, Hiroyuki Suzuki, Susumu Ogawa, Mari Yamashita, Yoshinori Fujiwara, Shuichi Awata, Masahiro Akishita &amp; Kenji Toba\n2. Research Team for Social Participation and Healthy Aging, Tokyo Metropolitan Institute for Geriatrics and Gerontology, Tokyo, Japan Daichi Yamashiro, Hiroyuki Suzuki, Susumu Ogawa, Takumi Abe &amp; Hiroshi Murayama\n3. Research Team for Promoting Independence and Mental Health, Tokyo Metropolitan Institute for Geriatrics and Gerontology, Tokyo, Japan Mari Yamashita &amp; Hiroyuki Sasai\n4. IdeaLab Inc., Tokyo, Japan Hiroki Moriya\n5. Research Team for Human Care, Tokyo Metropolitan Institute for Geriatrics and Gerontology, Tokyo, Japan Shuichi P. Obuchi &amp; Takumi Hirata\n6. School of Commerce, Meiji University, Tokyo, Japan Takumi Abe\n7. Tokyo Metropolitan Institute for Geriatrics and Gerontology, Tokyo, Japan Yoshinori Fujiwara, Shuichi Awata, Masahiro Akishita &amp; Kenji Toba\nAuthors", "doc_items_refs": ["#/texts/345", "#/texts/346", "#/texts/347", "#/texts/349", "#/texts/352", "#/texts/353", "#/texts/354", "#/texts/355", "#/texts/356", "#/texts/357", "#/texts/358", "#/texts/359"], "page_nos": [], "uuid": "12ac06f0-8f70-4241-aa59-487cd09a3752"}
{"doc_id": "2025__Development_of_a_predictive_model_for_long-term_care_and_support_eligibility_cer__W4413368004", "source_path": "<redacted:source_path>", "chunk_id": 28, "source_chunk_idxs": [35], "num_tokens": 281, "text": "Development of a predictive model for long-term care and support eligibility certification associated with dementia-related functional impairments: the IRIDE cohort study\nAuthor information\nAuthors and Affiliations\n1. Daichi Yamashiro\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n2. Hiroyuki Suzuki\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n3. Susumu Ogawa\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n4. Mari Yamashita\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n5. Hiroki Moriya\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n6. Hiroyuki Sasai\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n7. Shuichi P. Obuchi\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n8. Takumi Abe\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n9. Hiroshi Murayama\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n10. Takumi Hirata\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n11. Yoshinori Fujiwara\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n12. Shuichi Awata\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n13. Masahiro Akishita\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n14. Kenji Toba\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/360", "#/texts/361", "#/texts/362", "#/texts/363", "#/texts/364", "#/texts/365", "#/texts/366", "#/texts/367", "#/texts/368", "#/texts/369", "#/texts/370", "#/texts/371", "#/texts/372", "#/texts/373"], "page_nos": [], "uuid": "bfe9d83a-afac-4d6f-9224-0fc402dd5eec"}
{"doc_id": "2025__Development_of_a_predictive_model_for_long-term_care_and_support_eligibility_cer__W4413368004", "source_path": "<redacted:source_path>", "chunk_id": 29, "source_chunk_idxs": [36, 37, 38, 39], "num_tokens": 396, "text": "Development of a predictive model for long-term care and support eligibility certification associated with dementia-related functional impairments: the IRIDE cohort study\nAuthor information\nIRIDE Cohort Study Investigators\n- Tatsuro Ishizaki\n\nDevelopment of a predictive model for long-term care and support eligibility certification associated with dementia-related functional impairments: the IRIDE cohort study\nAuthor information\nContributions\nDY and HSu designed the study, curated and analyzed the data, and wrote the manuscript. SOg, and MY curated the data. HMo provided advice on analytical methods and formal analysis. HSa, SOb, TA, HMu, TH, and the IRIDE cohort study investigators collected the data and revised the manuscript. YF managed the research project. SA, MA, and KT supervised the research project. All authors read and approved of the final manuscript.\n\nDevelopment of a predictive model for long-term care and support eligibility certification associated with dementia-related functional impairments: the IRIDE cohort study\nAuthor information\nCorresponding author\nCorrespondence to\nDaichi Yamashiro\n.\n\nDevelopment of a predictive model for long-term care and support eligibility certification associated with dementia-related functional impairments: the IRIDE cohort study\nEthics declarations\nEthics approval and consent to participate\nWritten informed consent was obtained from all participants in each cohort study. All adult participants were deemed capable of providing ethical and medical consent by qualified mental health experts. This study was approved by the ethics review board of the Tokyo Metropolitan Institute for Geriatrics and Gerontology (No. R21-08, June 29, 2023). For this secondary use of research data, the study's purpose and details regarding data usage were disclosed through a dedicated website, public relations magazines, and postal mail. Participants were informed of their right to withdraw consent, and their cooperation was obtained under an opt-out model. This study was carried out in accordance with the World Medical Association Declaration of Helsinki.", "doc_items_refs": ["#/texts/376", "#/texts/378", "#/texts/380", "#/texts/381", "#/texts/382", "#/texts/385"], "page_nos": [], "uuid": "bec108ce-39f1-4577-874b-c588676030c5"}
{"doc_id": "2025__Development_of_a_predictive_model_for_long-term_care_and_support_eligibility_cer__W4413368004", "source_path": "<redacted:source_path>", "chunk_id": 30, "source_chunk_idxs": [40, 41, 42, 43], "num_tokens": 385, "text": "Development of a predictive model for long-term care and support eligibility certification associated with dementia-related functional impairments: the IRIDE cohort study\nEthics declarations\nConsent for publication\nNot applicable.\n\nDevelopment of a predictive model for long-term care and support eligibility certification associated with dementia-related functional impairments: the IRIDE cohort study\nEthics declarations\nCompeting interests\nThe authors declare no competing interests.\n\nDevelopment of a predictive model for long-term care and support eligibility certification associated with dementia-related functional impairments: the IRIDE cohort study\nAdditional information\nPublisher's Note\nSpringer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations.\n\nDevelopment of a predictive model for long-term care and support eligibility certification associated with dementia-related functional impairments: the IRIDE cohort study\nRights and permissions\nOpen Access\nThis article is licensed under a Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International License, which permits any non-commercial use, sharing, distribution and reproduction in any medium or format, as long as you give appropriate credit to the original author(s) and the source, provide a link to the Creative Commons licence, and indicate if you modified the licensed material. You do not have permission under this licence to share adapted material derived from this article or parts of it. The images or other third party material in this article are included in the article's Creative Commons licence, unless indicated otherwise in a credit line to the material. If material is not included in the article's Creative Commons licence and your intended use is not permitted by statutory regulation or exceeds the permitted use, you will need to obtain permission directly from the copyright holder. To view a copy of this licence, visit\nhttp://creativecommons.org/licenses/by-nc-nd/4.0/\n.\nReprints and permissions", "doc_items_refs": ["#/texts/387", "#/texts/389", "#/texts/392", "#/texts/398", "#/texts/399", "#/texts/400", "#/texts/401", "#/texts/402"], "page_nos": [], "uuid": "8487d78a-578e-434e-a4d3-7c8f761ea258"}
{"doc_id": "2025__Development_of_a_predictive_model_for_long-term_care_and_support_eligibility_cer__W4413368004", "source_path": "<redacted:source_path>", "chunk_id": 31, "source_chunk_idxs": [44, 45, 46, 47], "num_tokens": 342, "text": "Development of a predictive model for long-term care and support eligibility certification associated with dementia-related functional impairments: the IRIDE cohort study\nAbout this article\nCite this article\nYamashiro, D., Suzuki, H., Ogawa, S.\net al.\nDevelopment of a predictive model for long-term care and support eligibility certification associated with dementia-related functional impairments: the IRIDE cohort study.\nBMC Public Health\n25\n, 2867 (2025). https://doi.org/10.1186/s12889-025-23681-5\nDownload citation\n- Received : 10 March 2025\n- Accepted : 20 June 2025\n- Published : 21 August 2025\n- DOI : https://doi.org/10.1186/s12889-025-23681-5\n\nDevelopment of a predictive model for long-term care and support eligibility certification associated with dementia-related functional impairments: the IRIDE cohort study\nAbout this article\nKeywords\n- Dementia-related functional impairments\n- Community-dwelling older adults\n- The LTCI system\n- IRIDE-Cohort study\nDownload PDF\nAdvertisement\n\nDevelopment of a predictive model for long-term care and support eligibility certification associated with dementia-related functional impairments: the IRIDE cohort study\nAbout this article\nKeywords\nBMC Public Health\nISSN: 1471-2458\n\nDevelopment of a predictive model for long-term care and support eligibility certification associated with dementia-related functional impairments: the IRIDE cohort study\nAbout this article\nKeywords\nContact us\n- General enquiries:\njournalsubmissions@springernature.com", "doc_items_refs": ["#/texts/405", "#/texts/406", "#/texts/407", "#/texts/408", "#/texts/409", "#/texts/410", "#/texts/411", "#/texts/412", "#/texts/413", "#/texts/414", "#/texts/415", "#/texts/417", "#/texts/418", "#/texts/419", "#/texts/420", "#/texts/421", "#/texts/422", "#/texts/424", "#/texts/426"], "page_nos": [], "uuid": "5896dde8-d5b7-43c1-96b7-fda9adc8127e"}
