{"doc_id": "2025__Neurotoxic_Effects_of_PM25_Mechanisms_Evidence_and_Public_Health_Implications__W4414145558", "source_path": "<redacted:source_path>", "chunk_id": 0, "source_chunk_idxs": [0, 1], "num_tokens": 260, "text": "Neurotoxic Effects of PM2.5: Mechanisms, Evidence, and Public Health Implications\nTheoretical and Natural Science\nOpen access\nHome\nAbout series\nAims and scope\nEditorial board\nAnnouncements\nIndexing\nFAQs\nPolicies\nPublication ethics\nPolicies for authors\nPolicies for reviewers\nPolicies for editors\nPolicies for organizers\nOpen access policy\nPrivacy policy\nDeclaration of interests\nAuthorship policy\nPreservation\nVolumes\nTNS Vol.140\nTNS Vol.139\nTNS Vol.138\nAll volumes\nGuides\nGuide for organizers\nGuide for authors\nContact\n\nNeurotoxic Effects of PM2.5: Mechanisms, Evidence, and Public Health Implications\nNeurotoxic Effects of PM2.5: Mechanisms, Evidence, and Public Health Implications\nDownload PDF\nResearch Article\nOpen access\nJiaqi  Xia\n1*\n- 1\nCushing Academy, Massachusetts, United States\n- *corresponding author jiaqixia27@cushing.org\nPublished on 9 September 2025 |\nhttps://doi.org/10.54254/2753-8818/2025.AU26577\nTNS Vol.128\nISSN (Print): 2753-8818\nISSN (Online): 2753-8826\nISBN (Print): 978-1-80590-333-8\nISBN (Online): 978-1-80590-334-5\nDownload Cover", "doc_items_refs": ["#/texts/1", "#/texts/2", "#/texts/3", "#/texts/4", "#/texts/5", "#/texts/6", "#/texts/7", "#/texts/8", "#/texts/9", "#/texts/10", "#/texts/11", "#/texts/12", "#/texts/13", "#/texts/14", "#/texts/15", "#/texts/16", "#/texts/17", "#/texts/18", "#/texts/19", "#/texts/20", "#/texts/21", "#/texts/22", "#/texts/23", "#/texts/24", "#/texts/25", "#/texts/26", "#/texts/27", "#/texts/28", "#/texts/29", "#/texts/31", "#/texts/32", "#/texts/33", "#/texts/35", "#/texts/36", "#/texts/37", "#/texts/38", "#/texts/39", "#/texts/40", "#/texts/41", "#/texts/42", "#/texts/43", "#/texts/44", "#/texts/45", "#/texts/46"], "page_nos": [], "uuid": "dd743d79-3002-45b7-a1c8-103156648c2b"}
{"doc_id": "2025__Neurotoxic_Effects_of_PM25_Mechanisms_Evidence_and_Public_Health_Implications__W4414145558", "source_path": "<redacted:source_path>", "chunk_id": 1, "source_chunk_idxs": [2], "num_tokens": 285, "text": "Neurotoxic Effects of PM2.5: Mechanisms, Evidence, and Public Health Implications\nAbstract\nAir pollution is a global health concern, and among its various components, fine particulate matter (PM2.5) poses one of the most serious risks to human well-being. While its effects on the respiratory and cardiovascular systems are well-established, emerging research reveals its significant impact on the central nervous system. This paper reviews current knowledge on the neurotoxic effects of PM2.5, focusing on how these particles enter the brain and interfere with neurological function. Drawing on evidence from human population studies, animal models, and cellular experiments, this paper explore how PM2.5 contributes to neuroinflammation, oxidative stress, and neurotransmitter disruption, leading to conditions such as cognitive impairment, depression, AexploresDHD, and dementia. We also examine recent advances in research techniques and policy implications. Particular attention is given to vulnerable populations such as children and the elderly, who are disproportionately affected by PM2.5 exposure. Additionally, we discuss the role of PM2.5 chemical composition in determining its neurotoxicity, highlighting the importance of source-specific interventions. The findings emphasise the urgent need to address air pollution not only as an environmental issue, but as a public health priority with serious neurological consequences.", "doc_items_refs": ["#/texts/48"], "page_nos": [], "uuid": "641d3701-9003-45e2-958a-a7275bb535ac"}
{"doc_id": "2025__Neurotoxic_Effects_of_PM25_Mechanisms_Evidence_and_Public_Health_Implications__W4414145558", "source_path": "<redacted:source_path>", "chunk_id": 2, "source_chunk_idxs": [3], "num_tokens": 421, "text": "Neurotoxic Effects of PM2.5: Mechanisms, Evidence, and Public Health Implications\nKeywords:\nNeurotoxic Effect, PM2.5, public health.\nDownload PDF\nView PDF\nXia,J. (2025). Neurotoxic Effects of PM2.5: Mechanisms, Evidence, and Public Health Implications. Theoretical and Natural Science,128,122-129.\nExport citation\n1. Introduction\nAir pollution, particularly exposure to fine particulate matter (PM2.5), has emerged as one of the most pressing environmental health challenges of the modern era. PM2.5 refers to airborne particles with aerodynamic diameters less than 2.5 micrometres-small enough to bypass the body's natural defense systems, penetrate deep into the lungs, and even enter the bloodstream [1,2]. These particles are primarily released by vehicle emissions, industrial combustion, fossil fuel burning, and biomass smoke. Traditionally, public health concerns around PM2.5 have focused on respiratory diseases, cardiovascular complications, and premature mortality. However, in the past decade, a growing body of scientific literature has shifted attention to the central nervous system, particularly the brain.\nEmerging evidence suggests that PM2.5 can cross the blood-brain barrier (BBB) and induce harmful effects on brain cells and neural circuits. This ability raises serious concerns, as the human brain is particularly vulnerable to external insults due to its high lipid content, high oxygen consumption, and limited capacity for regeneration [3,4]. The small size and complex chemical composition of PM2.5-including heavy metals, polycyclic aromatic hydrocarbons (PAHs), and biological residues-enhance its potential to interfere with brain function. Once inside the central nervous system, these particles can trigger oxidative stress, inflammatory responses, and neurotransmitter dysregulation, which are all linked to neurological conditions such as Alzheimer's disease (AD), Parkinson's disease (PD), anxiety, and depression [5,6].", "doc_items_refs": ["#/texts/50", "#/texts/51", "#/texts/52", "#/texts/53", "#/texts/54", "#/texts/55", "#/texts/56", "#/texts/57"], "page_nos": [], "uuid": "b2b31054-fad2-4549-a151-fc4e5b1c48de"}
{"doc_id": "2025__Neurotoxic_Effects_of_PM25_Mechanisms_Evidence_and_Public_Health_Implications__W4414145558", "source_path": "<redacted:source_path>", "chunk_id": 3, "source_chunk_idxs": [4], "num_tokens": 440, "text": "Neurotoxic Effects of PM2.5: Mechanisms, Evidence, and Public Health Implications\nKeywords:\nThe effects of PM2.5 are not limited to the aging brain. Infants, children, and even fetuses may experience altered brain development due to early-life exposure to polluted air. Epidemiological studies in urban environments have shown associations between high PM2.5 levels and increased risk of cognitive delays, attention-deficit/hyperactivity disorder (ADHD), and lower IQ scores in school-aged children [7]. These findings raise urgent ethical and policy questions regarding air quality standards, urban planning, and public health intervention.\nThis paper aims to synthesise existing scientific knowledge on the neurotoxicity of PM2.5, focusing on four major aspects: (1) the current assumptions about how PM2.5 affects the brain; (2) the research methodologies used to investigate these effects; (3) empirical findings from both animal and human studies; and (4) recent developments and future research directions. By bringing together diverse lines of evidence, we aim to highlight the neurological risks posed by PM2.5 and the importance of addressing this issue in public health policy and environmental regulation.\n2. Current scientific assumptions on PM2.5 neurotoxicity\nScientific understanding of how PM2.5 affects the human nervous system is based on several well-established assumptions derived from both epidemiological evidence and experimental studies. These assumptions guide research designs and shape policy discussions about the health implications of air pollution.\n2.1. PM2.5 can penetrate the brain\nThe first major assumption is that PM2.5 particles can cross the BBB and enter brain tissue. This hypothesis has been supported by studies showing that inhaled ultrafine particles can translocate from the nasal cavity via the olfactory nerve or through systemic circulation [1,3]. Once in the brain, these particles may deposit in sensitive regions such as the hippocampus, striatum, and cortex-areas critical for memory, movement, and decision-making [3].\n2.2. Oxidative stress and inflammation are primary mechanisms", "doc_items_refs": ["#/texts/58", "#/texts/59", "#/texts/60", "#/texts/61", "#/texts/62", "#/texts/63", "#/texts/64"], "page_nos": [], "uuid": "866bca8b-1152-4b20-b6ac-b7a562d25050"}
{"doc_id": "2025__Neurotoxic_Effects_of_PM25_Mechanisms_Evidence_and_Public_Health_Implications__W4414145558", "source_path": "<redacted:source_path>", "chunk_id": 4, "source_chunk_idxs": [5], "num_tokens": 422, "text": "Neurotoxic Effects of PM2.5: Mechanisms, Evidence, and Public Health Implications\nKeywords:\nA second assumption is that oxidative stress and inflammation are the dominant pathways through which PM2.5 causes neurological damage. The particles carry metals and organic chemicals that can generate reactive oxygen species (ROS) within brain cells. ROS accumulation disrupts cellular signalling and damages DNA, proteins, and membranes. Concurrently, PM2.5 exposure leads to the release of pro-inflammatory cytokines, such as IL-6 and TNF-α, both locally in the brain and systemically [4]. These inflammatory processes contribute to neurodegeneration, cognitive deficits, and mood disorders.\n2.3. Neurodevelopmental windows are highly vulnerable\nA third widely accepted assumption is that early life-particularly fetal development and early childhood-is a critical window of vulnerability to PM2.5 exposure. During this period, the brain undergoes rapid growth, synaptogenesis, and myelination. Studies have shown that prenatal or early-life exposure to air pollution correlates with delayed language acquisition, lower IQ, and higher prevalence of ADHD-like behaviours [8]. These effects are believed to result from altered neural circuitry formation and chronic neuroinflammation initiated by environmental insults.\n2.4. Neurotransmitter disruption plays a central role\nPM2.5 exposure is also assumed to impair neurotransmitter systems, particularly dopamine, serotonin, and glutamate pathways. Dopamine dysfunction, for example, has been implicated in anxiety, depression, and PD. Sang et al. demonstrated that certain phenyl-containing compounds within PM2.5 interfere with dopamine receptor D1 (Drd1) signalling in mice, leading to depression-like behaviours. This assumption suggests that pollution exposure may act as a risk factor for psychiatric as well as neurodegenerative conditions.\n2.5. Effects are cumulative and long-term", "doc_items_refs": ["#/texts/65", "#/texts/66", "#/texts/67", "#/texts/68", "#/texts/69", "#/texts/70"], "page_nos": [], "uuid": "dc7b5337-f6d8-45c4-b913-65969ad50e96"}
{"doc_id": "2025__Neurotoxic_Effects_of_PM25_Mechanisms_Evidence_and_Public_Health_Implications__W4414145558", "source_path": "<redacted:source_path>", "chunk_id": 5, "source_chunk_idxs": [6], "num_tokens": 438, "text": "Neurotoxic Effects of PM2.5: Mechanisms, Evidence, and Public Health Implications\nKeywords:\nFinally, researchers assume that PM2.5 exposure has cumulative effects, with long-term exposure leading to gradual and irreversible neurological damage. Chronic inhalation of polluted air is associated with progressive cognitive decline and increased risk of dementia and AD [9]. Even moderate exposure levels, when sustained over years, appear sufficient to initiate changes in brain structure and function. Together, these assumptions form the foundation for ongoing scientific investigations into PM2.5 neurotoxicity and underscore the need for preventive interventions targeting both high-exposure environments and vulnerable populations.\n3. Research methods used to study PM2.5's neurotoxic effects\nTo investigate the neurotoxic effects of PM2.5, researchers employ a wide range of methodologies from both population-level epidemiology and experimental neuroscience. These methods aim to reveal how particulate matter affects the structure, function, and biochemistry of the human brain and to identify the biological pathways responsible for observed damage.\n3.1. Epidemiological approaches\nEpidemiological studies form the foundation of our understanding of PM2.5's neurological impacts in humans. These studies use large datasets to analyse associations between pollution exposure and neurological outcomes, such as dementia or cognitive decline. For instance, Kioumourtzoglou et al. studied Medicare data from millions of elderly Americans and found a statistically significant increase in hospital admissions for Alzheimer's and PD in regions with higher PM2.5 levels. Researchers also make use of long-term health databases like the UK Biobank, which contains both cognitive assessments and MRI brain scans. Gale et al. used this resource to link PM2.5 exposure to reduced hippocampal volume, a region essential for learning and memory. These studies typically rely on satellite data, land-use regression models, or air monitoring stations to estimate pollution exposure. Advanced models can estimate individual-level exposure based on home addresses, improving the precision of health outcome associations.\n3.2. Animal and cellular models", "doc_items_refs": ["#/texts/71", "#/texts/72", "#/texts/73", "#/texts/74", "#/texts/75", "#/texts/76"], "page_nos": [], "uuid": "34749da6-058b-4455-b6c2-e309191a160f"}
{"doc_id": "2025__Neurotoxic_Effects_of_PM25_Mechanisms_Evidence_and_Public_Health_Implications__W4414145558", "source_path": "<redacted:source_path>", "chunk_id": 6, "source_chunk_idxs": [7], "num_tokens": 446, "text": "Neurotoxic Effects of PM2.5: Mechanisms, Evidence, and Public Health Implications\nKeywords:\nWhile epidemiological studies can identify correlations, animal and cell-based experiments are used to establish causality and uncover mechanisms. Rodent models are commonly used because they allow researchers to control exposure conditions and perform invasive analysis. Kwon et al., for example, exposed rats to urban PM2.5 and observed reduced neuronal cell viability and signs of apoptosis (cell death) [10]. Histological examination revealed that these effects were especially pronounced in the hippocampus and cortex. Similarly, cell culture experiments using human neuronal cell lines provide insight into the molecular mechanisms of toxicity. Researchers often measure markers of oxidative stress, inflammatory response, synaptic protein levels, and mitochondrial function following PM2.5 exposure. These methods are valuable for screening different PM2.5 components to determine which chemicals pose the greatest threat to neurons.\n3.3. Bioinformatics and chemical profiling\nAn emerging approach combines chemical fractionation, bioinformatics, and gene expression profiling. For instance, Sang et al. analysed coal-derived PM2.5 and isolated specific phenyl-containing compounds. Using computational docking and mRNA sequencing, they identified interactions with Drd1 pathways and linked them to behavioral symptoms of depression in mice. This technique is powerful because it narrows down which specific pollutants-among the thousands present in PM2.5-are most neurotoxic.\n3.4. Brain imaging and cognitive testing\nNeuroimaging tools such as functional MRI (fMRI) and PET scans are increasingly used to observe structural and functional changes in the brain. These methods can detect atrophy, reduced blood flow, and neuronal connectivity changes in response to pollution. Combined with cognitive testing, they provide a non-invasive way to quantify pollution-related brain changes in living humans. Together, these diverse methodologies allow researchers to link population-level trends with cellular-level mechanisms and to identify pathways through which PM2.5 disrupts brain health.\n4. Neurological consequences of PM2.5", "doc_items_refs": ["#/texts/77", "#/texts/78", "#/texts/79", "#/texts/80", "#/texts/81", "#/texts/82"], "page_nos": [], "uuid": "0ddd6b65-3fcb-4e65-b043-4c84d29b9930"}
{"doc_id": "2025__Neurotoxic_Effects_of_PM25_Mechanisms_Evidence_and_Public_Health_Implications__W4414145558", "source_path": "<redacted:source_path>", "chunk_id": 7, "source_chunk_idxs": [8], "num_tokens": 482, "text": "Neurotoxic Effects of PM2.5: Mechanisms, Evidence, and Public Health Implications\nKeywords:\nThe body of scientific literature investigating the neurological effects of PM2.5 has grown substantially over the last decade. Findings from human studies, animal experiments, and in vitro research converge on the conclusion that exposure to PM2.5 significantly impairs brain function and structure. This section presents key results from multiple lines of research, highlighting the widespread consequences of long-term and early-life exposure to PM2.5.\n4.1. Cognitive decline and structural brain changes\nNumerous large-scale studies have reported that individuals exposed to high levels of PM2.5 experience faster cognitive decline and higher risks of dementia. In one prominent study, Kioumourtzoglou et al. found that every 1 μg/m³ increase in long-term PM2.5 exposure was associated with a measurable rise in hospital admissions for AD among elderly residents of the northeastern United States. These findings suggest that cumulative exposure plays a significant role in neurodegenerative disease progression.\nIn parallel, structural imaging studies from the UK Biobank have shown that long-term PM2.5 exposure is associated with smaller hippocampal volumes and reduced white matter integrity, particularly in older adults. These brain changes are consistent with impaired learning, memory, and emotional regulation.\n4.2. Effects on mental health and behaviour\nBeyond cognitive effects, PM2.5 exposure is also linked to mood and behavioural disorders. For example, Jia et al. demonstrated in a mouse model that exposure to coal-derived PM2.5 led to increased anxiety- and depression-like behaviours, such as decreased exploration and increased immobility [11]. Behavioural assays such as the open-field test and marble-burying test confirmed the emotional disturbances. These behavioural changes were matched by alterations in dopamine signalling, suggesting that PM2.5 affects the brain's reward and motivation circuits. Furthermore, Sang et al. identified that specific phenyl-containing compounds in PM2.5 directly bind to Drd1, leading to disrupted neurotransmitter signalling. This precise molecular link between PM2.5 composition and neurobehavioural outcomes underscores the importance of examining chemical speciation when assessing pollutant toxicity.\n4.3. Impacts on developing brains", "doc_items_refs": ["#/texts/83", "#/texts/84", "#/texts/85", "#/texts/86", "#/texts/87", "#/texts/88", "#/texts/89"], "page_nos": [], "uuid": "c01bc9b2-6eea-412b-8164-d5082c91db04"}
{"doc_id": "2025__Neurotoxic_Effects_of_PM25_Mechanisms_Evidence_and_Public_Health_Implications__W4414145558", "source_path": "<redacted:source_path>", "chunk_id": 8, "source_chunk_idxs": [9], "num_tokens": 506, "text": "Neurotoxic Effects of PM2.5: Mechanisms, Evidence, and Public Health Implications\nKeywords:\nInfants and children are particularly vulnerable to PM2.5. Studies have shown that prenatal and early-life exposure can have long-term effects on neurodevelopment. Wang et al. found that children exposed to higher PM2.5 concentrations during pregnancy were more likely to exhibit ADHD-like behaviours. These associations were strongest in urban environments, where exposure levels were higher and more consistent. Moreover, a study by Henn et al. highlighted that early exposure to particulate matter is associated with delayed language development, reduced working memory, and poor academic performance in school-aged children. These results suggest that PM2.5 exposure during critical developmental windows can lead to lifelong impairments.\n4.4. Cellular and molecular evidence\nAt the cellular level, researchers have observed multiple mechanisms through which PM2.5 causes damage. Kwon et al. reported that exposure to urban PM2.5 triggered both autophagy and apoptosis in neurons, contributing to substantial neuronal cell death. The study also identified a downregulation of brain-derived neurotrophic factor (BDNF), a protein essential for neuronal survival and synaptic plasticity. Another critical finding is the breakdown of the BBB due to PM2.5 exposure. Hedges et al. showed that long-term exposure in mice led to increased BBB permeability, allowing harmful substances and immune cells to enter the brain [12]. This permeability was accompanied by elevated levels of inflammatory cytokines such as TNF-α and IL-6, indicating chronic neuroinflammation.\n4.5. Regional and chemical specificity\nImportantly, not all PM2.5 is equally toxic. Its harmfulness depends on the source and composition. For instance, pollution dominated by coal combustion or vehicular emissions tends to contain more neurotoxic substances, such as heavy metals (lead, manganese) and PAHs. These components have been strongly associated with oxidative damage, DNA breaks, and abnormal synaptic function [3,4]. Taken together, these findings provide compelling evidence that PM2.5 negatively affects the nervous system at multiple levels-from neurotransmitter signalling and gene expression to brain structure and behaviour-especially in vulnerable populations like children and the elderly.\n5. Recent developments and future directions", "doc_items_refs": ["#/texts/90", "#/texts/91", "#/texts/92", "#/texts/93", "#/texts/94", "#/texts/95"], "page_nos": [], "uuid": "b83e176e-06f9-48e6-a725-0fb9f73c8080"}
{"doc_id": "2025__Neurotoxic_Effects_of_PM25_Mechanisms_Evidence_and_Public_Health_Implications__W4414145558", "source_path": "<redacted:source_path>", "chunk_id": 9, "source_chunk_idxs": [10], "num_tokens": 427, "text": "Neurotoxic Effects of PM2.5: Mechanisms, Evidence, and Public Health Implications\nKeywords:\nRecent research on the neurotoxicity of PM2.5 has advanced significantly beyond establishing simple associations. New developments in technology, analytical methods, and interdisciplinary collaboration are helping scientists understand the precise mechanisms of action and identify which particle components are most harmful to the brain. These advancements offer promising avenues for targeted interventions, public health strategies, and policy improvements.\n5.1. Advances in chemical and molecular profiling\nOne of the most important breakthroughs is the development of non-targeted chemical analysis and bioinformatics-based screening to identify the specific toxicants within PM2.5. Instead of treating PM2.5 as a uniform substance, scientists now isolate and test individual chemical species. For instance, Sang et al. used molecular docking and transcriptomic analysis to show that certain phenyl-containing compounds in coal-derived PM2.5 directly impair dopamine signalling by binding to Drd1 receptors. This pinpointed mechanism represents a shift from generalised toxicology to precision environmental health, where particular compounds can be regulated based on their biological effects.\n5.2. New imaging and biomarker techniques\nBrain imaging technologies such as fMRI, PET scans, and diffusion tensor imaging (DTI) are increasingly used to detect subtle structural and functional changes in the brain linked to pollution exposure. Hedges et al. demonstrated that long-term PM2.5 exposure was associated with microstructural white matter changes, even in cognitively healthy adults. These techniques offer a non-invasive method for identifying early biomarkers of pollution-related brain damage, which can be used for screening and intervention.\nResearchers are also using blood- and saliva-based biomarkers to detect elevated levels of inflammatory cytokines, oxidative stress indicators, and neurodegeneration-related proteins. These biomarkers could eventually be integrated into clinical settings to assess an individual's neurological risk from pollution exposure.\n5.3. Focus on neurodevelopment and vulnerable populations", "doc_items_refs": ["#/texts/96", "#/texts/97", "#/texts/98", "#/texts/99", "#/texts/100", "#/texts/101", "#/texts/102"], "page_nos": [], "uuid": "4f3fecdb-404f-4ab1-93db-0c51f8b993a4"}
{"doc_id": "2025__Neurotoxic_Effects_of_PM25_Mechanisms_Evidence_and_Public_Health_Implications__W4414145558", "source_path": "<redacted:source_path>", "chunk_id": 10, "source_chunk_idxs": [11], "num_tokens": 380, "text": "Neurotoxic Effects of PM2.5: Mechanisms, Evidence, and Public Health Implications\nKeywords:\nThere is growing concern about the impact of PM2.5 on the developing brain. Recent studies have linked prenatal and early-life exposure to disorders such as autism spectrum disorder (ASD) and ADHD. Research is now focusing on identifying critical exposure windows, such as the second trimester of pregnancy, during which brain development is most susceptible to environmental toxins. This research is especially important for informing guidelines on air quality around schools, childcare centres, and residential areas.\nPublic health experts are also paying more attention to socioeconomically disadvantaged communities, which often experience higher PM2.5 exposure due to industrial proximity and poor infrastructure. This adds an important environmental justice dimension to pollution policy, as it highlights the unequal burden of neurotoxic risk.\n6. Conclusion\nThe scientific evidence is now overwhelmingly clear: PM2.5 poses a serious threat to the human nervous system. Once considered mainly a risk factor for respiratory and cardiovascular disease, fine particulate matter has been revealed to exert significant effects on brain structure and function. This paper has synthesised evidence from epidemiological studies, animal research, and molecular biology to illustrate how PM2.5 contributes to a range of neurological outcomes, including cognitive decline, depression, ADHD, and dementia.\nKey assumptions underpinning this research include PM2.5's ability to cross the BBB, induce oxidative stress and inflammation, and disrupt neurotransmitter systems-particularly those involving dopamine and serotonin. These mechanisms have been consistently observed across species, age groups, and geographic regions. Furthermore, recent research has begun to identify the specific chemical constituents of PM2.5 most responsible for neurotoxicity, moving the field toward more targeted regulatory responses.", "doc_items_refs": ["#/texts/103", "#/texts/104", "#/texts/105", "#/texts/106", "#/texts/107"], "page_nos": [], "uuid": "d078b8c8-cfa7-4e0d-82d0-b80664febf1a"}
{"doc_id": "2025__Neurotoxic_Effects_of_PM25_Mechanisms_Evidence_and_Public_Health_Implications__W4414145558", "source_path": "<redacted:source_path>", "chunk_id": 11, "source_chunk_idxs": [12], "num_tokens": 171, "text": "Neurotoxic Effects of PM2.5: Mechanisms, Evidence, and Public Health Implications\nKeywords:\nOf particular concern is the impact on children and vulnerable populations, whose brains are still developing or already compromised. The effects of early-life exposure can be lifelong and irreversible, and may contribute to rising rates of neurodevelopmental and behavioural disorders in polluted urban environments. Looking forward, addressing this issue requires a multi-pronged approach. Policymakers must update air quality standards to reflect neurological outcomes, while public health initiatives should focus on exposure reduction in high-risk areas. Scientists must continue refining exposure models and identifying biomarkers for early diagnosis and intervention. At the same time, individuals can adopt preventive behaviours, such as using indoor air purifiers and avoiding outdoor activity during pollution peaks.", "doc_items_refs": ["#/texts/108"], "page_nos": [], "uuid": "b8b35bfd-9ed7-4554-8e04-951ddb6a68ef"}
{"doc_id": "2025__Neurotoxic_Effects_of_PM25_Mechanisms_Evidence_and_Public_Health_Implications__W4414145558", "source_path": "<redacted:source_path>", "chunk_id": 12, "source_chunk_idxs": [13], "num_tokens": 509, "text": "Neurotoxic Effects of PM2.5: Mechanisms, Evidence, and Public Health Implications\nReferences\n[1]. Block ML, Calderón-Garcidueñas L. Air pollution: mechanisms of neuroinflammation and CNS disease [J]. Trends in Neurosciences, 2009, 32(9): 506-516. DOI: 10.1016/j.tins.2009.05.009.\n[2]. Cullen B, Newby D, Lee D, et al. Cross-sectional and longitudinal analyses of outdoor air pollution exposure and cognitive function in UK Biobank [J]. Scientific Reports, 2018, 8(1): 12089.\n[3]. Calderón-Garcidueñas L, Solt AC, Henríquez-Roldán C, et al. Long-term air pollution exposure is associated with neuroinflammation, an altered innate immune response, disruption of the blood-brain barrier, ultrafine particulate deposition, and accumulation of amyloid beta-42 and alpha-synuclein in children and young adults [J]. Toxicologic Pathology, 2008, 36(2): 289-310. DOI: 10.1177/0192623307313011.\n[4]. Costa LG, Cole TB, Dao K, et al. Developmental impact of air pollution on brain function [J]. Neurochemistry International, 2019, 131: 104580.\n[5]. Murata K, Kikuchi H, Hasegawa M, et al. Air pollution and the risk of Parkinson's disease: A review [J]. Movement Disorders, 2022, 37(6): 1155-1166. DOI: 10.1002/mds.28974.\n[6]. Ji S, Guo Y, Yan W, et al. PM2.5 exposure contributes to anxiety and depression-like behaviors via phenyl-containing compounds interfering with dopamine receptor [J]. Proceedings of the National Academy of Sciences, 2024, 121(21): e2319595121.\n[7]. Liu B, Fang X, Strodl E, et al. Fetal exposure to air pollution in late pregnancy significantly increases ADHD-risk behavior in early childhood [J]. International Journal of Environmental Research and Public Health, 2022, 19(17): 10482.", "doc_items_refs": ["#/texts/110", "#/texts/111", "#/texts/112", "#/texts/113", "#/texts/114", "#/texts/115", "#/texts/116"], "page_nos": [], "uuid": "84d8e28f-97ac-46cd-a351-88bc0065c6ea"}
{"doc_id": "2025__Neurotoxic_Effects_of_PM25_Mechanisms_Evidence_and_Public_Health_Implications__W4414145558", "source_path": "<redacted:source_path>", "chunk_id": 13, "source_chunk_idxs": [14], "num_tokens": 354, "text": "Neurotoxic Effects of PM2.5: Mechanisms, Evidence, and Public Health Implications\nReferences\n[8]. Chang YC, Chen WT, Su SH, et al. PM2.5 exposure and incident attention-deficit/hyperactivity disorder during the prenatal and postnatal periods: A birth cohort study [J]. Environmental Research, 2022, 214: 113769.\n[9]. Kioumourtzoglou MA, Schwartz JD, Weisskopf MG, et al. Long-term PM2.5 exposure and neurological hospital admissions in the northeastern United States [J]. Environmental Health Perspectives, 2016, 124(1): 23-29. DOI: 10.1289/ehp.1408973.\n[10]. Ferreira APS, Ramos JMO, Gamaro GD, et al. Experimental rodent models exposed to fine particulate matter (PM2.5) highlighting the injuries in the central nervous system: A systematic review [J]. Atmospheric Pollution Research, 2022, 13(5): 101407.\n[11]. Zundel CG, Ryan P, Brokamp C, et al. Air pollution, depressive and anxiety disorders, and brain effects: A systematic review [J]. Neurotoxicology, 2022, 93: 272-300.\n[12]. Balboni E, Filippini T, Crous-Bou M, et al. The association between air pollutants and hippocampal volume from magnetic resonance imaging: a systematic review and meta-analysis [J]. Environmental Research, 2022, 204: 111976.", "doc_items_refs": ["#/texts/117", "#/texts/118", "#/texts/119", "#/texts/120", "#/texts/121"], "page_nos": [], "uuid": "d83f4bc5-e0d3-443b-bf3b-2633094eb96f"}
{"doc_id": "2025__Neurotoxic_Effects_of_PM25_Mechanisms_Evidence_and_Public_Health_Implications__W4414145558", "source_path": "<redacted:source_path>", "chunk_id": 14, "source_chunk_idxs": [15, 16, 17], "num_tokens": 216, "text": "Neurotoxic Effects of PM2.5: Mechanisms, Evidence, and Public Health Implications\nCite this article\nXia,J. (2025). Neurotoxic Effects of PM2.5: Mechanisms, Evidence, and Public Health Implications. Theoretical and Natural Science,128,122-129.\n\nNeurotoxic Effects of PM2.5: Mechanisms, Evidence, and Public Health Implications\nData availability\nThe datasets used and/or analyzed during the current study will be available from the authors upon reasonable request.\n\nNeurotoxic Effects of PM2.5: Mechanisms, Evidence, and Public Health Implications\nDisclaimer/Publisher's Note\nThe statements, opinions and data contained in all publications are solely those of the individual author(s) and contributor(s)\nand not of EWA Publishing and/or the editor(s). EWA Publishing and/or the editor(s) disclaim responsibility for any injury to\npeople or property resulting from any ideas, methods, instructions or products referred to in the content.", "doc_items_refs": ["#/texts/123", "#/texts/125", "#/texts/127", "#/texts/128", "#/texts/129"], "page_nos": [], "uuid": "c4ce7c8e-2459-4c83-811d-c35b8eb2e82a"}
{"doc_id": "2025__Neurotoxic_Effects_of_PM25_Mechanisms_Evidence_and_Public_Health_Implications__W4414145558", "source_path": "<redacted:source_path>", "chunk_id": 15, "source_chunk_idxs": [18], "num_tokens": 377, "text": "Neurotoxic Effects of PM2.5: Mechanisms, Evidence, and Public Health Implications\nAbout volume\nVolume title: Proceedings of ICBioMed 2025 Symposium: AI for Healthcare: Advanced Medical Data Analytics and Smart Rehabilitation\nISBN：978-1-80590-333-8(Print) / 978-1-80590-334-5(Online)\nEditor：Alan Wang\nConference website:\nhttps://2025.icbiomed.org/auckland.html\nConference date: 17 October 2025\nSeries: Theoretical and Natural Science\nVolume number: Vol.128\nISSN：2753-8818(Print) / 2753-8826(Online)\n© 2024 by the author(s). Licensee EWA Publishing, Oxford, UK. This article is an open access article distributed under the terms and\nconditions of the\nCreative Commons Attribution (CC BY)\nlicense. Authors who\npublish this series agree to the following terms: 1. Authors retain copyright and grant the series right of first publication with the work simultaneously licensed under a Creative Commons\nAttribution License that allows others to share the work with an acknowledgment of the work's authorship and initial publication in this\nseries. 2. Authors are able to enter into separate, additional contractual arrangements for the non-exclusive distribution of the series's published\nversion of the work (e.g., post it to an institutional repository or publish it in a book), with an acknowledgment of its initial\npublication in this series. 3. Authors are permitted and encouraged to post their work online (e.g., in institutional repositories or on their website) prior to and\nduring the submission process, as it can lead to productive exchanges, as well as earlier and greater citation of published work (See\nOpen access policy\nfor details).", "doc_items_refs": ["#/texts/131", "#/texts/132", "#/texts/133", "#/texts/134", "#/texts/135", "#/texts/136", "#/texts/137", "#/texts/138", "#/texts/139", "#/texts/140", "#/texts/141", "#/texts/142", "#/texts/143", "#/texts/144", "#/texts/145", "#/texts/146", "#/texts/147", "#/texts/148", "#/texts/149", "#/texts/150", "#/texts/151"], "page_nos": [], "uuid": "4cefab1e-e4e7-4c8e-b771-a30a069f231f"}
{"doc_id": "2025__Neurotoxic_Effects_of_PM25_Mechanisms_Evidence_and_Public_Health_Implications__W4414145558", "source_path": "<redacted:source_path>", "chunk_id": 16, "source_chunk_idxs": [19], "num_tokens": 509, "text": "Neurotoxic Effects of PM2.5: Mechanisms, Evidence, and Public Health Implications\nReferences\n[1]. Block ML, Calderón-Garcidueñas L. Air pollution: mechanisms of neuroinflammation and CNS disease [J]. Trends in Neurosciences, 2009, 32(9): 506-516. DOI: 10.1016/j.tins.2009.05.009.\n[2]. Cullen B, Newby D, Lee D, et al. Cross-sectional and longitudinal analyses of outdoor air pollution exposure and cognitive function in UK Biobank [J]. Scientific Reports, 2018, 8(1): 12089.\n[3]. Calderón-Garcidueñas L, Solt AC, Henríquez-Roldán C, et al. Long-term air pollution exposure is associated with neuroinflammation, an altered innate immune response, disruption of the blood-brain barrier, ultrafine particulate deposition, and accumulation of amyloid beta-42 and alpha-synuclein in children and young adults [J]. Toxicologic Pathology, 2008, 36(2): 289-310. DOI: 10.1177/0192623307313011.\n[4]. Costa LG, Cole TB, Dao K, et al. Developmental impact of air pollution on brain function [J]. Neurochemistry International, 2019, 131: 104580.\n[5]. Murata K, Kikuchi H, Hasegawa M, et al. Air pollution and the risk of Parkinson's disease: A review [J]. Movement Disorders, 2022, 37(6): 1155-1166. DOI: 10.1002/mds.28974.\n[6]. Ji S, Guo Y, Yan W, et al. PM2.5 exposure contributes to anxiety and depression-like behaviors via phenyl-containing compounds interfering with dopamine receptor [J]. Proceedings of the National Academy of Sciences, 2024, 121(21): e2319595121.\n[7]. Liu B, Fang X, Strodl E, et al. Fetal exposure to air pollution in late pregnancy significantly increases ADHD-risk behavior in early childhood [J]. International Journal of Environmental Research and Public Health, 2022, 19(17): 10482.", "doc_items_refs": ["#/texts/153", "#/texts/154", "#/texts/155", "#/texts/156", "#/texts/157", "#/texts/158", "#/texts/159"], "page_nos": [], "uuid": "ccdef58f-2dcb-47ce-b7ee-5e2068bbbb0c"}
{"doc_id": "2025__Neurotoxic_Effects_of_PM25_Mechanisms_Evidence_and_Public_Health_Implications__W4414145558", "source_path": "<redacted:source_path>", "chunk_id": 17, "source_chunk_idxs": [20], "num_tokens": 390, "text": "Neurotoxic Effects of PM2.5: Mechanisms, Evidence, and Public Health Implications\nReferences\n[8]. Chang YC, Chen WT, Su SH, et al. PM2.5 exposure and incident attention-deficit/hyperactivity disorder during the prenatal and postnatal periods: A birth cohort study [J]. Environmental Research, 2022, 214: 113769.\n[9]. Kioumourtzoglou MA, Schwartz JD, Weisskopf MG, et al. Long-term PM2.5 exposure and neurological hospital admissions in the northeastern United States [J]. Environmental Health Perspectives, 2016, 124(1): 23-29. DOI: 10.1289/ehp.1408973.\n[10]. Ferreira APS, Ramos JMO, Gamaro GD, et al. Experimental rodent models exposed to fine particulate matter (PM2.5) highlighting the injuries in the central nervous system: A systematic review [J]. Atmospheric Pollution Research, 2022, 13(5): 101407.\n[11]. Zundel CG, Ryan P, Brokamp C, et al. Air pollution, depressive and anxiety disorders, and brain effects: A systematic review [J]. Neurotoxicology, 2022, 93: 272-300.\n[12]. Balboni E, Filippini T, Crous-Bou M, et al. The association between air pollutants and hippocampal volume from magnetic resonance imaging: a systematic review and meta-analysis [J]. Environmental Research, 2022, 204: 111976.\nFor authors\nGuide for authors\nPolicies for authors\nAims and scope\nSubscription\nOpen access policy\nFor editors\nPolicies for editors\nEditorial board\nFor reviewers\nPolicies for reviewers\nPrivacy policy\nCookies are used by this site.", "doc_items_refs": ["#/texts/160", "#/texts/161", "#/texts/162", "#/texts/163", "#/texts/164", "#/texts/165", "#/texts/166", "#/texts/167", "#/texts/168", "#/texts/169", "#/texts/170", "#/texts/171", "#/texts/172", "#/texts/173", "#/texts/174", "#/texts/175", "#/texts/176", "#/texts/177"], "page_nos": [], "uuid": "be86e860-5e27-4330-aed4-cf4adc31f541"}
