{"doc_id": "2025__Dissecting_real-world_memory_clinical_cohort_heterogeneity_analysis_of_neuroanat__W4414704396", "source_path": "<redacted:source_path>", "chunk_id": 0, "source_chunk_idxs": [0], "num_tokens": 92, "text": "&lt;!-- image --&gt;\n&lt;!-- image --&gt;\nGordon Zhaoqi An$^{1,2}$, Yunchang Xie$^{1,2}$, Tammie L. S. Benzinger$^{2}$, Brian A. Gordon$^{2}$ and Aristeidis Sotiras$^{2,3*}$", "doc_items_refs": ["#/pictures/0", "#/pictures/1", "#/texts/0"], "page_nos": [1], "uuid": "5b85413e-621d-4bf9-ba0a-f9af46872fbc"}
{"doc_id": "2025__Dissecting_real-world_memory_clinical_cohort_heterogeneity_analysis_of_neuroanat__W4414704396", "source_path": "<redacted:source_path>", "chunk_id": 1, "source_chunk_idxs": [1], "num_tokens": 456, "text": "Abstract\nBackground There is significant evidence for neuroanatomical heterogeneity in neurodegenerative disorders, which has been demonstrated predominantly through analyses of well-characterized research cohorts. Despite the known diversity in clinical presentations among patients attending memory clinics, studies exploring neuroanatomical heterogeneity in such clinically diverse groups remain sparse.\nMethods To address this gap, we applied the semi-supervised Heterogeneity through Discriminative Analysis (HYDRA) (Neuroimage 145:346-364 2017) machine learning method to magnetic resonance imaging (MRI) data from the Open Access Series of Imaging Studies (OASIS) (NeuroImage 26:102248 2020) to uncover patterns of neurostructural heterogeneity in memory clinic attendees. Cross-validation was used to assess clustering stability via the Adjusted Rand Index (ARI), Silhouette Score, and Calinski-Harabasz Index (CHI). We performed survival analyses using Kaplan-Meier curves and mixed-effects models for longitudinal cognitive data (e.g., memory, executive function, and language assessments) to examine differences in disease progression.\nResults Cross-validation analyses indicated two highly stable subtypes of cognitively impaired individuals (ARI = 0.552), exhibiting significant neuroanatomical differences. Subtype 1, termed the Temporal-Sparing Atrophy (TSA) Subtype, was defined by relatively mild atrophy, especially in temporal areas, with slower cognitive decline and preserved Function across most domains. Subtype 2, termed the Temporal-Parietal Predominated Atrophy (TPPA) Subtype, was marked by notable alterations in areas critically affected in neurodegenerative disorders. These included key areas critical for executive function and memory, such as the frontal, temporal, and parietal cortices including the precuneus. Longitudinal analysis of neuroimaging and cognitive data revealed contrasting trajectories. The TSA Subtype demonstrated a gradual decline in cognitive functions over time, particularly in the assessments that are memory-focused tests. Conversely, the TPPA Subtype exhibited a more severe decline in these functions.", "doc_items_refs": ["#/texts/2", "#/texts/3", "#/texts/4"], "page_nos": [1], "uuid": "d4eb261f-af01-42bd-936e-a25c35a29bf3"}
{"doc_id": "2025__Dissecting_real-world_memory_clinical_cohort_heterogeneity_analysis_of_neuroanat__W4414704396", "source_path": "<redacted:source_path>", "chunk_id": 2, "source_chunk_idxs": [2], "num_tokens": 128, "text": "Abstract\nConclusions This research illustrates that neurodegenerative diseases present a spectrum of structural brain changes rather than uniform pathology, suggesting that future research may benefit from stratified therapeutic approaches and targeted recruitment strategies for clinical trials. By leveraging detailed clinical assessments and longitudinal data, including uncertain diagnoses and Clinical Dementia Rating (CDR) scores, this study contributes to better understanding/characterizing memory clinic populations, which could help with optimizing interventions.\nKeywords Neurodegeneration, Memory clinic, Dementia, Machine learning, Subtyping, Heterogeneity\n&lt;!-- image --&gt;", "doc_items_refs": ["#/texts/5", "#/texts/6", "#/pictures/2"], "page_nos": [1], "uuid": "72eaaf07-e0d1-4572-9989-43ceefc8cf38"}
{"doc_id": "2025__Dissecting_real-world_memory_clinical_cohort_heterogeneity_analysis_of_neuroanat__W4414704396", "source_path": "<redacted:source_path>", "chunk_id": 3, "source_chunk_idxs": [3], "num_tokens": 397, "text": "Background\nNeurodegenerative disorders, including Alzheimer's Disease (AD), Parkinson's Disease (PD) [1] and others, exhibit significant heterogeneity, challenging the notion of a \"typical\" disease presentation [2]. Importantly, clinicians encounter a spectrum of cognitive and neuroanatomical variations among patients, which are often influenced by multiple risk factors and comorbidities. This heterogeneity is critical to understand, as it impacts diagnostic accuracy, disease prognosis, and therapeutic response [3]. Characterizing disease heterogeneity within real-world clinical cohorts by identifying neurobiologically homogeneous clusters of patients can lead to more precise diagnoses and targeted treatments [4]. To this end, neuroimaging provides a reliable and reproducible noninvasive in vivo method to assess the neurobiology of brain disorders, and dementia in particular. However, the high dimensionality and complexity of neuroimaging data present significant analytical challenges.\nOver the past few decades, machine learning methods have emerged as an effective way to address these challenges because of their ability to capture complex relationships of imaging signals among brain regions [5]. This capability enhances the characterization of group differences, potentially leading to improved personalized diagnosis and prognosis, Consequently, machine learning has been increasingly successful in driving highly sensitive and specific disease biomarkers at the individual level [6]. For example, Support Vector Machines (SVMs) effectively classified patients based on neuroimaging features [7, 8], while Random Forests predicted disease progression and identified biomarkers [9, 10]. However, a common assumption behind commonly used machine learning methods is that there is a single pattern that differentiates the two contrasted groups. While this approach enables the detection of hallmark pathology, it ignores disease heterogeneity, potentially overlooking distinct neuroanatomical subtypes.", "doc_items_refs": ["#/texts/10", "#/texts/11"], "page_nos": [1], "uuid": "58e49652-55b4-4535-88d4-935328a89388"}
{"doc_id": "2025__Dissecting_real-world_memory_clinical_cohort_heterogeneity_analysis_of_neuroanat__W4414704396", "source_path": "<redacted:source_path>", "chunk_id": 4, "source_chunk_idxs": [4], "num_tokens": 384, "text": "Background\nRecent advancements address this limitation by leveraging unsupervised or semi-supervised methods [11-21]. Prior research studies have primarily investigated heterogeneity within well-characterized research cohorts. However, these cohorts do not represent well the variability seen in clinical practice. This limitation is particularly evident in memory clinic populations, where patients present with diverse cognitive profiles and often have uncertain diagnoses. Despite this, investigations into the neurobiological heterogeneity of dementia in clinical settings are scarce. Additionally, while longitudinal cognitive data may offer invaluable insights into disease progression, these are often overlooked in heterogeneity analyses of research or real-world clinical cohorts [22].\nIn response to these gaps in the field, we investigated the heterogeneity of neurodegeneration using data from a large publicly available sample of patients and their follow-ups seen at the Washington University Memory Diagnostic Center outpatient clinic in Saint Louis, MO by applying the HYDRA (heterogeneity through discriminative analysis) algorithm [23] to the Open Access Series of Imaging Studies (OASIS-4) dataset [24], a clinically representative cohort with neuroimaging and longitudinal clinical data. Specifically, we sought to identify neuroanatomical subtypes using a semi-supervised machine learning method termed HYDRA. HYDRA is a well-established and validated method that has been successfully applied in various neurological and psychiatric disorders, consistently uncovering biologically meaningful and homogeneous clusters within heterogeneous patient populations [25-29]. We hypothesized that HYDRA would objectively reveal distinct neuroanatomical subtypes by analyzing volumetric data. We further hypothesized that the identified subtypes would exhibit distinct clinical and cognitive longitudinal trajectories.", "doc_items_refs": ["#/texts/12", "#/texts/14"], "page_nos": [1], "uuid": "cc37c4d2-e88d-49ba-a176-ce7259f706f3"}
{"doc_id": "2025__Dissecting_real-world_memory_clinical_cohort_heterogeneity_analysis_of_neuroanat__W4414704396", "source_path": "<redacted:source_path>", "chunk_id": 5, "source_chunk_idxs": [5], "num_tokens": 512, "text": "Dataset description\nTo implement HYDRA, a patient group and a reference group of controls are needed to identify structural subtypes. Two datasets were used for patients and controls separately for this purpose.\nThe OASIS-4 dataset was employed to extract patients specifically, sourced from patients seen at the Washington University in St. Louis Memory Diagnostic Center outpatient clinic. This memory clinic cohort provides comprehensive neuroimaging and longitudinal clinical data from individuals with memory disorders and dementia. Patients at various stages of impairment underwent magnetic resonance imaging (MRI) scans and clinical assessments. From this dataset, we included 580 individuals aged 50 to 94 who passed FreeSurfer [30] quality checks. Longitudinal clinical assessments were available for a subset of participants. Though the number and timing of follow-up visits varied, it is a hallmark of real-world clinical data, where patients are assessed as needed rather than at fixed intervals.\nWe utilized OASIS-3 dataset [31] coming from the Washington University Knight Alzheimer's Disease Research Center (ADRC) - a research-based cohort, which is used to derive a robust reference group of cognitively unimpaired (CU) controls. We identified 536 CU individuals based on a global Clinical Dementia Rating (CDR) [32] of 0 and amyloid negative. Amyloid negativity was defined as the absence of substantial preclinical cognitive impairment pathology, assessed using either cerebrospinal fluid (CSF) biomarkers or amyloid positron\nemission tomography (PET) imaging. For amyloid PET, the Centiloid scale [33-35] was used to standardize quantitative amyloid measurements across different tracers and methods. A Centiloid value of ≤ 20 was used as the threshold for amyloid negativity, consistent with the widely accepted cutoff for distinguishing amyloid-negative individuals from those with amyloid-positive pathology [36]. For CSF, amyloid negativity was determined based on the Aβ42/40 ratio that minimizes variability caused by preanalytical factors (e.g., tube adsorption) and interindividual differences in total Aβ production. A threshold of Aβ42/40\nAfter combining OASIS-3 and OASIS-4, the final dataset comprised 1,116 Subjects with 86 cortical and subcortical volumes from both the left and right hemispheres (i.e., the dimensionality of the data matrix was 1116 × 86).", "doc_items_refs": ["#/texts/17", "#/texts/18", "#/texts/19", "#/texts/21", "#/texts/22"], "page_nos": [1], "uuid": "73e614e6-11e0-4c35-8b9d-3da68beb4ed1"}
{"doc_id": "2025__Dissecting_real-world_memory_clinical_cohort_heterogeneity_analysis_of_neuroanat__W4414704396", "source_path": "<redacted:source_path>", "chunk_id": 6, "source_chunk_idxs": [6, 7], "num_tokens": 252, "text": "Dataset description\nAnalysis of the demographic data (see Table 1) revealed significant differences between the clinical group from OASIS-4 and CU controls from OASIS-3 across several key variables. The CU control group was younger and consisted of a higher proportion of females, while the clinical group was older on average and had a more balanced gender distribution. As expected, due to the way\nevident in clinical assessments: CDR scores range from 0.5 to greater than 1 in the clinical group, indicating varying degrees of cognitive impairment. Similarly, the MiniMental State Examination (MMSE) [38] scores differed markedly, with the clinical group showing an average score of 22.9, indicative of cognitive decline, compared to 28.9 in CU controls.\n\nImage acquisition and processing\nOur analysis focused on 3 T T1-weighted volumetric MRI data to investigate brain atrophy patterns characteristic of AD. Regional volumes were processed with FreeSurfer [30] version 5.3, based on the DesikanKillian atlas [39]. To account for head size variations, total intracranial volume adjustment [40] was applied to normalize regional volumes across participants. Lastly, regional volumes were z-scored using the CU control group as the reference for normalization.", "doc_items_refs": ["#/texts/23", "#/texts/25", "#/texts/27"], "page_nos": [1], "uuid": "d763d02b-1212-4a31-956f-b6d0df80eb58"}
{"doc_id": "2025__Dissecting_real-world_memory_clinical_cohort_heterogeneity_analysis_of_neuroanat__W4414704396", "source_path": "<redacted:source_path>", "chunk_id": 7, "source_chunk_idxs": [8], "num_tokens": 505, "text": "Parsing heterogeneity using HYDA\nTo identify neuroanatomical subtypes within memory clinic patients, we used a non-linear machine learning method developed for simultaneous binary classification and subtype identification, termed HYDRA. Unlike traditional SVMs [41], which rely on a single hyperplane to separate cases from controls and cannot distinguish between subtypes of cases, HYDRA clusters cases based on their differences from controls (see Fig. 1).This is achieved by identifying multiple linear hyperplanes that collectively form a convex polytope. This enables\nTable 1 Demographics of Memory Clinic Patients (OASIS-4) and Cognitively Unimpaired Controls (OASIS-3)\n\n| Characteristic   | Clinical Group (OASIS-4), N = 580   | Healthy Controls (OASIS-3), N = 536 1 p-value 2   |\n|------------------|-------------------------------------|---------------------------------------------------|\n| Age              | 72 (SD = 10)                        | 64 (SD = 9)                                       |\n| Sex              |                                     |                                                   |\n| Female           | 297 (51%)                           | 335 (62%)                                         |\n| Male             | 283 (49%)                           | 201 (38%)                                         |\n| Race             |                                     |                                                   |\n| African American | 56 (9.7%)                           | 86 (16%)                                          |\n| Other            | 22 (3.8%)                           | 5 (0.9%)                                          |\n| White            | 502 (87%)                           | 445 (83%)                                         |\n| CDR              |                                     |                                                   |\n| 0.0              | 66 (11%)                            | 536 (100%)                                        |\n| 0.5              | 317 (55%)                           | 0 (0%)                                            |\n| 1 or greater     | 197 (34%)                           | 0 (0%)                                            |\n| CDR_SB           | 3.61 (SD = 3.27)                    | 0.00 (SD = 0.00)                                  |\n| MMSE             | 22.9 (SD = 6.2)                     | 28.9 (SD = 3.1)                                   |", "doc_items_refs": ["#/texts/29", "#/texts/30", "#/tables/0"], "page_nos": [1], "uuid": "1b0aebfb-8708-4da5-b575-d04950f5d0d5"}
{"doc_id": "2025__Dissecting_real-world_memory_clinical_cohort_heterogeneity_analysis_of_neuroanat__W4414704396", "source_path": "<redacted:source_path>", "chunk_id": 8, "source_chunk_idxs": [9], "num_tokens": 472, "text": "Parsing heterogeneity using HYDA\n1 Mean(SD = Standard Deviation); n (%)\n2 Wilcoxon rank sum test; Pearson's Chi-squared test\nFigure caption: Fig. 1 Schematic representation of the utility of HYDRA over SVMs for unraveling heterogeneity: HYDRA algorithm ( b ) aims to find a maximum margin convex polytope that separates two groups (e.g., healthy controls and pathologic samples). This polytope is formed by combining multiple linear hyperplanes, with each face defining a cluster. Whereas traditional SVMs ( a ), can only define two groups based on a single hyperplane\nHYDRA to not only differentiate healthy controls from pathological samples but also identify neuroanatomical subtypes within the pathological group by assigning cases to the different sides of the polytope. As a result, HYDRA uncovers distinct neuroimaging patterns that characterize subtypes and clusters cases by focusing on their differences from control subjects. This is contrast to unsupervised clustering techniques (e.g., k-means), which group participants based on their similarities. Lastly, HYDRA adjusts for important covariates such as age and gender, ensuring robust clustering. Note that HYDRA only uses a binary classification objective, distinguishing healthy controls from patients, to guide the discovery of multiple disease subtypes. Importantly, it does not utilize detailed diagnostic labels (e.g., mild cognitive impairment or AD) or clinical outcomes during training, allowing for the identification of data-driven neuroanatomical patterns.\nHYDRA defined neurostructural Subtypes using the z-scored regional volumetric values as input while adjusting for covariates such as age, Gender, and race. Following previous studies that used this approach, we evaluated multiple clustering solutions to identify the optimal number of clusters. Specifically, we tested clusters ranging from 2 to 8, with the goal of selecting the most stable solution. Stability was quantified primarily using the Adjusted Rand Index (ARI) [42], calculated through eightfold cross-validation. A high ARI value indicates a robust and reproducible clustering solution. The solution with the highest ARI value was selected for subsequent analyses. To further evaluate", "doc_items_refs": ["#/texts/31", "#/texts/32", "#/pictures/3", "#/texts/37", "#/texts/38"], "page_nos": [1], "uuid": "65d5339c-5f0b-4fea-a039-159561c4f235"}
{"doc_id": "2025__Dissecting_real-world_memory_clinical_cohort_heterogeneity_analysis_of_neuroanat__W4414704396", "source_path": "<redacted:source_path>", "chunk_id": 9, "source_chunk_idxs": [10, 11], "num_tokens": 298, "text": "Parsing heterogeneity using HYDA\ncluster structure, we supplemented ARI with two widely used internal validation metrics which are the Silhouette coefficient and the Calinski-Harabasz Index (CHI). A higher CHI indicates better-defined cluster structure with greater between-cluster dispersion relative to within-cluster compactness. Similarly, the Silhouette coefficient reflects the degree of separation between clusters, with higher values indicating greater distinctiveness.\nFor more detailed information on the specific parameters and steps used in implementing the HYDRA algorithm, please refer to the supplementary document.\n\nNeuropsychological and cognitive assessments\nCognitive functioning in OASIS-4 participants was assessed using six tests: the Boston Naming Test, the Logical Memory Immediate Recall, the Word Memory Test, the Word Recall Test, the Short Blessed Test, and the Verbal Fluency Test [43-45]. These tests evaluated cognitive domains commonly affected by dementia, such as memory, language, and executive function.\nThe CDR scale provides a global measure of cognitive and Functional impairment, ranging from 0 (no impairment) to 3 (severe dementia). The MMSE is a brief, standardized measure of global cognitive Function. It assesses orientation, registration, attention and calculation, recall, language, and visuospatial skills, yielding scores from 0 to 30 (higher scores indicate better cognitive performance). We examined baseline MMSE scores to evaluate overall cognitive status and used them as an outcome to compare between the identified subtypes.", "doc_items_refs": ["#/texts/39", "#/texts/40", "#/texts/42", "#/texts/43"], "page_nos": [1], "uuid": "f0b60d5c-e908-445e-9c7c-105760539e21"}
{"doc_id": "2025__Dissecting_real-world_memory_clinical_cohort_heterogeneity_analysis_of_neuroanat__W4414704396", "source_path": "<redacted:source_path>", "chunk_id": 10, "source_chunk_idxs": [12, 13], "num_tokens": 242, "text": "Differences in demographic and clinical characteristics\nTo validate the neuroanatomical subtypes identified by the HYDRA algorithm, statistical comparisons of demographic and clinical characteristics between the subtypes were conducted. Categorical variables, such as sex and CDR categories, were analyzed using Pearson's Chinese test [46]. Continuous variables, including age and MMSE scores, were evaluated using Mann-Whitney U Test, also known as Wilcoxon rank-sum test [47].\n\nDifferences in spatial neuroanatomy\nSpatial neuroanatomical atrophy patterns were analyzed using effect size measures and visualization techniques. To quantify the extent of atrophy for each subtype, we calculated Cohen's d [48], a standardized measure of effect size that represents the magnitude of atrophy in brain regions relative to CU controls. Higher Cohen's d values indicate greater reductions in regional brain volumes, signifying more pronounced atrophy. To visualize the spatial distribution of brain atrophy, we employed the ggseg [49] R package, which allows for cortical par-\nbetween subtypes, controlling for age, sex, and total intracranial volume.", "doc_items_refs": ["#/texts/48", "#/texts/50", "#/texts/51"], "page_nos": [1], "uuid": "b720c68d-ac0c-4f8b-b5e1-ca43f0b85f6b"}
{"doc_id": "2025__Dissecting_real-world_memory_clinical_cohort_heterogeneity_analysis_of_neuroanat__W4414704396", "source_path": "<redacted:source_path>", "chunk_id": 11, "source_chunk_idxs": [14], "num_tokens": 499, "text": "Differences in cognitive and clinical decline over time\nTo gain deeper insights into the cognitive impact of the neurostructural subtypes, we leveraged the available longitudinal component of our study to assess cognitive decline over time. A comprehensive longitudinal analysis was performed evaluating memory, language, verbal, and executive function to compare trajectories over time. For each neuropsychological assessment and clinical test (e.g., MMSE and CDR Sum of Boxes), we employed mixed-effects models [52] to account for individual variability and the non-independence of repeated measurements within participants, allowing us to track cognitive impairment progression. Two models were used:\nModel 1: Included fixed effects for baseline age, sex, race, subtypes, time interval, baseline MMSE and the interaction between interval and subtypes, with a random intercept to account for participant-level variability:\nTest = β$\\_{0}$ + β$\\_{1}$ × age atbaseline + β$\\_{2}$ × sex + β$\\_{3}$ × race + β$\\_{4}$ × subtypes + β$\\_{5}$ × baseline MMSE + β$\\_{6}$ × timeinterval + β$\\_{7}$ × (timeinterval × subtypes ) + u$\\_{i}$ + ϵ$\\_{i}$\nstandardized regions. This tool enabled us to map the neuroanatomical patterns of atrophy for Subtypes relative to CU controls. All visualizations were produced in\nModel 2: Extended Model 1 by adding a random slope for the time interval variable to account for individual differences in the rate of cognitive decline:\nTest = β$\\_{0}$ + β$\\_{1}$ × age at baseline + β$\\_{2}$ × sex + β$\\_{3}$ × race + β$\\_{4}$ × subtypes + β$\\_{5}$ × baseline MMSE + β$\\_{6}$ × time interval + β$\\_{7}$ × (time interval × subtypes ) + u$\\_{i}$ + b$\\_{i}$ × time interval + ϵ$\\_{i}$", "doc_items_refs": ["#/texts/53", "#/texts/54", "#/texts/55", "#/texts/56", "#/texts/57", "#/texts/58"], "page_nos": [1], "uuid": "8b7ad281-334c-45df-a252-fe35fdc7ff9b"}
{"doc_id": "2025__Dissecting_real-world_memory_clinical_cohort_heterogeneity_analysis_of_neuroanat__W4414704396", "source_path": "<redacted:source_path>", "chunk_id": 12, "source_chunk_idxs": [15, 16, 17], "num_tokens": 360, "text": "Differences in cognitive and clinical decline over time\nthe ggseg framework, ensuring consistent and interpretable representations of the spatial data.\n\nDifferences in vascular burden\nTo evaluate vascular burden across subtypes, we analyzed white matter hypo-intensities (WMH) derived from T1-weighted MRI. While Fluid-Attenuated Inversion Recovery (FLAIR) imaging offers a more direct assessment of vascular burden through white matter hyperintensities, it was not utilized in the current analysis due to resource constraints. Therefore, T1-derived WMH volumes were used as a proxy, which have shown reasonable sensitivity to vascular pathology in prior studies of aging and dementia [50, 51]. All WMH volumes were log-transformed to account for skewness and compared\n\n, where:\nu$\\_{i}$ ∼ N (0, σ 2 $\\_{u}$) is the random intercept for participant i , representing the participant-specific baseline level; b$\\_{i}$ ∼ N (0, σ 2 $\\_{b}$) is the random slope for participant i , representing the participant-specific rate of change over time; ϵ$\\_{i}$ is the residual error.\nInitially, we implemented Model 1 to examine cognitive trajectories. Baseline MMSE has been included as a covariate in the model to address the potential confounding effect of initial cognitive severity. Model 2 extended this framework to analyze temporal progression in longitudinal observations. We then used Akaike information criterion (AIC) [53] and Analysis of Variance (ANOVA) [54] to compare the models for cognitive tests, with p -values adjusted by the False Discovery Rate (FDR) [55].", "doc_items_refs": ["#/texts/59", "#/texts/61", "#/texts/63", "#/texts/64"], "page_nos": [1], "uuid": "be7ae95d-79ed-45a0-9ffb-4509b77fa627"}
{"doc_id": "2025__Dissecting_real-world_memory_clinical_cohort_heterogeneity_analysis_of_neuroanat__W4414704396", "source_path": "<redacted:source_path>", "chunk_id": 13, "source_chunk_idxs": [18, 19], "num_tokens": 291, "text": "Differences in clinical progression\nSurvival analysis was performed to evaluate the time to cognitive impairment progression. We included participants with a baseline CDR of 0.5 and defined clinical progression as the earliest visit with CDR ≥ 1. Survival curves were generated to compare the probability of remaining below this threshold between subtypes and assessed using the log-rank test, and hazard ratios were estimated using Cox proportional hazards models [56], adjusting for relevant covariates such as age, and sex. Confidence intervals were reported to support interpretability.\n\nSensitivity analyses\nTo address the potential imbalance in sample sizes between the identified Subtypes, we conducted a sensitivity analysis using a 1:1 matched Subsample. We employed an anti-clustering approach to match the Subtypes on both baseline MMSE and age for participants with longitudinal follow-up. Given the inherent randomness in anti-clustering, we repeated the matching and modeling process across 100 bootstrap iterations. For each iteration, we fit the linear mixed-effects models for six cognitive assessments and computed the difference in the median rate of change between subtypes.\nIn addition, to examine the impact of irregular followup length on longitudinal model estimates, we conducted\na secondary sensitivity analysis including only participants with at least three timepoints. The anti-clustering matching procedure on baseline age and MMSE was repeated for this Subset, and the Full 500-iteration bootstrapping pipeline was rerun.", "doc_items_refs": ["#/texts/69", "#/texts/71", "#/texts/72", "#/texts/74"], "page_nos": [1], "uuid": "b5f080f5-187a-4e9f-a748-b03adca8f471"}
{"doc_id": "2025__Dissecting_real-world_memory_clinical_cohort_heterogeneity_analysis_of_neuroanat__W4414704396", "source_path": "<redacted:source_path>", "chunk_id": 14, "source_chunk_idxs": [20], "num_tokens": 443, "text": "HYDRA identifies two reproducible atrophy subtypes\nHYDRA clustered patients based on regional brain volumes after adjusting for covariates (e.g. age, sex etc.). Evaluation of cluster stability using eightfold cross-validation exhibited a well-defined peak at K = 2 (see Fig. 2, the peak ARI value), indicating the existence of two highly reproducible subtypes (ARI = 0.552) within memory clinic patients. In addition to the ARI, we examined internal cluster validity using the Silhouette coefficient and CHI (see Supplementary Figure S2.). Both metrics supported the selection of two clusters as optimal. Specifically, the CH index peaked at K = 2 and declined steadily with additional clusters, indicating that the two-cluster solution provided the best separation relative to withincluster compactness. Similarly, the Silhouette coefficient was highest at K = 2, suggesting strong clustering quality in terms of compactness and distinctness.\nFigure caption: Fig. 2 A high ARI suggests a high-quality clustering result where the algorithm successfully identifies distinct and meaningful subtypes within the data. The figure presents ARI values corresponding to different numbers of clusters (K), obtained with HYDRA. The peak at K = 2 suggests the highest ARI, indicating that the two-cluster solution has the best agreement\nFigure caption: Subtypes exhibit divergent neuroanatomical deficits. On identifying two stable subtypes of memory clinic patient, we sought to understand which regional volumetric features drove this clustering result. The results revealed distinct neuroanatomical patterns of atrophy for the two subtypes compared to the CU controls (see Fig. 3). Subtype 1 exhibited relatively subtle atrophy, with low effect sizes throughout much of the temporal lobe and precuneus and was therefore termed the Temporal-Sparing Atrophy Subtype (TSA) Subtype. In contrast, Subtype 2 demonstrated more widespread atrophy, particularly in the frontal, parietal, and temporal lobes, and was therefore termed the Temporal-Parietal Predominated Atrophy (TPPA) Subtype.", "doc_items_refs": ["#/texts/77", "#/pictures/4", "#/pictures/5"], "page_nos": [1], "uuid": "340ecf30-ae77-4ee4-89de-9951aa54628e"}
{"doc_id": "2025__Dissecting_real-world_memory_clinical_cohort_heterogeneity_analysis_of_neuroanat__W4414704396", "source_path": "<redacted:source_path>", "chunk_id": 15, "source_chunk_idxs": [21, 22, 23], "num_tokens": 441, "text": "Subtypes exhibit divergent neuroanatomical deficits\nUpon identifying two stable subtypes of memory clinic patient, we sought to understand which regional volumetric features drove this clustering result. The results revealed distinct neuroanatomical patterns of atrophy for the two subtypes compared to the CU controls (see Fig. 3). Subtype 1 exhibited relatively subtle atrophy, with low effect sizes throughout much of the temporal lobe and precuneus and was therefore termed the Temporal-Sparing Atrophy Subtype (TSA) Subtype. In contrast, Subtype 2 demonstrated more widespread atrophy, particularly in the frontal, parietal, and temporal lobes, and was therefore termed the Temporal-Parietal Predominated Atrophy (TPPA) Subtype.\n\nSubtype demographics\nNext, we evaluated the demographics of the neurostructural subtypes (see Table 2). The TSA Subtype comprised 150 participants with a mean age of 71 (SD = 11), while the TPPA Subtype included 430 participants with\na mean age of 73 (SD = 9). While there was substantial overlap in age ranges among both subtypes, the TPPA Subtype had a slightly higher mean and median age than the TSA Subtype. Consequently, the two atrophy subtypes exhibited statistically significant differences in age distribution. When comparing with control group, both subtypes are generally older than the control group, with the TPPA Subtype showing the highest median age (see Supplementary Figure S1).\n\nAtrophy subtypes demonstrate distinct clinical and cognitive profiles at baseline\nWe then evaluated whether the subtypes differed in baseline cognitive performance. Both subtypes exhibited notable differences in CDR and cognitive function. As depicted in Fig. 4, the TSA Subtype was primarily Characterized by very mild dementia, with most participants having CDR scores of 0.5. However, this subtype also included a smaller proportion (16%) of individuals with a CDR score of 1 or greater. In contrast, participants in the TPPA Subtype were likely to have mild to moderate", "doc_items_refs": ["#/texts/83", "#/texts/85", "#/texts/86", "#/texts/88"], "page_nos": [1], "uuid": "3478271a-9dd4-43c4-b35f-60386ea5bff0"}
{"doc_id": "2025__Dissecting_real-world_memory_clinical_cohort_heterogeneity_analysis_of_neuroanat__W4414704396", "source_path": "<redacted:source_path>", "chunk_id": 16, "source_chunk_idxs": [24], "num_tokens": 449, "text": "Atrophy subtypes demonstrate distinct clinical and cognitive profiles at baseline\nTable 2 Subtype differences on demographics\n\n| Characteristic      | TSA Subtype, N = 150$^{1}$ TPPA Subtype, N = 430$^{1}$ p-value$^{2}$   |                  |          |\n|---------------------|------------------------------------------------------------------------|------------------|----------|\n| Age                 | 73 (SD = 9)                                                            |                  |          |\n| Sex                 |                                                                        |                  |          |\n|                     | 0.3                                                                    |                  |          |\n| Female              | 226 (53%)                                                              |                  |          |\n| Male                | 204 (47%)                                                              |                  |          |\n| Race                |                                                                        |                  |          |\n|                     | <0.001<nl>                                                             | African American | 48 (11%) |\n| Other               | 6 (1.4%)                                                               |                  |          |\n| White               | 376 (87%)                                                              |                  |          |\n| CDR_SB              | 4.1 (SD = 3.4)                                                         |                  |          |\n| Verbal Fluency test | 13.0 (SD = 5.2)                                                        |                  |          |\n| Boston Naming test  | 3.09 (SD = 2.28)                                                       |                  |          |\n| Word Memory test    | 12.9 (SD = 5.2)                                                        |                  |          |\n| Logical Memory test | 5.5 (SD = 3.9)                                                         |                  |          |\n| Word Recall test    | 3.05 (SD = 2.66)                                                       |                  |          |\n| Short Blessed test  | 9 (SD = 8)                                                             |                  |          |\n$^{1}$ Mean(SD = Standard Deviation); n (%)\n$^{2}$ Wilcoxon rank sum test; Pearson’s Chi-squared test", "doc_items_refs": ["#/texts/93", "#/tables/1", "#/texts/94", "#/texts/95"], "page_nos": [1], "uuid": "54016a91-c763-4535-aa7c-28ef2266be53"}
{"doc_id": "2025__Dissecting_real-world_memory_clinical_cohort_heterogeneity_analysis_of_neuroanat__W4414704396", "source_path": "<redacted:source_path>", "chunk_id": 17, "source_chunk_idxs": [25], "num_tokens": 290, "text": "Atrophy subtypes demonstrate distinct clinical and cognitive profiles at baseline\nFigure caption: Fig. 4 Subtype characterization using CDR: the TSA Subtype patients mostly exhibited CDR scores of 0.5 (65%), Suggesting very mild dementia. In contrast, the TPPA Subtype patients were Characterized by a higher prevalence of CDR scores of 1 or greater (40%), indicative of mild to moderate dementia\ndementia, with 40% having CDR scores of 1 or greater. Both subtypes consisted of individuals across the spectrum of CDR scores, further reflecting the heterogeneity within each group, indicating that the subtypes are not exclusively tied to a single clinical stage of dementia.\nThe violin plot in Fig. 5 illustrates the distribution of MMSE scores for the two subtypes, revealing distinct cognitive profiles. The TSA Subtype was characterized by a more concentrated range of MMSE scores, indicating consistent cognitive impairment within this group. In contrast, the TPPA Subtype was marked by a wider distribution of MMSE scores, reflecting greater\nvariability in cognitive function. Notably, some individuals in the TPPA Subtype retained relatively better cognitive function, while others experienced more severe impairments. The significant difference in MMSE scores between the two subtypes reinforces the idea that these subtypes represent distinct severities of dementia, with the TPPA Subtype displaying more pronounced cognitive deficits.", "doc_items_refs": ["#/pictures/6", "#/texts/97", "#/texts/98", "#/texts/99"], "page_nos": [1], "uuid": "04fa4302-9a07-4be4-8ec6-3ea6e3488441"}
{"doc_id": "2025__Dissecting_real-world_memory_clinical_cohort_heterogeneity_analysis_of_neuroanat__W4414704396", "source_path": "<redacted:source_path>", "chunk_id": 18, "source_chunk_idxs": [26], "num_tokens": 269, "text": "Vascular distribution difference between the subtypes\nTo examine potential vascular contributions to subtype differentiation, WMH volumes have been utilized. After\nFigure caption: Fig. 5 Comparison of MMSE scores between subtypes: the distribution of MMSE scores across the two atrophy subtypes is shown. The TSA Subtype (red) exhibits a more concentrated distribution of MMSE scores. The TPPA Subtype (blue) is characterized by a wider spread of MMSE scores, suggesting greater variability in cognitive function. The boxplot within each violin represents the interquartile range and median MMSE score, with a significant difference between the two subtypes (***p&lt;0.001). Confidence interval is reported (red line)\nlog transformation and adjustment for age, sex, and intracranial volume, significant differences are revealed in WMH burden between subtypes. The TPPA Subtype exhibited higher WMH volume compared to the TSA Subtype (see Supplementary Figure S3), suggesting a greater vascular burden in this group. These findings indicate that vascular pathology may disproportionately contribute to the neurodegenerative profile observed in the TPPA group, potentially accelerating cognitive decline or compounding the effects of neuroanatomical atrophy.", "doc_items_refs": ["#/texts/101", "#/pictures/7", "#/texts/106"], "page_nos": [1], "uuid": "b78a3cf1-e49a-4adb-8064-4a0d417abfe7"}
{"doc_id": "2025__Dissecting_real-world_memory_clinical_cohort_heterogeneity_analysis_of_neuroanat__W4414704396", "source_path": "<redacted:source_path>", "chunk_id": 19, "source_chunk_idxs": [27], "num_tokens": 448, "text": "Longitudinal cognitive and clinical decline differentiates atrophy subtypes\nTo assess cognitive differences across subtypes over time, we analyzed longitudinal trajectories using standardized tests of memory, language, verbal fluency, and executive function. The number of follow-up visits and the average time interval from baseline to follow-up were well-balanced between subtypes, as summarized in Supplementary Table S1.\nA formal comparison of two models (random intercept only vs. random intercept with random slope) is provided in Supplementary Table S2., indicating that the inclusion of random slopes offers an enhanced ability to\ncapture individual trajectories of decline ( p\nTurning to the rate of change in clinical assessment scores from the latter model, statistical analysis revealed significant differences in rate of change between subtypes across all tests (****p\nIn general, the TPPA Subtype exhibited a wider distribution and steeper rates of change (more positive for the Short Blessed test and more negative for the other tests), signifying faster cognitive deterioration (see Fig. 6(a)). However, it is notable that the Verbal Fluency test showed worse performance in the TSA Subtype compared to the TPPA Subtype. To contextualize these rates within a temporal framework, the longitudinal trajectories of clinical test scores over a 10-year span for both subtypes are visualized (see Fig. 6(b)). The TPPA Subtype demonstrated a steeper decline across most tests, particularly those assessing memory (Word Memory, Word Recall), language function (Boston Naming), and executive function (Logical Memory). Conversely, the TSA\nFigure caption: Fig. 6 Visualizations of cognitive decline rates: a : Violin plots highlight the variability within subtypes, with the TPPA Subtype showing broader distributions and more pronounced rates of decline across most tests, emphasizing the severity of cognitive deterioration in this group. b : Longitudinal trajectories reveal consistent differences between subtypes, with the TPPA Subtype declining more rapidly. Notably, the divergence is particularly evident in memory and executive function tests, suggesting these domains are most impacted by the subtype-specific atrophy patterns", "doc_items_refs": ["#/texts/108", "#/texts/109", "#/texts/110", "#/texts/111", "#/texts/112", "#/pictures/8"], "page_nos": [1], "uuid": "21269775-b8c5-4793-a58b-b2ff0f9d6ab4"}
{"doc_id": "2025__Dissecting_real-world_memory_clinical_cohort_heterogeneity_analysis_of_neuroanat__W4414704396", "source_path": "<redacted:source_path>", "chunk_id": 20, "source_chunk_idxs": [28, 29], "num_tokens": 205, "text": "Longitudinal cognitive and clinical decline differentiates atrophy subtypes\nSubtype exhibited a slower, more gradual decline, potentially reflecting a less aggressive disease course or different diseases feeding into the subtype. Despite this overall trend, the TSA Subtype's poorer performance on the Verbal Fluency Test highlights a potential domain-specific deficit that warrants further investigation. In contrast, when analyzing longitudinal changes in global clinical assessments such as CDR Sum of Boxes and MMSE, we found no statistically significant difference in the rate of clinical progression between the two subtypes (see Supplementary Figure S4).\n\nThe difference in the rates of clinical progression between the subtypes\nIn contrast to the clear subtype differences observed in neuropsychological test trajectories, the survival curves showed no statistically significant difference in time to clinical progression between the TSA and TPPA subtypes (see Supplementary Figure S5), aligned with the rate of clinical progression results in CDR Sum of Boxes and MMSE.", "doc_items_refs": ["#/texts/117", "#/texts/119"], "page_nos": [1], "uuid": "d2f56fd5-2b38-4dd2-a061-7ba3f6b14eff"}
{"doc_id": "2025__Dissecting_real-world_memory_clinical_cohort_heterogeneity_analysis_of_neuroanat__W4414704396", "source_path": "<redacted:source_path>", "chunk_id": 21, "source_chunk_idxs": [30], "num_tokens": 362, "text": "Sensitivity analyses for longitudinal studies\nTo evaluate whether the observed differences in cognitive decline between subtypes were robust to sampling bias, we conducted a sensitivity analysis using age and MMSE matched subsamples created with anti-clustering ( n = 66 per subtype at baseline visit). The process was repeated across 500 iterations, each\ntime estimating the difference in rate of change across six cognitive domains using linear mixed-effects models (see Fig. 7). Consistent with the main findings from the full sample, the TPPA Subtype showed faster decline across most domains (i.e., negative difference in rate of change). The exception was Verbal Fluency, where the TSA Subtype showed slightly worse trajectories, replicating the paradox noted in the primary analysis. As expected, the Short Blessed score (where higher values indicate worse performance) exhibited a positive difference, indicating a steeper rate of decline in the TPPA Subtype. Notably, the Short Blessed Test showed considerable variability across bootstrap iterations. This widespread likely reflects multiple contributing factors, including the smaller number of repeated observations, the relatively coarse scoring structure of the instrument, and its limited sensitivity to subtle longitudinal change. Given its primary role as a screening tool rather than a nuanced progression measure, the broader distribution is expected. Nonetheless, the overall directionality of subtype differences remained preserved.\nWe also conducted a secondary sensitivity analysis focusing on participants with at least three longitudinal visits (see Supplementary Figure S6). The results from this subgroup were broadly consistent with those from the full sample. While the average differences in rate of change between subtypes were somewhat attenuated, the directionality of effects across all cognitive tests remained stable, supporting the robustness of our findings despite variation in follow-up duration.", "doc_items_refs": ["#/texts/121", "#/texts/122", "#/texts/123"], "page_nos": [1], "uuid": "c3410c84-8a83-4f94-9a4c-50c5163da253"}
{"doc_id": "2025__Dissecting_real-world_memory_clinical_cohort_heterogeneity_analysis_of_neuroanat__W4414704396", "source_path": "<redacted:source_path>", "chunk_id": 22, "source_chunk_idxs": [31, 32], "num_tokens": 260, "text": "Sensitivity analyses for longitudinal studies\nFigure caption: Fig. 7 Rate of decline on clinical assessments after matching the baseline MMSE or age: Each histogram reflects the distribution of the difference in median rate of cognitive change between the TSA and TPPA subtypes (TSA minus TPPA) across 100 iterations using matched subsamples. Dashed vertical lines indicate a null difference (x = 0), and the colored vertical lines marks the average difference in each test. For most domains, a negative value indicates steeper decline in the TPPA subtype. In contrast, positive values for Verbal Fluency and Short Blessed reflect the paradoxical pattern where the TSA subtype shows comparable or steeper decline in verbal fluency, and the TPPA subtype performs worse on Short Blessed (where higher scores reflect more impairment). These results confirm the reproducibility of our subtype findings under sampling-balanced conditions\n\nDiscussion\nThis study's application of the HYDRA algorithm to the OASIS-4 memory clinic cohort has successfully segmented patients into two neuroanatomically meaningful subtypes, each characterized by unique structural and cognitive patterns. It characterized heterogeneity of dementia in memory clinics, building upon previous studies by examining a larger sample and longitudinal cognitive and clinical data.", "doc_items_refs": ["#/pictures/9", "#/texts/129"], "page_nos": [1], "uuid": "cb22a371-4e98-4c97-b1f0-96b3577cb573"}
{"doc_id": "2025__Dissecting_real-world_memory_clinical_cohort_heterogeneity_analysis_of_neuroanat__W4414704396", "source_path": "<redacted:source_path>", "chunk_id": 23, "source_chunk_idxs": [33], "num_tokens": 373, "text": "Neuroanatomical and cognitive variations between subtypes\nThe TSA Subtype, referred to as the Temporal-Sparing Atrophy Subtype, demonstrated relatively mild volumetric reductions overall, with notably lower effect sizes in temporal areas and precuneus. These are areas crucial for memory processing and especially for episodic memory [57]. In other words, within this subtype's atrophy pattern, the temporal lobes appear comparatively\n\"spared,\" while subtler atrophy was observed in a few parietal or frontal regions. This pattern could explain the milder cognitive impairments observed in this group, as reflected in their relatively preserved CDR and MMSE scores (Table 2). Taken together, these results suggest that the TSA Subtype might encompass an early stage or a less aggressive form of dementia, potentially responsive to early intervention strategies that could delay cognitive progression. The milder cognitive impairments seen in the TSA Subtype suggest the possibility of extending the window for therapeutic intervention, especially for memory-related cognitive functions.\nThe TPPA Subtype, referred to as the Temporal-Parietal Predominated Atrophy Subtype, demonstrated widespread atrophy affecting the frontal, parietal, and temporal lobes. These regions are integral to higher cognitive functions, which correlates with the more severe cognitive deficits [57, 58], reflected in lower MMSE scores and higher CDR scores. The extensive\n(2025) 17:215\nneurodegeneration in the TPPA Subtype suggests a more advanced or rapidly progressing form of dementia, highlighting the critical regions affected in these patients. The pronounced atrophy in multiple brain regions suggests a need for more intensive clinical management and highlights the potential for future research to focus on slowing the progression of degeneration in these critical areas.", "doc_items_refs": ["#/texts/131", "#/texts/132", "#/texts/133", "#/texts/135", "#/texts/136"], "page_nos": [1], "uuid": "498639c6-07a7-44b3-a867-21ae6eab9e90"}
{"doc_id": "2025__Dissecting_real-world_memory_clinical_cohort_heterogeneity_analysis_of_neuroanat__W4414704396", "source_path": "<redacted:source_path>", "chunk_id": 24, "source_chunk_idxs": [34, 35], "num_tokens": 429, "text": "Potential mechanisms\nThe differential decline rates between the subtypes may reflect underlying differences in neurobiological processes. The extensive atrophy observed in the TPPA Subtype suggests greater involvement of networks critical for executive function and memory, such as the frontoparietal and default mode networks. This may explain the faster cognitive deterioration and broader functional impairments in this group. Conversely, the TSA Subtype's slower progression might be attributed to the preservation of critical neural pathways, potentially delaying the onset of severe impairments.\nIn addition to structural and cognitive differences, we observed a significant disparity in vascular burden between subtypes. The TPPA Subtype exhibited higher T1-derived WMH volumes, suggesting greater vascular risk in this group. This vascular burden may compound the effects of neurodegeneration and contribute to the accelerated clinical progression seen in the TPPA Subtype. Importantly, because our clustering was based solely on normalized gray matter measures that directly capture neurodegeneration and can be widely obtained in clinical MRI, WMH differences were not part of the model input but instead represent an additional biological dimension that may interact with atrophy patterns. It supports the idea that subtype-specific disease trajectories may arise from a combination of neurodegenerative and vascular mechanisms. Collectively, these findings align with the hypothesis [59] that neurodegenerative processes can follow distinct pathways depending on the affected neural circuits, further highlighting the importance of stratified research into neurodegenerative mechanisms.\n\nAddressing heterogeneity in clinical cohorts\nA major strength of this study lies in its emphasis on real-world clinical cohorts, which inherently display significant heterogeneity compared to well-characterized research populations. By addressing the diversity in neuroanatomical presentations, this study bridges the gap between controlled research environments and clinical practice. This heterogeneity reflects the challenges faced by clinicians in diagnosing and managing patients with varying degrees and patterns of impairmentand may\nsupport future efforts to tailor research and care pathways to different subgroups.", "doc_items_refs": ["#/texts/138", "#/texts/139", "#/texts/141", "#/texts/143"], "page_nos": [1], "uuid": "e9b3ed3b-ac34-4874-bc49-93ce68f29846"}
{"doc_id": "2025__Dissecting_real-world_memory_clinical_cohort_heterogeneity_analysis_of_neuroanat__W4414704396", "source_path": "<redacted:source_path>", "chunk_id": 25, "source_chunk_idxs": [36], "num_tokens": 374, "text": "Insights from longitudinal analysis\nThe longitudinal analyses and the sensitivity tests revealed that cognitive decline does not follow a uniform trajectory across the dementia spectrum but varies significantly between the subtypes identified. Incorporating mixed-effects models allowed us to capture the nuances of how age and disease duration impact cognitive decline. These models indicated that the cognitive trajectory in the TPPA Subtype is steeper, aligning with its broader anatomical impact, while the TSA Subtype experienced a more gradual decline, consistent with its relatively low effect sizes in temporal regions and the precuneus, areas critical for memory processing and episodic recall. Interestingly, the Verbal Fluency Test results in the TSA Subtype, which were worse than those in the TPPA Subtype, point to a domain-specific vulnerability that stands apart from the otherwise milder pattern of global decline. This suggests that even \"less aggressive\" atrophy profiles may disproportionately affect certain cognitive circuits supporting lexical retrieval and language production, warranting hypothesis-driven investigation in future studies.\nComplementing these cognitive findings, we also examined global clinical progression using longitudinal changes in CDR-Sum of Boxes and MMSE, as well as Cox proportional hazards survival models restricted to individuals with baseline CDR = 0.5. Notably, none of these global metrics revealed significant differences in progression rates between subtypes. This apparent dissociation between cognitive test decline and global clinical staging suggests that while the TPPA subtype exhibits more rapid domain-specific deterioration, such changes may not be fully captured by global staging tools like the CDR within the available follow-up window. These findings underscore the limitations of global clinical scales in reflecting the nuanced progression patterns of biologically distinct subtypes and highlight the need for more sensitive or domain-specific outcome measures in memory clinic cohorts.", "doc_items_refs": ["#/texts/145", "#/texts/146"], "page_nos": [1], "uuid": "e116fd4d-d57c-4e1a-a0b6-8266eb3bb3fd"}
{"doc_id": "2025__Dissecting_real-world_memory_clinical_cohort_heterogeneity_analysis_of_neuroanat__W4414704396", "source_path": "<redacted:source_path>", "chunk_id": 26, "source_chunk_idxs": [37], "num_tokens": 350, "text": "Clinical implications and machine-learning perspectives\nRecognizing heterogeneity in memory clinic populations may eventually contribute to improved diagnostic refinement and stratified care pathways. By identifying distinct subtypes based on neuroanatomical patterns, this study provides a framework for better understanding the underlying complexity of dementia, including variable clinical presentations and trajectories. The distinct rates of cognitive decline observed between subtypes reinforce the value of tailored approaches in both\n(2025) 17:215\nroutine assessments and longer-term monitoring of disease progression.\nIn parallel, our findings underscore the power of machine-learning methods, particularly semi-supervised algorithms like HYDRA, in parsing hidden heterogeneity. Unlike traditional classification models that assume a single disease pattern, HYDRA leverages multiple \"margins\" to identify unique atrophy profiles within a clinically diverse cohort. This approach is especially beneficial in real-world memory clinics, where patients may have a range of pathologies and disease trajectories beyond a single, canonical syndrome. Beyond simply detecting subtypes, machine learning (ML)-driven analyses can illuminate the specific neuroanatomical markers that differentiate these subgroups, guiding clinicians toward more nuanced and data-driven diagnostic insights. Nevertheless, the clinical utility of such clustering hinges upon robust validation, both biologically (e.g., with pathology biomarkers) and clinically (e.g., through longitudinal functional outcomes). As multimodal datasets become more common, ongoing advances in machinelearning algorithms will help integrate imaging, fluid, genetic, and functional data, further supporting more granular models of dementia progression and informing future translational research.", "doc_items_refs": ["#/texts/148", "#/texts/150", "#/texts/151", "#/texts/152"], "page_nos": [1], "uuid": "38e16c45-3309-4e69-b033-194c791f1c04"}
{"doc_id": "2025__Dissecting_real-world_memory_clinical_cohort_heterogeneity_analysis_of_neuroanat__W4414704396", "source_path": "<redacted:source_path>", "chunk_id": 27, "source_chunk_idxs": [38, 39], "num_tokens": 424, "text": "Limitations\nWhile this study provides significant insights into the heterogeneity of dementia, several limitations must be acknowledged. First, because AD is the most common cause of dementia, having biomarker data for PET imaging, genetic markers, or fluid biomarkers would be critical for confirming or excluding AD pathology in our cohort [60]. However, the OASIS-4 dataset does not provide these biomarkers, which limits our ability to ascertain whether the identified subtypes map directly onto AD or other neurodegenerative processes. This constraint may affect the precision of our subtype classification and the overall robustness of our findings. Moreover, as our clustering approach relied on single modality design (i.e., T1-weighted structural MRI), the resulting subtypes capture dominant anatomical variation but may lack the sensitivity to differentiate Alzheimer's disease from other non-AD pathologies Such as frontotemporal lobar degeneration, vascular dementia, or mixed etiologies. Although HYDRA is designed to capture dominant neuroanatomical axes of variation, the lack of multimodal data restricts our ability to resolve overlapping atrophy patterns that may arise from distinct underlying mechanisms. Lastly, although approximately 10% of participants were African American, this remains\na single-site dataset, potentially restricting generalizability. Studies with more diverse, multi-site cohorts are needed to confirm the external validity of these findings and refine these subtypes accordingly.\n\nFuture research\nFuture studies should incorporate multimodal data, including Amyloid and Tau biomarkers, to validate the subtypes identified and better understand the biological underpinnings of the distinct trajectories observed. Investigating molecular and genetic markers that define or influence these subtypes could help elucidate individual risk profiles and heterogeneity. Additionally, longitudinal analyses combining imaging, genetic, and cognitive data may provide deeper insights into the mechanisms driving subtype-specific progression, informing future efforts toward personalized care and stratified clinical trial designs.", "doc_items_refs": ["#/texts/154", "#/texts/156", "#/texts/158"], "page_nos": [1], "uuid": "868947b6-f41a-4af2-abe4-cf40285d9f4a"}
{"doc_id": "2025__Dissecting_real-world_memory_clinical_cohort_heterogeneity_analysis_of_neuroanat__W4414704396", "source_path": "<redacted:source_path>", "chunk_id": 28, "source_chunk_idxs": [40], "num_tokens": 373, "text": "Conclusions\nThis study underscores the critical importance of addressing heterogeneity in clinical cohorts for understanding neurodegenerative diseases. By applying the HYDRA algorithm to the OASIS-4 dataset, we identified two distinct subtypes of memory clinic populations based on neuroanatomical atrophy patterns and cognitive decline trajectories. These subtypes highlight the substantial variability in clinical presentations, reflecting the diversity seen in real-world clinical settings.\nThe TSA Subtype, characterized by more localized atrophy and slower cognitive decline, represents a less aggressive form of dementia, potentially offering a larger window for early intervention. In contrast, the TPPA Subtype, with widespread atrophy and faster cognitive decline, underscores the need for more intensive clinical management. These findings demonstrate the value of recognizing and analyzing heterogeneity within clinical cohorts, moving beyond traditional one-size-fits-all approaches.\nImportantly, although clear subtype differences were observed in domain-specific cognitive trajectories, these did not consistently translate into differences in global clinical progression as captured by summary metrics such as CDR or MMSE. This dissociation highlights the limitations of relying solely on global staging tools to track disease progression in memory clinic populations. Future efforts should prioritize more sensitive and domain-specific measures to better capture the true extent and variability of cognitive decline across distinct subtypes.\nThe study's emphasis on real-world clinical populations ensures that its findings are directly relevant to clinical practice and may inform more representative sampling and stratification strategies in future clinical trials. By acknowledging and addressing heterogeneity, this study contributes to the evolving landscape of neurodegenerative disorder research, offering actionable insights for future studies seeking to optimize diagnosis, monitoring, and intervention development.", "doc_items_refs": ["#/texts/160", "#/texts/161", "#/texts/162", "#/texts/164"], "page_nos": [1], "uuid": "7c806b44-79ec-4caa-9db2-2a9f88d05ce4"}
{"doc_id": "2025__Dissecting_real-world_memory_clinical_cohort_heterogeneity_analysis_of_neuroanat__W4414704396", "source_path": "<redacted:source_path>", "chunk_id": 29, "source_chunk_idxs": [41], "num_tokens": 289, "text": "Abbreviations\n| AD        | Alzheimer's Disease                              |\n|-----------|--------------------------------------------------|\n| PD        | Parkinson's Disease                              |\n| MRI       | Magnetic Resonance Imaging                       |\n| PET       | Positron Emission Tomography                     |\n| FLAIR     | Fluid-Attenuated Inversion Recovery              |\n| CDR       | Clinical Dementia Rating                         |\n| MMSE      | Mini-Mental State Examination                    |\n| OASIS     | Open Access Series of Imaging Studies            |\n| HYDRA     | Heterogeneity through Discriminative Analysis    |\n| SVM       | Support Vector Machine                           |\n| ARI       | Adjusted Rand Index                              |\n| CSF       | Cerebrospinal Fluid                              |\n| CU        | Cognitively Unpaired                             |\n| FDR       | False Discovery Rate                             |\n| TSA       | Temporal-Sparing Atrophy (Subtype)               |\n| TPPA      | Temporal-Parietal Predominated Atrophy (Subtype) |\n| CHI       | Calinski-Harabasz Index                          |\n| LME model | Linear Mixed Effect model                        |\n| ML        | Machine Learning                                 |\n| WMH       | White Matter Hypointensity                       |\n| AIC       | Akaike Information Criterion                     |\n| ANOVA     | Analysis of Variance                             |", "doc_items_refs": ["#/tables/2"], "page_nos": [1], "uuid": "3886b71b-f3d2-4fb3-ac99-23ea3f2d0fec"}
{"doc_id": "2025__Dissecting_real-world_memory_clinical_cohort_heterogeneity_analysis_of_neuroanat__W4414704396", "source_path": "<redacted:source_path>", "chunk_id": 30, "source_chunk_idxs": [42, 43, 44], "num_tokens": 297, "text": "Supplementary Information\nThe online version contains supplementary material available at https://doi. org/10.1186/s13195-025-01850-3.\nSupplementary Material 1.\n\nAcknowledgements\nData was provided by OASIS-3: Longitudinal Multimodal Neuroimaging: Principal Investigators: T. Benzinger, D. Marcus, J. Morris; NIH P30 AG066444, P50 AG00561, P30 NS09857781, P01 AG026276, P01 AG003991, R01 AG043434, UL1 TR000448, R01 EB009352. AV-45 doses were provided by Avid Radiopropharmaceuticals, a wholly owned subsidiary of Eli Lilly, and OASIS-4: Clinical Cohort: Principal Investigators: T. Benzinger, L. Koenig, P. LaMontagne.\n\nAuthors' contributions\nG.A. led the project and contributed to the majority of the implementation for the study and manuscript writing. Y.X. contributed to the longitudinal studies and manuscript writing. T.B. contributed to the acquisition and curation of the datasets (OASIS). B.G. provided clinical expertise and contributed to manuscript revision. A.S. conceived and supervised the project and contributed to manuscript revision. All authors read, reviewed, and approved the final manuscript.", "doc_items_refs": ["#/texts/167", "#/texts/168", "#/texts/170", "#/texts/172"], "page_nos": [1], "uuid": "0adba344-77b7-4de0-97a3-acd23c584f79"}
{"doc_id": "2025__Dissecting_real-world_memory_clinical_cohort_heterogeneity_analysis_of_neuroanat__W4414704396", "source_path": "<redacted:source_path>", "chunk_id": 31, "source_chunk_idxs": [45, 46, 47, 48, 49, 50], "num_tokens": 382, "text": "Funding\nThis work was supported by the National Institutes of Health (R01-AG067103). We thank the staff of the Washington University Center for High Performance Computing for enabling the computational aspects of this project. Computations were performed in the Washington University Research Computing and Informatics Facility, which received funding from NIH S10 program grants: 1S10OD025200-01A1 and 1S10OD030477-01.\n\nData availability\nThe OASIS-3 dataset and the OASIS-4 dataset are publicly available. The link to the data access form is: https://sites.wustl.edu/oasisbrains/home/access/.\n\nEthics approval and consent to participate\nEthics approvals were obtained by the OASIS-3 dataset and the OASIS-4 dataset. All participants were consented into Knight ADRC-related projects in accordance with the Declaration of Helsinki and following procedures approved by the Institutional Review Board of Washington University School of Medicine in St. Louis. For more details, we refer the reader to the OASIS-3 reference and the OASIS-4 reference.\n\nConsent for publication\nNot applicable.\n\nCompeting interests\nAuthor A.S. holds equity in TheraPanacea and has received personal compensation for serving as a grant reviewer for BrightFocus Foundation. All other authors declare no conflicts of interest.\n\nAuthor details\n$^{1}$Division of Computational and Data Sciences, Washington University in St. Louis, St. Louis, USA. $^{2}$Mallinckrodt Institute of Radiology, Washington University School of Medicine, St. Louis, USA. $^{3}$Institute for Informatics, Data Science and Biostatistics, Washington University School of Medicine, St. Louis, USA.\nReceived: 25 March 2025 Accepted: 15 August 2025\nPublished online: 01 October 2025", "doc_items_refs": ["#/texts/174", "#/texts/177", "#/texts/180", "#/texts/182", "#/texts/184", "#/texts/186", "#/texts/187", "#/texts/188"], "page_nos": [1], "uuid": "b5a5adec-8ae6-4122-b293-b1ca07b61567"}
{"doc_id": "2025__Dissecting_real-world_memory_clinical_cohort_heterogeneity_analysis_of_neuroanat__W4414704396", "source_path": "<redacted:source_path>", "chunk_id": 32, "source_chunk_idxs": [51], "num_tokens": 401, "text": "References\n- 1. Greenland JC, Williams-Gray CH, Barker RA. The clinical heterogeneity of Parkinson's disease and its therapeutic implications. Eur J Neurosci. 2019;49(3):328-38. doi:https://doi.org/10.1111/ejn.14094.\n- 2. Murray ME, Graff-Radford NR, Ross OA, Petersen RC, Duara R, Dickson DW. Neuropathologically defined subtypes of Alzheimer's disease with distinct clinical characteristics: a retrospective study. Lancet Neurol. 2011;10(9):785-96. doi:https://doi.org/10.1016/S1474-4422(11)70156-9. Epub 1 1 1 Jul 27. PMID: 2201870; PMCID: PMC3175379.\n- 3. Balasa M, Gelpi E, Antonell A, Sánchez-Valle R, Molinuevo JL, Lladò A. Clinical features and APOE genotype of pathologically proven early-onset Alzheimer disease. Neurology. Medicine. 2011;76:17210-5.\n- 1. Insel TR, Cuthbert BN. Medicine. Brain disorders? Precisely. Science. 2015;348(6234):499-500. https://doi.org/10.1126/science.aab2358.\n- 2. Davatzicos C. Machine learning in neuroaging: progress and challenges. Neuroimage. 2019;197:652-6. https://doi.org/10.1016/j. neuroimage.2018.10.003. Epub 2018 Oct 6. PMID: 30296563; PMCID: PMC6499712.", "doc_items_refs": ["#/texts/190", "#/texts/191", "#/texts/192", "#/texts/193", "#/texts/194"], "page_nos": [], "uuid": "3ca089be-5c02-43bd-82c8-5a4f5c559574"}
{"doc_id": "2025__Dissecting_real-world_memory_clinical_cohort_heterogeneity_analysis_of_neuroanat__W4414704396", "source_path": "<redacted:source_path>", "chunk_id": 33, "source_chunk_idxs": [52], "num_tokens": 428, "text": "References\n- 6. Rathore S, Habes M, Itfikhar MA, Shacklett A, Davatzikos C. A review on neuroimaging-based classification studies and associated feature extraction methods for Alzheimer's disease and its prodromal stages. Neuroimage. 2017;155:530-48. https://doi.org/10.1016/j.neuroimage.2017.03.057. epub 2017 Apr 13. PMID: 28414186; PMCID: PMC5511557.\n- 7. Klöppel S, Stonnington CM, Chu C, Draganski B, Scahill RI, Rohrer JD, Fox NC, Jack CR Jr, Ashburner J, Frackowiak RS. Automatic classification of MR scans in Alzheimer's disease. Brain. 2008;131(Pt 3):681-9. https://doi. org/10.1093/brain/awm319. Epub 2008 Jan 17. PMID: 18202106; PMCID: PMC2579744.\n- 8. Magnin B, Mesrob L, Kinkingénhun S, Pélérini-Issac M, Colliot O, Sarazin M, Dubois B, Lehéryy S, Benali H. Support vector machine-based classification of Alzheimer's disease from whole-brain anatomical MRI. Neuroradiology. 2009;51(2):73-83. https://doi.org/10.1007/s00234-008-0463-x.\n- 9. Hothorn T, Jung HH. RandomForest4Life: a random forest for predicting ALS disease progression. Amyotroph Lateral Scler Frontotemporal Degener. 2014;15(5-6):444-52. https://doi.org/10.3109/21678421.2014. 893361.", "doc_items_refs": ["#/texts/195", "#/texts/196", "#/texts/197", "#/texts/198"], "page_nos": [], "uuid": "a78d085f-764b-4427-a151-44af947bf247"}
{"doc_id": "2025__Dissecting_real-world_memory_clinical_cohort_heterogeneity_analysis_of_neuroanat__W4414704396", "source_path": "<redacted:source_path>", "chunk_id": 34, "source_chunk_idxs": [53], "num_tokens": 379, "text": "References\n- 10. Khalilia M, Chakraborty S, Popescu M. Predicting disease risks from highly imbalanced data using random forest. BMC Med Inform Decis Mak. 2011;11: 51. https://doi.org/10.1186/1472-6947-11-51.\n- 11. Dong A, Honnorat N, Gaonkar B, Davatzikos C. Chimera: clustering of heterogeneous disease effects via distribution matching of imaging patterns. IEEE Trans Med Imaging. 2016;35(2):612-21. https://doi.org/10. 1109/TMI.2015.2487423.\n- 12. Ten Kate M, Dicks E, Visser PJ, van der Flier WM, Teunissen CE, Barkhof F, Scheltens P, Tijms BM, Alzheimer's Disease Neuroimaging Initiative. Atrophy subtypes in prodromal Alzheimer's disease are associated with cognitive decline. Brain. 2018;141(12):3443-56. https://doi.org/10.1093/ brain/awy264. PMID: 30351346; PMCID: PMC6669409.\n- 13. Zhang X, Mormino EC, Sun N, Sperling RA, Sabuncu MK, Yeo BT. Bayesian model reveals latent atrophy factors with dissociable cognitive trajectories in Alzheimer's disease. Proc Natl Acad Sci U S A. 2016;113(42):E6535-44. https://doi.org/10.1073/pnas.1611073113.", "doc_items_refs": ["#/texts/200", "#/texts/201", "#/texts/202", "#/texts/203"], "page_nos": [], "uuid": "26fe34cb-1c5c-4cc0-8611-56cc67c7e0a5"}
{"doc_id": "2025__Dissecting_real-world_memory_clinical_cohort_heterogeneity_analysis_of_neuroanat__W4414704396", "source_path": "<redacted:source_path>", "chunk_id": 35, "source_chunk_idxs": [54], "num_tokens": 466, "text": "References\n- 14. Yang Z, Nasrallah IM, Shou H, Wen J, Doshi J, Habes M, Erus G, Abdulkadir A, Resnick SM, Albert MS, Marquard P, Fripp J, Morris JC, Wolk DA, Davatzikos C, iSTAGING Consortium, Baltimore Longitudinal Study of Aging (BLSA), Alzheimer's Disease Neuroimaging Initiative (ADNI). A deep learning framework identifies dimensional representations of Alzheimer's disease from brain structure. Nat Commun. 2021;12(1):7065. https://doi.org/10. 1038/s41467-021-26703-z\n- 15. Habes M, Grothe MJ, Tunc B, McMillan C, Wolk DA, Davatzikos C. Disentangling heterogeneity in Alzheimer's disease and related dementias using data-driven methods. Biol Psychiatry. 2020;88(1):70-82. https://doi. org/10.1016/j.biopsych.2020.01.016. Epub 2020 Jan 31. PMID: 32201044. PMCID: PMC7305953.\n- 16. Wen J, Antoniades M, Yang Z, Hwang G, Skampardoni I, Wang R, Davatzikos C. Dimensional neuroimaging endophenotypes: neurobiological representations of disease heterogeneity through machine learning. Biol Psychiatry. 2024;96(7):564-84. https://doi.org/10.1016/j.biopsych. 2024.04.017.\n- 17. Verdi S, Marquand AF, Schott JM, Cole JH. Beyond the average patient: how neuroimaging models can address heterogeneity in dementia. Brain. 2021;144(10):2946-53. https://doi.org/10.1093/brain/awab165. PMID: 33892488; PMCID: PMC863411.", "doc_items_refs": ["#/texts/204", "#/texts/205", "#/texts/206", "#/texts/207"], "page_nos": [], "uuid": "728ebff6-3328-4c9e-8270-ea69abc0ab86"}
{"doc_id": "2025__Dissecting_real-world_memory_clinical_cohort_heterogeneity_analysis_of_neuroanat__W4414704396", "source_path": "<redacted:source_path>", "chunk_id": 36, "source_chunk_idxs": [55], "num_tokens": 505, "text": "References\n- 18. Noh Y, Jeon S, Lee JM, Seo SW, Kim GH, Cho H, Ye BS, Yoon CW, Kim HJ, Chin J, Park KH, Heilman KM, Na DL. Anatomical heterogeneity of Alzheimer disease: based on cortical thickness on MRIs. Neurology. 2014;83(21):1936-44. https://doi.org/10.1212/WNL.00000000000001B.\n- 19. Park JY, Na HK, Kim S, Kim H, Kim JH, Seo SW, Na DL, Han CE, Seong JK, Alzheimer's Disease Neuroimaging Initiative. Robust identification of Alzheimer's disease subtypes based on cortical atrophy patterns. Sci Rep. 2017;7:43270. https://doi.org/10.1038/srep43270. PMID: 28276464. PMCID: PMC5343676.\n- 20. Poulakis K, Pereira JB, Meccconi P, Vellasi M, Tsolaki M, Kloszewski I, Soinenha, H Lovestone S, Simmons A, Wahlund LO, Westman E. Heterogeneous patterns of brain atrophy in Alzheimer's disease. Neurobiol Aging. 2018;65:98-108. https://doi.org/10.1016/j.neurobiolaging.2018.01.009. Epub 2018 Jan 31. PMID: 29455029.\n- 21. Young AL, Marinescu RV, Oxtoby NP, BBCottam S, Yong K, Ninth FC, Clay DM, Thomas DL, Dick KM, Cardoso J, Van Swieten J, Borroni B, Galimberti D, Masellis M, Tartaglia MC, Rowe JB, Graff C, Tagliavini F, Frisoni GB, et al. Uncovering the heterogeneity and temporal complexity of neurodegenerative diseases with subtype and stage inference. Nat Commun. 2018;9(1):1-16. https://doi.org/10.1038/s41467-018-05892-0.", "doc_items_refs": ["#/texts/208", "#/texts/209", "#/texts/210", "#/texts/211"], "page_nos": [], "uuid": "fab4966d-ccd9-4b66-ad4e-c53a02138af2"}
{"doc_id": "2025__Dissecting_real-world_memory_clinical_cohort_heterogeneity_analysis_of_neuroanat__W4414704396", "source_path": "<redacted:source_path>", "chunk_id": 37, "source_chunk_idxs": [56], "num_tokens": 362, "text": "References\n- 22. Loreto F, Verdi S, Kia SM, Duvnjak A, Hakeem H, Fitzgerald A, Patel N, Lilja J, Win Z, Perry R, Marquand AF, Cole JH, Malhotra P. Alzheimer's disease heterogeneity revealed by neuroanatomical normative modeling. Alzheimer's Dementia: Diagn Assessment Dis Monit. 2024;16(1): https://doi.org/ 10.1002/dad2.12559.\n- 23. Varol E, Sotiras A, Davatzikos C. Alzheimer's disease neuroimaging initiative. HYDRA: revealing heterogeneity of imaging and genetic patterns through a multiple max-margin discriminative analysis framework. Neuroimage. 2017;145:346-364. https://doi.org/10.1016/j.neuroimage. 2016.02.041.\n- 24. Koenig LN, Day GS, Salter A, Keefe S, Marple LM, Long J, LaMontagne P, Massouzmzadeh P, Snider BJ, Kanthamneni M, Raji CA, Ghoshal N, Gordon BA, Miller-Thomas M, Morris JC, Shimony JS, Benzinger TLS. Select\nplaque estimation by PET. Alzheimers Dement. 2015;11(1):1-15. https:// doi.org/10.1016/j.jalz.2014.07.003. Epub 2014 Oct 28. PMID: 25443857; PMCID: PMC4300247.", "doc_items_refs": ["#/texts/212", "#/texts/213", "#/texts/214", "#/texts/217"], "page_nos": [1], "uuid": "4a7d4c79-a380-42b1-9c59-f6e461a1b705"}
{"doc_id": "2025__Dissecting_real-world_memory_clinical_cohort_heterogeneity_analysis_of_neuroanat__W4414704396", "source_path": "<redacted:source_path>", "chunk_id": 38, "source_chunk_idxs": [57], "num_tokens": 492, "text": "References\n- 37. Hansson O, Seibyl J, Stomrud E, Zetterberg H, Trojanowski JQ, Bittner T, Lifke V, Corradini V, Eichenlaub U, Batral R, Buck K, Zink K, Rabe C, Blennow K, Shaw LM, Swedish BioFINDER study group, Alzheimer's Disease Neuroimaging Initiative. CSF biomarkers of Alzheimer's disease concord with amyloidβ-PET and predict clinical progression: a study of fully automated immunoassays in BioFINDER and ADNI cohorts. Alzheimers Dement. 2018;14(11):1470-81. https://doi.org/10.1016/j.jalz.2018.01.010. Epub 2018 Mar 1. PMID: 2949971; PMCID: PMC6119541.\n- 38. Folstein MF, Folstein SE, McHugh PR. Mini-mental state. J Psychiatr Res. 1975;12(3):189-98. https://doi.org/10.1016/0022-3956(75)90026-6.\n- 39. Desikan RS, Ségnonde F, Fischl B, Quinn BT, Dickson BC, Blacker D, Buckner RL, Dale AM, Maguire RP, Hyman BT, Albert MS, Killanyri J. An automated labeling system for subdividing the human cerebral cortex on MRI scans into gyral based regions of interest. Neuroimage. 2006;31:96880. https://doi.org/10.1016/j.neuroimage.2006.01.021.\n- 40. Buckner RL, Head D, Parker J, Fotonos AF, Marcus DS, Morris JC, Snyder AZ. A unified approach for morphometric and functional data analysis in young, old, and demented adults using automated atlas-based head size normalization: reliability and validation against manual measurement of total intracranial volume. Neuroimage. 2004;23:724-38. https://doi.org/ 10.1016/j.neuroimage.2004.06.018.", "doc_items_refs": ["#/texts/218", "#/texts/219", "#/texts/220", "#/texts/221"], "page_nos": [], "uuid": "d47fac8b-5e54-4681-809f-e56aca673d5c"}
{"doc_id": "2025__Dissecting_real-world_memory_clinical_cohort_heterogeneity_analysis_of_neuroanat__W4414704396", "source_path": "<redacted:source_path>", "chunk_id": 39, "source_chunk_idxs": [58], "num_tokens": 468, "text": "References\n- 41. Q Gu, J Han. Clustered support vector machines. Proceedings of the sixteenth international conference on artificial intelligence and statistics. 2013;307-315.\n- 42. Hubert L, Arabie P. Comparing partitions. J Classif. 1985;2(1):193-218. 43. Iñesta C, Oltra-Cucarella J, Sites-Macià E. Regression-based normative data for independent and cognitively active Spanish older adults: verbal fluency tests and Boston naming test. Int J Environ Res Public Health. 2022;19(18):11445. https://doi.org/10.3390/ijerph1918114. PMID: 36141718; PMCID: PMC9517509.\n- 44. Alverson WA, O'Rourke JJP, Soble JR. The word memory test genuine memory impairment profiled discriminates genuine memory impairment from invalid performance in a mixed clinical sample with cognitive impairment. Clin Neuropsychol. 2019;33(8):1420-35. https://doi.org/10. 1080/13854046.2019.1599071.\n- 45. Carpenter CR, Bassett ER, Fischer GM, Shishkean J, Galvin JE, Morris JC. Four sensitive screening tools to detect cognitive dysfunction in geriatric emergency department patients: brief Alzheimer's screen, short blessed test, Ottawa 3DY, and the caregiver-completed AD8. Acad Emerg Med. 2011;18(4):374. https://doi.org/10.1111/j.1553-2712.2011.01040.x.\n- 46. Plackett RL. Karl Pearson and the chi-squared test Int. Stat Rev. 1983;51(1):59-72. https://doi.org/10.2307/1402731.\n- 47. McKnight PE, Najab J. Mann-Whitney U test. 1. https://doi.org/10.1002/ 9780470479216.corpsy0524.", "doc_items_refs": ["#/texts/222", "#/texts/223", "#/texts/224", "#/texts/225", "#/texts/226", "#/texts/227"], "page_nos": [], "uuid": "5244e26b-5455-4702-b766-a9b870c3c599"}
{"doc_id": "2025__Dissecting_real-world_memory_clinical_cohort_heterogeneity_analysis_of_neuroanat__W4414704396", "source_path": "<redacted:source_path>", "chunk_id": 40, "source_chunk_idxs": [59], "num_tokens": 492, "text": "References\n- 48. Lakens D. Calculating and reporting effect sizes to facilitate cumulative science: a practical primer for t-tests and ANOVAs. Front Psychol. 2013. https://doi.org/10.3389/fpsgy.2013.00863.\n- 49. Mowinckel A, Vidal-Piñeiro D. Visualization of brain statistics with R packages ggseg and ggseg3d. Adv Methods Pract Psychol. Sci. 2020;3:466-83. https://doi.org/10.1177/251524592029009.\n- 50. Wei K, Tran T, Chu K, Borzage MT, Braskie MN, Harrington MG, King KS. White matter hypointensities and hyperintensities have equivalent correlations with age and CSF β-amyloid in the nondemented elderly. Brain Behav. 2019;9(12):e01457. https://doi.org/10.1002/brb3.1457. Epub 2019 Nov 6. PMID: 31692294; PMCID: PMC6908861.\n- 51. Kamal F, Moqadam R, Morrison C, Dadar M. Racial and ethnic differences in white matter hypointensities: the role of vascular risk factors. Alzheimers Dement. 2025;21(3):e70105. https://doi.org/10.1002/alz.70105. PMID: 40145319; PMCID: PMC11947760.\n- 52. Bernal-Rusiel JL, Greve DN, Reuter M, Fischl B, Sabuncu MR. Statistical analysis of longitudinal neuroimage data with linear mixed effects models. Neuroimage. 2013;66:249-60. https://doi.org/10.1016/j.neuroimage. 2012.10.065.\n- 53. Akaike H. A new look at the statistical model identification. IEEE Trans Automat Control. 1974;19(6):716-23. https://doi.org/10.1109/TAC.1974. 1100705.", "doc_items_refs": ["#/texts/228", "#/texts/229", "#/texts/230", "#/texts/231", "#/texts/232", "#/texts/233"], "page_nos": [], "uuid": "5c0671b3-457c-4b62-aad9-fc1fd0dfec19"}
{"doc_id": "2025__Dissecting_real-world_memory_clinical_cohort_heterogeneity_analysis_of_neuroanat__W4414704396", "source_path": "<redacted:source_path>", "chunk_id": 41, "source_chunk_idxs": [60], "num_tokens": 500, "text": "References\n- 54. Ross A, Willson VL. One-way anova. In: basic and advanced statistical tests. SensePublishers, Rotterdam. 2017. https://doi.org/10.1007/ 978-94-6351-086-8\\_5.\n- 55. Benjamini Y, Hochberg Y. Controlling the false discovery rate: a practical and powerful approach to multiple testing. J R Stat Soc. Ser B (Methodological). 1995;57(1):289-300. https://doi.org/10.2307/2346101.\n- 56. Abd ElHafeez S, D'Arrigo G, Leonardi D, Fusaro M, Tripepi G, Roulemiotis S. Methods to analyze time-to-event data: the Cox regression analysis. Oxid Med Cell Longev. 2021;2021:1302811. https://doi.org/10.1155/2021/ 1302811.\n- 57. Foudil A, Macaluso E. The influence of the precuneus on the medial temporal cortex determines the subjective quality of memory during the retrieval of naturalistic episodes. Sci Rep. 2024. https://doi.org/10.1038/ s41598-024-58298-y.\n- 58. Liu Y, Li Z, Bai Y. Frontal and parietal lobes play crucial roles in understanding the disorder of consciousness: a perspective from electroencephalogram studies. Front Neurosci. 2022;16. https://doi.org/10.3389/fnins.2022. 1024278.\n- 59. Ferreira D, Verhagen C, Hernández-Cabrera JA, Cavallin L, Guo CJ, Ekman U, Hmuelbock JS, Simmons A, Barroso J, Wahlund LO, Westman E. Distinct subtypes of Alzheimer's disease based on patterns of brain atrophy: longitudinal trajectories and clinical applications. Sci Rep. 2017;7(1):46263. https://doi.org/10.1038/srep46263. PMID: 28417965; PMC: PMCID: PMC5394684.", "doc_items_refs": ["#/texts/235", "#/texts/236", "#/texts/237", "#/texts/238", "#/texts/239", "#/texts/240"], "page_nos": [], "uuid": "26cc0a10-4177-491d-88a5-56e9f82035a7"}
{"doc_id": "2025__Dissecting_real-world_memory_clinical_cohort_heterogeneity_analysis_of_neuroanat__W4414704396", "source_path": "<redacted:source_path>", "chunk_id": 42, "source_chunk_idxs": [61, 62], "num_tokens": 142, "text": "References\n- 60. Vermeiren MR, Calandri II, van der Flier WM, van de Giessen E, Ossenkoppele R. Survey among experts on the future role of tau-PET in clinical practice and trials. Alzheimer's Dementia: Diagn Assessment Dis Monit. 2024;16(4):e70033. https://doi.org/10.1002/dad2.70033. PMID: 39583643; PMC: PMCID: PMC11582687.\n\nPublisher's Note\nSpringer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations.", "doc_items_refs": ["#/texts/241", "#/texts/243"], "page_nos": [1], "uuid": "8069009f-fc96-46ca-8970-db9645a403f6"}
