{"doc_id": "2025__Diffusion_tensor_imaging_analysis_of_aged_dogs_with_and_without_canine_cognitive__W4414753933", "source_path": "<redacted:source_path>", "chunk_id": 0, "source_chunk_idxs": [0, 1, 2], "num_tokens": 445, "text": "Diffusion tensor imaging analysis of aged dogs with and without canine cognitive dysfunction | BMC Veterinary Research | Full Text\nSkip to main content\nAdvertisement\nSearch\n- Explore journals\n- Get published\n- About BMC\n- My account\nSearch all BMC articles\nSearch\nBMC Veterinary Research\n- Home\n- About\n- Articles\n- Submission Guidelines\n- Collections\n- Join the Editorial Board\n- Submit manuscript\nDiffusion tensor imaging analysis of aged dogs with and without canine cognitive dysfunction\nDownload PDF\nDownload PDF\n- Research\n- Open access\n- Published: 02 October 2025\n\nDiffusion tensor imaging analysis of aged dogs with and without canine cognitive dysfunction\n- Jamie Henry\n1\n,\n- Masayasu Ukai\n1\n,\n5\n,\n- Markos Antonakakis\n1\n,\n5\n,\n- Tianjian Zhou\n2\n,\n- Julie A. Moreno\n3\n,\n5\n,\n- Agnieszka Z. Burzynska\n4\n,\n5\n&amp;\n- ...\n- Stephanie McGrath\n1\n,\n5\nShow authors\nBMC Veterinary Research\nvolume 21\n, Article number: 550 ( 2025 )\nCite this article\n- 238 Accesses\n- 7 Altmetric\n- Metrics details\n\nDiffusion tensor imaging analysis of aged dogs with and without canine cognitive dysfunction\nAbstract\nBackground\nCanine cognitive dysfunction (CCD) is a naturally occurring disease in aged dogs that shares behavioral and pathological similarities with Alzheimer's disease (AD). Despite this, in vivo imaging of CCD has been limited, and to our knowledge, no studies have investigated the use of diffusion tensor imaging (DTI) to assess brain atrophy in this condition. The primary aim of this study was to determine whether DTI could detect differences in white matter microstructure between aged dogs with CCD and cognitively healthy aged dogs. A secondary aim was to evaluate correlations between DTI parameters and cognitive scores derived from the Canine Dementia Scale (CADES). We hypothesized that dogs with CCD would show lower fractional anisotropy (FA) and higher mean diffusivity (MD), axial diffusivity (AxD), and radial diffusivity (RD) in the corpus callosum (CC) and thalamus. We further hypothesized that these changes would correlate with cognitive dysfunction severity.", "doc_items_refs": ["#/texts/1", "#/texts/2", "#/texts/3", "#/texts/4", "#/texts/5", "#/texts/6", "#/texts/7", "#/texts/8", "#/texts/9", "#/texts/10", "#/texts/11", "#/texts/12", "#/texts/13", "#/texts/14", "#/texts/15", "#/texts/16", "#/texts/17", "#/texts/18", "#/texts/19", "#/texts/20", "#/texts/21", "#/texts/22", "#/texts/23", "#/texts/25", "#/texts/26", "#/texts/27", "#/texts/28", "#/texts/29", "#/texts/30", "#/texts/31", "#/texts/32", "#/texts/33", "#/texts/34", "#/texts/35", "#/texts/36", "#/texts/37", "#/texts/38", "#/texts/39", "#/texts/40", "#/texts/43"], "page_nos": [], "uuid": "5fcb2265-f18c-47a7-857e-61842ed0c21c"}
{"doc_id": "2025__Diffusion_tensor_imaging_analysis_of_aged_dogs_with_and_without_canine_cognitive__W4414753933", "source_path": "<redacted:source_path>", "chunk_id": 1, "source_chunk_idxs": [3, 4], "num_tokens": 356, "text": "Diffusion tensor imaging analysis of aged dogs with and without canine cognitive dysfunction\nAbstract\nResults\nDTI revealed significant differences in white matter diffusivity between CCD and cognitively healthy aged dogs. Dogs with CCD had higher MD in the thalamus compared to healthy controls (CCD: 0.00063 mm\n2\n/s, IQR 0.00062-0.00066;\nn\n= 20, Healthy: 0.00060 mm\n2\n/s, IQR 0.00060-0.00063;\nn\n= 10;\np\n= 0.022). CADES scores positively correlated with MD in the CC (rho=0.343,\np\n= 0.0471) and thalamus (rho=0.483,\np\n= 0.0038), and with RD in the thalamus (rho=0.416,\np\n= 0.0144).\n\nDiffusion tensor imaging analysis of aged dogs with and without canine cognitive dysfunction\nAbstract\nConclusions\nThese results demonstrate that DTI can detect changes in white matter integrity in the canine brain in both CCD and cognitively healthy aged dogs. Our findings suggest that axonal degeneration, as reflected by increased MD and RD values, correlates with worsening cognitive impairment. These patterns align with findings reported in Alzheimer's disease and support the potential use of DTI to monitor neuropathological progression in dogs with CCD. Overall, our results highlight the utility of DTI in characterizing structural brain changes associated with CCD and reinforce the translational relevance of CCD as a model for AD. Further research is required to determine whether DTI can reliably differentiate CCD from normal aging in clinical settings.\nPeer Review reports", "doc_items_refs": ["#/texts/45", "#/texts/46", "#/texts/47", "#/texts/48", "#/texts/49", "#/texts/50", "#/texts/51", "#/texts/52", "#/texts/53", "#/texts/54", "#/texts/55", "#/texts/56", "#/texts/57", "#/texts/58", "#/texts/59", "#/texts/60", "#/texts/61", "#/texts/63", "#/texts/64"], "page_nos": [], "uuid": "36e00826-50ba-4071-a876-377e5d6d5d6f"}
{"doc_id": "2025__Diffusion_tensor_imaging_analysis_of_aged_dogs_with_and_without_canine_cognitive__W4414753933", "source_path": "<redacted:source_path>", "chunk_id": 2, "source_chunk_idxs": [5], "num_tokens": 436, "text": "Diffusion tensor imaging analysis of aged dogs with and without canine cognitive dysfunction\nBackground\nCanine cognitive dysfunction (CCD) is a progressive neurodegenerative disorder that affects 14%- 35% of the aged dogs and mirrors Alzheimer's disease (AD) in behaviour and pathology [\n1\n]. Shared pathological changes between CCD and AD include amyloid-β (Aβ) plaques, cerebral atrophy, ventricular enlargement, and axonal degradation [\n1\n,\n2\n,\n3\n] Canines seem to be a promising model for AD due to their spontaneous development of neuropathological changes and shared environmental risk factors with humans [\n4\n]. Cognitive changes due to CCD include disorientation, sleep-wake disturbance, and house-soiling, all of which are relatively easy to identify and monitor by owners as disease severity progress [\n4\n,\n5\n]. However, advanced imaging studies-particularly diffusion tensor imaging (DTI)-are still needed to validate dogs as a robust Alzheimer's disease model.\nConventional MRI studies in both AD and CCD have previously reported cortical or hippocampal atrophy, ventricular enlargement, and diffuse white-matter signal change, but these macroscopic findings cannot reveal microstructural injury [\n6\n,\n7\n,\n8\n]. Diffusion tensor imaging (DTI) has been shown to be promising for evaluating microstructural white matter integrity in humans with AD [\n9\n,\n10\n]. DTI measures the directionality and magnitude of the diffusion of water molecules in a tissue and can characterize demyelination and axonal degradation throughout the brain [\n11\n,\n12\n,\n13\n]. Studies have suggested that DTI can differentiate AD from normal brain aging and may serve as a biomarker for the risk of AD in patients with mild cognitive impairment (MCI) [\n14\n,\n15\n,\n16\n]. However, there is a lack of consensus about the efficacy of DTI in distinguishing AD from aging pathology [\n17\n,\n18\n]. More research is needed to establish which white matter regions differ significantly in DTI indices between AD and aging brains in humans.", "doc_items_refs": ["#/texts/66", "#/texts/67", "#/texts/68", "#/texts/69", "#/texts/70", "#/texts/71", "#/texts/72", "#/texts/73", "#/texts/74", "#/texts/75", "#/texts/76", "#/texts/77", "#/texts/78", "#/texts/79", "#/texts/80", "#/texts/81", "#/texts/82", "#/texts/83", "#/texts/84", "#/texts/85", "#/texts/86", "#/texts/87", "#/texts/88", "#/texts/89", "#/texts/90", "#/texts/91", "#/texts/92", "#/texts/93", "#/texts/94", "#/texts/95", "#/texts/96", "#/texts/97", "#/texts/98", "#/texts/99", "#/texts/100", "#/texts/101", "#/texts/102", "#/texts/103", "#/texts/104", "#/texts/105", "#/texts/106", "#/texts/107"], "page_nos": [], "uuid": "c77da070-8d8f-437d-9ed1-7057f1035868"}
{"doc_id": "2025__Diffusion_tensor_imaging_analysis_of_aged_dogs_with_and_without_canine_cognitive__W4414753933", "source_path": "<redacted:source_path>", "chunk_id": 3, "source_chunk_idxs": [6], "num_tokens": 295, "text": "Diffusion tensor imaging analysis of aged dogs with and without canine cognitive dysfunction\nBackground\nDTI has been used to characterize various neurological diseases in canines, including spinal cord injury, idiopathic epilepsy, and degenerative myelopathy, with mixed success in differentiating healthy from diseased dogs [\n19\n,\n20\n,\n21\n]. A recent study investigating white matter changes in aging canine brains reported distinct alterations in DTI indices compared to healthy controls in the parietal and temporal regions, corpus callosum (CC), midbrain, and fornix [\n22\n]. To date, no study has used DTI to characterize white matter integrity in dogs with CCD.\nAccordingly, the primary aim of this study was to quantify differences in white-matter microstructure between aged dogs with canine cognitive dysfunction (CCD) and cognitively healthy aged dogs using diffusion tensor imaging (DTI). A secondary aim was to determine whether DTI metrics correlate with cognitive-impairment severity, as measured by the Canine Dementia Scale (CADES). We hypothesized that CCD would be associated with lower fractional anisotropy (FA) and higher mean diffusivity (MD), axial diffusivity (AxD), and radial diffusivity (RD) in the corpus callosum and thalamus, and that these alterations would increase with higher CADES scores.", "doc_items_refs": ["#/texts/108", "#/texts/109", "#/texts/110", "#/texts/111", "#/texts/112", "#/texts/113", "#/texts/114", "#/texts/115", "#/texts/116", "#/texts/117"], "page_nos": [], "uuid": "7c3c623a-4798-4cd9-96da-a63d88d6e88e"}
{"doc_id": "2025__Diffusion_tensor_imaging_analysis_of_aged_dogs_with_and_without_canine_cognitive__W4414753933", "source_path": "<redacted:source_path>", "chunk_id": 4, "source_chunk_idxs": [7], "num_tokens": 344, "text": "Diffusion tensor imaging analysis of aged dogs with and without canine cognitive dysfunction\nResults\nCohort characterization\nTwenty dogs had Canine Dementia Scale (CADES) scores &gt;8 (62.5%) and were, therefore, categorized as having signs of CCD: eight male castrated (40%) and 12 female spayed (60%) dogs with ages ranging from 8.8-15.2 years (12.4±1.81 years, mean±SD) and weights ranging from 6.3 to 35.5 kg (17.2±8.25 kg). Twelve dogs were categorized as cognitively healthy (37.5%): eight male castrated (66.7%) and four female spayed (33.3%) dogs with ages ranging from 8 to 14.5 years (10.4±2.29 years) and weights ranging from 7.4 to 44.4 kg (26.7±13.0 kg). The mean scores of the CADES survey for the CCD and healthy groups were 43.7±20.6 and 2.17±2.62, respectively. Within the CCD group, five were characterized as mild CCD (CASED score 8-23), four characterized as moderate CCD (CADES score 24-44), and eleven were characterized as severe CCD (CADES score 45-95). Common behavioural changes within the CCD group include wandering at night, inappropriate urination, increased irritability, and anxiety. Demographic information and CADES survey scores are summarized in Table\n1\n, while Additional file 1 provides the individual demographic data and changes in DTI indices for each patient.", "doc_items_refs": ["#/texts/120", "#/texts/121", "#/texts/122"], "page_nos": [], "uuid": "cb8343a2-874d-4cda-8be0-1e96e5ceda44"}
{"doc_id": "2025__Diffusion_tensor_imaging_analysis_of_aged_dogs_with_and_without_canine_cognitive__W4414753933", "source_path": "<redacted:source_path>", "chunk_id": 5, "source_chunk_idxs": [8, 9], "num_tokens": 324, "text": "Diffusion tensor imaging analysis of aged dogs with and without canine cognitive dysfunction\nResults\nROI quality and inter-observer agreement\nPrior to analysis, three samples were excluded because of severe dorsal-ventral warping, and two additional dogs were removed from the thalamic analysis after distortion prevented reliable ROI placement, leaving 20 CCD and 10 healthy images for thalamic ROIs. Interobserver agreement for all ROIs is summarized in Table\n2\nas intraclass correlation coefficients (ICCs) with 95% confidence intervals.\n\nDiffusion tensor imaging analysis of aged dogs with and without canine cognitive dysfunction\nResults\nGroup differences in DTI metrics\nAll collected DTI variables (FA, MD, AxD and RD) were evaluated for normality. Normal quantile-quantile plots demonstrated that the DTI variables were not normally distributed. As a result, the Wilcoxon rank sum test was performed to compare the median of each DTI variable between the CCD group and the healthy group. Figure\n1\nsummarizes the DTI metrics for the corpus callosum (CC) while Fig.\n2\npresents the corresponding thalamic metrics. According to this analysis, the median MD in the thalamus in dogs with CCD was significantly greater than that observed in healthy dogs (CCD: 0.00063 mm\n2\n/s, IQR 0.00062-0.00066;\nn\n= 20, Healthy: 0.00060 mm\n2\n/s, IQR 0.00060-0.00063;\nn\n= 10;\np\n= 0.022).\nFig. 1\nFig. 2", "doc_items_refs": ["#/texts/124", "#/texts/125", "#/texts/126", "#/texts/128", "#/texts/129", "#/texts/130", "#/texts/131", "#/texts/132", "#/texts/133", "#/texts/134", "#/texts/135", "#/texts/136", "#/texts/137", "#/texts/138", "#/texts/139", "#/texts/140", "#/texts/141", "#/texts/142", "#/texts/143", "#/texts/144"], "page_nos": [], "uuid": "19b44744-def3-46b2-8e6c-e6845443e74f"}
{"doc_id": "2025__Diffusion_tensor_imaging_analysis_of_aged_dogs_with_and_without_canine_cognitive__W4414753933", "source_path": "<redacted:source_path>", "chunk_id": 6, "source_chunk_idxs": [10, 11], "num_tokens": 279, "text": "Diffusion tensor imaging analysis of aged dogs with and without canine cognitive dysfunction\nResults\nCorrelation with CADES scores\nSpearman's rank correlation was computed to assess the relationship between CADES scores and DTI parameters. CADES scores correlated positively with MD in the corpus callosum (rho=0.343,\np\n= 0.0471) and MD and RD in the thalamus (rho=0.483,\np\n= 0.0038; rho=0.416,\np\n= 0.0144, respectively).\n\nDiffusion tensor imaging analysis of aged dogs with and without canine cognitive dysfunction\nResults\nPost-hoc power analysis\nPost-hoc power analysis was performed for each DTI parameter (FA, MD, AxD, RD) in the CC and thalamus using α = 0.05. The results of post-hoc power analysis can be seen in Table\n3\n. The \"Power\" column shows the statistical power our current sample achieved, whereas the \"n.80\" and \"n.90\" columns indicate the sample size required to reach 80% or 90% power, respectively, at the same effect size. These results demonstrate that larger cohorts are needed to detect reliable group differences in most metrics. Additionally, they suggest that thalamic MD and RD may be the most promising parameters for distinguishing CCD from healthy ageing dogs.", "doc_items_refs": ["#/texts/146", "#/texts/147", "#/texts/148", "#/texts/149", "#/texts/150", "#/texts/151", "#/texts/152", "#/texts/154", "#/texts/155", "#/texts/156"], "page_nos": [], "uuid": "9c659ef3-4d13-4aff-9dff-74f18da4e429"}
{"doc_id": "2025__Diffusion_tensor_imaging_analysis_of_aged_dogs_with_and_without_canine_cognitive__W4414753933", "source_path": "<redacted:source_path>", "chunk_id": 7, "source_chunk_idxs": [12], "num_tokens": 458, "text": "Diffusion tensor imaging analysis of aged dogs with and without canine cognitive dysfunction\nDiscussion\nWe compared 20 dogs with CCD with 12 similarly aged healthy dogs to investigate differences in white matter microstructure in a canine model of cognitive decline. We found a positive correlation between cognitive decline, evaluated by the CADES survey, and two DTI parameters, MD in both the CC and thalamus, and RD in the thalamus. Additionally, we found an increase in the mean MD in the thalamus of dogs with CCD compared to healthy controls. These findings indicate that DTI can detect differences in axonal integrity between dogs with CCD and cognitively healthy aged dogs, and that axonal integrity may decrease as the severity of cognitive dysfunction increases. Although further research is required to determine the feasibility of DTI as a diagnostic tool for CCD, our research reveals the applicability of DTI to investigate diffusivity changes in brains with CCD which could reveal the broader use of CCD as a translational model for AD.\nThe values of mean fractional anisotropy (FA), mean diffusivity (MD), axial diffusivity (AxD), and radial diffusivity (RD) provide insight into white matter integrity and are indicative of white matter degradation or demyelination [\n23\n]. Lower FA and greater RD and MD have been reported in aging and AD, which is thought to reflect decreased myelination, disruption of axonal structure, and overall rarefaction of white matter tissue [\n23\n,\n24\n,\n25\n]. In a recent study, human patients with AD-identified by lower Modified Mini-Mental State Examination (MMMSE) and Clinical Dementia Rating (CDR) scores-showed widespread increases in MD and decreases in FA within major white matter tracts including the splenium, cingulum, and arcuate fasciculus [\n14\n]. A comparable pattern emerged in our CCD cohort: higher CADES scores correlated with increased MD in the thalamus and splenium of the CC. These converging observations suggest that CCD and AD shares some microstructural features, supporting further exploration of canines with CCD as a translation model for human AD.", "doc_items_refs": ["#/texts/158", "#/texts/159", "#/texts/160", "#/texts/161", "#/texts/162", "#/texts/163", "#/texts/164", "#/texts/165", "#/texts/166", "#/texts/167", "#/texts/168", "#/texts/169"], "page_nos": [], "uuid": "a634bcf3-998d-4ed9-b178-a01260b56bb7"}
{"doc_id": "2025__Diffusion_tensor_imaging_analysis_of_aged_dogs_with_and_without_canine_cognitive__W4414753933", "source_path": "<redacted:source_path>", "chunk_id": 8, "source_chunk_idxs": [13], "num_tokens": 261, "text": "Diffusion tensor imaging analysis of aged dogs with and without canine cognitive dysfunction\nDiscussion\nThe corpus callosum (CC) is the largest fibre bundle connecting the two cerebral hemispheres and plays an important role in interhemispheric processing. CC atrophy can be detected in early-stage AD [\n26\n,\n27\n], which may explain why patients with AD struggle to perform tasks requiring interhemispheric processing [\n28\n]. Throughout our study, the splenium of the CC was well defined and easily differentiated on the FA map, resulting in consistent delineation of the CC for ROI selection. A positive correlation was observed between CADES scores and MD in the CC (\np\n= 0.0471), indicating that cognitive deficits appear to be correlated with increased MD in the CC. Similarly, AD research has found that DTI analysis of the splenium of the CC in patients with AD compared to controls shows significant increases in MD, AxD and RD values [\n29\n]. Another study found that patients with AD have increased MD in the splenium of the CC [\n30\n]. The positive correlation observed in our study between the CADES scores and MD in the CC emphasizes the promising use of DTI to quantify changes in axonal integrity associated with decreasing cognitive function.", "doc_items_refs": ["#/texts/170", "#/texts/171", "#/texts/172", "#/texts/173", "#/texts/174", "#/texts/175", "#/texts/176", "#/texts/177", "#/texts/178", "#/texts/179", "#/texts/180", "#/texts/181", "#/texts/182"], "page_nos": [], "uuid": "7544f4cc-3347-4bba-891f-471ff15bd27d"}
{"doc_id": "2025__Diffusion_tensor_imaging_analysis_of_aged_dogs_with_and_without_canine_cognitive__W4414753933", "source_path": "<redacted:source_path>", "chunk_id": 9, "source_chunk_idxs": [14], "num_tokens": 366, "text": "Diffusion tensor imaging analysis of aged dogs with and without canine cognitive dysfunction\nDiscussion\nThe thalamus is a well-defined region within the brain that plays an important role in memory and emotional processing through its axonal connection to the Papez Circuit [\n31\n]. There is evidence that the loss of episodic memory can be correlated with degeneration of the Papez circuit, which involves the limbic thalamus [\n32\n]. The thalamus is known to be affected by AD pathology, specifically neurofibrillary changes [\n33\n,\n34\n], and canine studies have shown elevated tau pathology in the Papez circuit and limbic thalamus in dogs with CCD [\n35\n]. In this study, we found an increase in mean MD in the thalamus in dogs with CCD compared to non-CCD aged controls (\np\n= 0.022). Additionally, the DTI findings in the thalamus showed a positive correlation between CADES scores and MD (\np\n= 0.0038) and RD (\np\n= 0.0144) values, indicating a correlation between increased axonal diffusivity and worsening cognitive decline. Studies of the white matter tracts in the thalamus of patients with AD revealed lower FA and greater RD, compared to controls [\n36\n]. Another study showed that patients with severe stages of AD have decreased FA and increased MD in thalamic connectivity regions, including the fornix, anterior thalamic radiation, and left posterior thalamic radiation, compared to healthy controls [\n37\n]. Our analysis indicated that as signs of cognitive decline worsen, thalamic diffusivity increases and anisotropy decreases, which corresponds with human DTI data from aging and Alzheimer's neuroimaging studies.", "doc_items_refs": ["#/texts/183", "#/texts/184", "#/texts/185", "#/texts/186", "#/texts/187", "#/texts/188", "#/texts/189", "#/texts/190", "#/texts/191", "#/texts/192", "#/texts/193", "#/texts/194", "#/texts/195", "#/texts/196", "#/texts/197", "#/texts/198", "#/texts/199", "#/texts/200", "#/texts/201", "#/texts/202", "#/texts/203"], "page_nos": [], "uuid": "a6629e42-5bd5-4bd6-b986-5ea8a8111407"}
{"doc_id": "2025__Diffusion_tensor_imaging_analysis_of_aged_dogs_with_and_without_canine_cognitive__W4414753933", "source_path": "<redacted:source_path>", "chunk_id": 10, "source_chunk_idxs": [15], "num_tokens": 459, "text": "Diffusion tensor imaging analysis of aged dogs with and without canine cognitive dysfunction\nDiscussion\nThe main limitation of this study is its modest sample size, which resulted in low post-hoc power for most DTI metrics (Table\n3\n) and required pooling mild, moderate, and severe CCD cases into a single group. Future studies should recruit larger cohorts and analyze dogs with varying CCD severity separately to clarify stage-specific white-matter changes. Additionally, dogs differentially express cognitive impairment signs based on varying factors-larger sized dogs showed a lower incidence of CCD risk while smaller sized dogs, dolichocephalic breeds, and purebreds had a higher CCD risk prevalence [\n38\n]. As the scope of CCD research increases, it will be essential to examine the effect of size and breed on CCD severity and therefore neuroimaging parameters. Although our study was underpowered, the promising results of this pilot study suggest that larger populations should be included in future studies on the use of DTI as a diagnostic tool for CCD and a monitoring parameter in dogs, which will ultimately help validate dogs as an appropriate model for AD research.\nLow resolution and distortion of the magnetic resonance images limited the ability to delineate various regions in the brain, excluding analysis of other important structures. The acquisition of an image in the opposite phase-encoding direction was not originally included due to technical errors in magnetic resonance imaging (MRI) data acquisition. The addition of the phase-encoding sequence to the protocol will allow for the use of\ntopup\n[\n39\n,\n40\n] in the MRI preprocessing steps, which will result in decreased anterior to posterior distortion of the brain, increasing the integrity of brain structures. Additionally, this step would also allow for the use of\neddy,\na more advanced form of\neddy\\_correct\n, which will further correct for eddy movement artifacts [\n41\n].\nFinally, this study focused exclusively on DTI and did not include volumetric MRI, blood biomarkers, or post-mortem confirmation of CCD; integrating those modalities will be essential for comprehensive validation of the canine model. Despite these constraints, our findings provide encouraging proof-of-concept for using DTI to detect microstructural brain changes in CCD.", "doc_items_refs": ["#/texts/204", "#/texts/205", "#/texts/206", "#/texts/207", "#/texts/208", "#/texts/209", "#/texts/210", "#/texts/211", "#/texts/212", "#/texts/213", "#/texts/214", "#/texts/215", "#/texts/216", "#/texts/217", "#/texts/218", "#/texts/219", "#/texts/220", "#/texts/221", "#/texts/222"], "page_nos": [], "uuid": "33216a0e-6496-4130-baa3-31a9abbd3026"}
{"doc_id": "2025__Diffusion_tensor_imaging_analysis_of_aged_dogs_with_and_without_canine_cognitive__W4414753933", "source_path": "<redacted:source_path>", "chunk_id": 11, "source_chunk_idxs": [16], "num_tokens": 415, "text": "Diffusion tensor imaging analysis of aged dogs with and without canine cognitive dysfunction\nDiscussion\nFuture investigations will include the use of DTI sequences to characterize differences in indices between healthy young, healthy aged, mildly cognitively impaired, moderately cognitively impaired, and severely cognitively impaired dogs. Histopathology of brain regions, serum, and cerebrospinal fluid biomarkers will be analyzed and compared to changes in DTI parameters to further characterize differences between the groups listed above. Based on past studies, the following anatomical structures will be analyzed using DTI, which may reveal more significant changes: prefrontal, temporal, parietal, entorhinal, occipital cortices, and limbic structures [\n2\n,\n3\n,\n42\n].\nComparison of DTI parameters with biomarkers may also provide insight into the severity of disease and further develop the diagnostic role of DTI and other potential diagnostic criteria for CCD, as well as understand the utility of DTI as a monitoring tool for the dog model in AD therapeutic drug trials. Slightly elevated liver enzymes (aspartate aminotransferase and alanine transaminase), decreased sodium and chloride, and increased neurofilament light chain levels in blood serum have been found in dogs with mild cognitive impairments compared to aging dogs and young controls [\n43\n]. Amyloid-β concentrations in the plasma may also provide insight into the severity of cognitive impairment; one study revealed that an increased ratio of total Aβ40 to Aβ42 in serum could effectively differentiate dogs with mild cognitive impairment from healthy and severely cognitively impaired dogs [\n44\n]. Thus, comparing levels of amyloid beta in the blood to DTI parameters may provide insight into how diffusivity changes throughout the progression of disease from mild to severe cognitive impairment. Overall, integrating biomarker data with DTI findings may enhance the diagnostic accuracy and monitoring capabilities for CCD. This combined approach could also strengthen the utility of CCD as a translational model for Alzheimer's disease (AD).", "doc_items_refs": ["#/texts/223", "#/texts/224", "#/texts/225", "#/texts/226", "#/texts/227", "#/texts/228", "#/texts/229", "#/texts/230", "#/texts/231", "#/texts/232", "#/texts/233", "#/texts/234"], "page_nos": [], "uuid": "514255ff-6e7f-4ca8-b043-25952341384b"}
{"doc_id": "2025__Diffusion_tensor_imaging_analysis_of_aged_dogs_with_and_without_canine_cognitive__W4414753933", "source_path": "<redacted:source_path>", "chunk_id": 12, "source_chunk_idxs": [17, 18], "num_tokens": 479, "text": "Diffusion tensor imaging analysis of aged dogs with and without canine cognitive dysfunction\nConclusion\nThis study demonstrates that DTI can detect changes in white matter microstructure in dogs with CCD, specifically in the CC and thalamus. We observed positive correlations between CADES scores and MD and RD values, indicating that axonal integrity declines with increased severity of cognitive impairment. These findings align with patterns observed in Alzheimer's disease (AD) and support the potential of CCD as a translational model for AD research. Despite technical limitations and a small samples size, our results establish a foundation for future studies investigating DTI as a diagnostic and monitoring tool in aging canine populations. Further research with larger cohorts and complementary biomarkers is warranted to validate these findings and improve the understanding of CCD pathophysiology.\n\nDiffusion tensor imaging analysis of aged dogs with and without canine cognitive dysfunction\nMethods\nSubjects\nThirty-two canine subjects were prospectively recruited from client populations at the Colorado State University Veterinary Teaching Hospital, Fort Collins, CO, USA, between 8/19/2021 and 2/10/2023. All aspects of this study were approved by the Colorado State University Institutional Animal Care and Use Committee and the Clinical Review Board (IACUC protocol numbers: 4106 and 3384). Informed consent to perform MR imaging under general anesthesia and use of data for study was obtained from all owners prior to the procedure. Euthanasia was not performed as a part of this study. There were 16 castrated males and 16 spayed females from 17 different breeds: American Pit Bull Terrier (\nn\n= 1), Australian Shephard (2), Blue Tick Hound (1), Border Collie (2), Boxer (1), Chesapeake Bay Retriever (1), Cocker Spaniel (2), Dachshund (1), German Shepherd (2), German Shorthaired Pointer (1), Labrador Retriever (2), Miniature Poodle (1), Pug (3), Rhodesian Ridgeback (1), Shih Tzu (1), Weimaraner (1), and mixed breed (9). Due to the limited nature of literature regarding diffusion tensor imaging of CCD, priori sample size calculation could not be performed. Results of this study can guide future sample size calculations.", "doc_items_refs": ["#/texts/236", "#/texts/239", "#/texts/240", "#/texts/241"], "page_nos": [], "uuid": "a62af295-ab1f-49d4-9288-6fe3ad35d92f"}
{"doc_id": "2025__Diffusion_tensor_imaging_analysis_of_aged_dogs_with_and_without_canine_cognitive__W4414753933", "source_path": "<redacted:source_path>", "chunk_id": 13, "source_chunk_idxs": [19], "num_tokens": 248, "text": "Diffusion tensor imaging analysis of aged dogs with and without canine cognitive dysfunction\nMethods\nSubjects\nThe participants were divided into two groups based on neurological examination and questionnaire scoring. A previously published and validated owner-directed survey, the Canine Dementia Scale (CADES), was used to determine the cognitive health of the dogs (5). The CADES questionnaire contains 17 questions related to changes in dogs' behavior, including spatial orientation, social orientation, social interactions, sleep-wake cycles, and house soiling. Normal aging scores range between 0-7 points, mild cognitive impairment between 8-23 points, moderate cognitive impairment between 24-44 points and severe cognitive impairment between 45-95 points. Dogs with scores &gt;8 on the CADES surveys were categorized as dogs as having some signs of CCD, while dogs with scores between 0-7 were categorized as cognitively healthy. All dogs were greater than 8 years of age. Neurological examination and anatomical magnetic resonance imaging (MRI) analysis to rule out cognitive decline due to structural pathology were performed by a board-certified veterinary neurologist (S.M) or a veterinary neurology resident (M.U.), both of whom were blinded to the CADES scores.", "doc_items_refs": ["#/texts/242"], "page_nos": [], "uuid": "fb7111ab-8b06-487b-8d7e-cf0232c77867"}
{"doc_id": "2025__Diffusion_tensor_imaging_analysis_of_aged_dogs_with_and_without_canine_cognitive__W4414753933", "source_path": "<redacted:source_path>", "chunk_id": 14, "source_chunk_idxs": [20], "num_tokens": 398, "text": "Diffusion tensor imaging analysis of aged dogs with and without canine cognitive dysfunction\nMethods\nMagnetic Resonance Imaging (MRI) acquisition\nMagnetic Resonance Imaging of the dogs was performed under general anesthesia by a board-certified veterinary anesthesiologist. It is standard practice to anesthetize dogs for MR imaging. All dogs recovered uneventfully after the MRI sequences were acquired. Animals were premedicated with methadone (0.1-0.5 mg/kg) or butorphanol (0.1-0.5 mg/kg). Preoxygenation and monitoring equipment was placed prior to induction (as tolerated). Propofol (2-5 mg/kg) and midazolam (0.1-0.2 mg/kg) were administered intravenously. Mechanical ventilation began immediately after induction to prevent an increase in carbon dioxide. They were maintained using isoflurane or sevoflurane with continuous propofol infusion (100-400 mcg/kg/min). Heart rate and rhythm, body temperature, direct arterial blood pressure, end-tidal carbon dioxide and oxygen saturation levels were monitored throughout the procedure. MRI was performed using a 3.0T Siemens Skyra (Siemens Healthcare GmbH, Erlangen, Germany) whole-body scanner (70 cm bore diameter) operating at 45 mT/m amplitude at 200 T/m/s slew-rate. The subjects were placed in dorsal recumbency with their Head centered in a 15-channel receive-transmit knee coil. Diffusion tensor images were acquired in the transaxial plane (TR=3120, TE=112.40, flip angle=78°, isometric voxel size of 1.64 ´ 1.64 ´ 1.90 mm, in-plane field of view=213 mm, matrix size 130 mm ´ 130 mm with 138 gradient directions, b=0 and 2000 s/mm2).", "doc_items_refs": ["#/texts/244"], "page_nos": [], "uuid": "bfb7fa99-fb3f-4a8c-8f09-73b1a0bb6ac2"}
{"doc_id": "2025__Diffusion_tensor_imaging_analysis_of_aged_dogs_with_and_without_canine_cognitive__W4414753933", "source_path": "<redacted:source_path>", "chunk_id": 15, "source_chunk_idxs": [21], "num_tokens": 321, "text": "Diffusion tensor imaging analysis of aged dogs with and without canine cognitive dysfunction\nMethods\nDiffusion MRI preprocessing\nDiffusion weighted imaging (DWI) data were corrected for eddy distortion and motion using\neddy\\_correct\n[\n45\n] in FMRIB's Software Library (FSL) [\n40\n]. Brain masks were created using the Brain Extraction Tool (BET) [\n46\n] in FSL to separate the brain from surrounding tissues, using the indices of -m, -f 0.85 and -R.\nA DTI model was fitted to the data using FMBRIB's Diffusion Toolbox 5.0 in FSL, creating voxelwise tensor maps for fractional anisotropy (FA), mean diffusivity (MD), radial diffusivity (RD) and axial diffusivity (AxD) [\n47\n,\n48\n]. FA is the measure of directionality of diffusion in a tissue, with values ranging from 0 (isotropic) to 1 (anisotropic). In white matter, anisotropic diffusion is due to the presence of membranes, as well as myelination [\n25\n]. The MD reflects the magnitude of the total diffusion in a voxel, regardless of directionality. AxD is the diffusion parallel to the primary diffusion direction, while RD is the diffusion perpendicular to the primary diffusion direction [\n12\n,\n49\n].\nAll images were visually inspected at each step of image processing. Diffusion tensor images that had severe distortion were excluded from the study due to difficulty and uncertainty in identifying the targeted brain region of interest.", "doc_items_refs": ["#/texts/246", "#/texts/247", "#/texts/248", "#/texts/249", "#/texts/250", "#/texts/251", "#/texts/252", "#/texts/253", "#/texts/254", "#/texts/255", "#/texts/256", "#/texts/257", "#/texts/258", "#/texts/259", "#/texts/260", "#/texts/261", "#/texts/262", "#/texts/263", "#/texts/264", "#/texts/265", "#/texts/266"], "page_nos": [], "uuid": "c614c320-cc91-4b67-a11a-0fbb3c91ca6e"}
{"doc_id": "2025__Diffusion_tensor_imaging_analysis_of_aged_dogs_with_and_without_canine_cognitive__W4414753933", "source_path": "<redacted:source_path>", "chunk_id": 16, "source_chunk_idxs": [22], "num_tokens": 468, "text": "Diffusion tensor imaging analysis of aged dogs with and without canine cognitive dysfunction\nMethods\nRegion of interest definition\nPrior to region of interest (ROI) selection, the study was blinded and randomized. Clinical Trials Coordinator was aware of group allocation throughout the study and unblinded data post MRI analysis. To overcome the anatomical and brain size variations across the dog subjects, manual ROI selection was performed using the\nFsleyes edit\nmode [\n50\n]. The following regions were considered for analysis due to histopathological changes observed in dogs with CCD [\n3\n]: thalamus, hippocampus, corpus callosum, fornix, and cortex. Image distortion and low resolution inhibited consistent delineation of the hippocampus, fornix, and cortical regions. Therefore, the splenium of the corpus callosum (CC) and thalamus were selected as ROIs because of feasibility of voxel selection based on consistent MRI quality/resolution. Veterinary neurology resident (M.U.) and veterinary neurology research assistant (J.H.) individually selected voxels for the ROIs for each image sample, and after all analyses were completed, the average of the two ROIs for each image was used. All images were visually inspected, and datasets with severe distortion that prevented reliable ROI delineation in the CC or thalamus were marked for exclusion.\nFour voxels from the splenium of the CC and eight voxels from the thalamus were included in the ROI to minimize contamination from extraneous structures while maximizing the data points included within the mean of each parameter. Transverse sections of the FA map were used for visualization of structures, and color FA map was used to enhance visibility of axonal tracts and avoid contamination of the internal capsule when selecting voxels of the thalamus ROI and ventricles when selecting voxels for the CC ROI [\n51\n]. Figure\n3\nshows an example ROI of the CC (A and B) and thalamus (C and D) using black and white and color FA maps. The mean data were extracted from the ROIs using\nfslmeants.\nThe mean FA, MD, AxD, and RD were acquired for the CC and thalamus of each subject.\nFig. 3", "doc_items_refs": ["#/texts/268", "#/texts/269", "#/texts/270", "#/texts/271", "#/texts/272", "#/texts/273", "#/texts/274", "#/texts/275", "#/texts/276", "#/texts/277", "#/texts/278", "#/texts/279", "#/texts/280", "#/texts/281", "#/texts/282"], "page_nos": [], "uuid": "03578d0e-8d8d-4ed8-a4bd-0ab65b73173e"}
{"doc_id": "2025__Diffusion_tensor_imaging_analysis_of_aged_dogs_with_and_without_canine_cognitive__W4414753933", "source_path": "<redacted:source_path>", "chunk_id": 17, "source_chunk_idxs": [23, 24, 25], "num_tokens": 484, "text": "Diffusion tensor imaging analysis of aged dogs with and without canine cognitive dysfunction\nMethods\nStatistics\nThe statistical analyses were performed by statistician (T. Z.), veterinary neurology resident (M.U.), and veterinary neurology research assistant (J.H) using R statistical software (R Core Team, 2023) and GraphPad Prism (GraphPad Prism 10.5.0 for macOS, GraphPad Software, Boston, Massachusetts, USA,\nwww.graphpad.com\n).\nAll continuous variables were screened for normality with the Shapiro-Wilk test. Because DTI variables were non-normally distributed, group differences (CCD vs healthy) were assessed with the two-sided Wilcoxon rank-sum test. Correlations between Canine Dementia Scale (CADES) scores and DTI parameters (FA, MD, AxD, RD) were evaluated using Spearman's rank correlation coefficient (ρ).\nInter-observer reliability for region-of-interest (ROI) measurements was quantified with a two-way random-effects intraclass correlation coefficient (ICC, single measures, absolute agreement) and interpreted as poor (0.90).\nPost-hoc power calculations (80 % and 90 % targets) were performed for each DTI parameter in the corpus callosum (CC) and thalamus to estimate the sample size required for future studies. The significance level was set at α = 0.05; no multiple-comparison correction was applied because the study was exploratory.\n\nDiffusion tensor imaging analysis of aged dogs with and without canine cognitive dysfunction\nData availability\nThe datasets used and/or analysed during the current study are available from the corresponding author on reasonable request. Stephanie McGrath (stephanie.mcgrath@colostate.edu)\n\nDiffusion tensor imaging analysis of aged dogs with and without canine cognitive dysfunction\nAbbreviations\nAβ:\nAmyloid-β\nAD:\nAlzheimer's disease\nAxD:\nAxial diffusivity\nBET:\nBrain Extraction Tool\nCADES:\nCanine Dementia Scale\nCC:\nCorpus callosum\nCCD:\nCanine cognitive dysfunction\nDTI:\nDiffusion tensor imaging\nDWI:\nDiffusion-weighted imaging\nFA:\nFractional anisotropy\nFS:\nFemale spayed\nMC:\nMale castrated\nMCI:\nMild cognitive impairment\nMD:\nMean diffusivity\nMRI:\nMagnetic resonance imaging\nRD:\nRadial diffusivity\nROI:\nRegion of interest", "doc_items_refs": ["#/texts/284", "#/texts/285", "#/texts/286", "#/texts/287", "#/texts/288", "#/texts/289", "#/texts/291", "#/texts/293", "#/texts/294", "#/texts/295", "#/texts/296", "#/texts/297", "#/texts/298", "#/texts/299", "#/texts/300", "#/texts/301", "#/texts/302", "#/texts/303", "#/texts/304", "#/texts/305", "#/texts/306", "#/texts/307", "#/texts/308", "#/texts/309", "#/texts/310", "#/texts/311", "#/texts/312", "#/texts/313", "#/texts/314", "#/texts/315", "#/texts/316", "#/texts/317", "#/texts/318", "#/texts/319", "#/texts/320", "#/texts/321", "#/texts/322", "#/texts/323", "#/texts/324", "#/texts/325", "#/texts/326"], "page_nos": [], "uuid": "21cf37b6-6100-470b-af64-ecae23da48e4"}
{"doc_id": "2025__Diffusion_tensor_imaging_analysis_of_aged_dogs_with_and_without_canine_cognitive__W4414753933", "source_path": "<redacted:source_path>", "chunk_id": 18, "source_chunk_idxs": [26], "num_tokens": 495, "text": "Diffusion tensor imaging analysis of aged dogs with and without canine cognitive dysfunction\nReferences\n1. Dewey CW, Davies ES, Xie H, Wakshlag JJ. Canine cognitive dysfunction: pathophysiology, diagnosis, and treatment. Vet Clin North Am Small Anim Pract. 2019;49(3):477-99.\nArticle\nPubMed\nGoogle Scholar\n2. Prpar Mihevc S, Majdič G. Canine cognitive dysfunction and Alzheimer's disease - two facets of the same disease? Front Neurosci. 2019;13:604.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n3. Hines AD, McGrath S, Latham AS, Kusick B, Mulligan L, Richards ML, et al. Activated gliosis, accumulation of amyloid β, and hyperphosphorylation of tau in aging canines with and without cognitive decline. Front Aging Neurosci. 2023;15:1128521.\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n4. MacQuiddy B, Moreno JA, Kusick B, McGrath S. Assessment of risk factors in dogs with presumptive advanced canine cognitive dysfunction. Front Vet Sci. 2022;9: 958488.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n5. Madari A, Farbakova J, Katina S, Smolek T, Novak P, Weissova T, et al. Assessment of severity and progression of canine cognitive dysfunction syndrome using the canine dementia scale (CADES). Appl Anim Behav Sci. 2015;171:138-45.\nArticle\nGoogle Scholar\n6. Dewey CW, Rishniw M, Johnson PJ, Platt S, Robinson K, Sackman J, et al. Canine cognitive dysfunction patients have reduced total hippocampal volume compared with aging control dogs: a comparative magnetic resonance imaging study. Open Vet J. 2021;10(4):438-42.\nArticle\nPubMed\nGoogle Scholar\n7. van de Pol LA, Hensel A, van der Flier WM, Visser PJ, Pijnenburg YA, Barkhof F, et al. Hippocampal atrophy on MRI in frontotemporal lobar degeneration and Alzheimer's disease. J Neurol Neurosurg Psychiatry. 2006;77(4):439-42.\nArticle\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/328", "#/texts/329", "#/texts/330", "#/texts/331", "#/texts/332", "#/texts/333", "#/texts/334"], "page_nos": [], "uuid": "ffe14ac4-f5cb-4723-859f-9b15a92e7259"}
{"doc_id": "2025__Diffusion_tensor_imaging_analysis_of_aged_dogs_with_and_without_canine_cognitive__W4414753933", "source_path": "<redacted:source_path>", "chunk_id": 19, "source_chunk_idxs": [27], "num_tokens": 441, "text": "Diffusion tensor imaging analysis of aged dogs with and without canine cognitive dysfunction\nReferences\n8. Nestor SM, Rupsingh R, Borrie M, Smith M, Accomazzi V, Wells JL, et al. Ventricular enlargement as a possible measure of Alzheimer's disease progression validated using the Alzheimer's disease neuroimaging initiative database. Brain. 2008;131(Pt 9):2443-54.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n9. Stěpán-Buksakowska I, Keller J, Laczó J, Rulseh A, Hort J, Lisý J, et al. Diffusion tensor imaging in Alzheimer disease and mild cognitive impairment. Neurol Neurochir Pol. 2012;46(5):462-71.\nArticle\nPubMed\nGoogle Scholar\n10. Madden DJ, Bennett IJ, Burzynska A, Potter GG, Chen NK, Song AW. Diffusion tensor imaging of cerebral white matter integrity in cognitive aging. Biochim Biophys Acta. 2012;1822(3):386-400.\nArticle\nCAS\nPubMed\nGoogle Scholar\n11. O'Donnell LJ, Westin CF. An introduction to diffusion tensor image analysis. Neurosurg Clin N Am. 2011;22(2):185-96, viii.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n12. Jones DK, Leemans A. Diffusion tensor imaging. Methods Mol Biol. 2011;711:127-44.\nArticle\nCAS\nPubMed\nGoogle Scholar\n13. Aung WY, Mar S, Benzinger TL. Diffusion tensor MRI as a biomarker in axonal and myelin damage. Imaging Med. 2013;5(5):427-40.\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n14. Esrael SMAM, Hamed AMM, Khedr EM, Soliman RK. Application of diffusion tensor imaging in Alzheimer's disease: quantification of white matter microstructural changes. Egypt J Radiol Nucl Med. 2021;52(1):89.\nArticle\nGoogle Scholar", "doc_items_refs": ["#/texts/335", "#/texts/336", "#/texts/337", "#/texts/338", "#/texts/339", "#/texts/340", "#/texts/341"], "page_nos": [], "uuid": "7baa0d47-9b39-4b13-8c1f-e5aa5c6eab41"}
{"doc_id": "2025__Diffusion_tensor_imaging_analysis_of_aged_dogs_with_and_without_canine_cognitive__W4414753933", "source_path": "<redacted:source_path>", "chunk_id": 20, "source_chunk_idxs": [28], "num_tokens": 463, "text": "Diffusion tensor imaging analysis of aged dogs with and without canine cognitive dysfunction\nReferences\n15. Magalhães TNC, Casseb RF, Gerbelli CLB, Pimentel-Siva LR, Nogueira MH, Teixeira CVL, et al. Whole-brain DTI parameters associated with tau protein and hippocampal volume in Alzheimer's disease. Brain Behav. 2023;13(2): e2863.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n16. Stone DB, Ryman SG, Hartman AP, Wertz CJ, Vakhtin AA, AsDNI. Specific white matter tracts and diffusion properties predict conversion from mild cognitive impairment to Alzheimer's disease. Front Aging Neurosci. 2021;13.\n17. Kavcic V, Ni H, Zhu T, Zhong J, Duffy CJ. White matter integrity linked to functional impairments in aging and early Alzheimer's disease. Alzheimers Dement. 2008;4(6):381-9.\nArticle\nPubMed\nGoogle Scholar\n18. Head D, Buckner RL, Shimony JS, Williams LE, Akbudak E, Conturo TE, et al. Differential vulnerability of anterior white matter in nondemented aging with minimal acceleration in dementia of the Alzheimer type: evidence from diffusion tensor imaging. Cereb Cortex. 2004;14(4):410-23.\nArticle\nPubMed\nGoogle Scholar\n19. Beckmann KM, Wang-Leandro A, Steffen F, Richter H, Dennler M, Bektas R, et al. Diffusion tensor-based analysis of white matter in dogs with idiopathic epilepsy. Front Vet Sci. 2023.\nhttps://doi.org/10.3389/fvets.2023.1325521\n.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n20. Lewis MJ, Shomper JL, Williamson BG, Vansteenkiste DP, Bibi KF, Lim SHY, et al. Brain diffusion tensor imaging in dogs with degenerative myelopathy. J Vet Intern Med. 2021;35(5):2342-9.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/342", "#/texts/343", "#/texts/344", "#/texts/345", "#/texts/346", "#/texts/347"], "page_nos": [], "uuid": "f981ad65-0d36-4ed3-bb65-65ed42213a20"}
{"doc_id": "2025__Diffusion_tensor_imaging_analysis_of_aged_dogs_with_and_without_canine_cognitive__W4414753933", "source_path": "<redacted:source_path>", "chunk_id": 21, "source_chunk_idxs": [29], "num_tokens": 488, "text": "Diffusion tensor imaging analysis of aged dogs with and without canine cognitive dysfunction\nReferences\n21. Liu CB, Yang DG, Li J, Qin C, Zhang X, Liu J, et al. Diffusion tensor imaging reveals brain structure changes in dogs after spinal cord injury. Neural Regen Res. 2023;18(1):176-82.\nArticle\nPubMed\nGoogle Scholar\n22. Barry EF, Loftus JP, Luh WM, de Leon MJ, Niogi SN, Johnson PJ. Diffusion tensor-based analysis of white matter in the healthy aging canine brain. Neurobiol Aging. 2021;105:129-36.\nArticle\nPubMed\nGoogle Scholar\n23. Burzynska AZ, Preuschhof C, Bäckman L, Nyberg L, Li SC, Lindenberger U, et al. Age-related differences in white matter microstructure: region-specific patterns of diffusivity. Neuroimage. 2010;49(3):2104-12.\nArticle\nCAS\nPubMed\nGoogle Scholar\n24. Toepper M. Dissociating normal aging from Alzheimer's disease: a view from cognitive neuroscience. J Alzheimers Dis. 2017;57(2):331-52.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n25. Le Bihan D, Mangin JF, Poupon C, Clark CA, Pappata S, Molko N, et al. Diffusion tensor imaging: concepts and applications. J Magn Reson Imaging. 2001;13(4):534-46.\nArticle\nPubMed\nGoogle Scholar\n26. Raghavan S, Przybelski SA, Reid RI, Graff-Radford J, Lesnick TG, Zuk SM, et al. Reduced fractional anisotropy of the genu of the corpus callosum as a cerebrovascular disease marker and predictor of longitudinal cognition in MCI. Neurobiol Aging. 2020;96:176-83.\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n27. Teipel SJ, Bayer W, Alexander GE, Zebuhr Y, Teichberg D, Kulic L, et al. Progression of corpus callosum atrophy in Alzheimer disease. Arch Neurol. 2002;59(2):243-8.\nArticle\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/348", "#/texts/349", "#/texts/350", "#/texts/351", "#/texts/352", "#/texts/353", "#/texts/354"], "page_nos": [], "uuid": "a29f6998-3f31-4619-bf3a-5d207031ddf1"}
{"doc_id": "2025__Diffusion_tensor_imaging_analysis_of_aged_dogs_with_and_without_canine_cognitive__W4414753933", "source_path": "<redacted:source_path>", "chunk_id": 22, "source_chunk_idxs": [30], "num_tokens": 507, "text": "Diffusion tensor imaging analysis of aged dogs with and without canine cognitive dysfunction\nReferences\n28. Qiu Y, Liu S, Hilal S, Loke YM, Ikram MK, Xu X, et al. Inter-hemispheric functional dysconnectivity mediates the association of corpus callosum degeneration with memory impairment in AD and amnestic MCI. Sci Rep. 2016;6(1):32573.\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n29. Nir TM, Jahanshad N, Villalon-Reina JE, Toga AW, Jack CR, Weiner MW, et al. Effectiveness of regional DTI measures in distinguishing Alzheimer's disease, MCI, and normal aging. NeuroImage: Clinical. 2013;3:180-95.\nArticle\nPubMed\nGoogle Scholar\n30. Oishi K, Mielke MM, Albert M, Lyketsos CG, Mori S. DTI analyses and clinical applications in Alzheimer's disease. J Alzheimers Dis. 2011;26 Suppl 3(Suppl 3):287-96.\n31. Weininger J, Roman E, Tierney P, Barry D, Gallagher H, Murphy P, et al. Papez's forgotten tract: 80 years of unreconciled findings concerning the thalamocingulate tract. Front Neuroanat. 2019.\nhttps://doi.org/10.3389/fnana.2019.00014\n.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n32. Adesnik H, Naka A. Cracking the function of layers in the sensory cortex. Neuron. 2018;100(5):1028-43.\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n33. Villain N, Desgranges B, Viader F, de la Sayette V, Mézenge F, Landeau B, et al. Relationships between hippocampal atrophy, white matter disruption, and gray matter hypometabolism in Alzheimer's disease. J Neurosci. 2008;28(24):6174-81.\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n34. Braak H, Braak E. Neuropathological stageing of Alzheimer-related changes. Acta Neuropathol. 1991;82(4):239-59.\nArticle\nCAS\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/355", "#/texts/356", "#/texts/357", "#/texts/358", "#/texts/359", "#/texts/360", "#/texts/361"], "page_nos": [], "uuid": "e0ba7f12-fcc3-4d54-b80c-3540b4cab11f"}
{"doc_id": "2025__Diffusion_tensor_imaging_analysis_of_aged_dogs_with_and_without_canine_cognitive__W4414753933", "source_path": "<redacted:source_path>", "chunk_id": 23, "source_chunk_idxs": [31], "num_tokens": 485, "text": "Diffusion tensor imaging analysis of aged dogs with and without canine cognitive dysfunction\nReferences\n35. Abey A, Davies D, Goldsbury C, Buckland M, Valenzuela M, Duncan T. Distribution of tau hyperphosphorylation in canine dementia resembles early Alzheimer's disease and other tauopathies. Brain Pathol. 2021;31(1):144-62.\nArticle\nCAS\nPubMed\nGoogle Scholar\n36. Wen Q, Mustafi SM, Li J, Risacher SL, Tallman E, Brown SA, et al. White matter alterations in early-stage Alzheimer's disease: a tract-specific study. Alzheimers Dement (N Y). 2019;11:576-87.\nArticle\nGoogle Scholar\n37. Zhu QY, Bi SW, Yao XT, Ni ZY, Li Y, Chen BY, et al. Disruption of thalamic connectivity in Alzheimer's disease: a diffusion tensor imaging study. Metab Brain Dis. 2015;30(5):1295-308.\nArticle\nCAS\nPubMed\nGoogle Scholar\n38. Turcsán B, Kubinyi E. Differential behavioral aging trajectories according to body size, expected lifespan, and head shape in dogs. Geroscience. 2024;46(2):1731-54.\nArticle\nPubMed\nGoogle Scholar\n39. Andersson JL, Skare S, Ashburner J. How to correct susceptibility distortions in spin-echo echo-planar images: application to diffusion tensor imaging. Neuroimage. 2003;20(2):870-88.\nArticle\nPubMed\nGoogle Scholar\n40. Smith SM, Jenkinson M, Woolrich MW, Beckmann CF, Behrens TE, Johansen-Berg H, et al. Advances in functional and structural MR image analysis and implementation as FSL. Neuroimage. 2004;23(Suppl 1):S208-19.\nArticle\nPubMed\nGoogle Scholar\n41. Zhuang J, Hrabe J, Kangarlu A, Xu D, Bansal R, Branch CA, et al. Correction of eddy-current distortions in diffusion tensor images using the known directions and strengths of diffusion gradients. J Magn Reson Imaging. 2006;24(5):1188-93.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/362", "#/texts/363", "#/texts/364", "#/texts/365", "#/texts/366", "#/texts/367", "#/texts/368"], "page_nos": [], "uuid": "7168c707-ba21-4897-80cb-75712a97ac1a"}
{"doc_id": "2025__Diffusion_tensor_imaging_analysis_of_aged_dogs_with_and_without_canine_cognitive__W4414753933", "source_path": "<redacted:source_path>", "chunk_id": 24, "source_chunk_idxs": [32], "num_tokens": 469, "text": "Diffusion tensor imaging analysis of aged dogs with and without canine cognitive dysfunction\nReferences\n42. Youssef SA, Capucchio MT, Rofina JE, Chambers JK, Uchida K, Nakayama H, et al. Pathology of the aging brain in domestic and laboratory animals, and animal models of human neurodegenerative diseases. Vet Pathol. 2016;53(2):327-48.\nArticle\nCAS\nPubMed\nGoogle Scholar\n43. Vikartovska Z, Farbakova J, Smolek T, Hanes J, Zilka N, Hornakova L, et al. Novel diagnostic tools for identifying cognitive impairment in dogs: behavior, biomarkers, and pathology. Front Vet Sci. 2020;7: 551895.\nArticle\nPubMed\nGoogle Scholar\n44. Stylianaki I, Polizopoulou ZS, Theodoridis A, Koutouzidou G, Baka R, Papaioannou NG. Amyloid-beta plasma and cerebrospinal fluid biomarkers in aged dogs with cognitive dysfunction syndrome. J Vet Intern Med. 2020;34(4):1532-40.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n45. Andersson JLR, Sotiropoulos SN. An integrated approach to correction for off-resonance effects and subject movement in diffusion MR imaging. Neuroimage. 2016;125:1063-78.\nArticle\nPubMed\nGoogle Scholar\n46. Smith SM. Fast robust automated brain extraction. Hum Brain Mapp. 2002;17(3):143-55.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n47. Behrens TE, Woolrich MW, Jenkinson M, Johansen-Berg H, Nunes RG, Clare S, et al. Characterization and propagation of uncertainty in diffusion-weighted MR imaging. Magn Reson Med. 2003;50(5):1077-88.\nArticle\nCAS\nPubMed\nGoogle Scholar\n48. Behrens TE, Berg HJ, Jbabdi S, Rushworth MF, Woolrich MW. Probabilistic diffusion tractography with multiple fibre orientations: what can we gain? Neuroimage. 2007;34(1):144-55.\nArticle\nCAS\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/369", "#/texts/370", "#/texts/371", "#/texts/372", "#/texts/373", "#/texts/374", "#/texts/375"], "page_nos": [], "uuid": "4ff805f0-804b-441d-8b84-bc606822883c"}
{"doc_id": "2025__Diffusion_tensor_imaging_analysis_of_aged_dogs_with_and_without_canine_cognitive__W4414753933", "source_path": "<redacted:source_path>", "chunk_id": 25, "source_chunk_idxs": [33, 34], "num_tokens": 257, "text": "Diffusion tensor imaging analysis of aged dogs with and without canine cognitive dysfunction\nReferences\n49. Winklewski PJ, Sabisz A, Naumczyk P, Jodzio K, Szurowska E, Szarmach A. Understanding the physiopathology behind axial and radial diffusivity changes-what do we know? Front Neurol. 2018;9:92.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n50. McCarthy Pa, Cottaar Ma, Webster Ma, Fitzgibbon Sa, Craig M. fslpy. 3.10.0 ed: Zenodo; 2022.\n51. Goga C, Firat Z, Brinzaniuc K, Florian I. Meyer's loop anatomy demonstrated using diffusion tensor MR imaging and fiber tractography at 3T. Acta Med Marisiensis. 2014.\nhttps://doi.org/10.2478/amma-2014-0045\n.\nArticle\nGoogle Scholar\nDownload references\n\nDiffusion tensor imaging analysis of aged dogs with and without canine cognitive dysfunction\nFunding\nThis work was supported by the Institute of Cannabis Research CSU Pueblo award (ICY-FY22-McGrath). They did not play a role in design, analysis or reporting of this study.", "doc_items_refs": ["#/texts/376", "#/texts/377", "#/texts/378", "#/texts/379", "#/texts/381"], "page_nos": [], "uuid": "a092209f-27aa-4fa0-a9e0-c4945e0136a5"}
{"doc_id": "2025__Diffusion_tensor_imaging_analysis_of_aged_dogs_with_and_without_canine_cognitive__W4414753933", "source_path": "<redacted:source_path>", "chunk_id": 26, "source_chunk_idxs": [35], "num_tokens": 320, "text": "Diffusion tensor imaging analysis of aged dogs with and without canine cognitive dysfunction\nAuthor information\nAuthors and Affiliations\n1. Department of Clinical Sciences, Colorado State University, Fort Collins, CO, 80523, USA Jamie Henry, Masayasu Ukai, Markos Antonakakis &amp; Stephanie McGrath\n2. Department of Statistics, Colorado State University, Fort Collins, CO, 80523, USA Tianjian Zhou\n3. Department of Environmental and Radiological Health Sciences, Colorado State University, Fort Collins, CO, 80523, USA Julie A. Moreno\n4. Department of Human Development and Family Studies, Colorado State University, Fort Collins, CO, 80523, USA Agnieszka Z. Burzynska\n5. Brain Research Center, Colorado State University, Fort Collins, CO, 80523, USA Masayasu Ukai, Markos Antonakakis, Julie A. Moreno, Agnieszka Z. Burzynska &amp; Stephanie McGrath\nAuthors\n1. Jamie Henry\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n2. Masayasu Ukai\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n3. Markos Antonakakis\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n4. Tianjian Zhou\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n5. Julie A. Moreno\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n6. Agnieszka Z. Burzynska\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n7. Stephanie McGrath\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/384", "#/texts/385", "#/texts/386", "#/texts/387", "#/texts/388", "#/texts/389", "#/texts/390", "#/texts/391", "#/texts/392", "#/texts/393", "#/texts/394", "#/texts/395", "#/texts/396"], "page_nos": [], "uuid": "3fdfe346-6b67-4858-a246-8a80cc4e0c27"}
{"doc_id": "2025__Diffusion_tensor_imaging_analysis_of_aged_dogs_with_and_without_canine_cognitive__W4414753933", "source_path": "<redacted:source_path>", "chunk_id": 27, "source_chunk_idxs": [36, 37, 38, 39, 40], "num_tokens": 257, "text": "Diffusion tensor imaging analysis of aged dogs with and without canine cognitive dysfunction\nAuthor information\nContributions\nJH performed MRI preprocessing, ROI selection, data analysis and was a major contributor in writing the manuscript. MU performed ROI selection, data analysis, statistical analysis, and was a major contributor in writing the manuscript. MA performed neurological examinations. TZ performed statistical analysis. JAM and AZB revised article for intellectual content. SM was a major contributor in writing the manuscript and revised the article for intellectual content. All authors read and approved manuscript.\n\nDiffusion tensor imaging analysis of aged dogs with and without canine cognitive dysfunction\nAuthor information\nCorresponding author\nCorrespondence to\nStephanie McGrath\n.\n\nDiffusion tensor imaging analysis of aged dogs with and without canine cognitive dysfunction\nEthics declarations\nEthics approval and consent to participate\nThe study was approved by the Colorado State University Institutional Animal Care and Use Committee and the Clinical Review Board (IACUC protocol numbers: 4106 and 3384). Informed consent to perform MR imaging under general anesthesia and use of data for study was obtained from all owners prior to the procedure.\n\nDiffusion tensor imaging analysis of aged dogs with and without canine cognitive dysfunction\nEthics declarations\nConsent for publication\nNot applicable.\n\nDiffusion tensor imaging analysis of aged dogs with and without canine cognitive dysfunction\nEthics declarations\nCompeting interests\nThe authors declare no competing interests.", "doc_items_refs": ["#/texts/398", "#/texts/400", "#/texts/401", "#/texts/402", "#/texts/405", "#/texts/407", "#/texts/409"], "page_nos": [], "uuid": "54e5e572-f452-4885-9b8a-23625de8bd73"}
{"doc_id": "2025__Diffusion_tensor_imaging_analysis_of_aged_dogs_with_and_without_canine_cognitive__W4414753933", "source_path": "<redacted:source_path>", "chunk_id": 28, "source_chunk_idxs": [41, 42], "num_tokens": 270, "text": "Diffusion tensor imaging analysis of aged dogs with and without canine cognitive dysfunction\nAdditional information\nPublisher's Note\nSpringer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations.\n\nDiffusion tensor imaging analysis of aged dogs with and without canine cognitive dysfunction\nRights and permissions\nOpen Access\nThis article is licensed under a Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International License, which permits any non-commercial use, sharing, distribution and reproduction in any medium or format, as long as you give appropriate credit to the original author(s) and the source, provide a link to the Creative Commons licence, and indicate if you modified the licensed material. You do not have permission under this licence to share adapted material derived from this article or parts of it. The images or other third party material in this article are included in the article's Creative Commons licence, unless indicated otherwise in a credit line to the material. If material is not included in the article's Creative Commons licence and your intended use is not permitted by statutory regulation or exceeds the permitted use, you will need to obtain permission directly from the copyright holder. To view a copy of this licence, visit\nhttp://creativecommons.org/licenses/by-nc-nd/4.0/\n.\nReprints and permissions", "doc_items_refs": ["#/texts/412", "#/texts/416", "#/texts/417", "#/texts/418", "#/texts/419", "#/texts/420"], "page_nos": [], "uuid": "6bd0411f-c7be-4b33-b5cb-67f74cda5b8f"}
{"doc_id": "2025__Diffusion_tensor_imaging_analysis_of_aged_dogs_with_and_without_canine_cognitive__W4414753933", "source_path": "<redacted:source_path>", "chunk_id": 29, "source_chunk_idxs": [43, 44, 45, 46], "num_tokens": 247, "text": "Diffusion tensor imaging analysis of aged dogs with and without canine cognitive dysfunction\nAbout this article\nCite this article\nHenry, J., Ukai, M., Antonakakis, M.\net al.\nDiffusion tensor imaging analysis of aged dogs with and without canine cognitive dysfunction.\nBMC Vet Res\n21\n, 550 (2025). https://doi.org/10.1186/s12917-025-04973-9\nDownload citation\n- Received : 25 June 2024\n- Accepted : 01 August 2025\n- Published : 02 October 2025\n- DOI : https://doi.org/10.1186/s12917-025-04973-9\n\nDiffusion tensor imaging analysis of aged dogs with and without canine cognitive dysfunction\nAbout this article\nKeywords\n- Diffusion imaging\n- Diffusion tensor imaging\n- Dementia\n- Cognitive dysfunction\n- Aging\n- Cognitive aging\nDownload PDF\nAdvertisement\n\nDiffusion tensor imaging analysis of aged dogs with and without canine cognitive dysfunction\nAbout this article\nKeywords\nBMC Veterinary Research\nISSN: 1746-6148\n\nDiffusion tensor imaging analysis of aged dogs with and without canine cognitive dysfunction\nAbout this article\nKeywords\nContact us\n- General enquiries:\njournalsubmissions@springernature.com", "doc_items_refs": ["#/texts/423", "#/texts/424", "#/texts/425", "#/texts/426", "#/texts/427", "#/texts/428", "#/texts/429", "#/texts/430", "#/texts/431", "#/texts/432", "#/texts/433", "#/texts/435", "#/texts/436", "#/texts/437", "#/texts/438", "#/texts/439", "#/texts/440", "#/texts/441", "#/texts/442", "#/texts/444", "#/texts/446"], "page_nos": [], "uuid": "b036d656-9945-4eeb-b4df-fa02dece94ee"}
