{"doc_id": "2025__Korean_medicine_registry_for_cognitive_disorder_A_protocol_for_prospective_obser__W4410395861", "source_path": "<redacted:source_path>", "chunk_id": 0, "source_chunk_idxs": [0, 1], "num_tokens": 163, "text": "Korean medicine registry for cognitive disorder: A protocol for prospective observational multi-center study | PLOS One\nSkip to main content\nAdvertisement\n\nPLOS One\n- Publish Submit Your Manuscript Discover a faster, simpler path to publishing in a high-quality journal.\nPLOS ONE\npromises fair, rigorous peer review, broad scope, and wide readership - a perfect fit for your research every time.\nLearn More\nSubmit Now\n- About\n- Why Publish with PLOS ONE\n- Journal Information\n- Staff Editors\n- Editorial Board\n- Section Editors\n- Advisory Groups\n- Find and Read Articles\n- Publishing Information\n- Publication Fees\n- Press and Media\n- Contact\nSearch Search\nadvanced search\nBrowse Subject Areas ?\nClick through the PLOS taxonomy to find articles in your field.\nFor more information about PLOS Subject Areas, click\nhere\n.\n- Loading metrics\nOpen Access\nStudy Protocol", "doc_items_refs": ["#/texts/1", "#/texts/2", "#/texts/4", "#/texts/5", "#/texts/6", "#/texts/7", "#/texts/8", "#/texts/9", "#/texts/10", "#/texts/11", "#/texts/12", "#/texts/13", "#/texts/14", "#/texts/15", "#/texts/16", "#/texts/17", "#/texts/18", "#/texts/19", "#/texts/20", "#/texts/21", "#/texts/22", "#/texts/23", "#/texts/24", "#/texts/25", "#/texts/26"], "page_nos": [], "uuid": "5f7d219b-e6be-4350-8d6e-8f808c7664ea"}
{"doc_id": "2025__Korean_medicine_registry_for_cognitive_disorder_A_protocol_for_prospective_obser__W4410395861", "source_path": "<redacted:source_path>", "chunk_id": 1, "source_chunk_idxs": [2], "num_tokens": 463, "text": "Korean medicine registry for cognitive disorder: A protocol for prospective observational multi-center study\n- Hanbit Jin, Roles Conceptualization, Investigation, Methodology, Writing - original draft, Writing - review &amp; editing Affiliation Department of Diagnostics, College of Korean Medicine, Wonkwang University, Iksan, Republic of Korea\nhttps://orcid.org/0000-0003-2329-6230\n⨯\n- Image Hyperlink.\n- Do-Eun Lee, Roles Conceptualization, Investigation, Methodology Affiliation Department of Korean Neuropsychiatry Medicine, College of Korean Medicine, Wonkwang University, Iksan, Republic of Korea ⨯\n- Moon Joo Cheong, Roles Investigation, Methodology Affiliation Department of Medical Counseling, College of Health Sciences, Wonkwang University, Iksan, Republic of Korea ⨯\n- Hyungsun Jun, Roles Investigation, Methodology Affiliation Department of Diagnostics, College of Korean Medicine, Wonkwang University, Iksan, Republic of Korea ⨯\n- Taena Eom, Roles Investigation, Methodology Affiliation Department of Korean Neuropsychiatry Medicine, College of Korean Medicine, Wonkwang University, Iksan, Republic of Korea ⨯\n- Seojae Jeon, Roles Investigation, Methodology Affiliation Department of Digital Healthcare, Graduate School of JABA, Wonkwang University, Iksan, Republic of Korea ⨯\n- Dong-Hoon Kang, Roles Investigation, Methodology Affiliation Department of Neuropsychiatry, College of Korean Medicine, Daejeon University, Daejeon, Republic of Korea\nhttps://orcid.org/0000-0003-2216-6311\n⨯\n- Image Hyperlink.\n- Hye-Jeong KooK, Roles Investigation, Methodology Affiliation Department of Neuropsychiatry, College of Korean Medicine, Daejeon University, Daejeon, Republic of Korea\nhttps://orcid.org/0000-0002-6489-5160\n⨯\n- Image Hyperlink.\n- Daeun Lee, Roles Investigation, Methodology Affiliation Clinical Trial Center, Daejeon Korean Medicine Hospital of Daejeon University, Daejeon, Republic of Korea\nhttps://orcid.org/0000-0002-0823-7358\n⨯\n- Image Hyperlink.", "doc_items_refs": ["#/texts/28", "#/texts/29", "#/texts/30", "#/texts/31", "#/texts/32", "#/texts/33", "#/texts/34", "#/texts/35", "#/texts/36", "#/texts/37", "#/texts/38", "#/texts/39", "#/texts/40"], "page_nos": [], "uuid": "708c46eb-fff4-4bd1-bb14-7893de836226"}
{"doc_id": "2025__Korean_medicine_registry_for_cognitive_disorder_A_protocol_for_prospective_obser__W4410395861", "source_path": "<redacted:source_path>", "chunk_id": 2, "source_chunk_idxs": [3], "num_tokens": 511, "text": "Korean medicine registry for cognitive disorder: A protocol for prospective observational multi-center study\n- In Chul Jung, Roles Conceptualization, Writing - review &amp; editing Affiliations Department of Neuropsychiatry, College of Korean Medicine, Daejeon University, Daejeon, Republic of Korea, Clinical Trial Center, Daejeon Korean Medicine Hospital of Daejeon University, Daejeon, Republic of Korea\nhttps://orcid.org/0000-0001-7245-4990\n⨯\n- Image Hyperlink.\n- Jungtae Leem , Roles Conceptualization, Supervision, Writing - review &amp; editing * E-mail:\njulcho0908@wku.ac.kr\n(JL);\ndskhw@wku.ac.kr\n(HWK) Affiliations Department of Diagnostics, College of Korean Medicine, Wonkwang University, Iksan, Republic of Korea, Research Center of Traditional Korean Medicine, College of Korean Medicine, Wonkwang University, Iksan, Republic of Korea, Department of Il-won Integrated Medicine, Wonkwang University Korean Medicine Hospital, Iksan, Republic of Korea\nhttps://orcid.org/0000-0003-3300-5556\n⨯\n- Image Hyperlink.\n- Hyung Won Kang Roles Conceptualization, Supervision, Writing - review &amp; editing * E-mail:\njulcho0908@wku.ac.kr\n(JL);\ndskhw@wku.ac.kr\n(HWK) Affiliations Department of Korean Neuropsychiatry Medicine, College of Korean Medicine, Wonkwang University, Iksan, Republic of Korea, Department of Digital Healthcare, Graduate School of JABA, Wonkwang University, Iksan, Republic of Korea, Korean Medicine Cognitive Disorder Research Center, College of Korean medicine, Wonkwang University, Iksan, Republic of Korea ⨯\n- Hanbit Jin,\n- Do-Eun Lee,\n- Moon Joo Cheong,\n- Hyungsun Jun,\n- Taena Eom,\n- Seojae Jeon,\n- Dong-Hoon Kang,\n- Hye-Jeong KooK,\n- Daeun Lee,\n- In Chul Jung\nx\n- Published: May 15, 2025\n- https://doi.org/10.1371/journal.pone.0323170\n- Article\n- Authors\n- Metrics\n- Comments\n- Media Coverage\n- Reader Comments\n- Figures", "doc_items_refs": ["#/texts/41", "#/texts/42", "#/texts/43", "#/texts/44", "#/texts/45", "#/texts/47", "#/texts/48", "#/texts/49", "#/texts/50", "#/texts/51", "#/texts/52", "#/texts/53", "#/texts/54", "#/texts/55", "#/texts/56", "#/texts/57", "#/texts/58", "#/texts/59", "#/texts/60", "#/texts/61", "#/texts/62", "#/texts/63", "#/texts/64", "#/texts/65", "#/texts/66"], "page_nos": [], "uuid": "1645fc70-9a0a-400f-bc14-d983922e0983"}
{"doc_id": "2025__Korean_medicine_registry_for_cognitive_disorder_A_protocol_for_prospective_obser__W4410395861", "source_path": "<redacted:source_path>", "chunk_id": 3, "source_chunk_idxs": [4, 5], "num_tokens": 339, "text": "Korean medicine registry for cognitive disorder: A protocol for prospective observational multi-center study\nAbstract\nObjective\nDespite the rapid increase in dementia and cognitive impairment incidence in Korea, research on integrative treatment for cognitive impairment using Korean medicine (KM) is still in its infancy. Thus, prospective studies with systematic data collection are required. This study aims to systematically collect and explore data from patients with dementia and mild cognitive impairment (MCI) who visit KM institutions. The data collected will include the participants' baseline characteristics, cognitive impairment severity, KM diagnosis and treatment status, as well as the factors influencing their choice of integrative medical treatment.\n\nKorean medicine registry for cognitive disorder: A protocol for prospective observational multi-center study\nAbstract\nMaterials and methods\nThis registry study will be conducted from the time of registration in 2024 until December 31, 2029, at Wonkwang University Korean Medicine Hospital, Wonkwang University Jangheung Integrated Medical Hospital, and Daejeon Korean Medicine Hospital of Daejeon University. Approximately 300 participants will be enrolled and visit the hospital annually for data collection. The collected data will include sociodemographic characteristics, laboratory tests, medical device inspections, long-term care information, and various questionnaires related to dementia and cognitive impairment. No predefined interventions or restrictions on treatment will be imposed. Standard and KM treatments for cognitive impairment, including combination therapies, are permitted. As a registry study, the purpose is to investigate the participants' characteristics as outlined in the study objectives, including severity, KM diagnosis and interventions, and clinical outcomes. This epidemiological study is designed to include additional statistical analyses in response to research questions that emerge over time.", "doc_items_refs": ["#/texts/70", "#/texts/72"], "page_nos": [], "uuid": "dcfd8ef7-204e-45cf-bcfc-6301a44b50de"}
{"doc_id": "2025__Korean_medicine_registry_for_cognitive_disorder_A_protocol_for_prospective_obser__W4410395861", "source_path": "<redacted:source_path>", "chunk_id": 4, "source_chunk_idxs": [6], "num_tokens": 500, "text": "Korean medicine registry for cognitive disorder: A protocol for prospective observational multi-center study\nAbstract\nDiscussion\nThis study represents a pioneering effort in the KM field establishing the first registry of its kind focusing on dementia and MCI. This study aims to identify the characteristics of patients with dementia and MCI who visit KM institutions, explore the factors influencing KM treatment, and observe clinical outcomes according to KM pattern identification, providing evidence based on real-world data.\nCitation:\nJin H, Lee D-E, Cheong MJ, Jun H, Eom T, Jeon S, et al.  (2025) Korean medicine registry for cognitive disorder: A protocol for prospective observational multi-center study. PLoS One 20(5):\ne0323170.\nhttps://doi.org/10.1371/journal.pone.0323170\nEditor:\nIoannis Liampas, University of Thessaly Faculty of Medicine: Panepistemio Thessalias Tmema Iatrikes, GREECE\nReceived:\nJune 3, 2024;\nAccepted:\nMarch 31, 2025;\nPublished:\nMay 15, 2025\nCopyright:\n© 2025 Jin et al. This is an open access article distributed under the terms of the\nCreative Commons Attribution License\n, which permits unrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.\nData Availability:\nAs this paper is a protocol for a clinical study, no data have been collected so far, and therefore, there is no data to share. However, after completeion of the study, Once permission has been granted for the data to be used for public purposes, it will be accessible via the online database. (\nhttps://nikom.or.kr/nckm/index.do\n)\nFunding:\nThis research was also supported by a grant of the Korea Health Technology Project through the Korea Health Industry Development Institute, funded by the Ministry of Health and Welfare, Republic of Korea (grant no. RS-2023-KH138802) The funders had no role in the design of the study and will not be involved in the collection and analysis of data, decision to publish, or preparation of the manuscript.\nCompeting interests:\nThe authors have declared that no competing interests exist.\nAbbreviations::\nKM,\nKorean medicine; MCI,\nmild cognitive impairment; RCTs,\nrandomized controlled trials; VCID,\nvascular cognitive impairment and dementia", "doc_items_refs": ["#/texts/74", "#/texts/75", "#/texts/76", "#/texts/77", "#/texts/78", "#/texts/79", "#/texts/80", "#/texts/81", "#/texts/82", "#/texts/83", "#/texts/84", "#/texts/85", "#/texts/86", "#/texts/87", "#/texts/88", "#/texts/89", "#/texts/90", "#/texts/91", "#/texts/92", "#/texts/93", "#/texts/94", "#/texts/95", "#/texts/96", "#/texts/97", "#/texts/98", "#/texts/99", "#/texts/100", "#/texts/101", "#/texts/102", "#/texts/103", "#/texts/104"], "page_nos": [], "uuid": "fe90f6eb-5ff9-4f1e-a95c-181f09caf056"}
{"doc_id": "2025__Korean_medicine_registry_for_cognitive_disorder_A_protocol_for_prospective_obser__W4410395861", "source_path": "<redacted:source_path>", "chunk_id": 5, "source_chunk_idxs": [7], "num_tokens": 356, "text": "Korean medicine registry for cognitive disorder: A protocol for prospective observational multi-center study\nIntroduction\nGlobal aging has accelerated over the past few decades. In 2022, the global population aged 65 years and older will reach 770 million, tripling the 1980 figure of 258 million. The older adult population continues to grow steadily, with projections of 994 million people by 2030 and 1.6 billion by 2050 [\n1\n]. This demographic shift reflects a significant risk for cognitive impairment, resulting in a rapid increase in the number of patients with dementia and mild cognitive impairment (MCI) worldwide [\n2\n]. The global prevalence of dementia is estimated to be approximately 55 million, with projections indicating it will increase to 139 million by 2050. Moreover, while 80% of individuals have expressed concerns regarding dementia, 25% believe nothing can be done to prevent it [\n3\n], indicating substantial apprehension regarding dementia onset. Dementia represents a severe loss of cognitive function that impairs social or occupational functioning [\n4\n], whereas MCI is considered an intermediate stage between normal aging and dementia [\n5\n]. Alzheimer's disease accounts for 60-80% of dementia cases [\n2\n,\n6\n], followed by vascular dementia at 15-30% [\n7\n]. As dementia progresses, the need for caregiving and decision-making assistance increases, with patients ultimately requiring full-time care [\n8\n]. Consequently, dementia affects not only the individuals themselves but also their families and caregivers, imposing significant burdens on medical and care services and leading to substantial social costs. The global cost of dementia was estimated at $1 trillion in 2010 [\n9\n,\n10\n] and is projected to increase by approximately 85% by 2030, reflecting the largest economic burden of any single disease [\n3\n].", "doc_items_refs": ["#/texts/106", "#/texts/107", "#/texts/108", "#/texts/109", "#/texts/110", "#/texts/111", "#/texts/112", "#/texts/113", "#/texts/114", "#/texts/115", "#/texts/116", "#/texts/117", "#/texts/118", "#/texts/119", "#/texts/120", "#/texts/121", "#/texts/122", "#/texts/123", "#/texts/124", "#/texts/125", "#/texts/126", "#/texts/127", "#/texts/128", "#/texts/129", "#/texts/130"], "page_nos": [], "uuid": "289d61e6-9ab9-455f-8fd0-d76285bec28f"}
{"doc_id": "2025__Korean_medicine_registry_for_cognitive_disorder_A_protocol_for_prospective_obser__W4410395861", "source_path": "<redacted:source_path>", "chunk_id": 6, "source_chunk_idxs": [8], "num_tokens": 424, "text": "Korean medicine registry for cognitive disorder: A protocol for prospective observational multi-center study\nIntroduction\nDespite the high socio-economic burden of dementia and cognitive impairment, the development of related treatments has been slow. Vascular cognitive impairment and dementia (VCID) require treatment for cerebrovascular issues in conjunction with dementia; however, no drugs have been approved for the specific treatment of VCID [\n11\n]. Moreover, the two drugs most utilized in current treatments are cholinesterase inhibitors (e.g., donepezil hydrochloride, cabalatin, and galantamine) and excitatory amino acid receptor antagonists (memantine) [\n12\n]. However, these options are limited in scope. In addition, monoclonal antibodies (mAbs) have recently received accelerated approval from the United States Food and Drug Administration to initiate treatment in patients with early Alzheimer's disease with proven β-amyloid pathology (Aβ); however, long-term observation of brain volume loss and safety is required [\n13\n]. South Korea, which is in East Asia, is among the countries experiencing the most rapid aging worldwide. This demographic shift presents a significant healthcare challenge, as cognitive impairment prevention and management are becoming increasingly important. According to the Korean Statistical Information Service [\n14\n], in 2022, those aged 65 years and older accounted for over 18% of the total population, and this figure is projected to increase to 25.5% by 2030 and 43.8% by 2060. In contrast to the United Kingdom, which transitioned gradually from an aging society to a super-aged society over approximately 50 years, or the United States, which took approximately 15 years, Korea is expected to enter the super-aged society stage within a mere 7 years. Considering this accelerated aging, the National Institute of Dementia Annual Report 2022 [\n15\n] estimates that Korea has approximately 960,555 patients with dementia, with a prevalence of 7.3%. The projected cost of dementia management is expected to double every decade, reaching an estimated 78 trillion KRW by 2050.", "doc_items_refs": ["#/texts/131", "#/texts/132", "#/texts/133", "#/texts/134", "#/texts/135", "#/texts/136", "#/texts/137", "#/texts/138", "#/texts/139", "#/texts/140", "#/texts/141"], "page_nos": [], "uuid": "4c63e622-75aa-4eba-8778-c43442088281"}
{"doc_id": "2025__Korean_medicine_registry_for_cognitive_disorder_A_protocol_for_prospective_obser__W4410395861", "source_path": "<redacted:source_path>", "chunk_id": 7, "source_chunk_idxs": [9], "num_tokens": 474, "text": "Korean medicine registry for cognitive disorder: A protocol for prospective observational multi-center study\nIntroduction\nThe healthcare system in South Korea is structured on a dual framework, wherein traditional Korean medicine (KM) and Western medicine (WM) are officially recognized as equal. Consequently, patients have the option to select KM or WM, or a combination of both, for treatment based on their condition and symptoms. Furthermore, the National Health Insurance Service provides coverage for KM treatments, ensuring relatively high accessibility. In order to facilitate patient convenience and effective treatment, integrative medicine is often provided as a form of collaborative care [\n16\n]. A study utilizing data from the Health Insurance Review and Assessment Service found that 1.8% of all patients with dementia opted for KM treatment [\n17\n]. Furthermore, a survey conducted in 2022 on KM use revealed that 6.8% of hospital admissions to KM facilities were for dementia-related purposes [\n18\n]. However, in contrast to China, where diverse integrative management strategies for dementia and cognitive impairment are actively pursued [\n19\n], research on integrative treatment for cognitive impairment using traditional medicine is still in its nascent stages in Korea. KM has long addressed the characteristic symptoms of dementia under categories such as \"Chimae (癡呆)\" for dementia, \"Geonmang (健忘)\" for forgetfulness, and \"Heoro (虛勞)\" for exhaustion [\n20\n], and several previous studies have explored the effects of traditional medicine management on dementia and cognitive impairment [\n21\n,\n22\n]. Nevertheless, despite the chronic nature of diseases such as dementia, which necessitate prolonged tracking, most studies have encountered limitations owing to the relatively short duration of the studies themselves. Another limitation of the existing research is the lack of consideration of participants' baseline characteristics and the influence of traditional medicine patterns on treatment [\n23\n]. Consequently, the systematic collection of data to assess the status and efficacy of traditional medicine in treating cognitive impairment is increasingly necessary [\n24\n]. Furthermore, although randomized controlled trials (RCTs) are considered the gold standard in evidence-based research, the importance of real-world data and evidence has been increasingly emphasized [\n25\n]. Consequently, studies that accurately reflect the actual clinical setting environment of traditional medicine institutions and systematically accumulate and manage data over extended follow-up periods are urgently needed.", "doc_items_refs": ["#/texts/142", "#/texts/143", "#/texts/144", "#/texts/145", "#/texts/146", "#/texts/147", "#/texts/148", "#/texts/149", "#/texts/150", "#/texts/151", "#/texts/152", "#/texts/153", "#/texts/154", "#/texts/155", "#/texts/156", "#/texts/157", "#/texts/158", "#/texts/159", "#/texts/160", "#/texts/161", "#/texts/162"], "page_nos": [], "uuid": "ec600f5d-8301-4b82-8308-c0f6340e6378"}
{"doc_id": "2025__Korean_medicine_registry_for_cognitive_disorder_A_protocol_for_prospective_obser__W4410395861", "source_path": "<redacted:source_path>", "chunk_id": 8, "source_chunk_idxs": [10, 11, 12], "num_tokens": 382, "text": "Korean medicine registry for cognitive disorder: A protocol for prospective observational multi-center study\nIntroduction\nThis study is planned as a structured patient registry research project designed to collect, store, retrieve, analyze, and disseminate information on individuals diagnosed with specific diseases or experiencing health-related events [\n26\n]. Patients diagnosed with dementia or MCI who visit KM institutions will be enrolled in the study. Participants' baseline characteristics, cognitive impairment severity, traditional medicine patterns, factors influencing the choice of integrative medicine treatment, and other relevant data will be systematically collected and explored. The participants will be classified into three groups based on whether they are receiving KM treatment, WM treatment, or a combination of both. The factors influencing the prognosis of cognitive impairment with integrative medical treatment will be analyzed based on the characteristics, clinical outcomes, and safety profiles of each group.\n\nKorean medicine registry for cognitive disorder: A protocol for prospective observational multi-center study\nMaterials and methods\nThe protocol was registered on the clinical research registration website called the Clinical Research Information Service (CRIS). The registration number is KCT0009477. The URL is as follows:\nhttps://cris.nih.go.kr/cris/search/detailSearch.do?seq=27329&amp;search\\_page=L\n.\n\nKorean medicine registry for cognitive disorder: A protocol for prospective observational multi-center study\nMaterials and methods\nRegistry aims\n1. To gain a deeper understanding of the characteristics of patients with dementia and MCI.\n2. To evaluate the clinical outcomes and safety of KM and standard treatment for dementia and MCI.\n3. To investigate the factors that influence KM treatment of dementia and MCI.\n4. To establish a registry of patients with dementia and MCI to facilitate long-term follow-up of the therapeutic effects of integrative medicine.", "doc_items_refs": ["#/texts/163", "#/texts/164", "#/texts/165", "#/texts/167", "#/texts/168", "#/texts/169", "#/texts/171", "#/texts/172", "#/texts/173", "#/texts/174"], "page_nos": [], "uuid": "3272c62b-82f6-4101-946c-42fe5cd82d04"}
{"doc_id": "2025__Korean_medicine_registry_for_cognitive_disorder_A_protocol_for_prospective_obser__W4410395861", "source_path": "<redacted:source_path>", "chunk_id": 9, "source_chunk_idxs": [13], "num_tokens": 347, "text": "Korean medicine registry for cognitive disorder: A protocol for prospective observational multi-center study\nMaterials and methods\nDesign and setting\nThis is a prospective multi-center observational registry study of patients with dementia and MCI who visited academic hospitals that provide KM. Considering the number of patients with the respective diseases and accessibility over the past three years, three participating institutions were selected: Wonkwang University Korean Medicine Hospital, Wonkwang University Jangheung Integrated Medical Hospital, and Daejeon Korean Medicine Hospital of Daejeon University. A list of the participating institutions can be found in\nS2\nStudy Protocol v1.2. Participants enrolled in the registry will undergo annual follow-up visits to the hospital between the time of registration and December 31, 2029.\nFig 1\npresents a detailed schedule. The Short form Geriatric Depression Scale (S-GDpS-K), Global Deterioration Scale (GDS), Korean version of the Montreal Cognitive Assessment (MoCA-K), Korean-Mini Mental State Examination 2nd Edition: Standard Version (K-MMSE-2: SV) will be used to assess the primary outcome. Secondary outcome variables will be assessed using a sociodemographic survey, laboratory tests, a KM questionnaire, and measures of quality of life, patient health status, and caregiver burden. The study will not prescribe any predefined interventions; participants will receive treatment at their own or healthcare professionals' discretion.\nDownload:\n- PPT PowerPoint slide\n- PNG larger image\n- TIFF original image\nFig 1. SPIRIT schedule of enrolment and assessments.\nhttps://doi.org/10.1371/journal.pone.0323170.g001", "doc_items_refs": ["#/texts/176", "#/texts/177", "#/texts/178", "#/texts/179", "#/texts/180", "#/texts/181", "#/texts/182", "#/texts/183", "#/texts/184", "#/texts/185", "#/texts/186"], "page_nos": [], "uuid": "6fe920af-50b2-405b-ad4d-29539e099813"}
{"doc_id": "2025__Korean_medicine_registry_for_cognitive_disorder_A_protocol_for_prospective_obser__W4410395861", "source_path": "<redacted:source_path>", "chunk_id": 10, "source_chunk_idxs": [14, 15], "num_tokens": 372, "text": "Korean medicine registry for cognitive disorder: A protocol for prospective observational multi-center study\nMaterials and methods\nDesign and setting\nStudy population and recruitment.\nThe study population comprises patients diagnosed with dementia and MCI who visit each participating institution and meet the inclusion criteria. Each participating institution plans to promote the study by posting recruitment posters on hospital websites or offline bulletin boards. Upon patient visits, screening evaluations will be conducted to assess whether they meet the inclusion and exclusion criteria. Patients who agree to participate will be provided with detailed information about the study and all safety-related matters before they are asked to provide informed consent. Furthermore, because this study is a government-funded project of the National Development Institute of Korean Medicine (NIKOM), data may be anonymized and linked to secondary data sources, such as national health insurance claims data, for future use. Accordingly, separate consent will be obtained for granting access to third parties and use in secondary research. The electronic Case Report Form (e-CRF) is established by the NIKOM and the information is managed by the government. Such registries are being conducted simultaneously for other diseases, and the government wants to continue research and manage data. We will conduct an observational study for 7 years with funding and then continue to receive funding to build the registry and conduct related research.\n\nKorean medicine registry for cognitive disorder: A protocol for prospective observational multi-center study\nMaterials and methods\nDesign and setting\nInclusion criteria.\n1. Adults aged 55-85 years.\n2. Individuals diagnosed with a major neurocognitive disorder caused by Alzheimer disease or vascular disease, or a mild neurocognitive disorder based on the criteria described in the\nDiagnostic and Statistical Manual of Mental Disorders, 5th Edition\n(DSM-5).\n3. Individuals who voluntarily agree to participate or whose legal representatives have provided signed informed consent.", "doc_items_refs": ["#/texts/188", "#/texts/190", "#/texts/191", "#/texts/192"], "page_nos": [], "uuid": "81b9f987-97fa-40bc-accc-378c5f7ea471"}
{"doc_id": "2025__Korean_medicine_registry_for_cognitive_disorder_A_protocol_for_prospective_obser__W4410395861", "source_path": "<redacted:source_path>", "chunk_id": 11, "source_chunk_idxs": [16], "num_tokens": 285, "text": "Korean medicine registry for cognitive disorder: A protocol for prospective observational multi-center study\nMaterials and methods\nDesign and setting\nExclusion criteria.\n1. Patients with dementia caused by conditions other than Alzheimer disease or vascular dementia (e.g., degenerative brain diseases such as Parkinson disease, Huntington disease, frontotemporal disorder, and Creutzfeldt-Jakob disease).\n2. Individuals with systemic conditions that may cause dementia (e.g., hypothyroidism, vitamin B12 or folic acid deficiency, niacin deficiency, hyperkalemia, neurosyphilis, and human immunodeficiency virus disease).\n3. Individuals with a history of being diagnosed with a psychotic disorder or substance-related disorder based on DSM-5 criteria (e.g., schizophrenia, delusional disorder, bipolar disorder, and alcohol or substance abuse disorder).\n4. Individuals with a history of neurological disorders such as epilepsy, focal brain injury, and head trauma.\n5. Individuals with gastrointestinal, endocrine, or cardiovascular diseases that cannot be controlled through dietary or drug therapy.\n6. Individuals in a serious unstable medical condition (as determined by a physician based on laboratory tests, electrocardiogram results, chest X-rays, and vital signs).\n7. Others whom the investigator deems ineligible to participate in the study.", "doc_items_refs": ["#/texts/194", "#/texts/195", "#/texts/196", "#/texts/197", "#/texts/198", "#/texts/199", "#/texts/200"], "page_nos": [], "uuid": "896f1015-5d6d-4cdd-9d5b-0c793cb2223f"}
{"doc_id": "2025__Korean_medicine_registry_for_cognitive_disorder_A_protocol_for_prospective_obser__W4410395861", "source_path": "<redacted:source_path>", "chunk_id": 12, "source_chunk_idxs": [17], "num_tokens": 314, "text": "Korean medicine registry for cognitive disorder: A protocol for prospective observational multi-center study\nMaterials and methods\nDesign and setting\nSample size.\nThe sample size was calculated as follows: Through discussions among the research team, we pre-selected 15 covariates that are expected to affect changes in MOCA-K, an important continuous variable for evaluating treatment progress. The 15 covariates are as follows: gender, age, smoking, alcohol consumption, weight, height, cognitive impairment severity, region of residence, duration of illness, income, education level, occupation, marital status, medication use, and family history. We aimed to conduct a multiple linear regression analysis to identify which covariates influence changes in MOCA-K for patients receiving Korean medicine treatment. It is generally known that multiple linear regression analysis requires approximately 20 samples for each independent variable, so the total sample size was estimated to be around 300. As this study is intended as an epidemiological investigation inherent to the nature of the registry, no predefined statistical hypotheses have been formulated. As new research questions emerge over time, additional statistical analysis plans will be devised. Consequently, each participating institution has estimated the number of eligible patients who could reasonably be registered to calculate the final sample size. The average number of patients with dementia and MCI across the three institutions is 121 per year. With an estimated registration rate of approximately 50%, the objective is to enroll 60 new participants annually, with the goal of obtaining a total of 300 new registrations in total over five years.", "doc_items_refs": ["#/texts/202"], "page_nos": [], "uuid": "6395cf33-e2e5-4f0b-93c5-5d73e100e7a7"}
{"doc_id": "2025__Korean_medicine_registry_for_cognitive_disorder_A_protocol_for_prospective_obser__W4410395861", "source_path": "<redacted:source_path>", "chunk_id": 13, "source_chunk_idxs": [18], "num_tokens": 377, "text": "Korean medicine registry for cognitive disorder: A protocol for prospective observational multi-center study\nMaterials and methods\nData management\nData analysis.\nThe analysis plan for the research questions that arise over time is as follows. Descriptive analyses will be employed to demonstrate the baseline data and disease-related variables. Nominal variables will be presented as frequencies and ratios, whereas continuous variables will be presented as means and standard deviations. Baseline data will be subjected to statistical analysis to identify associations between the data and several variables, including treatment characteristics, treatment effects, factors influencing KM treatment, health outcome variables, and prognosis. Changes in continuous variables in all patients or specific subgroups will be tested using either paired t-tests or Wilcoxon signed-rank tests, depending on the normality test results. Changes in the nominal variables will be tested using McNemar's test. Correlations between continuous variables will be analyzed using Pearson (or Spearman) correlation analysis. Differences in continuous variables between subgroups will be analyzed using independent t-tests (or Wilcoxon rank-sum tests, depending on the normality test results). Differences in nominal variables will be analyzed using chi-squared tests (or Fisher's exact test, depending on the normality test results). Multiple regression analysis will be used to test the effects of the covariates on a particular continuous dependent variable, and multinomial logistic regression analysis will be used to test the effects of the covariates on the occurrence of binominal indicators. Survival analysis will be performed to test the effects of the covariates on the occurrence of a particular binomial variable over time. The proportion of missing data that can be included in the analysis is limited to 10%. The missing data will be imputed using one of several strategies, including unconditional or conditional mean imputation and expectation maximization.", "doc_items_refs": ["#/texts/205"], "page_nos": [], "uuid": "0beee882-0333-433c-953c-1edea730005c"}
{"doc_id": "2025__Korean_medicine_registry_for_cognitive_disorder_A_protocol_for_prospective_obser__W4410395861", "source_path": "<redacted:source_path>", "chunk_id": 14, "source_chunk_idxs": [19, 20], "num_tokens": 426, "text": "Korean medicine registry for cognitive disorder: A protocol for prospective observational multi-center study\nMaterials and methods\nData management\nData collection.\nThis study is a pure research project with no feedback to participating hospitals and aims to collect basic patient sociodemographic characteristics, survey information, and clinical practice data. All documents pertaining to registry participants will be recorded using identification codes rather than names and stored on computers as encrypted files with access restricted to approved researchers only. Trained trial staff and research coordinators will be responsible for collecting baseline and follow-up data. All data will be stored in an e-CRF using an electronic data capture system called MyTrial, which is managed by the Korea Institute of Oriental Medicine. The online database permits information to be modified and updated as required and real-time exportation for the purposes of quality management and statistical analysis purposes. Once permission has been granted for the data to be used for public purposes, it will be accessible via the online database.\n\nKorean medicine registry for cognitive disorder: A protocol for prospective observational multi-center study\nMaterials and methods\nData management\nData quality control and queue maintenance.\nData completeness and reliability will be evaluated by independent monitoring personnel separate from the researchers and sponsors. The monitoring personnel will be responsible for ensuring compliance with the observational study protocol, endorsing modifications of the registry protocol, appropriate and accurate data collection, and confirmation of participants' informed consent. If data completeness and reliability are compromised, face-to-face or telephone interviews will be conducted with the participants to facilitate the necessary corrections. Furthermore, a random sample of less than 10% from each institution will be selected up to five times during the study period for comparison between the data entered in the e-CRF and the paper case report forms maintained at each institution. If the input errors exceed a predetermined acceptable level, the institution will compare all case records and input data. To minimize dropout rates, materials related to health and cognitive disorders, including lifestyle information, will be distributed at least once per year. Additionally, the study coordinator will contact the participants to monitor their health management status.", "doc_items_refs": ["#/texts/207", "#/texts/209"], "page_nos": [], "uuid": "2b3a0f83-fa28-43d2-834a-2aafe98debc4"}
{"doc_id": "2025__Korean_medicine_registry_for_cognitive_disorder_A_protocol_for_prospective_obser__W4410395861", "source_path": "<redacted:source_path>", "chunk_id": 15, "source_chunk_idxs": [21, 22, 23, 24], "num_tokens": 464, "text": "Korean medicine registry for cognitive disorder: A protocol for prospective observational multi-center study\nMaterials and methods\nMeasures\nCollect sociodemographic characteristics, lab and medical device tests, long-term care information, and various questionnaires from participants. Trained trial staff and research coordinators will be responsible for collecting sociodemographic characteristics, lab and medical device tests, long-term care information. Among various questionnaires, Pattern Identification Tool for Cognitive Disorder (PIC-C), Mini-Mental State Examination (MMSE), Montreal Cognitive Assessment (MoCA), GDS, Geriatric Quality of Life-Dementia (GQOL) are assessed by trained medical staff. In addition, the Barthel Index, Seoul-Instrumental Activities of Daily Living (S-IADL), Brief Questionnaire form of Neuropsychiatric Inventory (NPI-Q), and Caregiver Burden Inventory (CBI) will be assessed by the caregiver. And the S-GDpS-K, Core Seven-Emotions Inventory Short Form (CSEI-s), Korean Medical Pathologic Aging Scale, EuroQol 5 Dimensions 5 Levels and EuroQol Visual Analog Scale (EQ-5D and EQ-VAS) will be assessed by the participant with the help of the caregiver.\nFig 1\npresents a detailed schedule.\n\nKorean medicine registry for cognitive disorder: A protocol for prospective observational multi-center study\nMaterials and methods\nMeasures\nSociodemographic characteristics.\nInformation on the sociodemographic characteristics and medical history of the participants and their caregivers will be collected.\n\nKorean medicine registry for cognitive disorder: A protocol for prospective observational multi-center study\nMaterials and methods\nMeasures\nLaboratory tests and medical device inspections.\nData will be collected from participants regarding hematology tests, blood chemistry tests, urinalysis, Vital signs, and medical device inspections (electrocardiogram, chest X-ray, heart rate variability, quantitative electroencephalograph, and functional near-infrared spectroscopy)\n\nKorean medicine registry for cognitive disorder: A protocol for prospective observational multi-center study\nMaterials and methods\nMeasures\nLong-term care.\nInformation will be collected on participants' long-term care insurance grade, nursing home admission, and long-term care services currently in use.", "doc_items_refs": ["#/texts/211", "#/texts/212", "#/texts/213", "#/texts/215", "#/texts/217", "#/texts/219"], "page_nos": [], "uuid": "7bd3057c-fa86-4bf5-95ba-59b5c130c372"}
{"doc_id": "2025__Korean_medicine_registry_for_cognitive_disorder_A_protocol_for_prospective_obser__W4410395861", "source_path": "<redacted:source_path>", "chunk_id": 16, "source_chunk_idxs": [25], "num_tokens": 506, "text": "Korean medicine registry for cognitive disorder: A protocol for prospective observational multi-center study\nMaterials and methods\nMeasures\nQuestionnaires.\nPattern identification tool for cognitive disorder:\nThe PIC-C [\n20\n,\n27\n] comprises 22 items across 10 categories and classifies cognitive impairment into four patterns: Qi Deficiency, Yin Deficiency, Dampness, and Heat Syndrome. In addition to determining the primary pattern, it quantitatively assesses the tendencies of other patterns. Consequently, it can be utilized for evaluating the selection of primary prescriptions for herbal medicine and acupuncture treatment, adjusting herbal dosages, selecting adjunctive acupuncture treatments, and assessing treatment progress.\nBarthel index:\nVarious versions of the Barthel Index are available. Originally, the total score ranged from 0 to 100 points; however, this study used the version revised by Collin et al. [\n28\n], which was translated into Korean as the Korean version of Barthel Activities of Daily Living Index (K-BADL) [\n29\n]]. The K-BADL assesses the ability to perform basic activities of daily living. The scale is based on a total score of 20 points, with 11-15 points indicating moderate disability and ≤ 10 points indicating severe disability.\nSeoul-instrumental activities of daily living:\nThe S-IADL [\n30\n] was developed and standardized using items suitable for Korea's cultural characteristics. It comprises 15 items rated on a scale of 0-3 points, with a total score ranging from 0 to 45 points. Higher scores indicate greater disability in daily life. This tool evaluates instrumental activities of daily living by dividing them into current and potential abilities. It has been demonstrated that a cut-off score of 7.5 can be used to differentiate between normal individuals and those with dementia. An S-IADL score of 8 points or above indicates the likely presence of dementia.\nBrief questionnaire form of neuropsychiatric inventory:\nThe NPI-Q [\n31\n] is a streamlined version of the original NPI [\n32\n] designed for straightforward use in clinical settings. The instrument evaluates the severity of 12 common neuropsychiatric symptoms observed in patients with dementia and their caregivers. It assesses both the severity of neuropsychiatric symptoms (rated 1-3) and caregiver distress caused by these symptoms (rated 0-5). Higher scores indicate greater severity. The Korean version of the NIP-Q (KNPI-Q) [\n33\n] will be used in this study.", "doc_items_refs": ["#/texts/221", "#/texts/222", "#/texts/223", "#/texts/224", "#/texts/225", "#/texts/226", "#/texts/227", "#/texts/228", "#/texts/229", "#/texts/230", "#/texts/231", "#/texts/232", "#/texts/233", "#/texts/234", "#/texts/235", "#/texts/236", "#/texts/237", "#/texts/238", "#/texts/239", "#/texts/240", "#/texts/241", "#/texts/242", "#/texts/243", "#/texts/244"], "page_nos": [], "uuid": "8dde8b83-c360-414c-9a91-73fa47356826"}
{"doc_id": "2025__Korean_medicine_registry_for_cognitive_disorder_A_protocol_for_prospective_obser__W4410395861", "source_path": "<redacted:source_path>", "chunk_id": 17, "source_chunk_idxs": [26], "num_tokens": 456, "text": "Korean medicine registry for cognitive disorder: A protocol for prospective observational multi-center study\nMaterials and methods\nMeasures\nQuestionnaires.\nMini-mental state examination 2nd edition: Standard version:\nThe MMSE [\n34\n] is the most widely used test for screening cognitive impairment in older adult populations. To provide greater sensitivity and adaptability to each country's culture, the MMSE-2 was developed, which consists of three versions: Brief Version (BV), Standard Version (SV), and Expanded Version (EV). As with the original MMSE, the K-MMSE-2:SV has a total score of 30 points. It assesses orientation to time (5 points), orientation to place (5 points), registration (3 points), attention and calculation (5 points), recall (3 points), language (8 points), and drawing (1 point). A total score of 23 points is typically considered the cutoff point for cognitive impairment.\nMontreal cognitive assessment:\nThe MoCA [\n35\n], which has been translated into Korean [\n36\n], will be used. The MoCA-K is a questionnaire developed to screen for MCI in individuals with normal findings on the MMSE test. Total scores equal 30 points, and a score of 23 or higher is considered normal.\nGlobal deterioration scale:\nThe Korean version of the GDS will be used in this study [\n37\n,\n38\n]. The GDS is generally used to quantify the extent of dementia progression. GDS 1 indicates a clinically normal individual without cognitive impairment, GDS 2 indicates subjective memory impairment, and GDS 3 indicates MCI and some with mild dementia. From GDS 4 onwards, a definitive diagnosis of dementia can be made, with GDS 4 representing mild dementia, GDS 5 representing moderate dementia, and GDS 6 and 7 representing severe dementia.\nShort form geriatric depression scale:\nThis study will use the Korean version of the S-GDpS-K [\n39\n], which has been developed by shortening the original 30-item GDpS [\n40\n] to 15 items. This self-report questionnaire allows for simple \"yes\" or \"no\" responses. A score of 8 or higher indicates a depressive state.", "doc_items_refs": ["#/texts/245", "#/texts/246", "#/texts/247", "#/texts/248", "#/texts/249", "#/texts/250", "#/texts/251", "#/texts/252", "#/texts/253", "#/texts/254", "#/texts/255", "#/texts/256", "#/texts/257", "#/texts/258", "#/texts/259", "#/texts/260", "#/texts/261", "#/texts/262", "#/texts/263", "#/texts/264", "#/texts/265", "#/texts/266"], "page_nos": [], "uuid": "8dc40dae-c8b0-4ab4-9f50-af501522f0cc"}
{"doc_id": "2025__Korean_medicine_registry_for_cognitive_disorder_A_protocol_for_prospective_obser__W4410395861", "source_path": "<redacted:source_path>", "chunk_id": 18, "source_chunk_idxs": [27], "num_tokens": 458, "text": "Korean medicine registry for cognitive disorder: A protocol for prospective observational multi-center study\nMaterials and methods\nMeasures\nQuestionnaires.\nCore seven-emotions inventory short form:\nThe CSEI-s [\n41\n] consists of 28 items across 7 categories, with each item measured on a 5-point Likert scale. This scale uses t-scores (mean 50, standard deviation, 10) as reference points. For emotions other than happiness, including anger, thoughtfulness, sadness, fear, anxiety, and surprise, higher scores indicate a higher risk level. Regarding the specific cutoff points: t-scores ranging from 55 to 60 are considered cautionary, scores from 61 to 65 are considered risky, and scores above 66 are classified as high risk. In contrast, for happiness, lower scores indicate a higher likelihood, with t-scores ranging from 40 to 45 considered slightly likely, 35-39 considered likely, and scores below 34 classified as highly likely.\nKorean medical pathologic aging scale:\nThe Korean Medical Pathologic Aging Scale [\n20\n] comprises 9 items related to the sensory and physical symptoms of aging. Each item is measured on a 3-point Likert scale, with 0 points indicating \"none,\" 1 point indicating \"sometimes present,\" and 2 points indicating \"frequently present.\" Lower scores signify a better health status in relation to aging.\nEuroQol 5 dimensions 5 levels and EuroQol visual analog scale:\nThe EQ-5D [\n42\n,\n43\n] assesses health-related quality of life and comprises five dimensions: mobility, self-care, usual activities, pain/discomfort, and anxiety/depression. Each dimension is evaluated on a five-point scale, with 1 indicating the best state and 5 indicating the worst state. The EQ-VAS is a visual analog scale comprising a vertical line of 100 mm. The EQ-VAS represents the respondent's self-rated health status on a scale of 0-100, on which 100 represents the best imaginable health state and 0 represents the worst imaginable health state. In general, rating scales are recommended as supplementary tools to other instruments. The EQ-VAS was also included as a supplementary component to the standard EQ-5D questionnaire.", "doc_items_refs": ["#/texts/267", "#/texts/268", "#/texts/269", "#/texts/270", "#/texts/271", "#/texts/272", "#/texts/273", "#/texts/274", "#/texts/275", "#/texts/276", "#/texts/277", "#/texts/278", "#/texts/279", "#/texts/280"], "page_nos": [], "uuid": "e2c2621e-9e0d-4b80-8998-6b552e1998d8"}
{"doc_id": "2025__Korean_medicine_registry_for_cognitive_disorder_A_protocol_for_prospective_obser__W4410395861", "source_path": "<redacted:source_path>", "chunk_id": 19, "source_chunk_idxs": [28, 29], "num_tokens": 360, "text": "Korean medicine registry for cognitive disorder: A protocol for prospective observational multi-center study\nMaterials and methods\nMeasures\nQuestionnaires.\nGeriatric quality of life-dementia:\nThe GQOL scale [\n44\n] is used to assess the comprehensive quality of life of older adults and patients with dementia. Subsequently, the Geriatric Quality of Life-Dementia scale (GQOL-D) [\n45\n] was developed to reflect the quality-of-life domains of particular importance to patients with dementia. The GQOL-D comprises 13 items that assess various quality-of-life domains, including physical health, psychological health, independence level, social relations, environment, and religion. It also includes one item for overall health and another item for overall life satisfaction. Each item is measured on a 4-point Likert scale.\nCaregiver burden inventory:\nThe CBI [\n46\n] assesses the burden experienced by caregivers of patients with dementia. The scale has 24 items in total, divided into five domains: time-dependent burden, developmental burden, physical burden, social burden, and emotional burden. One advantage of the CBI is that it allows for the simultaneous measurement of both objective and subjective burden.\n\nKorean medicine registry for cognitive disorder: A protocol for prospective observational multi-center study\nMaterials and methods\nMeasures\nAdverse events.\nThis registry study is designed without any interventions included and has a low expectation of risks or adverse events (AEs). All medical histories collected during the follow-up visits after the initial visit will be documented as medical histories, and only recorded as serious AEs if the participant dies. Additionally, cumulative mortality cases from all participating institutions will be reported collectively during periodic reviews. Clinical research indemnity insurance has been obtained to mitigate potential harm from trial participation.", "doc_items_refs": ["#/texts/281", "#/texts/282", "#/texts/283", "#/texts/284", "#/texts/285", "#/texts/286", "#/texts/287", "#/texts/288", "#/texts/289", "#/texts/290", "#/texts/292"], "page_nos": [], "uuid": "9124bdc4-88e5-465b-8b84-19f7bf1d8082"}
{"doc_id": "2025__Korean_medicine_registry_for_cognitive_disorder_A_protocol_for_prospective_obser__W4410395861", "source_path": "<redacted:source_path>", "chunk_id": 20, "source_chunk_idxs": [30], "num_tokens": 434, "text": "Korean medicine registry for cognitive disorder: A protocol for prospective observational multi-center study\nMaterials and methods\nEthical considerations\nThis study was approved by the Institutional Review Board of Wonkwang University Korean Medicine Hospital (February 16, 2024; IRB 2023-14), Institutional Review Board of Wonkwang University Jangheung Integrative Medical Hospital (March 14, 2024; WKUJIM-202403-003), and Institutional Review Board of Daejeon Korean Medicine Hospital of Daejeon University (February 29, 2024; DJDSKH-23-BM-14).\nBefore obtaining consent from prospective participants, the researcher will thoroughly explain the research protocol and consent form, both of which have received Institutional Review Board approval. Written informed consent will be obtained in accordance with ethical principles based on the Declaration of Helsinki. Once written consent has been obtained from participants, they will be provided with a copy of the consent form. To ensure the participants' confidentiality, they will each be assigned a unique identification number. Records pertinent to the study will be retained for three years following the conclusion of the study, after which they will be destroyed in accordance with the provisions of the Bioethics and Safety Act. However, the retention period can be extended if deemed necessary by the sponsor. Information pertaining to research conducted to provide data to third parties for secondary research utilization will be retained, managed, and provided for disposal upon request or for up to 10 years following the completion of the primary study. Individuals diagnosed with major neurocognitive disorders are classified as vulnerable, and both the participant and their legal representative must provide consent. Those diagnosed with MCI are deemed capable of providing their own consent. Should the researcher identify a change in the participant's medical condition subsequent to the initial provision of consent, and should the participant be deemed vulnerable, additional consent will be obtained from both the participant and their legal representative. The researcher will assess the legal representative's capacity to consent through outpatient visits. If the representative's consent capacity is impaired, the participant will not be registered or consent will be obtained from another legal representative.", "doc_items_refs": ["#/texts/294", "#/texts/295"], "page_nos": [], "uuid": "872485d6-3a11-4728-ac6c-0cf12997d325"}
{"doc_id": "2025__Korean_medicine_registry_for_cognitive_disorder_A_protocol_for_prospective_obser__W4410395861", "source_path": "<redacted:source_path>", "chunk_id": 21, "source_chunk_idxs": [31, 32], "num_tokens": 384, "text": "Korean medicine registry for cognitive disorder: A protocol for prospective observational multi-center study\nMaterials and methods\nStatus and timeline of the registry\nParticipant enrolment for the registry will begin in August 26, 2024\n\nKorean medicine registry for cognitive disorder: A protocol for prospective observational multi-center study\nDiscussion\nThis registry study will conduct long-term observation of patients with dementia and MCI who attend university-affiliated KM hospitals. In addition, the registry established in this study will be used for long-term epidemiological research by linking it with health insurance and retrospective hospital data.\nAlthough RCTs have been published on the effectiveness and safety of East Asian traditional medicine for dementia [\n47\n,\n48\n], recent studies have emphasized the need for real-world data and evidence [\n25\n]. The objective of this study is to expand the current evidence base by systematically collecting real-world data in conjunction with existing RCT results. While retrospective cohort studies using health insurance data offer advantages, such as large sample sizes and long follow-up periods [\n49\n,\n50\n], they also have limitations, including the data not being collected specifically for research purposes and other limitations inherent in the data itself [\n51\n]]. This study aims to overcome the limitations of extant research by prospectively collecting multiple outcome variables and combining them with retrospective data to provide new insights. This study represents the inaugural registry for dementia and MCI in the field of KM and is the first longitudinal study to apply Korean medical questionnaires such as the PIT-C, CSEI-s, and the Korean Medical Pathologic Aging Scale. This study will explore the factors that influence KM treatment to provide a clearer understanding of the characteristics of patients with dementia and MCI who visit KM institutions. Furthermore, through long-term observation of patients based on the identification of their KM patterns, evidence will be accumulated for the development of personalized treatments for dementia and MCI.", "doc_items_refs": ["#/texts/297", "#/texts/299", "#/texts/300", "#/texts/301", "#/texts/302", "#/texts/303", "#/texts/304", "#/texts/305", "#/texts/306", "#/texts/307", "#/texts/308", "#/texts/309", "#/texts/310", "#/texts/311", "#/texts/312"], "page_nos": [], "uuid": "d9037ee0-5e6d-49f1-a1b5-19809b6b5d11"}
{"doc_id": "2025__Korean_medicine_registry_for_cognitive_disorder_A_protocol_for_prospective_obser__W4410395861", "source_path": "<redacted:source_path>", "chunk_id": 22, "source_chunk_idxs": [33, 34, 35, 36, 37], "num_tokens": 487, "text": "Korean medicine registry for cognitive disorder: A protocol for prospective observational multi-center study\nDiscussion\nLimitations\nThe study has a relatively short follow-up period of up to 5 years, and as a registry study, it lacks random allocation, which may introduce various confounding factors [\n52\n,\n53\n]. Since there was no predetermined intervention, clinical interventions may vary depending on the clinician. The study will be conducted at three university-affiliated hospitals, selected to represent the diversity of healthcare systems in Korea. The hospitals are located in a 1.5 million metropolitan area, a 250,000 urban area, and a 40,000 rural area. However, the limited number of participating hospitals and the study's regional scope may limit its representativeness. Finally, this study will be conducted in university-affiliated KM hospitals and may not be representative of primary care institutions.\n\nKorean medicine registry for cognitive disorder: A protocol for prospective observational multi-center study\nDiscussion\nDissemination\nThe findings of this research will be presented in settings such as academic conferences and international seminars, as well as published in peer-reviewed journals. Furthermore, the findings will be used in developing clinical practice guidelines for treating cognitive impairment. Additionally, the findings of this research will be reported annually, and a dedicated website will be created to provide further information.\n\nKorean medicine registry for cognitive disorder: A protocol for prospective observational multi-center study\nSupporting information\nS1 File. SPIRIT 2013 checklist: Recommended items to address in a clinical trial protocol and related documents.\nhttps://doi.org/10.1371/journal.pone.0323170.s001\n(DOCX)\n\nKorean medicine registry for cognitive disorder: A protocol for prospective observational multi-center study\nSupporting information\nS2 File. Study protocol for IRB v1.2_English (Effective Date: 2024. 01. 22).\nhttps://doi.org/10.1371/journal.pone.0323170.s002\n(DOCX)\n\nKorean medicine registry for cognitive disorder: A protocol for prospective observational multi-center study\nSupporting information\nS3 File. Study protocol for IRB v1.2_Korean (Effective Date: 2024. 01. 22).\nhttps://doi.org/10.1371/journal.pone.0323170.s003\n(DOCX)", "doc_items_refs": ["#/texts/314", "#/texts/315", "#/texts/316", "#/texts/317", "#/texts/318", "#/texts/320", "#/texts/323", "#/texts/324", "#/texts/326", "#/texts/327", "#/texts/329", "#/texts/330"], "page_nos": [], "uuid": "0d6df078-1baf-49c6-8daa-2c610fa80828"}
{"doc_id": "2025__Korean_medicine_registry_for_cognitive_disorder_A_protocol_for_prospective_obser__W4410395861", "source_path": "<redacted:source_path>", "chunk_id": 23, "source_chunk_idxs": [38], "num_tokens": 494, "text": "Korean medicine registry for cognitive disorder: A protocol for prospective observational multi-center study\nReferences\n1. 1. World Population Prospects 2022 - Population Division - United Nations [Internet]. [cited 2023 Nov 15. ]. Available from:\nhttps://population.un.org/wpp/\n2. View Article\n3. Google Scholar\n4. 2. 2021 Alzheimer's disease facts and figures. Alzheimers Dement. 2021;17(3):327-406. pmid:33756057\n5. View Article\n6. PubMed/NCBI\n7. Google Scholar\n8. 3. International AD. World Alzheimer report 2023: reducing dementia risk: never too early, never too late; 2023 [cited 2023 Nov 15. ]; Available from:\nhttps://www.alzint.org/resource/world-alzheimer-report-2023/\n9. View Article\n10. Google Scholar\n11. 4. Arvanitakis Z, Shah RC, Bennett DA. Diagnosis and management of dementia: review. JAMA. 2019;322(16):1589-99. pmid:31638686\n12. View Article\n13. PubMed/NCBI\n14. Google Scholar\n15. 5. Albert MS, DeKosky ST, Dickson D, Dubois B, Feldman HH, Fox NC, et al. The diagnosis of mild cognitive impairment due to Alzheimer's disease: recommendations from the National Institute on Aging-Alzheimer's Association workgroups on diagnostic guidelines for Alzheimer's disease. Alzheimers Dement. 2011;7(3):270-9. pmid:21514249\n16. View Article\n17. PubMed/NCBI\n18. Google Scholar\n19. 6. Rajan KB, Weuve J, Barnes LL, McAninch EA, Wilson RS, Evans DA. Population estimate of people with clinical Alzheimer's disease and mild cognitive impairment in the United States (2020-2060). Alzheimers Dement. 2021;17(12):1966-75.\n20. View Article\n21. Google Scholar\n22. 7. Wolters FJ, Ikram MA. Epidemiology of vascular dementia. Arterioscler Thromb Vasc Biol. 2019;39(8):1542-9. pmid:31294622\n23. View Article\n24. PubMed/NCBI\n25. Google Scholar", "doc_items_refs": ["#/texts/332", "#/texts/333", "#/texts/334", "#/texts/335", "#/texts/336", "#/texts/337", "#/texts/338", "#/texts/339", "#/texts/340", "#/texts/341", "#/texts/342", "#/texts/343", "#/texts/344", "#/texts/345", "#/texts/346", "#/texts/347", "#/texts/348", "#/texts/349", "#/texts/350", "#/texts/351", "#/texts/352", "#/texts/353", "#/texts/354", "#/texts/355", "#/texts/356"], "page_nos": [], "uuid": "7e85d937-a9f1-49e2-a872-7052d8d70293"}
{"doc_id": "2025__Korean_medicine_registry_for_cognitive_disorder_A_protocol_for_prospective_obser__W4410395861", "source_path": "<redacted:source_path>", "chunk_id": 24, "source_chunk_idxs": [39], "num_tokens": 508, "text": "Korean medicine registry for cognitive disorder: A protocol for prospective observational multi-center study\nReferences\n26. 8. Manly JJ, Jones RN, Langa KM, Ryan LH, Levine DA, McCammon R, et al. Estimating the prevalence of dementia and mild cognitive impairment in the US: the 2016 health and retirement study harmonized cognitive assessment protocol project. JAMA Neurol. 2022;79(12):1242-9.\n27. View Article\n28. Google Scholar\n29. 9. Gustavsson A, Brinck P, Bergvall N, Kolasa K, Wimo A, Winblad B, et al. Predictors of costs of care in Alzheimer's disease: a multinational sample of 1222 patients. Alzheimers Dement. 2011;7(3):318-27. pmid:21575872\n30. View Article\n31. PubMed/NCBI\n32. Google Scholar\n33. 10. Wimo A, Guerchet M, Ali G-C, Wu Y-T, Prina AM, Winblad B, et al. The worldwide costs of dementia 2015 and comparisons with 2010. Alzheimers Dement. 2017;13(1):1-7. pmid:27583652\n34. View Article\n35. PubMed/NCBI\n36. Google Scholar\n37. 11. Sun M-K. Potential therapeutics for vascular cognitive impairment and dementia. Curr Neuropharmacol. 2018;16(7):1036-44. pmid:29046153\n38. View Article\n39. PubMed/NCBI\n40. Google Scholar\n41. 12. O'Brien JT, Holmes C, Jones M, Jones R, Livingston G, McKeith I, et al. Clinical practice with anti-dementia drugs: a revised (third) consensus statement from the British Association for Psychopharmacology. J Psychopharmacol. 2017;31(2):147-68. pmid:28103749\n42. View Article\n43. PubMed/NCBI\n44. Google Scholar\n45. 13. Cummings J, Osse AML, Cammann D, Powell J, Chen J. Anti-amyloid monoclonal antibodies for the treatment of Alzheimer's disease. BioDrugs. 2024;38(1):5-22. pmid:37955845\n46. View Article\n47. PubMed/NCBI\n48. Google Scholar", "doc_items_refs": ["#/texts/357", "#/texts/358", "#/texts/359", "#/texts/360", "#/texts/361", "#/texts/362", "#/texts/363", "#/texts/364", "#/texts/365", "#/texts/366", "#/texts/367", "#/texts/368", "#/texts/369", "#/texts/370", "#/texts/371", "#/texts/372", "#/texts/373", "#/texts/374", "#/texts/375", "#/texts/376", "#/texts/377", "#/texts/378", "#/texts/379"], "page_nos": [], "uuid": "0b9df6ca-abb4-4df5-bea7-69c6efe9f80c"}
{"doc_id": "2025__Korean_medicine_registry_for_cognitive_disorder_A_protocol_for_prospective_obser__W4410395861", "source_path": "<redacted:source_path>", "chunk_id": 25, "source_chunk_idxs": [40], "num_tokens": 430, "text": "Korean medicine registry for cognitive disorder: A protocol for prospective observational multi-center study\nReferences\n49. 14. Korean Statistical Information Service. Percentage of the elderly population [Internet]. [cited 2023 Nov 21. ]. Available from:\nhttps://kosis.kr/statHtml/statHtml.do?orgId=101&amp;tblId=DT\\_1YL20631&amp;vw\\_cd=MT\\_GTITLE01&amp;list\\_id=101&amp;scrId=&amp;seqNo=&amp;lang\\_mode=ko&amp;obj\\_var\\_id=&amp;itm\\_id=&amp;conn\\_path=MT\\_GTITLE01&amp;path=%252FstatisticsList%252FstatisticsListIndex.do\n50. View Article\n51. Google Scholar\n52. 15. National Institute of Dementia. National institute of dementia annual report 2022 [Internet]. [cited 2023 Nov 21. ]. Available from:\nhttps://www.nid.or.kr/info/dataroom\\_view.aspx?bid=261\n53. View Article\n54. Google Scholar\n55. 16. Leem J, Kim K-I, Seo JH, Cheong MJ, Youn I. Perception, attitude, and demand for Korean medicine and Western medicine collaborative treatment of medical occupational groups in Korea: a scoping review. Integr Med Res. 2021;10(1):100430. pmid:32923363\n56. View Article\n57. PubMed/NCBI\n58. Google Scholar\n59. 17. Lee JB, Kang HW, Kim J, Kim G, Namkwen K. A study on medical expenses of modern and Korean medicine for dementia patients under national health care. Korean Soc Orient Neuropsychiatry. 2019;30(1):31-8.\n60. View Article\n61. Google Scholar", "doc_items_refs": ["#/texts/380", "#/texts/381", "#/texts/382", "#/texts/383", "#/texts/384", "#/texts/385", "#/texts/386", "#/texts/387", "#/texts/388", "#/texts/389", "#/texts/390", "#/texts/391", "#/texts/392"], "page_nos": [], "uuid": "d0cecce8-5487-4da6-a69a-a888a8c01aae"}
{"doc_id": "2025__Korean_medicine_registry_for_cognitive_disorder_A_protocol_for_prospective_obser__W4410395861", "source_path": "<redacted:source_path>", "chunk_id": 26, "source_chunk_idxs": [41], "num_tokens": 512, "text": "Korean medicine registry for cognitive disorder: A protocol for prospective observational multi-center study\nReferences\n62. 18. 2022 Korean Medicine Utilization Survey - Ministry of Health and Welfare [Internet]. [cited 2023 Nov 21. ]. Available from:\nhttps://www.mohw.go.kr/board.es?mid=a10411010200&amp;bid=0019&amp;act=view&amp;list\\_no=375810\n63. View Article\n64. Google Scholar\n65. 19. Pei H, Ma L, Cao Y, Wang F, Li Z, Liu N. Traditional Chinese medicine for Alzheimer's disease and other cognitive impairment: a review. Am J Chin Med. 2020;48(3):487-511.\n66. View Article\n67. Google Scholar\n68. 20. Lee G eun, Moon KS, Kim NK, yong C sun, Jung IC, Kang HW. Preliminary study to develop the korean medical pathologic aging scale and korean medical pattern identification for dementia. J Korean Med. 2017;38(3):111-23.\n69. View Article\n70. Google Scholar\n71. 21. Shi G, Liu C, Guan W, Wang Z, Wang L, Xiao C, et al. Effects of acupuncture on Chinese medicine syndromes of vascular dementia. Chin J Integr Med. 2014;20(9):661-6. pmid:24155069\n72. View Article\n73. PubMed/NCBI\n74. Google Scholar\n75. 22. Choi Y, Kim Y, Jerng U, Kim H, Lee S, Kim G. Korean traditional medicine in treating patients with mild cognitive impairment: a multicenter prospective observational case series. Evid-Based Complement Altern Med. 2020;2020:4323989.\n76. View Article\n77. Google Scholar\n78. 23. Kim J-B, Lee D-Y, Ha D-J, Kwon C-Y. Scoping review of prospective clinical studies, projects, and clinical study protocol for korean medicine treatment on dementia. J Korean Med. 2021;42(3):99-118.\n79. View Article\n80. Google Scholar\n81. 24. Han K, Ha I-H, Lee J-H. Application of health care big data and necessity of traditional Korean medicine data registry. JKOMOR. 2017;17(1):46-53.", "doc_items_refs": ["#/texts/393", "#/texts/394", "#/texts/395", "#/texts/396", "#/texts/397", "#/texts/398", "#/texts/399", "#/texts/400", "#/texts/401", "#/texts/402", "#/texts/403", "#/texts/404", "#/texts/405", "#/texts/406", "#/texts/407", "#/texts/408", "#/texts/409", "#/texts/410", "#/texts/411", "#/texts/412"], "page_nos": [], "uuid": "8d669bb9-212b-4e9b-b370-5e495d509597"}
{"doc_id": "2025__Korean_medicine_registry_for_cognitive_disorder_A_protocol_for_prospective_obser__W4410395861", "source_path": "<redacted:source_path>", "chunk_id": 27, "source_chunk_idxs": [42], "num_tokens": 485, "text": "Korean medicine registry for cognitive disorder: A protocol for prospective observational multi-center study\nReferences\n82. View Article\n83. Google Scholar\n84. 25. Allen A, Patrick H, Ruof J, Buchberger B, Varela-Lema L, Kirschner J, et al. Development and pilot test of the registry evaluation and quality standards tool: an information technology-based tool to support and review registries. Value Health. 2022;25(8):1390-8. pmid:35277336\n85. View Article\n86. PubMed/NCBI\n87. Google Scholar\n88. 26. Gliklich RE, Dreyer NA, Leavy MB. Patient registries. In: Registries for evaluating patient outcomes: a user's guide [Internet]. 3rd ed [Internet]. Agency for Healthcare Research and Quality (US); 2014 [cited 2023 Nov 16. ]. Available from:\nhttps://www.ncbi.nlm.nih.gov/books/NBK208643/\n89. 27. Lee JY, Kim H, Seo YK, Kang HW, Kang WC, Jung I. A research to evaluate the reliability and validity of pattern identifications tool for cognitive disorder: a clinical study protocol. Korean Soc Orient Neuropsychiatry. 2018;29(4):255-66.\n90. View Article\n91. Google Scholar\n92. 28. Collin C, Wade DT, Davies S, Horne V. The barthel ADL index: a reliability study. Int Disabil Stud. 1988;10(2):61-3. pmid:3403500\n93. View Article\n94. PubMed/NCBI\n95. Google Scholar\n96. 29. Kim S, Kyun R, Won C. The validity and reliability of Korean version of bathel ADL index. Korean J Fam Med. 2004;25(7):534-41.\n97. View Article\n98. Google Scholar\n99. 30. Ku H, Kim J, Kwon E, Kim S, Lee H, Ko H. A study on the reliability and validity of Seoul-instrumental activities of daily living (S-IADL). J Korean Neuropsychiatr Assoc. 2004;43(2):189-99.\n100. View Article\n101. Google Scholar", "doc_items_refs": ["#/texts/413", "#/texts/414", "#/texts/415", "#/texts/416", "#/texts/417", "#/texts/418", "#/texts/419", "#/texts/420", "#/texts/421", "#/texts/422", "#/texts/423", "#/texts/424", "#/texts/425", "#/texts/426", "#/texts/427", "#/texts/428", "#/texts/429", "#/texts/430", "#/texts/431", "#/texts/432"], "page_nos": [], "uuid": "49edb24c-3733-4b4c-94a1-13b376e4d19a"}
{"doc_id": "2025__Korean_medicine_registry_for_cognitive_disorder_A_protocol_for_prospective_obser__W4410395861", "source_path": "<redacted:source_path>", "chunk_id": 28, "source_chunk_idxs": [43], "num_tokens": 443, "text": "Korean medicine registry for cognitive disorder: A protocol for prospective observational multi-center study\nReferences\n102. 31. Kaufer DI, Cummings JL, Ketchel P, Smith V, MacMillan A, Shelley T, et al. Validation of the NPI-Q, a brief clinical form of the Neuropsychiatric Inventory. J Neuropsychiatry Clin Neurosci. 2000;12(2):233-9. pmid:11001602\n103. View Article\n104. PubMed/NCBI\n105. Google Scholar\n106. 32. Cummings JL, Mega M, Gray K, Rosenberg-Thompson S, Carusi DA, Gornbein J. The Neuropsychiatric Inventory: comprehensive assessment of psychopathology in dementia. Neurology. 1994;44(12):2308-14. pmid:7991117\n107. View Article\n108. PubMed/NCBI\n109. Google Scholar\n110. 33. Kim HJ, Choi KH, Kim SH, Cummings JL, Yang DW. Validation study of the korean version of the brief clinical form of the Neuropsychiatric Inventory. Dement Geriatr Cogn Disord Extra. 2016;6(2):214-21.\n111. View Article\n112. Google Scholar\n113. 34. Folstein MF, Folstein SE, McHugh PR. \"Mini-mental state\". A practical method for grading the cognitive state of patients for the clinician. J Psychiatr Res. 1975;12(3):189-98. pmid:1202204\n114. View Article\n115. PubMed/NCBI\n116. Google Scholar\n117. 35. Nasreddine ZS, Phillips NA, Bédirian V, Charbonneau S, Whitehead V, Collin I, et al. The Montreal Cognitive Assessment, MoCA: a brief screening tool for mild cognitive impairment. J Am Geriatr Soc. 2005;53(4):695-9. pmid:15817019\n118. View Article\n119. PubMed/NCBI\n120. Google Scholar", "doc_items_refs": ["#/texts/433", "#/texts/434", "#/texts/435", "#/texts/436", "#/texts/437", "#/texts/438", "#/texts/439", "#/texts/440", "#/texts/441", "#/texts/442", "#/texts/443", "#/texts/444", "#/texts/445", "#/texts/446", "#/texts/447", "#/texts/448", "#/texts/449", "#/texts/450", "#/texts/451"], "page_nos": [], "uuid": "9aa353b8-f834-409d-a2f7-6e0c95527e81"}
{"doc_id": "2025__Korean_medicine_registry_for_cognitive_disorder_A_protocol_for_prospective_obser__W4410395861", "source_path": "<redacted:source_path>", "chunk_id": 29, "source_chunk_idxs": [44], "num_tokens": 459, "text": "Korean medicine registry for cognitive disorder: A protocol for prospective observational multi-center study\nReferences\n121. 36. Lee J-Y, Lee DW, Cho S-J, Na DL, Jeon HJ, Kim S-K, et al. Brief screening for mild cognitive impairment in elderly outpatient clinic: validation of the Korean version of the Montreal Cognitive Assessment. J Geriatr Psychiatry Neurol. 2008;21(2):104-10. pmid:18474719\n122. View Article\n123. PubMed/NCBI\n124. Google Scholar\n125. 37. Choi S, Na D, Lee B, Hahm HJ, Jeong Y. The validity of the Korean version of global deterioration scale. J Korean Neurol Assoc. 2002;20(6):612-7.\n126. View Article\n127. Google Scholar\n128. 38. Reisberg B, Ferris SH, de Leon MJ, Crook T. The Global Deterioration Scale for assessment of primary degenerative dementia. Am J Psychiatry. 1982;139(9):1136-9. pmid:7114305\n129. View Article\n130. PubMed/NCBI\n131. Google Scholar\n132. 39. Bae JN, Cho MJ. Development of the Korean version of the Geriatric Depression Scale and its short form among elderly psychiatric patients. J Psychosom Res. 2004;57(3):297-305. pmid:15507257\n133. View Article\n134. PubMed/NCBI\n135. Google Scholar\n136. 40. Yesavage JA, Brink TL, Rose TL, Lum O, Huang V, Adey M, et al. Development and validation of a geriatric depression screening scale: a preliminary report. J Psychiatr Res. 1982;17(1):37-49. pmid:7183759\n137. View Article\n138. PubMed/NCBI\n139. Google Scholar\n140. 41. Mj C, Ge L, Y L, Kh B, Y K, Jh K. Validation of the core seven-emotions inventory - short form. Integr Med Res. 2019;8(2).\n141. View Article\n142. Google Scholar", "doc_items_refs": ["#/texts/452", "#/texts/453", "#/texts/454", "#/texts/455", "#/texts/456", "#/texts/457", "#/texts/458", "#/texts/459", "#/texts/460", "#/texts/461", "#/texts/462", "#/texts/463", "#/texts/464", "#/texts/465", "#/texts/466", "#/texts/467", "#/texts/468", "#/texts/469", "#/texts/470", "#/texts/471", "#/texts/472", "#/texts/473"], "page_nos": [], "uuid": "56c398fb-644f-40fd-b377-b6ab1ae1ecab"}
{"doc_id": "2025__Korean_medicine_registry_for_cognitive_disorder_A_protocol_for_prospective_obser__W4410395861", "source_path": "<redacted:source_path>", "chunk_id": 30, "source_chunk_idxs": [45], "num_tokens": 472, "text": "Korean medicine registry for cognitive disorder: A protocol for prospective observational multi-center study\nReferences\n143. 42. Brooks R. EuroQol: the current state of play. Health Policy [Internet]. 1996 [cited 2023 Nov 21. ];37(1). Available from:\nhttps://pubmed.ncbi.nlm.nih.gov/10158943//\n144. View Article\n145. Google Scholar\n146. 43. Yk L, Hs N, Lh C, Ky K, Hk Y, Is K. South Korean time trade-off values for EQ-5D health states: modeling with observed values for 101 health states. Value Health [Internet]. 2009 [cited 2023 Nov 21. ];12(8). Available from:\nhttps://pubmed.ncbi.nlm.nih.gov/19659703//\n147. View Article\n148. Google Scholar\n149. 44. Lee H, Kim D, Ko H, Ku H, Kwon E, Kim J. The standardization of [geriatric quality of life scale]. Korean J Clin Psychol. 2003;22(4):859-81.\n150. View Article\n151. Google Scholar\n152. 45. Lee H, Kim J, Ko H, Ku H, Kwon E, Shin J. The standardization of the geriatric quality of life scale-dementia (GQOL-D). J Korean Geriatr Soc. 2004;8(3):151-64.\n153. View Article\n154. Google Scholar\n155. 46. Novak M, Guest C. Application of a multidimensional caregiver burden inventory. Gerontologist. 1989;29(6):798-803. pmid:2516000\n156. View Article\n157. PubMed/NCBI\n158. Google Scholar\n159. 47. Jiang X, Lu T, Dong Y, Shi J, Duan M, Zhang X. Effectiveness and safety of moxibustion for vascular dementia: a systematic review and meta-analysis. Medicine (Baltimore). 2022;101(26):e29804. pmid:35777054\n160. View Article\n161. PubMed/NCBI\n162. Google Scholar", "doc_items_refs": ["#/texts/474", "#/texts/475", "#/texts/476", "#/texts/477", "#/texts/478", "#/texts/479", "#/texts/480", "#/texts/481", "#/texts/482", "#/texts/483", "#/texts/484", "#/texts/485", "#/texts/486", "#/texts/487", "#/texts/488", "#/texts/489", "#/texts/490", "#/texts/491", "#/texts/492", "#/texts/493"], "page_nos": [], "uuid": "45c58a57-7d29-4913-9892-a0b32af7a8a7"}
{"doc_id": "2025__Korean_medicine_registry_for_cognitive_disorder_A_protocol_for_prospective_obser__W4410395861", "source_path": "<redacted:source_path>", "chunk_id": 31, "source_chunk_idxs": [46], "num_tokens": 508, "text": "Korean medicine registry for cognitive disorder: A protocol for prospective observational multi-center study\nReferences\n163. 48. Zhou S, Dong L, He Y, Xiao H. Acupuncture plus herbal medicine for Alzheimer's disease: a systematic review and meta-analysis. Am J Chin Med. 2017;45(7):1327-44. pmid:28922926\n164. View Article\n165. PubMed/NCBI\n166. Google Scholar\n167. 49. Chen K-H, Yeh M-H, Livneh H, Chen B-C, Lin I-H, Lu M-C, et al. Association of traditional Chinese medicine therapy and the risk of dementia in patients with hypertension: a nationwide population-based cohort study. BMC Complement Altern Med. 2017;17(1):178. pmid:28356117\n168. View Article\n169. PubMed/NCBI\n170. Google Scholar\n171. 50. Chu S-A, Chen T-Y, Chen P-Y, Tzeng W-J, Liang C-L, Lu K, et al. Acupuncture may decrease the incidence of post-stroke dementia: a Taiwan nationwide retrospective cohort study. Front Neurol. 2021;12:657048. pmid:34093405\n172. View Article\n173. PubMed/NCBI\n174. Google Scholar\n175. 51. Talari K, Goyal M. Retrospective studies - utility and caveats. J R Coll Physicians Edinb. 2020;50(4):398-402. pmid:33469615\n176. View Article\n177. PubMed/NCBI\n178. Google Scholar\n179. 52. Kip KE, Cohen F, Cole SR, Wilhelmus KR, Patrick DL, Blair RC, et al. Recall bias in a prospective cohort study of acute time-varying exposures: example from the herpetic eye disease study. J Clin Epidemiol. 2001;54(5):482-7. pmid:11337211\n180. View Article\n181. PubMed/NCBI\n182. Google Scholar\n183. 53. Camm AJ, Fox KAA. Strengths and weaknesses of \"real-world\" studies involving non-vitamin K antagonist oral anticoagulants. Open Heart. 2018;5(1):e000788. pmid:29713485\n184. View Article", "doc_items_refs": ["#/texts/494", "#/texts/495", "#/texts/496", "#/texts/497", "#/texts/498", "#/texts/499", "#/texts/500", "#/texts/501", "#/texts/502", "#/texts/503", "#/texts/504", "#/texts/505", "#/texts/506", "#/texts/507", "#/texts/508", "#/texts/509", "#/texts/510", "#/texts/511", "#/texts/512", "#/texts/513", "#/texts/514", "#/texts/515"], "page_nos": [], "uuid": "151a653c-9e07-44cc-9142-cf3330aeacc5"}
{"doc_id": "2025__Korean_medicine_registry_for_cognitive_disorder_A_protocol_for_prospective_obser__W4410395861", "source_path": "<redacted:source_path>", "chunk_id": 32, "source_chunk_idxs": [47, 48], "num_tokens": 476, "text": "Korean medicine registry for cognitive disorder: A protocol for prospective observational multi-center study\nReferences\n185. PubMed/NCBI\n186. Google Scholar\nDownload PDF\n- Citation\n- XML\nPrint\nShare\n- Reddit\n- Image Hyperlink.\n- Facebook\n- Image Hyperlink.\n- LinkedIn\n- Image Hyperlink.\n- Mendeley\n- Image Hyperlink.\n- Bluesky\n- Image Hyperlink.\n- Email\n- Image Hyperlink.\nCheck for updates via CrossMark\nAdvertisement\n\nKorean medicine registry for cognitive disorder: A protocol for prospective observational multi-center study\nReferences\nSubject Areas ? For more information about PLOS Subject Areas, click here . We want your feedback. Do these Subject Areas make sense for this article? Click the target next to the incorrect Subject Area and let us know. Thanks for your help!\n- Dementia\nIs the Subject Area\n\"Dementia\"\napplicable to this article? Yes No Thanks for your feedback.\n- Cognitive impairment\nIs the Subject Area\n\"Cognitive impairment\"\napplicable to this article? Yes No Thanks for your feedback.\n- Alzheimer's disease\nIs the Subject Area\n\"Alzheimer's disease\"\napplicable to this article? Yes No Thanks for your feedback.\n- Aging\nIs the Subject Area\n\"Aging\"\napplicable to this article? Yes No Thanks for your feedback.\n- Caregivers\nIs the Subject Area\n\"Caregivers\"\napplicable to this article? Yes No Thanks for your feedback.\n- Neuropsychological testing\nIs the Subject Area\n\"Neuropsychological testing\"\napplicable to this article? Yes No Thanks for your feedback.\n- Korean people\nIs the Subject Area\n\"Korean people\"\napplicable to this article? Yes No Thanks for your feedback.\n- Traditional medicine\nIs the Subject Area\n\"Traditional medicine\"\napplicable to this article? Yes No Thanks for your feedback.\n- Publications\n- PLOS Biology\n- PLOS Climate\n- PLOS Complex Systems\n- PLOS Computational Biology\n- PLOS Digital Health\n- PLOS Genetics\n- PLOS Global Public Health\n- PLOS Medicine\n- PLOS Mental Health\n- PLOS Neglected Tropical Diseases\n- PLOS One\n- PLOS Pathogens\n- PLOS Sustainability and Transformation\n- PLOS Water\n- Home\n- Blogs\n- Collections\n- Give feedback\n- LOCKSS\n- Privacy Policy\n- Terms of Use\n- Advertise\n- Media Inquiries\n- Contact\nPLOS is a nonprofit 501(c)(3) corporation, #C2354500, based in California, US\nPLOS", "doc_items_refs": ["#/texts/516", "#/texts/517", "#/texts/518", "#/texts/519", "#/texts/520", "#/texts/521", "#/texts/522", "#/texts/523", "#/texts/524", "#/texts/525", "#/texts/526", "#/texts/527", "#/texts/528", "#/texts/529", "#/texts/530", "#/texts/531", "#/texts/532", "#/texts/533", "#/texts/534", "#/texts/535", "#/texts/536", "#/texts/538", "#/texts/539", "#/texts/540", "#/texts/541", "#/texts/542", "#/texts/543", "#/texts/544", "#/texts/545", "#/texts/546", "#/texts/547", "#/texts/548", "#/texts/549", "#/texts/550", "#/texts/551", "#/texts/552", "#/texts/553", "#/texts/554", "#/texts/555", "#/texts/556", "#/texts/557", "#/texts/558", "#/texts/559", "#/texts/560", "#/texts/561", "#/texts/562", "#/texts/563", "#/texts/564", "#/texts/565", "#/texts/566", "#/texts/567", "#/texts/568", "#/texts/569", "#/texts/570", "#/texts/571", "#/texts/572"], "page_nos": [], "uuid": "13baaf41-b615-48d8-9fe2-57ed4ab75519"}
