{"doc_id": "2025__Repetitive_negative_thinking_self-reflection_and_perceived_cognitive_dysfunction__W4413050772", "source_path": "<redacted:source_path>", "chunk_id": 0, "source_chunk_idxs": [0, 1], "num_tokens": 207, "text": "Repetitive negative thinking, self-reflection, and perceived cognitive dysfunction in older adults: a cross-sectional study | BMC Psychiatry | Full Text\nSkip to main content\nAdvertisement\nSearch\n- Explore journals\n- Get published\n- About BMC\n- My account\nSearch all BMC articles\nSearch\nBMC Psychiatry\n- Home\n- About\n- Articles\n- Submission Guidelines\n- Collections\n- Join The Board\n- Submit manuscript\nRepetitive negative thinking, self-reflection, and perceived cognitive dysfunction in older adults: a cross-sectional study\nDownload PDF\nDownload PDF\n- Research\n- Open access\n- Published: 07 August 2025\n\nRepetitive negative thinking, self-reflection, and perceived cognitive dysfunction in older adults: a cross-sectional study\n- Xi Ren\n1\n,\n- Landon Edwards\n1\n,\n- Eric Mann\n1\n,\n- Satoshi Horiuchi\n2\n&amp;\n- ...\n- Aki Tsuchiyagaito\n1\n,\n3\n,\n4\nShow authors\nBMC Psychiatry\nvolume 25\n, Article number: 773 ( 2025 )\nCite this article\n- 653 Accesses\n- 10 Altmetric\n- Metrics details", "doc_items_refs": ["#/texts/1", "#/texts/2", "#/texts/3", "#/texts/4", "#/texts/5", "#/texts/6", "#/texts/7", "#/texts/8", "#/texts/9", "#/texts/10", "#/texts/11", "#/texts/12", "#/texts/13", "#/texts/14", "#/texts/15", "#/texts/16", "#/texts/17", "#/texts/18", "#/texts/19", "#/texts/20", "#/texts/21", "#/texts/22", "#/texts/23", "#/texts/25", "#/texts/26", "#/texts/27", "#/texts/28", "#/texts/29", "#/texts/30", "#/texts/31", "#/texts/32", "#/texts/33", "#/texts/34", "#/texts/35", "#/texts/36", "#/texts/37", "#/texts/38"], "page_nos": [], "uuid": "d067767e-fed6-4795-b871-6a28548db198"}
{"doc_id": "2025__Repetitive_negative_thinking_self-reflection_and_perceived_cognitive_dysfunction__W4413050772", "source_path": "<redacted:source_path>", "chunk_id": 1, "source_chunk_idxs": [2], "num_tokens": 380, "text": "Repetitive negative thinking, self-reflection, and perceived cognitive dysfunction in older adults: a cross-sectional study\nAbstract\nAs the global population ages, understanding cognitive dysfunction, including Alzheimer's Disease and other forms of dementia, is crucial. With the growing prevalence of these disorders, it is essential to identify and understand potential factors that maintain cognitive function and potentially delay severe cognitive dysfunction. This study examined the roles of repetitive negative thinking (RNT) and reflection in subjective cognitive dysfunction among older adults, with an additional consideration of their association with depressive symptoms. RNT, which is common in depression, has been associated with cognitive impairments. However, its unique influence on cognitive dysfunction is unclear. Conversely, reflection, considered to protect against adverse cognitive outcomes, is less explored. Using the Rumination Response Scale (RRS), we hypothesize that RNT may be more strongly linked to cognitive dysfunction than reflection, even when controlling for depressive symptoms. Two-hundred and seventy-six older adults (137 male, 139 female) from Japan participated in the study, providing measures of RRS-brooding (an index of RNT), RRS-reflection (an index of reflection), depressive symptoms, and self-reported cognitive dysfunction. The results showed higher reflection, but not RNT, was associated with greater subjective cognitive dysfunction [β = 0.28,\np\n=.03], even after controlling for depressive symptoms. Importantly, the association between reflection and cognitive dysfunction demonstrated sex differences, with reflection significantly accounting for cognitive dysfunction in female [β = 0.46,\np\n=.01] but not in male. These findings highlight the significance of evaluating specific subtypes of repetitive thoughts and sex differences when investigating the association with perceived cognitive dysfunction. Future research should continue to explore the mechanisms underlying these associations and the prevention and treatment of cognitive dysfunctions.\nPeer Review reports", "doc_items_refs": ["#/texts/40", "#/texts/41", "#/texts/42", "#/texts/43", "#/texts/44", "#/texts/45"], "page_nos": [], "uuid": "41e462c9-17b3-444a-8d51-47cbdef9b17d"}
{"doc_id": "2025__Repetitive_negative_thinking_self-reflection_and_perceived_cognitive_dysfunction__W4413050772", "source_path": "<redacted:source_path>", "chunk_id": 2, "source_chunk_idxs": [3], "num_tokens": 448, "text": "Repetitive negative thinking, self-reflection, and perceived cognitive dysfunction in older adults: a cross-sectional study\nIntroduction\nWith the rise in global aging, cognitive dysfunction in older adults has become a public health concern. For example, Alzheimer's Disease (AD) and other forms of dementia are major contributors of neurological causes of death and disabilities worldwide, with the absolute number of affected individuals continually rising [\n1\n]. Although new disease-modifying treatments have shown promise in slowing cognitive decline in early-stage AD, their long-term efficacy, safety, and accessibility remain limited [\n2\n,\n3\n,\n4\n,\n5\n]. Consequently, there is an urgent need to identify risk factors and understand their mechanisms, potentially enabling therapeutic strategies that maintain cognitive function and potentially delay the onset of severe cognitive dysfunction.\nA key area of interest that has been implicated in cognitive health research is the effect of repetitive thinking, a cognitive style characterized by recurring thoughts that can manifest in both adaptive and maladaptive forms [\n6\n]. Repetitive thinking encompasses various types, including repetitive negative thinking (RNT) and self-reflection [\n7\n,\n8\n]. RNT, such as worry and rumination, is characterized by persistent thoughts that revolve around negative themes [\n9\n], and has been linked to impaired memory and executive function across diverse populations [\n10\n,\n11\n,\n12\n,\n13\n,\n14\n,\n15\n,\n16\n,\n17\n]. Furthermore, Marchant and colleagues utilized amyloid-positron emission tomography (PET) and tau-PET scans to identify the association between RNT and cognitive dysfunction, as well as neuropathological markers of AD [\n18\n]. These findings implicate RNT as a potential pathway contributing to the increased risk of cognitive impairment and dementia. Additionally, since RNT is a central feature of depression and depressive symptoms have been shown to contribute to cognitive dysfunction [\n19\n], the need to understand the complex interplay between RNT, depression, and cognitive health is imperative. Some of the existing studies on RNT and cognitive function have adjusted for depression, while others have not (see review 12). This inconsistency, which strengthens the argument for further exploration of the independent role of RNT in cognitive dysfunction.", "doc_items_refs": ["#/texts/47", "#/texts/48", "#/texts/49", "#/texts/50", "#/texts/51", "#/texts/52", "#/texts/53", "#/texts/54", "#/texts/55", "#/texts/56", "#/texts/57", "#/texts/58", "#/texts/59", "#/texts/60", "#/texts/61", "#/texts/62", "#/texts/63", "#/texts/64", "#/texts/65", "#/texts/66", "#/texts/67", "#/texts/68", "#/texts/69", "#/texts/70", "#/texts/71", "#/texts/72", "#/texts/73", "#/texts/74", "#/texts/75", "#/texts/76", "#/texts/77", "#/texts/78", "#/texts/79", "#/texts/80", "#/texts/81", "#/texts/82", "#/texts/83", "#/texts/84", "#/texts/85", "#/texts/86"], "page_nos": [], "uuid": "3f4bd8cd-da91-4259-8d62-b52c050158cf"}
{"doc_id": "2025__Repetitive_negative_thinking_self-reflection_and_perceived_cognitive_dysfunction__W4413050772", "source_path": "<redacted:source_path>", "chunk_id": 3, "source_chunk_idxs": [4], "num_tokens": 477, "text": "Repetitive negative thinking, self-reflection, and perceived cognitive dysfunction in older adults: a cross-sectional study\nIntroduction\nIn contrast, self-reflective tendencies, defined as active evaluation of one's thoughts, feelings, and behaviors, have been assumed to protect against adverse cognitive outcomes [\n20\n]. However, while brooding (as a measure of RNT) and reflection (as a measure of self-reflection) are often measured together using the total score of the Rumination Response Scale (RRS; 21), there is increasing evidence that these constructs are associated with different cognitive and psychological outcomes [\n10\n]. Brooding involves a passive comparison of one's current situation with unachieved standards (e.g., \"think about a recent situation, wishing it had gone better), while reflection is characterized by purposeful introspection aimed at cognitive problem-solving to alleviate depressive symptoms (e.g., \"analyze your personality to try to understand why you are depressed\"; 22). Although both cognitive styles share a common aspect as perseverative repetitive thinking; however, RNT focuses on the negative valance and tends to exacerbate cognitive dysfunction, while reflection may support cognitive resilience by enhancing problem-solving and promoting emotional regulation. For example, studies have demonstrated that engaging in reflective self-analysis is associated with improved executive functioning and reduced cognitive decline in older adults [\n20\n,\n23\n,\n24\n]. Additionally, reflection has been linked to greater neural plasticity and the maintenance of cognitive flexibility, which are crucial for cognitive health across the lifespan [\n25\n,\n26\n]. Future research should aim to disentangle the differential effects of these cognitive styles on cognitive trajectories and determine whether interventions that promote self-reflective practices can mitigate the cognitive risks associated with RNT and aging [\n17\n,\n27\n]. The association between these cognitive styles and cognitive impairment requires further exploration. In addition, previous studies have consistently reported that sex plays a distinct role in the contribution to RNT and cognitive dysfunction [\n28\n,\n29\n,\n30\n,\n31\n,\n32\n,\n33\n,\n34\n]. These studies observed that females are more likely to exhibit pronounced RNT and reflection, and tend to experience cognitive dysfunction at a faster rate compared to male. Given these findings, further investigations are needed to determine whether RNT differently affect cognitive impairment in male and female.", "doc_items_refs": ["#/texts/87", "#/texts/88", "#/texts/89", "#/texts/90", "#/texts/91", "#/texts/92", "#/texts/93", "#/texts/94", "#/texts/95", "#/texts/96", "#/texts/97", "#/texts/98", "#/texts/99", "#/texts/100", "#/texts/101", "#/texts/102", "#/texts/103", "#/texts/104", "#/texts/105", "#/texts/106", "#/texts/107", "#/texts/108", "#/texts/109", "#/texts/110", "#/texts/111", "#/texts/112", "#/texts/113", "#/texts/114", "#/texts/115", "#/texts/116", "#/texts/117", "#/texts/118", "#/texts/119"], "page_nos": [], "uuid": "1017a3a4-5369-4858-92b4-73a313a5e0a9"}
{"doc_id": "2025__Repetitive_negative_thinking_self-reflection_and_perceived_cognitive_dysfunction__W4413050772", "source_path": "<redacted:source_path>", "chunk_id": 4, "source_chunk_idxs": [5, 6], "num_tokens": 184, "text": "Repetitive negative thinking, self-reflection, and perceived cognitive dysfunction in older adults: a cross-sectional study\nIntroduction\nTherefore, the present study aims to investigate the association between RNT, reflection, and cognitive dysfunction in older adults, while considering the role of depression. Our hypothesis is that higher levels of RNT will be associated with greater extent of cognitive dysfunction in older adults, even when controlling for depression, whereas higher levels of reflection will be associated with less cognitive dysfunction. Additionally, this study seeks to explore whether RNT differentially influences cognitive dysfunction between males and females.\n\nRepetitive negative thinking, self-reflection, and perceived cognitive dysfunction in older adults: a cross-sectional study\nMethods\nThis is a part of the larger study investigating the relationship between RNT and hoarding in older adults. Detailed recruitment process and participants' eligibility are described in Tsuchiyagaito et al. (2023; 35) and Supplementary Methods.", "doc_items_refs": ["#/texts/120", "#/texts/122"], "page_nos": [], "uuid": "23adfb4a-0121-442d-8093-95bc8331d41e"}
{"doc_id": "2025__Repetitive_negative_thinking_self-reflection_and_perceived_cognitive_dysfunction__W4413050772", "source_path": "<redacted:source_path>", "chunk_id": 5, "source_chunk_idxs": [7], "num_tokens": 348, "text": "Repetitive negative thinking, self-reflection, and perceived cognitive dysfunction in older adults: a cross-sectional study\nMethods\nParticipants\nA total of 300 older adults aged 65 and above (150 male and 150 female, average age = 70.71 years, SD = 4.97, range = 65-86 years) residing in Japan were recruited in August 2022 through survey panels. Participants were randomly selected from a pool of registered monitors with the external online survey company, based on age and sex criteria. Once 300 responses were collected, the survey was closed to further participants. While the sample was randomly drawn from the panel, it does not represent the entire older adult population in Japan due to its voluntary registration nature. Participants received an e-mail invitation from an external online survey company and provided online informed consent before completing the survey. Participants were excluded if they reported current psychiatric or major neurological disorders (e.g., depression, anxiety, insomnia, schizophrenia, substance abuse, dementia, epilepsy, etc.), or were taking any psychotropic medications. Two hundred and seventy-six participants (137 male and 139 female, average age = 70.74, SD = 5.07) remained in the final sample. The sample size was initially estimated using G*Power 3.1 [\n36\n] based on the previous study's purpose which assured 80% power to detect a 3.3 to 5.0% increase in R\n2\nin a hierarchical regression analysis (six total number of predictors). The study protocol was reviewed and approved by the Iwate Prefectural University Institutional Review Board (IRB) [IRB Tracking Number. 356], and this study was conducted in accordance with the Declaration of Helsinki.", "doc_items_refs": ["#/texts/124", "#/texts/125", "#/texts/126", "#/texts/127", "#/texts/128"], "page_nos": [], "uuid": "3859f4ee-3ee7-4d7b-99de-b99816bc7a9e"}
{"doc_id": "2025__Repetitive_negative_thinking_self-reflection_and_perceived_cognitive_dysfunction__W4413050772", "source_path": "<redacted:source_path>", "chunk_id": 6, "source_chunk_idxs": [8], "num_tokens": 332, "text": "Repetitive negative thinking, self-reflection, and perceived cognitive dysfunction in older adults: a cross-sectional study\nMethods\nMeasures\nParticipants provided demographic information including their age, biological sex, education, occupation, marital status, self-reported medical conditions, and use of psychotropic medication. Additionally, participants completed the following inventories, with the internal consistency (Cronbach's alpha) of each inventory reported:\nPatient Health Questionnaire-9 (PHQ-9; Cronbach's alpha = 0.85; 37). The Japanese version of the PHQ-9 [\n38\n,\n39\n] was used to assess the severity of depression experienced over the past 2 weeks. This inventory consists of 9 items, each rated on a 4-point Likert scale from 0 (not at all) to 3 (nearly every day). Higher scores indicate greater severity of depressive symptoms.\nRuminative Response Scale (RRS; Cronbach's alpha = 0.95; 21, 40). The Japanese version of the RRS contains 10 items rated on a 4-point Likert scale ranging from 1 (never) to 4 (always). A factor analysis indicated a two-dimensional model of repetitive thinking: brooding measured by RRS-B (e.g., think about a recent situation, wishing it had gone better) and reflection measured by RRS-R (e.g., go way by yourself and think about why you feel this way; 22). Higher scores of brooding subscale indicate greater levels of RNT, while higher scores of self-reflection subscale indicate greater levels of reflection.", "doc_items_refs": ["#/texts/130", "#/texts/131", "#/texts/132", "#/texts/133", "#/texts/134", "#/texts/135", "#/texts/136"], "page_nos": [], "uuid": "0be81b72-25a7-4bd5-93bb-2987416dfcd5"}
{"doc_id": "2025__Repetitive_negative_thinking_self-reflection_and_perceived_cognitive_dysfunction__W4413050772", "source_path": "<redacted:source_path>", "chunk_id": 7, "source_chunk_idxs": [9, 10], "num_tokens": 363, "text": "Repetitive negative thinking, self-reflection, and perceived cognitive dysfunction in older adults: a cross-sectional study\nMethods\nMeasures\nSelf-administered Dementia Checklist (SDC; Cronbach's alpha = 0.78; 41). The SDC is a 10-item self-report scale measuring subjective symptoms of dementia, using a 4-point Likert scale from 1 (not at all/I can do it without any problem) to 4 (always/I cannot do it). It comprises two subjective subscales: one measuring the subjective decline in daily living functioning (e.g., \"Can you go out alone by bus, train, or car?\"; Cronbach's alpha = 0.81) and the other assessing subjective cognitive dysfunction (e.g., \"Do you lose track of where you put things such as your wallet or keys?\"; Cronbach's alpha = 0.77). Higher scores indicate greater perceived cognitive impairment. For the present analyses, only the subjective cognitive dysfunction subscale was utilized.\n\nRepetitive negative thinking, self-reflection, and perceived cognitive dysfunction in older adults: a cross-sectional study\nMethods\nData analysis\nData analyses were performed with R 4.3.0 using functions from base R or following packages: readxl, dplyr, ltm, tableone, Table\n1\n, corrr, psych, car. Hierarchical regression analyses were performed to examine the relationship between RNT, reflection, and cognitive impairment, while controlling for age, sex, years of education, and the severity of depressive symptoms. All continuous variables were standardized to calculate standardized beta coefficients. Post-hoc simple slope Johnson-Neyman analyses were implemented to evaluate significant interactions. The significance levels for all tests were evaluated at\np", "doc_items_refs": ["#/texts/137", "#/texts/139", "#/texts/140", "#/texts/141", "#/texts/142"], "page_nos": [], "uuid": "4bd283b3-cc63-4bd7-98ac-16eed0d19ace"}
{"doc_id": "2025__Repetitive_negative_thinking_self-reflection_and_perceived_cognitive_dysfunction__W4413050772", "source_path": "<redacted:source_path>", "chunk_id": 8, "source_chunk_idxs": [11, 12, 13], "num_tokens": 339, "text": "Repetitive negative thinking, self-reflection, and perceived cognitive dysfunction in older adults: a cross-sectional study\nMethods\nTransparency and openness\nWe have provided a comprehensive description of our sample size determination process, data exclusion criteria, manipulation procedure, and measures employed in the study. All data, analytic code, and research materials are available upon request. The Data Analysis section contains a report on the data analytic software and packages used. This study's design and its analysis were not pre-registered.\n\nRepetitive negative thinking, self-reflection, and perceived cognitive dysfunction in older adults: a cross-sectional study\nResults\nDemographics\nTable\n1\npresents the demographic variables stratified by sex. In the current sample, most female participants were houseworkers or unemployed. Female reported significantly less years of education and were less likely to have received college or higher level of education compared to male. Sex and years of education were included in the first level of the hierarchical regression model.\n\nRepetitive negative thinking, self-reflection, and perceived cognitive dysfunction in older adults: a cross-sectional study\nResults\nSex difference in cognitive function and repetitive thinking\nTable\n1\nalso displays the mean scores, and standard deviations of the self-reported measurements stratified by sex. Female reported significantly higher scores than male on the PHQ-9 [t(274) = −2.66,\np\n=.008], SDC subjective cognitive dysfunction measure [t(274) = −2.21,\np\n=.03], RRS-B [t(274) = −2.31,\np\n=.02], and RRS-R [t(274) = −2.03,\np\n=.04].", "doc_items_refs": ["#/texts/145", "#/texts/148", "#/texts/149", "#/texts/150", "#/texts/152", "#/texts/153", "#/texts/154", "#/texts/155", "#/texts/156", "#/texts/157", "#/texts/158", "#/texts/159", "#/texts/160", "#/texts/161", "#/texts/162"], "page_nos": [], "uuid": "80f77a6f-9891-4b52-9d0f-8d19563e1287"}
{"doc_id": "2025__Repetitive_negative_thinking_self-reflection_and_perceived_cognitive_dysfunction__W4413050772", "source_path": "<redacted:source_path>", "chunk_id": 9, "source_chunk_idxs": [14], "num_tokens": 475, "text": "Repetitive negative thinking, self-reflection, and perceived cognitive dysfunction in older adults: a cross-sectional study\nResults\nCross-sectional examination of the role of repetitive negative thinking in subjective cognitive function\nIn the first step of the hierarchical regression model, age, sex, years of education, and depressive symptoms were entered to predict the dysfunction in cognitive functions as measured by the SDC (Table\n2\n). The base model accounted for 18.6% of the variance in self-reported cognitive dysfunction [F(4, 270) = 16.62,\np\np\n2\n= 5.4%, F(6, 264) = 4.23,\np\np\n=.05], along with a main effect for RNT [β = 0.25,\np\n=.05]. Additionally, a significant interaction between reflection and RNT was observed [β = −0.08,\np\n=.02]. Post-hoc simple slope and Johnson-Neyman analyses revealed that higher levels of RNT were associated with greater cognitive dysfunction in addition to depressive symptoms [β = 0.18,\np\np\n=.05] and below the mean level [slope = 0.36,\np\n=.02] (Fig.\n1\n).\nFig. 1\nTo further explore the marginal interaction between sex, RNT, and reflection, hierarchical regression analyses were conducted separately for each sex. In male, the extended model accounted for 15.4% of the variance in self-reported cognitive dysfunction [ΔR\n2\n= 5.4%, F(3, 130) = 3.80,\np\n=.01]. A significant interaction between RNT and reflection emerged [β = −0.08,\np\n=.01], and a main effect for RNT [β = 0.25,\np\n=.046]. Post-hoc analyses revealed that higher levels of RNT were associated with greater cognitive dysfunction in addition to depressive symptoms [β = 0.19,\np\n=.01], particularly at mean [slope = 0.27,\np\n=.04] and below-mean [slope = 0.36,\np\n=.01] reflection levels. In female, although the extended model accounted for 6% more variance [F(3, 131) = 4.65,\np\np\ns &gt; 0.05).", "doc_items_refs": ["#/texts/164", "#/texts/165", "#/texts/166", "#/texts/167", "#/texts/169", "#/texts/171", "#/texts/172", "#/texts/173", "#/texts/175", "#/texts/176", "#/texts/177", "#/texts/178", "#/texts/179", "#/texts/180", "#/texts/181", "#/texts/183", "#/texts/184", "#/texts/185", "#/texts/186", "#/texts/187", "#/texts/188", "#/texts/189", "#/texts/190", "#/texts/191", "#/texts/192", "#/texts/193", "#/texts/194", "#/texts/195", "#/texts/196", "#/texts/197", "#/texts/198", "#/texts/199", "#/texts/200", "#/texts/201", "#/texts/202", "#/texts/203", "#/texts/204", "#/texts/205", "#/texts/207", "#/texts/208"], "page_nos": [], "uuid": "1f25a05a-6555-4c6e-9d04-e94663961ba7"}
{"doc_id": "2025__Repetitive_negative_thinking_self-reflection_and_perceived_cognitive_dysfunction__W4413050772", "source_path": "<redacted:source_path>", "chunk_id": 10, "source_chunk_idxs": [15], "num_tokens": 415, "text": "Repetitive negative thinking, self-reflection, and perceived cognitive dysfunction in older adults: a cross-sectional study\nDiscussion\nThe present study aimed to investigate the association between RNT, reflection, and subjective cognitive impairment in older adults, while considering the role of depressive symptoms. Consistent with our hypothesis, higher levels of RNT were associated with greater subjective cognitive dysfunction, independent of the contribution of depressive symptoms. In contrast, reflection did not exhibit a protective effect in general. However, it moderated the relationship between RNT and cognitive dysfunction, particularly when levels of reflection were below-average. This finding suggests that reflection alone may not be sufficient to buffer against the negative effects of RNT unless it is at an adequate level to facilitate effective problem-solving and emotional regulation. Theoretical frameworks support the observed associations between cognitive styles and cognitive dysfunction. Research on attention and memory biases in depression reveals consistent patterns across currently depressed, formerly depressed, and never-depressed individuals. Currently and formerly depressed individuals show attentional biases towards negative stimuli and away from positive stimuli [\n27\n]. RNT can act as a perseverative cognitive process that disrupts cognitive functioning by occupying cognitive resources and contributing to heightened emotional distress [\n42\n]. This aligns with our findings that higher levels of RNT are linked to greater cognitive dysfunction. Similarly, Zainal and Newman (2022) build on these ideas by proposing that the relationship between cognitive dysfunction and psychopathology symptoms, such as anxiety and depression, is bidirectional and complex [\n17\n]. Their review supports both vulnerability and scar theories, where cognitive dysfunction can both precede and result from anxiety-related symptoms. The observed associations in our study suggest that maladaptive forms of RNT, which may lead to cognitive overload and reduced cognitive efficiency, could contribute to subjective cognitive dysfunction [\n43\n]. Furthermore, our findings are consistent with the work of Sharp, Miller, and Heller (2015), who describe how transdiagnostic factors such as anxious apprehension and anxious arousal can influence executive function across multiple disorders [\n16", "doc_items_refs": ["#/texts/210", "#/texts/211", "#/texts/212", "#/texts/213", "#/texts/214", "#/texts/215", "#/texts/216", "#/texts/217", "#/texts/218", "#/texts/219"], "page_nos": [], "uuid": "6a581977-5a6e-40a8-8070-3ee842b46e30"}
{"doc_id": "2025__Repetitive_negative_thinking_self-reflection_and_perceived_cognitive_dysfunction__W4413050772", "source_path": "<redacted:source_path>", "chunk_id": 11, "source_chunk_idxs": [16], "num_tokens": 203, "text": "Repetitive negative thinking, self-reflection, and perceived cognitive dysfunction in older adults: a cross-sectional study\nDiscussion\n]. These transdiagnostic factors are known to interact with executive function and cognitive styles, potentially amplifying the effects of RNT on cognitive health. These research suggest that RNT and reflection, when engaged in excessively, may disrupt cognitive processes that are crucial for maintaining cognitive flexibility and problem-solving abilities. This helps explain why reflection, although typically considered adaptive, did not exhibit a protective effect in our study and was instead associated with cognitive dysfunction at low levels. Notably, sex differences emerged, with the relationship between cognitive styles and cognitive dysfunction being more pronounced in males, while neither brooding nor reflection contributed to cognitive dysfunction in females beyond the influence of depression severity. These results suggest that males may be more vulnerable to the negative effects of RNT, especially when they lack adaptive self-reflective strategies. These findings suggest that the interplay between cognitive styles and cognitive health is more complex than previously understood.", "doc_items_refs": ["#/texts/220"], "page_nos": [], "uuid": "1afdf816-513d-4cda-b0c3-03ab927608b6"}
{"doc_id": "2025__Repetitive_negative_thinking_self-reflection_and_perceived_cognitive_dysfunction__W4413050772", "source_path": "<redacted:source_path>", "chunk_id": 12, "source_chunk_idxs": [17], "num_tokens": 434, "text": "Repetitive negative thinking, self-reflection, and perceived cognitive dysfunction in older adults: a cross-sectional study\nDiscussion\nWhile our hypothesis was not completely substantiated, the findings align to an extent with previous research that has highlighted the role of depression as a psychological risk factor for dementia. Importantly, this study expands on previous work by examining the association between RNT, reflection, and cognitive dysfunction, going beyond depression alone. Previous studies have suggested that RNT may be a potential pathway contributing to the increased risk of AD [\n10\n,\n11\n,\n12\n,\n13\n,\n14\n], while reflection could potentially serve as a protective factor against dementia [\n20\n]. The current study, however, found that reflection significantly explained the subjective cognitive dysfunction in addition to depression severity. One might argue that, given the strong link between depression and RNT, RNT may not independently account for cognitive impairment beyond depression, while reflection does. However, both reflection and RNT demonstrated a relatively strong correlation with depressive symptoms (reflection:\nr\n=.57,\np\nr\n=.65,\np\nS1\n), which highlights the distinctive role of reflection in subjective cognitive dysfunction. Although both RNT and reflection are forms of persistent and repetitive thoughts, the relationship between reflection, depressive symptoms, and cognitive dysfunction is less well-defined. Contradictory findings suggest that reflection does not always serve as an adaptive coping strategy [\n44\n,\n45\n]. This could suggest the existence of a threshold beyond which reflection ceases to be beneficial and begins to contribute to cognitive dysfunction. Another interpretation for this counterintuitive association between reflection and subjective cognitive dysfunction could be a self-preservation mechanism [\n46\n,\n47\n]. Individuals experiencing more pronounced subjective cognitive decline might engage more in reflection, stemming from a belief that active mental engagement and contemplative thoughts are essential to maintain cognitive function and daily activity [\n46\n]. Additionally, it is possible that older adults with subjective cognitive dysfunction might have a response bias towards reporting higher levels of reflection due to increased concern about their cognitive abilities [\n47\n]. However, the directionality of the relationship between reflection and cognitive dysfunction remains unclear due to this study's cross-sectional nature.", "doc_items_refs": ["#/texts/221", "#/texts/222", "#/texts/223", "#/texts/224", "#/texts/225", "#/texts/226", "#/texts/227", "#/texts/228", "#/texts/229", "#/texts/230", "#/texts/231", "#/texts/232", "#/texts/233", "#/texts/234", "#/texts/235", "#/texts/236", "#/texts/238", "#/texts/239", "#/texts/240", "#/texts/242", "#/texts/243", "#/texts/244", "#/texts/245", "#/texts/246", "#/texts/247", "#/texts/248", "#/texts/249", "#/texts/250", "#/texts/251", "#/texts/252", "#/texts/253", "#/texts/254", "#/texts/255"], "page_nos": [], "uuid": "442831a1-dc8d-4623-80b5-fda3e05a0ba7"}
{"doc_id": "2025__Repetitive_negative_thinking_self-reflection_and_perceived_cognitive_dysfunction__W4413050772", "source_path": "<redacted:source_path>", "chunk_id": 13, "source_chunk_idxs": [18], "num_tokens": 442, "text": "Repetitive negative thinking, self-reflection, and perceived cognitive dysfunction in older adults: a cross-sectional study\nDiscussion\nOur results highlight the importance of considering the specific subtypes of repetitive thinking when investigating its association with subjective cognitive dysfunction. Additionally, the study found that the effect of reflection on cognitive decline varies between female and male. This indicates that there may be divergent underlying mechanisms of dementia in different sexes. This finding is consistent with previous studies that have shown a higher risk of developing AD in female compared to male [\n48\n] and that the apolipoprotein E (APOE) genotype, the most significant known genetic risk factor for dementia, has a greater deleterious effect on hippocampus and memory performance in female than for male [\n49\n]. The findings of this study contribute to the understanding of potential risk factors and inform considerations for developing interventions aimed at supporting brain health and possibly delaying dementia symptoms.\nGiven that males appear to be more negatively influenced by RNT, interventions targeting maladaptive RNT, such as cognitive-behavioral therapy (CBT) or mindfulness-based cognitive therapy (MBCT), could be particularly effective in this group [\n50\n]. These interventions could focus on enhancing reflective capacities to promote adaptive reflection and reduce the detrimental effects of RNT. For females, the stronger association between depressive symptoms and cognitive dysfunction suggests that interventions targeting mood-related symptoms may be more beneficial for cognitive health [\n51\n]. Moreover, future research should investigate whether sex-specific interventions that take into account these cognitive styles can optimize treatment outcomes. For instance, incorporating elements of reflection training into existing therapeutic frameworks could be evaluated for its potential to enhance cognitive resilience, particularly in males [\n50\n].\nOverall, the findings of this study underscore the need to consider sex differences when designing and implementing cognitive health interventions. Tailoring interventions based on these differences could lead to more effective strategies for mitigating cognitive decline in older adults and enhancing quality of life. Furthermore, the results suggest that future studies should explore the complex interplay between cognitive styles, sex differences, and cognitive health across diverse populations and cultural contexts to develop a more comprehensive understanding of these relationships.", "doc_items_refs": ["#/texts/256", "#/texts/257", "#/texts/258", "#/texts/259", "#/texts/260", "#/texts/261", "#/texts/262", "#/texts/263", "#/texts/264", "#/texts/265", "#/texts/266", "#/texts/267", "#/texts/268"], "page_nos": [], "uuid": "f4cd4144-223e-4bd7-b926-5e224e423d9c"}
{"doc_id": "2025__Repetitive_negative_thinking_self-reflection_and_perceived_cognitive_dysfunction__W4413050772", "source_path": "<redacted:source_path>", "chunk_id": 14, "source_chunk_idxs": [19], "num_tokens": 368, "text": "Repetitive negative thinking, self-reflection, and perceived cognitive dysfunction in older adults: a cross-sectional study\nDiscussion\nAlthough the current findings are promising, there are limitations and future directions that should be discussed. Firstly, the data was originally collected to investigate hoarding disorders in Japanese older adults, and cognitive dysfunction was not the primary focus of the project. Cognitive function was measured via self-reported cognitive function inventories, which reflect participants' own perception of their cognitive functions compared to their past experiences and may be biased based on subjective experience and individual standard. Future studies need to control potential biases and implement objective measures of cognitive functions, such as the Mini Mental State Examination (MMSE) and Frontal Assessment Battery (FAB), which are commonly used to assess cognitive impairments, including those seen in dementia. Secondly, the participants in this study were recruited via e-mail invitation, which naturally excludes older adults who have no access to the internet or limited technology skills. Future replication should utilize traditional recruiting methods such as phone calls to ensure a more representative sample. Thirdly, the focus of this study was on past-oriented repetitive thinking. Since both rumination (past-oriented) and worry (future-oriented) are included in the transdiagnostic concept of RNT, the current findings cannot address whether and to what extent worry could explain cognitive function dysfunction in older adults. Future studies should include inventories targeting worry, such as the Penn State Worry Questionnaire, to explore this possibility. Fourth, the current study design was cross-sectional, which means that the directionality and causality between reflection and cognitive dysfunction remain uncertain. To establish a causal relationship, future research should incorporate experimental methods in its study design. Finally, it is important to note that the mean scores for depressive symptoms (PHQ-9: M =", "doc_items_refs": ["#/texts/269"], "page_nos": [], "uuid": "4f212fdf-ea64-41dc-b3bf-67867f875f2a"}
{"doc_id": "2025__Repetitive_negative_thinking_self-reflection_and_perceived_cognitive_dysfunction__W4413050772", "source_path": "<redacted:source_path>", "chunk_id": 15, "source_chunk_idxs": [20], "num_tokens": 288, "text": "Repetitive negative thinking, self-reflection, and perceived cognitive dysfunction in older adults: a cross-sectional study\nDiscussion\n1.64), RNT, and reflection in this sample were relatively low, indicating that the majority of participants did not exhibit clinical levels of depressive symptoms or maladaptive thinking patterns. While this could suggest that threshold effects (i.e., only high levels of depression or RNT contributing to cognitive dysfunction) are not relevant to our findings, it also highlights the sensitivity of our measures in detecting associations between cognitive styles and cognitive dysfunction even at subclinical levels. Furthermore, the relatively low levels of RNT and reflection suggest that even mild or moderate engagement in these cognitive styles can have detectable effects on cognitive health, underscoring the need to examine these relationships in populations with varying levels of cognitive styles and psychological symptoms. The current findings thus demonstrate that threshold effects may not fully explain the effect of brooding on cognitive dysfunction in this sample, as significant associations were observed despite the generally low levels of brooding and depressive symptoms. Future research should further explore this by including participants with a broader range of symptom severity to determine whether threshold effects or dose-response relationships are evident in more diverse samples. Overall, the results indicate that cognitive styles like RNT can exert an influence on cognitive function across a range of severity levels, highlighting the importance of early identification and intervention even before symptoms reach clinical thresholds.", "doc_items_refs": ["#/texts/269"], "page_nos": [], "uuid": "6a859468-4c72-4411-baaf-f8298361ebb1"}
{"doc_id": "2025__Repetitive_negative_thinking_self-reflection_and_perceived_cognitive_dysfunction__W4413050772", "source_path": "<redacted:source_path>", "chunk_id": 16, "source_chunk_idxs": [21], "num_tokens": 389, "text": "Repetitive negative thinking, self-reflection, and perceived cognitive dysfunction in older adults: a cross-sectional study\nDiscussion\nAn important area for further investigation is the influence of cultural differences on the relationship between repetitive thinking and cognitive health. Most existing research has been conducted in Western European and North American countries, which may limit the generalizability of these findings. Cultural values and norms can shape how individuals engage in RNT and reflection. Research suggests that people from collectivistic cultures, such as those in East Asian countries, may engage in these cognitive styles differently compared to those from individualistic cultures, such as Western European countries. For example, in Japan, both brooding and self-reflection were associated with a history of depression, indicating that these cognitive styles may not always have a protective effect [\n52\n]. Cross-cultural comparisons also show variability in how different cognitive and emotional regulation strategies are used. For instance, Korean individuals were found to engage in RNT more frequently than American individuals, while Americans reported higher levels of anger suppression. These differences suggest that culture can shape the expression and outcomes of these cognitive styles, potentially affecting mental health differently across populations [\n53\n]. These cultural differences indicate that the relationship between repetitive thinking and cognitive health may vary depending on cultural context. Therefore, future research should investigate how cultural norms shape the expression and outcomes of repetitive thinking. Such studies could provide a deeper understanding of how cognitive styles influence cognitive health across different populations and contribute to developing culturally sensitive interventions that effectively reduce cognitive dysfunction.\nIn conclusion, this study provides preliminary evidence for the unique association of reflection with cognitive dysfunction in older adults, while considering the role of depressive symptoms. These findings underscore the relevance of acknowledging and managing depressive symptoms and cognitive patterns as part of a comprehensive approach to maintain brain health. Future research should continue to explore the mechanisms underlying these associations and investigate interventions that target these risk factors for the prevention and treatment of cognitive dysfunctions in older adults.", "doc_items_refs": ["#/texts/270", "#/texts/271", "#/texts/272", "#/texts/273", "#/texts/274", "#/texts/275"], "page_nos": [], "uuid": "2abc65cc-1063-4c77-9375-366300c464ce"}
{"doc_id": "2025__Repetitive_negative_thinking_self-reflection_and_perceived_cognitive_dysfunction__W4413050772", "source_path": "<redacted:source_path>", "chunk_id": 17, "source_chunk_idxs": [22, 23], "num_tokens": 184, "text": "Repetitive negative thinking, self-reflection, and perceived cognitive dysfunction in older adults: a cross-sectional study\nData availability\nAll data, analytic code, and research materials are available upon request from Dr. Xi Ren.\n\nRepetitive negative thinking, self-reflection, and perceived cognitive dysfunction in older adults: a cross-sectional study\nAbbreviations\nRNT:\nRepetitive negative thinking\nRRS:\nRumination response scale\nRRS-B:\nRuminative response scale brooding subscale\nRRS-R:\nRuminative response scale reflection subscale\nAD:\nAlzheimer's disease\nPET:\nPositron emission tomography\nIRB:\nInstitutional review board\nPHQ-9:\nPatient health questionnaire-9\nSDC:\nSelf-administered dementia checklist\nAPOE:\nApolipoprotein E\nCBT:\nCognitive-behavioral therapy\nMBCT:\nMindfulness-based cognitive therapy\nMMSE:\nMini mental state examination\nFAB:\nFrontal assessment battery", "doc_items_refs": ["#/texts/277", "#/texts/279", "#/texts/280", "#/texts/281", "#/texts/282", "#/texts/283", "#/texts/284", "#/texts/285", "#/texts/286", "#/texts/287", "#/texts/288", "#/texts/289", "#/texts/290", "#/texts/291", "#/texts/292", "#/texts/293", "#/texts/294", "#/texts/295", "#/texts/296", "#/texts/297", "#/texts/298", "#/texts/299", "#/texts/300", "#/texts/301", "#/texts/302", "#/texts/303", "#/texts/304", "#/texts/305", "#/texts/306"], "page_nos": [], "uuid": "5d8325a4-426a-4d3f-a86c-3750b3acca3c"}
{"doc_id": "2025__Repetitive_negative_thinking_self-reflection_and_perceived_cognitive_dysfunction__W4413050772", "source_path": "<redacted:source_path>", "chunk_id": 18, "source_chunk_idxs": [24], "num_tokens": 476, "text": "Repetitive negative thinking, self-reflection, and perceived cognitive dysfunction in older adults: a cross-sectional study\nReferences\n1. Ding C, Wu Y, Chen X, Chen Y, Wu Z, Lin Z, et al. Global, regional, and National burden and attributable risk factors of neurological disorders: the global burden of disease study 1990-2019. Front Public Health. 2022;10:952161.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n2. Beshir SA, Hussain N, Menon VB, Al Haddad AH, Al Zeer RAK, Elnour AA. Advancements and challenges in antiamyloid therapy for alzheimer's disease: A comprehensive review. Int J Alzheimer's Disease. 2024;2024(1):2052142.\nArticle\nGoogle Scholar\n3. Jönsson L, Wimo A. Amyloid-targeting new therapies for alzheimer's disease: A health economics perspective. J Prev Alzheimer's Disease. 2023;10(3):349-52.\nArticle\nGoogle Scholar\n4. Volloch V, Rits-Volloch S. Effect of Lecanemab and Donanemab in early alzheimer's disease: mechanistic interpretation in the amyloid cascade hypothesis 2.0 perspective. J Alzheimers Dis. 2023;93(4):1277-84.\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n5. Mahase E. Lecanemab trial finds slight slowing of cognitive decline, but clinical benefits are uncertain. British Medical Journal Publishing Group; 2022.\n6. Watkins ER. Constructive and unconstructive repetitive thought. Psychol Bull. 2008;134(2):163-206.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n7. Kaplan DM, Palitsky R, Carey AL, Crane TE, Havens CM, Medrano MR, et al. Maladaptive repetitive thought as a transdiagnostic phenomenon and treatment target: an integrative review. J Clin Psychol. 2018;74(7):1126-36.\nArticle\nPubMed\nGoogle Scholar\n8. Baars BJ. Spontaneous repetitive thoughts can be adaptive: postscript on Mind wandering. Psychol Bull. 2010;136(2):208.\nArticle\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/308", "#/texts/309", "#/texts/310", "#/texts/311", "#/texts/312", "#/texts/313", "#/texts/314", "#/texts/315"], "page_nos": [], "uuid": "e83f2cfe-acd6-41bf-8b06-6183caa99f02"}
{"doc_id": "2025__Repetitive_negative_thinking_self-reflection_and_perceived_cognitive_dysfunction__W4413050772", "source_path": "<redacted:source_path>", "chunk_id": 19, "source_chunk_idxs": [25], "num_tokens": 464, "text": "Repetitive negative thinking, self-reflection, and perceived cognitive dysfunction in older adults: a cross-sectional study\nReferences\n9. Harvey AG, Watkins E, Mansell W. Cognitive behavioural processes across psychological disorders: A transdiagnostic approach to research and treatment. Oxford University Press, USA; 2004.\n10. Watkins E, Teasdale JD. Adaptive and maladaptive self-focus in depression. J Affect Disord. 2004;82(1):1-8.\nArticle\nPubMed\nGoogle Scholar\n11. Watkins E, Teasdale JD. Rumination and overgeneral memory in depression: effects of self-focus and analytic thinking. J Abnorm Psychol. 2001;110(2):353.\nArticle\nCAS\nPubMed\nGoogle Scholar\n12. Whitmer AJ, Gotlib IH. An attentional scope model of rumination. Psychol Bull. 2013;139(5):1036.\nArticle\nPubMed\nGoogle Scholar\n13. Exner C, Martin V, Rief W. Self-focused ruminations and memory deficits in obsessive-compulsive disorder. Cogn Therapy Res. 2009;33:163-74.\nArticle\nGoogle Scholar\n14. Davis RN, Nolen-Hoeksema S. Cognitive inflexibility among ruminators and nonruminators. Cogn Therapy Res. 2000;24:699-711.\nArticle\nGoogle Scholar\n15. Schlosser M, Demnitz-King H, Whitfield T, Wirth M, Marchant NL. Repetitive negative thinking is associated with subjective cognitive decline in older adults: a cross-sectional study. BMC Psychiatry. 2020;20:1-10.\nArticle\nGoogle Scholar\n16. Sharp PB, Miller GA, Heller W. Transdiagnostic dimensions of anxiety: neural mechanisms, executive functions, and new directions. Int J Psychophysiol. 2015;98(2):365-77.\nArticle\nPubMed\nGoogle Scholar\n17. Zainal NH, Newman MG. Executive functioning constructs in anxiety, obsessive-compulsive, post-traumatic stress, and related disorders. Curr Psychiatry Rep. 2022;24(12):871-80.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/316", "#/texts/317", "#/texts/318", "#/texts/319", "#/texts/320", "#/texts/321", "#/texts/322", "#/texts/323", "#/texts/324"], "page_nos": [], "uuid": "5c56a233-d06d-491f-8904-73e394aab18f"}
{"doc_id": "2025__Repetitive_negative_thinking_self-reflection_and_perceived_cognitive_dysfunction__W4413050772", "source_path": "<redacted:source_path>", "chunk_id": 20, "source_chunk_idxs": [26], "num_tokens": 489, "text": "Repetitive negative thinking, self-reflection, and perceived cognitive dysfunction in older adults: a cross-sectional study\nReferences\n18. Marchant NL, Lovland LR, Jones R, Pichet Binette A, Gonneaud J, Arenaza-Urquijo EM, et al. Repetitive negative thinking is associated with amyloid, tau, and cognitive decline. Alzheimer's Dement. 2020;16(7):1054-64.\nArticle\nGoogle Scholar\n19. Pan Z, Park C, Brietzke E, Zuckerman H, Rong C, Mansur RB, et al. Cognitive impairment in major depressive disorder. CNS Spectr. 2019;24(1):22-9.\nArticle\nPubMed\nGoogle Scholar\n20. Demnitz-King H, Gonneaud J, Klimecki OM, Chocat A, Collette F, Dautricourt S, et al. Association of self-reflection with cognition and brain health in cognitively unimpaired older adults. Neurology. 2022;99(13):e1422-31.\nArticle\nCAS\nPubMed\nGoogle Scholar\n21. Nolen-Hoeksema S, Morrow J. A prospective study of depression and posttraumatic stress symptoms after a natural disaster: the 1989 Loma Prieta earthquake. J Personal Soc Psychol. 1991;61(1):115.\nArticle\nCAS\nGoogle Scholar\n22. Treynor W, Gonzalez R, Nolen-Hoeksema S. Rumination reconsidered: A psychometric analysis. Cogn Therapy Res. 2003;27:247-59.\nArticle\nGoogle Scholar\n23. Demnitz-King H, Whitfield T, Schlosser M, Barnhofer T, Collette F, Klimecki O et al. Reflective pondering is associated with a global cognitive marker of Alzheimer's disease risk: Neuropsychiatry and behavioral neurology: The neuropsychiatry of subjective cognitive disorder and prodromal AD. Alzheimer's &amp; Dementia. 2020;16:e042084.\n24. Nowlan JS, Wuthrich VM, Rapee RM. Positive reappraisal in older adults: a systematic literature review. Aging Ment Health. 2015;19(6):475-84.\nArticle\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/325", "#/texts/326", "#/texts/327", "#/texts/328", "#/texts/329", "#/texts/330", "#/texts/331"], "page_nos": [], "uuid": "69af77fb-5a6d-42ab-98fa-53d6186f6b16"}
{"doc_id": "2025__Repetitive_negative_thinking_self-reflection_and_perceived_cognitive_dysfunction__W4413050772", "source_path": "<redacted:source_path>", "chunk_id": 21, "source_chunk_idxs": [27], "num_tokens": 479, "text": "Repetitive negative thinking, self-reflection, and perceived cognitive dysfunction in older adults: a cross-sectional study\nReferences\n25. Nguyen L, Murphy K, Andrews G. Cognitive and neural plasticity in old age: A systematic review of evidence from executive functions cognitive training. Ageing Res Rev. 2019;53:100912.\nArticle\nPubMed\nGoogle Scholar\n26. Vance DE, Roberson AJ, McGuinness TM, Fazeli PL. How neuroplasticity and cognitive reserve: protect cognitive functioning. J PsychoSoc Nurs Ment Health Serv. 2010;48(4):23-30.\nArticle\nPubMed\nGoogle Scholar\n27. Hsu KJ, Davison GC. Compounded deficits: the association between neuropsychological impairment and attention biases in currently depressed, formerly depressed, and never depressed individuals. Clin Psychol Sci. 2017;5(2):286-98.\nArticle\nGoogle Scholar\n28. Espinosa F, Martin-Romero N, Sanchez-Lopez A. Repetitive negative thinking processes account for gender differences in depression and anxiety during adolescence. Int J Cogn Therapy. 2022;15(2):115-33.\nArticle\nGoogle Scholar\n29. Graham BM, Weiner S, Li SH. Gender differences in avoidance and repetitive negative thinking following symptom provocation in men and women with spider phobia. Wiley Online Library; 2020. pp. 565-77.\n30. Ancelin M-L, Ripoche E, Dupuy A-M, Samieri C, Rouaud O, Berr C, et al. Gender-specific associations between lipids and cognitive decline in the elderly. Eur Neuropsychopharmacol. 2014;24(7):1056-66.\nArticle\nCAS\nPubMed\nGoogle Scholar\n31. Podcasy JL, Epperson CN. Considering sex and gender in Alzheimer disease and other dementias. Dialogues in clinical neuroscience. 2022.\n32. Levine DA, Gross AL, Briceño EM, Tilton N, Giordani BJ, Sussman JB, et al. Sex differences in cognitive decline among US adults. JAMA Netw Open. 2021;4(2):e210169-e.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/332", "#/texts/333", "#/texts/334", "#/texts/335", "#/texts/336", "#/texts/337", "#/texts/338", "#/texts/339"], "page_nos": [], "uuid": "4336eb26-2894-47bb-8e93-8cc09a6dcb7b"}
{"doc_id": "2025__Repetitive_negative_thinking_self-reflection_and_perceived_cognitive_dysfunction__W4413050772", "source_path": "<redacted:source_path>", "chunk_id": 22, "source_chunk_idxs": [28], "num_tokens": 478, "text": "Repetitive negative thinking, self-reflection, and perceived cognitive dysfunction in older adults: a cross-sectional study\nReferences\n33. Nooyens AC, Wijnhoven HA, Schaap LS, Sialino LD, Kok AA, Visser M, et al. Sex differences in cognitive functioning with aging in the Netherlands. Gerontology. 2022;68(9):999-1009.\nArticle\nCAS\nPubMed\nGoogle Scholar\n34. Csank PA, Conway M. Engaging in self-reflection changes self-concept clarity: on differences between women and men, and low-and high-clarity individuals. Sex Roles. 2004;50:469-80.\nArticle\nGoogle Scholar\n35. Tsuchiyagaito A, Aoki S, Cochran G, Kawanori Y, Horiuchi S. Hard to let it go: repetitive negative thinking and hoarding in later life in Japan. Aging Ment Health. 2023;8:1-9.\nGoogle Scholar\n36. Faul F, Erdfelder E, Buchner A, Lang A-G. Statistical power analyses using G* power 3.1: tests for correlation and regression analyses. Behav Res Methods. 2009;41(4):1149-60.\nArticle\nPubMed\nGoogle Scholar\n37. Kroenke K, Spitzer RL, Williams JB. The PHQ-9: validity of a brief depression severity measure. J Gen Intern Med. 2001;16(9):606-13.\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n38. Muramatsu K, Miyaoka H, Kamijima K, Muramatsu Y, Tanaka Y, Hosaka M, et al. Performance of the Japanese version of the patient health Questionnaire-9 (J-PHQ-9) for depression in primary care. Gen Hosp Psychiatry. 2018;52:64-9.\nArticle\nPubMed\nGoogle Scholar\n39. Muramatsu K, Kamijima K, Yoshida M, Otsubo T, Miyaoka H, Muramatsu Y, et al. The patient health questionnaire, Japanese version: validity according to the mini-international neuropsychiatric interview-plus. Psychol Rep. 2007;101(3):952-60.\nArticle\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/340", "#/texts/341", "#/texts/342", "#/texts/343", "#/texts/344", "#/texts/345", "#/texts/346"], "page_nos": [], "uuid": "4b5e9dba-fcc7-40fb-a5a0-5fe1616dd0dc"}
{"doc_id": "2025__Repetitive_negative_thinking_self-reflection_and_perceived_cognitive_dysfunction__W4413050772", "source_path": "<redacted:source_path>", "chunk_id": 23, "source_chunk_idxs": [29], "num_tokens": 495, "text": "Repetitive negative thinking, self-reflection, and perceived cognitive dysfunction in older adults: a cross-sectional study\nReferences\n40. Hasegawa A. Translation and initial validation of the Japanese version of the ruminative responses scale. Psychol Rep. 2013;112(3):716-26.\nArticle\nPubMed\nGoogle Scholar\n41. Miyamae F, Ura C, Sakuma N, Niikawa H, Inagaki H, Ijuin M, et al. The development of a self-administered dementia checklist: the examination of concurrent validity and discriminant validity. Nihon Ronen Igakkai Zasshi Japanese J Geriatr. 2016;53(4):354-62.\nArticle\nGoogle Scholar\n42. Macedo A, Marques M, Pereira AT. Perfectionism and psychological distress: A review of the cognitive factors. Int J Clin Neurosciences Mental Health. 2014;1(6):1-10.\nGoogle Scholar\n43. Zainal NH, Newman MG. Elevated anxious and depressed mood relates to future executive dysfunction in older adults: a longitudinal network analysis of psychopathology and cognitive functioning. Clin Psychol Sci. 2023;11(2):218-38.\nArticle\nPubMed\nGoogle Scholar\n44. Rude SS, Little Maestas K, Neff K. Paying attention to distress: what's wrong with rumination? Cogn Emot. 2007;21(4):843-64.\nArticle\nGoogle Scholar\n45. McEvoy PM, Brans S. Common versus unique variance across measures of worry and rumination: predictive utility and mediational models for anxiety and depression. Cogn Therapy Res. 2013;37(1):183-96.\nArticle\nGoogle Scholar\n46. Jenkins A, Tree J, Tales A. Distinct profile differences in subjective cognitive decline in the general public are associated with metacognition, negative affective symptoms, neuroticism, stress, and poor quality of life. J Alzheimers Dis. 2021;80(3):1231-42.\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n47. Tassoni MB, Giovannetti T. A-15 elucidating patterns of naturalistic behavior in those with Self-Reported functional cognitive decline. Arch Clin Neuropsychol. 2023;38(7):1176.\nArticle\nGoogle Scholar", "doc_items_refs": ["#/texts/347", "#/texts/348", "#/texts/349", "#/texts/350", "#/texts/351", "#/texts/352", "#/texts/353", "#/texts/354"], "page_nos": [], "uuid": "c97ac215-ac99-4c4a-a900-19b572f995b5"}
{"doc_id": "2025__Repetitive_negative_thinking_self-reflection_and_perceived_cognitive_dysfunction__W4413050772", "source_path": "<redacted:source_path>", "chunk_id": 24, "source_chunk_idxs": [30], "num_tokens": 360, "text": "Repetitive negative thinking, self-reflection, and perceived cognitive dysfunction in older adults: a cross-sectional study\nReferences\n48. Azad NA, Al Bugami M, Loy-English I. Gender differences in dementia risk factors. Gend Med. 2007;4(2):120-9.\nArticle\nPubMed\nGoogle Scholar\n49. Fleisher A, Grundman M, Jack CR, Petersen RC, Taylor C, Kim HT, et al. Sex, Apolipoprotein E ε4 status, and hippocampal volume in mild cognitive impairment. Arch Neurol. 2005;62(6):953-7.\nArticle\nPubMed\nGoogle Scholar\n50. Watkins ER. Depressive rumination: investigating mechanisms to improve cognitive behavioural treatments. Cogn Behav Ther. 2009;38(S1):8-14.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n51. Forsell Y, Jorm AF, Winblad B. Association of age, sex, cognitive dysfunction, and disability with major depressive symptoms in an elderly sample. Am J Psychiatry. 1994;151(11):1600-4.\nArticle\nCAS\nPubMed\nGoogle Scholar\n52. Hasegawa A, Koda M, Hattori Y, Kondo T, Kawaguchi J. Depressive rumination and past depression in Japanese university students: comparison of brooding and reflection. Psychol Rep. 2014;114(3):653-74.\nArticle\nPubMed\nGoogle Scholar\n53. Kwon H, Yoon KL, Joormann J, Kwon J-H. Cultural and gender differences in emotion regulation: relation to depression. Cognition Emot. 2013;27(5):769-82.\nArticle\nGoogle Scholar\nDownload references", "doc_items_refs": ["#/texts/355", "#/texts/356", "#/texts/357", "#/texts/358", "#/texts/359", "#/texts/360", "#/texts/361"], "page_nos": [], "uuid": "bfc1f80a-9fd8-4ac9-a55d-2878279743f6"}
{"doc_id": "2025__Repetitive_negative_thinking_self-reflection_and_perceived_cognitive_dysfunction__W4413050772", "source_path": "<redacted:source_path>", "chunk_id": 25, "source_chunk_idxs": [31, 32, 33], "num_tokens": 340, "text": "Repetitive negative thinking, self-reflection, and perceived cognitive dysfunction in older adults: a cross-sectional study\nAcknowledgements\nWe would like to express our appreciation to Yoshiya Kawanori, Doho University Nagoya, Japan, for the funding acquisition and data sharing.\n\nRepetitive negative thinking, self-reflection, and perceived cognitive dysfunction in older adults: a cross-sectional study\nFunding\nThis study was supported by LIBR, NIGMS (2P20GM121312-06) and the JSPS KAKENHI (Grant Number 18K03102).\n\nRepetitive negative thinking, self-reflection, and perceived cognitive dysfunction in older adults: a cross-sectional study\nAuthor information\nAuthors and Affiliations\n1. Laureate Institute for Brain Research, 6655 South Yale Ave. Tulsa, Tulsa, OK, 74136, USA Xi Ren, Landon Edwards, Eric Mann &amp; Aki Tsuchiyagaito\n2. Department of Social and Clinical Psychology, Hijiyama University, Hiroshima, Japan Satoshi Horiuchi\n3. Oxley College of Health Sciences, The University of Tulsa, Tulsa, OK, USA Aki Tsuchiyagaito\n4. Research Center for Child Mental Development, Chiba University, Chiba, Japan Aki Tsuchiyagaito\nAuthors\n1. Xi Ren\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n2. Landon Edwards\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n3. Eric Mann\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n4. Satoshi Horiuchi\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n5. Aki Tsuchiyagaito\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/363", "#/texts/365", "#/texts/368", "#/texts/369", "#/texts/370", "#/texts/371", "#/texts/372", "#/texts/373", "#/texts/374", "#/texts/375", "#/texts/376", "#/texts/377"], "page_nos": [], "uuid": "b6f08b65-49df-4b64-ad55-7f18a85cbb6c"}
{"doc_id": "2025__Repetitive_negative_thinking_self-reflection_and_perceived_cognitive_dysfunction__W4413050772", "source_path": "<redacted:source_path>", "chunk_id": 26, "source_chunk_idxs": [34, 35, 36, 37, 38, 39], "num_tokens": 280, "text": "Repetitive negative thinking, self-reflection, and perceived cognitive dysfunction in older adults: a cross-sectional study\nAuthor information\nContributions\nConceptualization and and data interpretation: XR and AT. Data analyses and original manuscript draft: XR. Experimental Design and data collection: SH. All authors revised and reviewed the manuscript.\n\nRepetitive negative thinking, self-reflection, and perceived cognitive dysfunction in older adults: a cross-sectional study\nAuthor information\nCorresponding author\nCorrespondence to\nXi Ren\n.\n\nRepetitive negative thinking, self-reflection, and perceived cognitive dysfunction in older adults: a cross-sectional study\nEthics declarations\nEthics approval and consent to participate\nThe study protocol was reviewed and approved by the Iwate Prefectural University Institutional Review Board (IRB) [IRB Tracking Number. 356], and this study was conducted in accordance with the Helsinki Declaration. All participants provided online informed consent.\n\nRepetitive negative thinking, self-reflection, and perceived cognitive dysfunction in older adults: a cross-sectional study\nEthics declarations\nConsent for publication\nNot applicable.\n\nRepetitive negative thinking, self-reflection, and perceived cognitive dysfunction in older adults: a cross-sectional study\nEthics declarations\nCompeting interests\nThe authors declare no competing interests.\n\nRepetitive negative thinking, self-reflection, and perceived cognitive dysfunction in older adults: a cross-sectional study\nAdditional information\nPublisher's note\nSpringer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations.", "doc_items_refs": ["#/texts/379", "#/texts/381", "#/texts/382", "#/texts/383", "#/texts/386", "#/texts/388", "#/texts/390", "#/texts/393"], "page_nos": [], "uuid": "3f0bd2b9-8e95-47e6-b84d-99c2ebb5fdb4"}
{"doc_id": "2025__Repetitive_negative_thinking_self-reflection_and_perceived_cognitive_dysfunction__W4413050772", "source_path": "<redacted:source_path>", "chunk_id": 27, "source_chunk_idxs": [40, 41], "num_tokens": 274, "text": "Repetitive negative thinking, self-reflection, and perceived cognitive dysfunction in older adults: a cross-sectional study\nSupplementary Information\nBelow is the link to the electronic supplementary material.\n\nRepetitive negative thinking, self-reflection, and perceived cognitive dysfunction in older adults: a cross-sectional study\nRights and permissions\nOpen Access\nThis article is licensed under a Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International License, which permits any non-commercial use, sharing, distribution and reproduction in any medium or format, as long as you give appropriate credit to the original author(s) and the source, provide a link to the Creative Commons licence, and indicate if you modified the licensed material. You do not have permission under this licence to share adapted material derived from this article or parts of it. The images or other third party material in this article are included in the article's Creative Commons licence, unless indicated otherwise in a credit line to the material. If material is not included in the article's Creative Commons licence and your intended use is not permitted by statutory regulation or exceeds the permitted use, you will need to obtain permission directly from the copyright holder. To view a copy of this licence, visit\nhttp://creativecommons.org/licenses/by-nc-nd/4.0/\n.\nReprints and permissions", "doc_items_refs": ["#/texts/395", "#/texts/398", "#/texts/399", "#/texts/400", "#/texts/401", "#/texts/402"], "page_nos": [], "uuid": "5687b169-6412-43f8-8915-7de3300dcad5"}
{"doc_id": "2025__Repetitive_negative_thinking_self-reflection_and_perceived_cognitive_dysfunction__W4413050772", "source_path": "<redacted:source_path>", "chunk_id": 28, "source_chunk_idxs": [42, 43, 44, 45], "num_tokens": 283, "text": "Repetitive negative thinking, self-reflection, and perceived cognitive dysfunction in older adults: a cross-sectional study\nAbout this article\nCite this article\nRen, X., Edwards, L., Mann, E.\net al.\nRepetitive negative thinking, self-reflection, and perceived cognitive dysfunction in older adults: a cross-sectional study.\nBMC Psychiatry\n25\n, 773 (2025). https://doi.org/10.1186/s12888-025-07225-0\nDownload citation\n- Received : 11 January 2024\n- Accepted : 18 July 2025\n- Published : 07 August 2025\n- DOI : https://doi.org/10.1186/s12888-025-07225-0\n\nRepetitive negative thinking, self-reflection, and perceived cognitive dysfunction in older adults: a cross-sectional study\nAbout this article\nKeywords\n- Repetitive negative thinking\n- Self-reflection\n- Depression\n- Cognitive dysfunction\n- Older adults\nDownload PDF\nAdvertisement\n\nRepetitive negative thinking, self-reflection, and perceived cognitive dysfunction in older adults: a cross-sectional study\nAbout this article\nKeywords\nBMC Psychiatry\nISSN: 1471-244X\n\nRepetitive negative thinking, self-reflection, and perceived cognitive dysfunction in older adults: a cross-sectional study\nAbout this article\nKeywords\nContact us\n- General enquiries:\njournalsubmissions@springernature.com", "doc_items_refs": ["#/texts/405", "#/texts/406", "#/texts/407", "#/texts/408", "#/texts/409", "#/texts/410", "#/texts/411", "#/texts/412", "#/texts/413", "#/texts/414", "#/texts/415", "#/texts/417", "#/texts/418", "#/texts/419", "#/texts/420", "#/texts/421", "#/texts/422", "#/texts/423", "#/texts/425", "#/texts/427"], "page_nos": [], "uuid": "f77a521b-b810-415e-8c4b-d7a22f2d64ff"}
