{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 0, "source_chunk_idxs": [0], "num_tokens": 176, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease | Nature Aging\nSkip to main content\nThank you for visiting nature.com. You are using a browser version with limited support for CSS. To obtain\nthe best experience, we recommend you use a more up to date browser (or turn off compatibility mode in\nInternet Explorer). In the meantime, to ensure continued support, we are displaying the site without styles\nand JavaScript.\nAdvertisement\n- View all journals\n- Search\n- Log in\n- Content Explore content\n- About the journal\n- Publish with us\n- Sign up for alerts\n- RSS feed\n1. nature\n2. nature aging\n3. technical reports\n4. article\nDunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nDownload PDF\nDownload PDF\n- Technical Report\n- Open access\n- Published: 01 July 2025", "doc_items_refs": ["#/texts/1", "#/texts/2", "#/texts/3", "#/texts/4", "#/texts/5", "#/texts/6", "#/texts/7", "#/texts/8", "#/texts/9", "#/texts/10", "#/texts/11", "#/texts/12", "#/texts/13", "#/texts/14", "#/texts/15", "#/texts/16", "#/texts/17", "#/texts/18", "#/texts/19", "#/texts/20", "#/texts/21", "#/texts/22", "#/texts/23", "#/texts/24"], "page_nos": [], "uuid": "b3f9dbf2-73d7-4503-84cb-441b841d1158"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 1, "source_chunk_idxs": [1], "num_tokens": 358, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\n- Ethan T. Whitman\nORCID: orcid.org/0000-0002-3208-171X\n1\nna1\n,\n- Maxwell L. Elliott\nORCID: orcid.org/0000-0003-1083-6277\n2\nna1\n,\n- Annchen R. Knodt\nORCID: orcid.org/0000-0001-6501-8947\n1\n,\n- Wickliffe C. Abraham\n3\n,\n- Tim J. Anderson\nORCID: orcid.org/0000-0002-1116-3839\n4\n,\n5\n,\n6\n,\n- Nicholas J. Cutfield\n7\n,\n- Sean Hogan\n8\n,\n- David Ireland\n8\n,\n- Tracy R. Melzer\nORCID: orcid.org/0000-0003-0621-212X\n4\n,\n5\n,\n9\n,\n10\n,\n- Sandhya Ramrakha\n8\n,\n- Karen Sugden\n1\n,\n- Reremoana Theodore\n8\n,\n- Benjamin S. Williams\n1\n,\n- Avshalom Caspi\nORCID: orcid.org/0000-0003-0082-4600\n1\n,\n11\n,\n12\n,\n13\n,\n- Terrie E. Moffitt\n1\n,\n11\n,\n12\n,\n13\n&amp;\n- ...\n- Ahmad R. Hariri\nORCID: orcid.org/0000-0003-3052-9880\n1\nShow authors\nNature Aging\nvolume 5\n, pages 1619-1636 ( 2025 )\nCite this article\n- 43k Accesses\n- 3 Citations\n- 1005 Altmetric\n- Metrics details", "doc_items_refs": ["#/texts/26", "#/texts/27", "#/texts/28", "#/texts/29", "#/texts/30", "#/texts/31", "#/texts/32", "#/texts/33", "#/texts/34", "#/texts/35", "#/texts/36", "#/texts/37", "#/texts/38", "#/texts/39", "#/texts/40", "#/texts/41", "#/texts/42", "#/texts/43", "#/texts/44", "#/texts/45", "#/texts/46", "#/texts/47", "#/texts/48", "#/texts/49", "#/texts/50", "#/texts/51"], "page_nos": [], "uuid": "4c6eca54-d77b-498e-a355-57fddacd6054"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 2, "source_chunk_idxs": [2, 3, 4, 5, 6], "num_tokens": 394, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nSubjects\n- Neural ageing\n- Predictive markers\nThis article has been\nupdated\n\nDunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nAbstract\nTo understand how aging affects functional decline and increases disease risk, it is necessary to develop measures of how fast a person is aging. Using data from the Dunedin Study, we introduce an accurate and reliable measure for the rate of longitudinal aging derived from cross-sectional brain magnetic resonance imaging, that is, the Dunedin Pace of Aging Calculated from NeuroImaging (DunedinPACNI). Exporting this measure to the Alzheimer's Disease Neuroimaging Initiative, UK Biobank and BrainLat datasets revealed that faster DunedinPACNI predicted cognitive impairment, accelerated brain atrophy and conversion to diagnosed dementia. Faster DunedinPACNI also predicted physical frailty, poor health, future chronic diseases and mortality in older adults. When compared to brain age gap, DunedinPACNI was similarly or more strongly related to clinical outcomes. DunedinPACNI is a next-generation brain magnetic resonance imaging biomarker that can help researchers explore aging effects on health outcomes and evaluate the effectiveness of antiaging strategies.\n\nDunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nAbstract\nBrain change trajectories in healthy adults correlate with Alzheimer's related genetic variation and memory decline across life\nArticle\nOpen access\n17 December 2024\n\nDunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nAbstract\nDisparities in the pace of biological aging among midlife adults of the same chronological age have implications for future frailty risk and policy\nArticle\n15 March 2021\n\nDunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nAbstract\nBrain aging patterns in a large and diverse cohort of 49,482 individuals\nArticle\n15 August 2024", "doc_items_refs": ["#/texts/53", "#/texts/54", "#/texts/55", "#/texts/56", "#/texts/58", "#/texts/61", "#/texts/62", "#/texts/63", "#/texts/65", "#/texts/66", "#/texts/68", "#/texts/69"], "page_nos": [], "uuid": "d812fbe4-13f5-4636-afd5-527270cd791a"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 3, "source_chunk_idxs": [7], "num_tokens": 294, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nMain\nAging is the gradual, progressive and correlated decline of multiple organ systems over decades. Longitudinal studies provide evidence for substantial individual variation in the rate of aging; people born in the same year can age slower or faster than their peers\n1\n,\n2\n,\n3\n. Furthermore, aging itself is increasingly regarded as a potentially preventable cause of chronic disease. Accordingly, accurate and reliable measures of how fast a person is aging are needed to effectively study how individual variation in the rate of aging contributes to disease risk and to evaluate interventions intended to slow aging before irreversible decline\n4\n,\n5\n,\n6\n,\n7\n,\n8\n.\nAge-sensitive alterations in DNA methylation, referred to as epigenetic clocks, are currently the most widely used measures for estimating individual differences in aging\n4\n,\n9\n,\n10\n. First-generation epigenetic clocks were trained on chronological age\n11\n,\n12\n, but the more precisely they predicted chronological age, the less well they predicted clinical outcomes\n13\n,\n14\n. In response, second-generation clocks were trained on measures of health that predict mortality in older people\n15\n,\n16\n,\n17\n. However, these clocks were trained on cross-sectional phenotypes in multiage samples, not on longitudinal observations of the same person as recommended in geroscience\n5\n,\n18\n. This limitation led to the development of a third-generation longitudinal approach to measuring aging.", "doc_items_refs": ["#/texts/71", "#/texts/72", "#/texts/73", "#/texts/74", "#/texts/75", "#/texts/76", "#/texts/77", "#/texts/78", "#/texts/79", "#/texts/80", "#/texts/81", "#/texts/82", "#/texts/83", "#/texts/84", "#/texts/85", "#/texts/86", "#/texts/87", "#/texts/88", "#/texts/89", "#/texts/90", "#/texts/91", "#/texts/92", "#/texts/93", "#/texts/94", "#/texts/95", "#/texts/96", "#/texts/97", "#/texts/98", "#/texts/99", "#/texts/100", "#/texts/101", "#/texts/102", "#/texts/103", "#/texts/104", "#/texts/105", "#/texts/106", "#/texts/107", "#/texts/108", "#/texts/109", "#/texts/110", "#/texts/111", "#/texts/112"], "page_nos": [], "uuid": "780a0a1a-4018-4070-9e32-f5d3462cc656"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 4, "source_chunk_idxs": [8], "num_tokens": 438, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nMain\nWe previously adopted this longitudinal approach in the Dunedin Study, which has followed a population representative sample of 1,037 people born in the same year (1972-1973) from birth to age 45 (ref.\n19\n). Across two decades (ages = 26, 32, 38 and 45 years), we repeatedly measured 19 biomarkers of cardiovascular, metabolic, renal, immune, dental and pulmonary functioning. By averaging the decline in the trajectories of these biomarkers, we operationalized the theoretical construct of biological aging into a specific measure that we called the Pace of Aging\n2\n. We subsequently developed an epigenetic clock that accurately and reliably estimates the Pace of Aging: the Dunedin Pace of Aging Calculated from the Epigenome (DunedinPACE)\n20\n. Because DunedinPACE is calculated from a single time point measurement of DNA methylation, it has been rapidly adopted by studies on aging, where it has been associated with signs of accelerated brain aging, morbidity and mortality\n20\n,\n21\n,\n22\n,\n23\n,\n24\n,\n25\n. However, it has not been possible to export DunedinPACE or other epigenetic clocks to studies lacking DNA methylation data. This includes many neuroimaging studies of brain aging and neurodegenerative diseases such as Alzheimer's disease (AD).\nCurrent neuroimaging-based approaches to measure aging, akin to first-generation epigenetic clocks, involve training models to predict chronological age from variability in magnetic resonance imaging (MRI) measures of brain structure in large multiage samples\n26\n,\n27\n,\n28\n,\n29\n,\n30\n. Researchers then typically quantify a brain age gap, which reflects the difference between a participant's predicted and actual chronological age. A positive brain age gap is interpreted as evidence of accelerated brain aging. As with first-generation epigenetic clocks, these age deviation approaches unavoidably mix model error (for example, historical differences in environmental exposures, survivor bias, disease effects, measurement bias) with a person's true rate of biological aging\n31\n,\n32\n,\n33\n.", "doc_items_refs": ["#/texts/113", "#/texts/114", "#/texts/115", "#/texts/116", "#/texts/117", "#/texts/118", "#/texts/119", "#/texts/120", "#/texts/121", "#/texts/122", "#/texts/123", "#/texts/124", "#/texts/125", "#/texts/126", "#/texts/127", "#/texts/128", "#/texts/129", "#/texts/130", "#/texts/131", "#/texts/132", "#/texts/133", "#/texts/134", "#/texts/135", "#/texts/136", "#/texts/137", "#/texts/138", "#/texts/139", "#/texts/140", "#/texts/141", "#/texts/142", "#/texts/143", "#/texts/144", "#/texts/145", "#/texts/146", "#/texts/147", "#/texts/148"], "page_nos": [], "uuid": "26653d3f-d48e-4a52-9b3b-8cc96a6117b7"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 5, "source_chunk_idxs": [9], "num_tokens": 322, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nMain\nIn this study, using a single T1-weighted MRI scan collected at age 45 in the Dunedin Study, we describe the development and validation of a brain MRI measure for the Pace of Aging (Fig.\n1a-c\n). We call this measure Dunedin Pace of Aging Calculated from NeuroImaging (DunedinPACNI). Using data from the Human Connectome Project (HCP), we evaluated the test-retest reliability of DunedinPACNI. Exporting the measure to the Alzheimer's Disease Neuroimaging Initiative (ADNI), UK Biobank (UKB) and Latin American Brain Health Institute (BrainLat) datasets, we conducted a series of preregistered analyses (\nhttps://rb.gy/b9x4u6\n) designed to evaluate the utility of DunedinPACNI for predicting multiple aging-related health outcomes (Fig.\n1d\n). To benchmark our findings, we compared the effect sizes for DunedinPACNI to those for brain age gap\n34\n. DunedinPACNI is a brain-based measure trained to directly estimate longitudinal aging of non-brain organ systems. Therefore, if DunedinPACNI indeed estimates individual differences in the rate of aging, it would add evidence for close links between brain integrity and whole-body aging and establish neuroimaging as a powerful tool for measuring aging, that is, not just of the brain but of the entire body\n35\n.\nFig. 1: Schematic overview of the study methods.", "doc_items_refs": ["#/texts/149", "#/texts/150", "#/texts/151", "#/texts/152", "#/texts/153", "#/texts/154", "#/texts/155", "#/texts/156", "#/texts/157", "#/texts/158", "#/texts/159", "#/texts/160"], "page_nos": [], "uuid": "6a2674a3-a554-4b6a-b8c3-317c2ef8c0e5"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 6, "source_chunk_idxs": [10], "num_tokens": 194, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nResults\nDunedinPACNI: a brain MRI measure of longitudinal aging\nWe trained an elastic net regression model to predict the longitudinal Pace of Aging measure using T1-weighted MRI scans collected in a subsample of 860 Dunedin Study members when they were 45 years old. This subsample maintains the population representativeness of the full cohort (Extended Data Figs.\n1\nand\n2\n). Specifically, the elastic net regression model used 315 MRI-derived structural measures for each study member, including regional cortical thickness (CT), surface area (SA), gray matter volume (GMV) and gray:white signal intensity ratio (GWR), as well as subcortical gray matter and ventricular volumes\n36\n. We performed tenfold cross-validation to identify the optimal tuning parameters\n37\n. This optimized model was used to create DunedinPACNI.", "doc_items_refs": ["#/texts/163", "#/texts/164", "#/texts/165", "#/texts/166", "#/texts/167", "#/texts/168", "#/texts/169", "#/texts/170", "#/texts/171"], "page_nos": [], "uuid": "f7bdb600-611b-48ee-ac6c-9f6c7646e63e"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 7, "source_chunk_idxs": [11], "num_tokens": 414, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nResults\nDunedinPACNI: a brain MRI measure of longitudinal aging\nThe in-sample correlation between DunedinPACNI and the longitudinal Pace of Aging was\nr\n= 0.60 (Fig.\n2a\n). We performed a cross-validation analysis by splitting the sample into training and testing subsets 100 different times. Each time, we used 90% of the sample for training and held out the remaining 10% for testing. Across all 100 different splits, the average correlation between DunedinPACNI and Pace of Aging in the testing sample was\nr\n= 0.42. This prediction accuracy is in line with next-generation epigenetic biomarkers of aging\n15\n,\n20\n,\n38\n. For both DunedinPACNI and the longitudinal Pace of Aging, higher scores indicate faster aging. Note that DunedinPACNI is a quantitative variable that indexes relative differences between people without clear units. For this reason, we restricted our interpretation to directional comparisons within studies. Associations between faster DunedinPACNI scores and measures of physical functioning, cognitive functioning and facial aging were similar to those previously observed with Pace of Aging\n2\n. In these analyses, we controlled for sex but not age because all Dunedin Study members have the same chronological age. The DunedinPACNI effect sizes for 12 of the 15 measures were within the 95% confidence intervals (CIs) of the original Pace of Aging (Fig.\n2b\n; full results in Supplementary Table\n1\n). This was expected given the high internal correlation between DunedinPACNI and Pace of Aging. Dunedin Study members with faster DunedinPACNI scores had worse balance, slower gait, weaker lower-body and upper-body strength, and poorer coordination; they also reported worse health and more physical limitations; performed more poorly on tests of cognitive functioning; experienced greater childhood-to-adulthood cognitive decline; and looked older. These results indicate that DunedinPACNI accurately estimates the longitudinal Pace of Aging in the Dunedin Study dataset.\nFig. 2: DunedinPACNI model validation and feature importance.", "doc_items_refs": ["#/texts/172", "#/texts/173", "#/texts/174", "#/texts/175", "#/texts/176", "#/texts/177", "#/texts/178", "#/texts/179", "#/texts/180", "#/texts/181", "#/texts/182", "#/texts/183", "#/texts/184", "#/texts/185", "#/texts/186", "#/texts/187", "#/texts/188", "#/texts/189", "#/texts/190", "#/texts/191"], "page_nos": [], "uuid": "1d6d0f35-f719-47e0-a26e-15ca0b3f4407"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 8, "source_chunk_idxs": [12, 13], "num_tokens": 399, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nResults\nDunedinPACNI reflects canonical patterns of brain aging\nThe optimized model used to derive DunedinPACNI included 99 regional brain measures. Because of difficulties in interpreting multivariable model coefficients, we used the Haufe transformation to estimate feature importance scores from the covariance between each brain measure and Pace of Aging\n39\n. Given that many of the MRI-derived measures are highly correlated, our elastic net model reduced overfitting by setting the weights for many of them to zero (visualized in Supplementary Fig.\n1\n). Faster Pace of Aging covaried with thinner cortex, smaller cortical SA, smaller cortical GMV, lower cortical GWR, smaller subcortical GMV and larger ventricular volumes (Fig.\n2c\n). We also observed positive covariance between calcarine CT and GWR, although not calcarine GMV. This is probably due to known aging-related effects on gray and white matter signal intensity that have been demonstrated previously\n40\n,\n41\n,\n42\n,\n43\n. These structural features overlap with the MRI signatures of both normal brain aging and neurodegenerative diseases\n44\n,\n45\n,\n46\n,\n47\n,\n48\n, suggesting that faster DunedinPACNI reflects, at least in part, canonical patterns of brain aging.\n\nDunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nResults\nDunedinPACNI has excellent test-retest reliability\nIf DunedinPACNI is to be used as a measure of aging, it must exhibit sufficient measurement reliability when exported to new datasets. We used test-retest MRI data (\nn\n= 45) from the HCP\n49\nto estimate the reliability of DunedinPACNI. The test-retest reliability was excellent (intraclass correlation coefficient = 0.94, 95% CI = 0.89 to 0.97; Supplementary Fig.\n2\n).", "doc_items_refs": ["#/texts/193", "#/texts/194", "#/texts/195", "#/texts/196", "#/texts/197", "#/texts/198", "#/texts/199", "#/texts/200", "#/texts/201", "#/texts/202", "#/texts/203", "#/texts/204", "#/texts/205", "#/texts/206", "#/texts/207", "#/texts/208", "#/texts/209", "#/texts/210", "#/texts/211", "#/texts/212", "#/texts/213", "#/texts/214", "#/texts/215", "#/texts/216", "#/texts/217", "#/texts/219", "#/texts/220", "#/texts/221", "#/texts/222", "#/texts/223", "#/texts/224", "#/texts/225"], "page_nos": [], "uuid": "e415847a-83c3-4d40-b010-e317545b5196"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 9, "source_chunk_idxs": [14], "num_tokens": 408, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nResults\nDunedinPACNI is associated with worse cognitive functioning\nHaving established both internal validity and test-retest reliability, we sought to examine whether DunedinPACNI generalizes to new datasets to detect aging-related outcomes. Specifically, we first tested for associations with cognitive impairment in ADNI and cognitive functioning in UKB. We generated DunedinPACNI scores from T1-weighted MRI scans collected in 1,737 ADNI participants (mean age = 74.3 years, s.d. = 7.2, range = 52-97 years) and 42,583 UKB participants (mean age = 64.4 years, s.d. = 12.7, range = 44-82 years). In ADNI, participants with faster DunedinPACNI showed greater impairment on mental status examinations used to screen for dementia, as well as tests of memory, psychomotor speed and executive functioning. They also reported more impairment in cognitively demanding activities of daily living (ADLs), such as maintaining finances or preparing a meal (Fig.\n3a\n). Absolute standardized effect sizes across all cognitive measures in ADNI ranged from\nβ\n= 0.18 to 0.39 (all\nP\n2\n). Similarly, UKB participants with faster DunedinPACNI performed more poorly on tests of executive functioning and psychomotor speed (Fig.\n3b\n). Absolute standardized effect sizes across all cognitive measures in UKB ranged from\nβ\n= 0.05 to 0.12 (all\nP\n3\n). Associations in UKB were not driven by individuals with early cognitive decline or\nAPOE\nε4 homozygotes, who have heightened genetic risk for Alzheimer's disease and show earlier onset of cognitive decline\n50\n(Extended Data Fig.\n3\nand Supplementary Table\n4\n). These, and all subsequent analyses presented in this article, control for sex and chronological age.\nFig. 3: DunedinPACNI predicts cognition, cognitive impairment and conversion to dementia.", "doc_items_refs": ["#/texts/227", "#/texts/228", "#/texts/229", "#/texts/230", "#/texts/231", "#/texts/232", "#/texts/234", "#/texts/235", "#/texts/236", "#/texts/237", "#/texts/238", "#/texts/239", "#/texts/240", "#/texts/242", "#/texts/243", "#/texts/244", "#/texts/245", "#/texts/246", "#/texts/247", "#/texts/248", "#/texts/249", "#/texts/250", "#/texts/251", "#/texts/252"], "page_nos": [], "uuid": "6e54c3ae-6fd4-4d7f-9656-d6c7d8d10a5e"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 10, "source_chunk_idxs": [15], "num_tokens": 487, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nResults\nDunedinPACNI predicts future cognitive decline and dementia\nWe next tested if DunedinPACNI differentiates between normal and clinically impaired cognitive functioning in ADNI (Fig.\n3c\n). Participants with mild cognitive impairment (MCI) had faster DunedinPACNI compared to cognitively normal (CN) participants (\nβ\n= 0.27,\nP\nβ\n= 0.54,\nP\nβ\n= 0.81,\nP\nWe further tested whether DunedinPACNI predicts future cognitive decline in people without cognitive impairment. Specifically, we analyzed a subsample of 624 ADNI participants who were CN at the time of their first scan (mean age = 72.4 years, s.d. = 6.3 years, range = 52.7-89.9 years), 112 of whom converted to either MCI or dementia during up to 16 years of follow-up (mean follow-up = 4.90 years). CN participants with faster DunedinPACNI at baseline were more likely to develop MCI or dementia and to do so earlier during the follow-up window (hazard ratio (HR) = 1.49,\nP\n= 0.005, 95% CI = 1.12 to 1.97; Fig.\n3d\n), meaning that those in the top 10% had a 61% increased risk of developing MCI or dementia compared to participants with an average DunedinPACNI. We conducted a similar analysis in the 701 participants who were diagnosed with MCI at the time of their first scan (mean age = 72.8 years, s.d. = 7.3 years, range = 55.0-88.8 years), 271 of whom converted to dementia during up to 16 years of follow-up (mean follow-up = 4.10 years). Participants with MCI with faster DunedinPACNI at baseline were more likely to convert to dementia (HR = 1.44,\nP\nAPOE\nε4 alleles, a well-established genetic risk allele for sporadic, late-onset AD (baseline CN: HR = 1.49,\nP\n= 0.005, 95% CI = 1.13 to 1.96; baseline MCI: HR = 1.42,\nP\nn\n= 73), we were underpowered to report parallel results in this dataset.", "doc_items_refs": ["#/texts/254", "#/texts/255", "#/texts/256", "#/texts/257", "#/texts/258", "#/texts/259", "#/texts/261", "#/texts/262", "#/texts/263", "#/texts/265", "#/texts/266", "#/texts/267", "#/texts/269", "#/texts/270", "#/texts/271", "#/texts/272", "#/texts/273", "#/texts/274", "#/texts/276", "#/texts/277", "#/texts/278", "#/texts/279", "#/texts/280", "#/texts/282", "#/texts/283"], "page_nos": [], "uuid": "97b615e8-50d1-4894-912e-2c2daec85e5b"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 11, "source_chunk_idxs": [16], "num_tokens": 251, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nResults\nDunedinPACNI predicts accelerated brain atrophy\nAs an estimate of how fast a person is aging, DunedinPACNI should reflect longitudinal trajectories of brain decline\n33\n. We tested whether faster baseline DunedinPACNI predicted accelerated hippocampal atrophy, which is an established risk factor for cognitive decline and dementia onset in older adults\n51\n. Specifically, we computed longitudinal trajectories of hippocampal atrophy among 1,302 ADNI participants who had MRI data at multiple time points (average number of scans = 4.4, range = 2-13 scans) as well as 4,601 UKB participants who had MRI data at two time points (Fig.\n4a\n). Participants with faster baseline DunedinPACNI exhibited accelerated hippocampal atrophy in both ADNI (\nβ\n= −0.15,\nP\n4b\n) and UKB (\nβ\n= −0.09,\nP\n4b\n). This result was consistent while controlling for number of\nAPOE\nε4 alleles (Supplementary Table\n5\n).\nFig. 4: DunedinPACNI predicts accelerated hippocampal atrophy.", "doc_items_refs": ["#/texts/285", "#/texts/286", "#/texts/287", "#/texts/288", "#/texts/289", "#/texts/290", "#/texts/291", "#/texts/292", "#/texts/293", "#/texts/294", "#/texts/296", "#/texts/297", "#/texts/298", "#/texts/299", "#/texts/300", "#/texts/302", "#/texts/303", "#/texts/304", "#/texts/305", "#/texts/306", "#/texts/307", "#/texts/308"], "page_nos": [], "uuid": "c958592c-098a-4218-8eb1-576390e23990"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 12, "source_chunk_idxs": [17], "num_tokens": 368, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nResults\nDunedinPACNI predicts frailty, disease and mortality\nAs a measure of aging derived from longitudinal assessments of multiple biomarkers, DunedinPACNI should capture instances of declining health across all organ systems, not just the brain. To test this hypothesis, we used UKB to map DunedinPACNI scores onto measures of frailty, subjective overall health, incident aging-related chronic diseases and all-cause mortality.\nWe used the Fried Frailty Index to quantify the degree of vulnerability to common stressors associated with aging-related decline in energy reserves and functioning. When treating index scores as a continuous measure ranging from 0 to 5, with higher scores indicating greater frailty\n52\n,\n53\n, we found that participants with faster DunedinPACNI were frailer (\nn\n= 42,583;\nβ\n= 0.17,\nP\nn\n= 42,235;\nβ\n= −0.17,\nP\n5a\n), which predicts mortality even independently of objective health measures\n54\n. These associations were not driven by individuals with early cognitive decline or high genetic risk for AD (Extended Data Fig.\n3\nand Supplementary Table\n4\n).\nFig. 5: DunedinPACNI predicts frailty, poor health, multimorbidity, future chronic diseases and mortality, and reflects social gradients of health inequities.\nSimilar patterns emerged when considering clinical diagnoses of chronic aging-related diseases, including myocardial infarction, chronic obstructive pulmonary disease, dementia and stroke. Participants with a lifetime prevalence of one of these chronic diseases had faster DunedinPACNI compared to those with no diagnoses (\nβ\n= 0.19,\nP\nβ\n= 0.25,\nP\nβ\n= 0.44,\nP\n5b\n).", "doc_items_refs": ["#/texts/310", "#/texts/311", "#/texts/312", "#/texts/313", "#/texts/314", "#/texts/315", "#/texts/316", "#/texts/317", "#/texts/318", "#/texts/319", "#/texts/320", "#/texts/322", "#/texts/323", "#/texts/324", "#/texts/325", "#/texts/326", "#/texts/328", "#/texts/329", "#/texts/330", "#/texts/331", "#/texts/332", "#/texts/333", "#/texts/334", "#/texts/335", "#/texts/336", "#/texts/337", "#/texts/338", "#/texts/339", "#/texts/340", "#/texts/342", "#/texts/343", "#/texts/344", "#/texts/346", "#/texts/347", "#/texts/348", "#/texts/350", "#/texts/351"], "page_nos": [], "uuid": "c0d764d7-fe4e-4bff-8da5-2997f95ddd12"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 13, "source_chunk_idxs": [18], "num_tokens": 402, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nResults\nDunedinPACNI predicts frailty, disease and mortality\nExtending beyond contemporaneous associations, we assessed whether faster DunedinPACNI at baseline predicted future myocardial infarction, chronic obstructive pulmonary disease, dementia or stroke in UKB participants who were diagnosis-free at the time of scanning (\nn\n= 40,753). A total of 827 participants reported a new diagnosis of at least one of these aging-related chronic diseases over a maximum follow-up period of 9.7 years after scanning (that is, baseline). Consistent with the contemporaneous associations, healthy participants with faster DunedinPACNI at baseline were more likely to be later diagnosed with chronic aging-related diseases (HR = 1.14,\nP\n5c\n), that is, those in the top 10% had an 18% or greater increased risk of developing a chronic disease compared to participants with average DunedinPACNI. These associations were not driven by individuals with early cognitive decline or high genetic risk for AD (Extended Data Fig.\n3\nand Supplementary Table\n4\n).\nGiven the increased mortality rates among people with chronic aging-related diseases, we asked if baseline DunedinPACNI scores predicted all-cause mortality. Of the 42,583 UKB participants included in our dataset, 757 died over the follow-up period after their baseline MRI scan. Participants with faster baseline DunedinPACNI scores died earlier (HR = 1.32,\nP\n5d\n), that is, those in the top 10% were at least 41% more likely to die compared to participants with average DunedinPACNI. These associations were not driven by individuals with early cognitive decline or high genetic risk for AD (Extended Data Fig.\n3\nand Supplementary Table\n4\n). Taken together, these findings suggest that DunedinPACNI is useful for gauging general physical health and assessing the risk for future chronic disease and death.", "doc_items_refs": ["#/texts/352", "#/texts/353", "#/texts/354", "#/texts/355", "#/texts/357", "#/texts/358", "#/texts/359", "#/texts/360", "#/texts/361", "#/texts/362", "#/texts/363", "#/texts/364", "#/texts/366", "#/texts/367", "#/texts/368", "#/texts/369", "#/texts/370", "#/texts/371"], "page_nos": [], "uuid": "a8ba1291-2230-40c6-8dfe-bd0b46bcb401"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 14, "source_chunk_idxs": [19], "num_tokens": 164, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nResults\nDunedinPACNI reflects social gradients of health inequities\nPeople who are less advantaged in their socioeconomic position experience a wide range of chronic diseases and earlier mortality\n55\n,\n56\n,\n57\n; DunedinPACNI should reflect such gradients of health inequities. We used information about educational attainment and income to test this prediction. Faster DunedinPACNI was observed for participants who either had fewer years of formal education (ADNI:\nβ\n= −0.10,\nP\nβ\n= −0.09,\nP\nβ\n= −0.06,\nP\n5e,f\n). These associations were not driven by individuals with early cognitive decline or high genetic risk for AD (Extended Data Fig.\n3\n).", "doc_items_refs": ["#/texts/373", "#/texts/374", "#/texts/375", "#/texts/376", "#/texts/377", "#/texts/378", "#/texts/379", "#/texts/380", "#/texts/381", "#/texts/382", "#/texts/384", "#/texts/385", "#/texts/386", "#/texts/388", "#/texts/389", "#/texts/390", "#/texts/392", "#/texts/393", "#/texts/394", "#/texts/395"], "page_nos": [], "uuid": "2acd4e9e-9343-41a7-acbf-68d3958d9bbd"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 15, "source_chunk_idxs": [20], "num_tokens": 373, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nResults\nDunedinPACNI generalizes to a Latin American sample\nBrain-based predictive algorithms often fail when applied to groups that demographically differ from the training sample\n58\n. Most cognitive and brain aging studies are collected in high-income countries in North America and Europe; this may limit the generalizability of brain-based models to people in low-income and middle-income countries\n59\n,\n60\n,\n61\n. Latin Americans are underrepresented in biomedical research\n60\n,\n62\nand may experience distinct social and environmental influences on brain aging compared to people in high-income countries in North America and Europe\n60\n. To test the generalizability of DunedinPACNI in Latin Americans, we calculated DunedinPACNI scores in a sample of 369 adults from Argentina, Chile, Colombia, Mexico and Peru from the BrainLat dataset\n63\n. A total of 162 BrainLat participants were diagnosed with AD, 84 were diagnosed with behavioral variant frontotemporal dementia (FTD) and 123 were healthy controls. When controlling for age and sex, BrainLat participants with AD and FTD had faster DunedinPACNI scores compared to healthy controls (AD:\nβ\n= 0.70,\nP\nβ\n= 0.79,\nP\n6a\n). Notably, these effect sizes are comparable to the difference between participants with dementia and CN participants in ADNI (Fig.\n6b\n). In addition, 191 BrainLat participants also completed the Montreal Cognitive Assessment (MoCA). In this subset, BrainLat participants with faster DunedinPACNI scores had poorer scores on the MoCA (\nβ\n= −0.35,\nP\nβ\n= −0.32,\nP\n6c\n).\nFig. 6: DunedinPACNI is similarly associated with dementia and cognitive impairment in a sample of BrainLat participants.", "doc_items_refs": ["#/texts/397", "#/texts/398", "#/texts/399", "#/texts/400", "#/texts/401", "#/texts/402", "#/texts/403", "#/texts/404", "#/texts/405", "#/texts/406", "#/texts/407", "#/texts/408", "#/texts/409", "#/texts/410", "#/texts/411", "#/texts/412", "#/texts/413", "#/texts/414", "#/texts/415", "#/texts/416", "#/texts/418", "#/texts/419", "#/texts/420", "#/texts/422", "#/texts/423", "#/texts/424", "#/texts/425", "#/texts/426", "#/texts/427", "#/texts/428", "#/texts/430", "#/texts/431", "#/texts/432", "#/texts/434", "#/texts/435", "#/texts/436"], "page_nos": [], "uuid": "112169c8-279b-4319-b3e2-457509b00f16"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 16, "source_chunk_idxs": [21], "num_tokens": 383, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nResults\nDunedinPACNI is distinct from common measures of brain aging\nLastly, we compared DunedinPACNI with existing approaches for measuring aging using brain MRI data. Specifically, we compared the effect sizes for DunedinPACNI from all of the aforementioned analyses in ADNI, UKB and BrainLat with brain age gap generated using brainageR\n34\n. We selected this algorithm because of its high accuracy and test-retest reliability compared to other brain age gap algorithms\n64\n. DunedinPACNI and brain age gap were only modestly correlated (ADNI:\nr\n= 0.17,\nP\nr\n= 0.31,\nP\nr\n= 0.32,\nP\n3\n). Compared to brain age gap, the effect sizes for DunedinPACNI were similar or larger across measures of cognitive function, cognitive decline, brain atrophy, frailty, disease risk, mortality and socioeconomic health gradients (Fig.\n7\nand Extended Data Figs.\n5\nand\n6\n; full results are shown in Supplementary Tables\n2\n,\n3\nand\n6\n-\n11\n). Commensurate with the low correlation between these measures, when we included both DunedinPACNI and brain age gap in a single model, each measure explained unique variance in clinical outcomes, with only minor reductions in effect sizes. Moreover, using both DunedinPACNI and brain age gap together in a single model generally increased the prediction of these outcomes (Extended Data Figs.\n5\nand\n6\n). For example, the combined HR of DunedinPACNI and brain age gap predicting mortality risk was 1.50 (95% CI = 1.36 to 1.65), compared to the independent HRs of 1.32 for DunedinPACNI and 1.24 for brain age gap.\nFig. 7: Comparison of DunedinPACNI and brain age gap associations with aging-related phenotypes.", "doc_items_refs": ["#/texts/438", "#/texts/439", "#/texts/440", "#/texts/441", "#/texts/442", "#/texts/443", "#/texts/444", "#/texts/445", "#/texts/447", "#/texts/448", "#/texts/449", "#/texts/451", "#/texts/452", "#/texts/453", "#/texts/455", "#/texts/456", "#/texts/457", "#/texts/458", "#/texts/459", "#/texts/460", "#/texts/461", "#/texts/462", "#/texts/463", "#/texts/464", "#/texts/465", "#/texts/466", "#/texts/467", "#/texts/468", "#/texts/469", "#/texts/470", "#/texts/471", "#/texts/472", "#/texts/473", "#/texts/474", "#/texts/475"], "page_nos": [], "uuid": "50e77093-2e38-4fb7-8a4b-9497b1fd1a1e"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 17, "source_chunk_idxs": [22], "num_tokens": 192, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nResults\nDunedinPACNI is distinct from common measures of brain aging\nIn addition, we investigated how DunedinPACNI differs from commonly reported MRI-based measures of brain aging, namely hippocampal volume and ventricular volume. To test this, we compared the effect sizes for DunedinPACNI with the effect sizes for bilateral hippocampal volume and bilateral ventricular volume in UKB and in CN participants in ADNI. In both datasets, we observed that a faster DunedinPACNI was generally more strongly and more consistently associated with poor cognition, poor health and frailty, as well as risk of dementia, disease and mortality. Furthermore, DunedinPACNI explained incremental variance in these outcomes over and above hippocampal volume and ventricular volume alone (Extended Data Figs.\n7\n-\n9\nand Supplementary Tables\n12\n-\n14\n).", "doc_items_refs": ["#/texts/476", "#/texts/477", "#/texts/478", "#/texts/479", "#/texts/480", "#/texts/481", "#/texts/482", "#/texts/483", "#/texts/484"], "page_nos": [], "uuid": "a04ddebb-26fa-41ab-be9f-1648daea0a08"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 18, "source_chunk_idxs": [23], "num_tokens": 390, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nDiscussion\nDunedinPACNI is an accurate and reliable measure of how fast a person is aging derived from a single brain MRI scan. Using 50,106 scans from people ranging from 22 to 98 years old across the HCP, ADNI, UKB and BrainLat datasets, we demonstrate that people with faster DunedinPACNI had not only worse cognitive and brain health (that is, poorer cognition, faster hippocampal atrophy and greater dementia risk) but also worse general health (that is, greater frailty, poorer self-reported health, greater risk of chronic disease and mortality). This indicates that patterns of aging detected during midlife are clinically useful among people in advanced age, including people with neurodegenerative disease. Furthermore, DunedinPACNI showed evidence of generalization to a sample of Latin American adults with and without dementia. Across all analyses, the effect sizes for DunedinPACNI were similar or larger than the effect sizes for brain age gap, an existing age deviation measure estimated using the same structural MRI data. Moreover, DunedinPACNI and brain age gap were only weakly correlated, and DunedinPACNI accounted for incremental variance in aging-related health outcomes. While weak correlations between neuroimaging-based measures of aging may appear surprising, they mirror findings that different epigenetic clocks are also weakly correlated, and that multiple clocks are useful for predicting disease and death\n65\n,\n66\n. It is possible that biomarkers of aging trained in midlife samples more closely detect the earlier stages of aging compared to biomarkers of aging trained in samples of advanced age. This may partially explain the modest correlations observed between aging biomarkers. Aging remains a construct in search of measurement tools\n4\n,\n5\n, and DunedinPACNI represents a next-generation measure of aging that is distinct from existing approaches.", "doc_items_refs": ["#/texts/486", "#/texts/487", "#/texts/488", "#/texts/489", "#/texts/490", "#/texts/491", "#/texts/492", "#/texts/493", "#/texts/494"], "page_nos": [], "uuid": "d85ad99f-2d57-4f8d-891c-27a79faee5dc"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 19, "source_chunk_idxs": [24], "num_tokens": 383, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nDiscussion\nDunedinPACNI is not without limitations. First, the Dunedin Study, ADNI and UKB consist of data collected primarily from participants of European ancestry. Furthermore, ADNI and UKB oversample participants from higher socioeconomic backgrounds\n67\n. There is growing awareness that lack of representativeness in neuroimaging research may hinder clinical translation\n68\n,\n69\n, including clinical translation of brain-based predictive models\n58\n. To address this, we replicated associations with DunedinPACNI in a sample of Latin Americans, as well as low-income and non-White UKB participants. (Supplementary Tables\n15\nand\n16\n). Additionally, our findings in ADNI, UKB and BrainLat demonstrate that DunedinPACNI generalizes well to older adults. This suggests that early differences in aging can be detected in brain MRI measures collected at age 45 years that are clinically useful in people who are decades older. At the same time, it is also possible that an analogous aging biomarker trained in older adults may generalize more readily to other samples of older adults. A priority for future work is to further evaluate the generalizability of DunedinPACNI to people of diverse demographics and backgrounds. Second, DunedinPACNI only uses structural brain measures derived from a T1-weighted MRI scan. We chose this strategy because these scans are collected in nearly every MRI study, thereby maximizing the potential adoption of DunedinPACNI. It is possible that the performance accuracy reported in this study could be improved by including additional structural or functional MRI measures (for example, white matter microstructural integrity from diffusion-weighted images, blood-oxygen-level-dependent signal from T2*-weighted images). Relatedly, while elastic net is widely used to measure biological age\n11\n,\n12\n,\n15\n,\n16\n,\n20", "doc_items_refs": ["#/texts/495", "#/texts/496", "#/texts/497", "#/texts/498", "#/texts/499", "#/texts/500", "#/texts/501", "#/texts/502", "#/texts/503", "#/texts/504", "#/texts/505", "#/texts/506", "#/texts/507", "#/texts/508", "#/texts/509", "#/texts/510", "#/texts/511", "#/texts/512", "#/texts/513", "#/texts/514", "#/texts/515", "#/texts/516"], "page_nos": [], "uuid": "288ec968-7356-48ab-abe8-071208821f5b"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 20, "source_chunk_idxs": [25], "num_tokens": 361, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nDiscussion\n, future research should evaluate whether predictive performance accuracy could be increased by more complex, nonlinear models. Third, by design, DunedinPACNI is a measure of the longitudinal rate of the aging of the body derived from a single MRI scan and is not designed to replace longitudinal measurement of brain aging through repeated MRI assessments. Fourth, DunedinPACNI is estimated through observed correlations between measures of brain structure and longitudinal aging, which could reflect multiple causal pathways. For example, faster aging of non-brain organs might cause poorer brain health or vice versa. Alternatively, both may be driven by a third factor. Fifth, although we found robust associations with aging phenotypes across both ADNI and UKB, we generally observed larger effect sizes in ADNI. This could suggest that DunedinPACNI is sensitive to dysfunction in individuals with neurodegenerative diseases. Further evaluation is needed to establish the degree to which DunedinPACNI is sensitive to individual organ systems. Sixth, DunedinPACNI is currently a quantitative tool for comparison of individuals within datasets but not between datasets. Future research, potentially through data harmonization and normative modeling approaches, should establish normative reference values and ranges that can aid in the clinical interpretation of DunedinPACNI scores. Seventh, as is true for all MRI-based measurements, the derivation of DunedinPACNI may be compromised in low-quality scans, such as those with high levels of head motion. In the analyses presented in this study, we followed standard practice by excluding low-quality scans (Supplementary Figs.\n4\n-\n7\n). Future research should adopt methods to improve data quality in high-motion participants to help maximize generalizability\n70\n,\n71\n.", "doc_items_refs": ["#/texts/517", "#/texts/518", "#/texts/519", "#/texts/520", "#/texts/521", "#/texts/522", "#/texts/523", "#/texts/524", "#/texts/525"], "page_nos": [], "uuid": "28d90e39-9f26-4652-b505-c187a93b1faa"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 21, "source_chunk_idxs": [26], "num_tokens": 301, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nDiscussion\nCurrently, DunedinPACNI and general aging biomarkers are research tools that require further validation before potential translation to the clinic\n5\n. Nonetheless, we believe that DunedinPACNI and other biomarkers of general aging have several promising uses that differ from, and are complementary to, biomarkers of specific diseases (for example, hippocampal atrophy and AD\n72\nor high blood pressure and stroke\n73\n). For example, biomarkers of general aging could help identify a broad risk for many age-related diseases earlier in the lifespan, when individuals may benefit most from health and antiaging intervention\n23\n. Biomarkers of general aging could also help establish a person's prognosis after the onset of a specific disease or establish how interventions or insults may change how fast a person is aging\n25\n,\n74\n,\n75\n. Lastly, biomarkers of general aging are necessary to mechanistically link exposures (for example, low socioeconomic status) to aging or to link the rate of aging to outcomes such as increased disease risk\n4\n. While detecting or diagnosing a specific disease requires a proximal, specific biomarker of that disease, biomarkers of general aging could be used to measure the distal risk for a broad array of diseases. This difference allows for clinical applications of biomarkers of aging such as DunedinPACNI alongside biomarkers of specific diseases.", "doc_items_refs": ["#/texts/526", "#/texts/527", "#/texts/528", "#/texts/529", "#/texts/530", "#/texts/531", "#/texts/532", "#/texts/533", "#/texts/534", "#/texts/535", "#/texts/536", "#/texts/537", "#/texts/538", "#/texts/539", "#/texts/540", "#/texts/541", "#/texts/542"], "page_nos": [], "uuid": "16f37c7e-bfa0-42f6-a932-e7ab062439eb"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 22, "source_chunk_idxs": [27], "num_tokens": 372, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nDiscussion\nSeveral unique features of the Dunedin Study contribute advantages to DunedinPACNI compared to other biomarkers of aging. First, DunedinPACNI was developed in a cohort of people all born in the same year and studied at the same ages throughout their lives, thereby avoiding biases that are introduced by differences in historical exposures across generations and across time. Second, DunedinPACNI was trained on 19 biomarkers that were each assessed over nearly two decades and thus are not influenced by short-term illnesses that can cause aberrant biomarker signals at a single assessment. Third, DunedinPACNI was derived from participants followed from birth to age 45 years-before the onset of chronic, aging-related diseases that cause divergence from typical trajectories of aging. Other biomarkers of aging are typically derived from multiage samples in which many of the older members already have chronic diseases that have altered their body and brain, so those measures may inadvertently repackage disease instead of aging. Fourth, because the Dunedin Study cohort is a population representative cohort with very low attrition and mortality rates, DunedinPACNI does not suffer from oversampling of healthy volunteers, attrition bias (that is, people with worse health being more likely to drop out) or survivor bias (that is, people with worse health dying earlier). Indeed, our results align with prior research showing that DunedinPACE, which like DunedinPACNI was trained on the longitudinal Pace of Aging, is associated with dementia, morbidity and mortality\n20\n,\n22\n,\n23\n. Our results, alongside the fast-growing literature on DunedinPACE, suggest that these unique design characteristics of the Dunedin Study make it a powerful training sample for longitudinal biomarkers of aging.", "doc_items_refs": ["#/texts/543", "#/texts/544", "#/texts/545", "#/texts/546", "#/texts/547", "#/texts/548", "#/texts/549"], "page_nos": [], "uuid": "2a202fb8-41d2-49ea-8ec0-68449879f29f"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 23, "source_chunk_idxs": [28, 29], "num_tokens": 415, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nDiscussion\nThe scope of geroscience has rapidly expanded with the proliferation of omic clocks that can measure how fast people age\n10\n. DunedinPACNI is poised to further this growth by allowing individual differences in the rate of longitudinal aging to be estimated from a single noninvasive MRI scan that can be collected in just a few minutes. Indeed, the requisite MRI data to estimate DunedinPACNI have already been collected in many psychiatric, neurological and brain health cohorts, from tens of thousands of research participants across the lifespan and around the world. DunedinPACNI offers an opportunity to enrich such studies and deepen our understanding of the causes of individual differences in the rate of longitudinal aging, including genetics\n76\n, childhood adversities\n77\n, environmental exposures (for example, lead\n78\n,\n79\n) and lifestyle factors (for example, physical inactivity, social isolation\n80\n). DunedinPACNI may also be adopted as a surrogate endpoint to accelerate our ability to develop, prioritize and evaluate potential antiaging interventions that slow aging and prevent disease\n81\n,\n82\n. The algorithm for DunedinPACNI is publicly available to the research community to facilitate these and other future research directions (\nhttps://github.com/etw11/DunedinPACNI\n).\n\nDunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nMethods\nThis research complies with all relevant ethical regulations; all study protocols were approved by the relevant ethical review boards. The specific ethical review boards are detailed in the description of each dataset. The premise and analysis plan for this study were preregistered (\nhttps://rb.gy/b9x4u6\n). All analyses and code were checked for accuracy by an independent analyst. Analyses were conducted on data collected through the Dunedin Study, HCP, ADNI, UKB and BrainLat. The details of each study and dataset are described below.", "doc_items_refs": ["#/texts/550", "#/texts/551", "#/texts/552", "#/texts/553", "#/texts/554", "#/texts/555", "#/texts/556", "#/texts/557", "#/texts/558", "#/texts/559", "#/texts/560", "#/texts/561", "#/texts/562", "#/texts/563", "#/texts/564", "#/texts/565", "#/texts/566", "#/texts/567", "#/texts/568", "#/texts/570", "#/texts/571", "#/texts/572"], "page_nos": [], "uuid": "26ce6b73-ea8e-4c22-b41c-2fb010ac4d95"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 24, "source_chunk_idxs": [30], "num_tokens": 341, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nMethods\nData sources\nDunedin Study\nParticipants are members of the Dunedin Study, a longitudinal investigation of health and behavior in a population-representative birth cohort. The 1,037 participants (91% of eligible births, 48% female) were all people born between April 1972 and March 1973 in Dunedin, New Zealand, who were residents in the province and who participated in the first assessment at age 3 years\n19\n. The cohort represented the full range of socioeconomic status in the general population of New Zealand's South Island and, as adults, matched the New Zealand National Health and Nutrition Survey on key adult health indicators (for example, BMI, smoking and general practitioner visits) and the New Zealand Census of citizens of the same age on educational attainment\n19\n,\n83\n. Study members are primarily of New Zealand European ethnicity; 8.6% reported Māori ethnicity at age 45 years.\nGeneral assessments were performed at birth as well as ages 3, 5, 7, 9, 11, 13, 15, 18, 21, 26, 32 and 38 years, and most recently (completed April 2019) at age 45 years, when 938 of the 997 living study members (94.1%) participated. At each assessment, study members were brought to the Dunedin Study Research Unit at the University of Otago for interviews and examinations. In addition, staff provided standardized ratings; informant questionnaires were sent to people who the study members nominated as people who knew them well, and administrative records were searched. The Dunedin Study was approved by the University of Otago Ethics Committee and study members gave written informed consent before participating.", "doc_items_refs": ["#/texts/575", "#/texts/576", "#/texts/577", "#/texts/578", "#/texts/579", "#/texts/580", "#/texts/581", "#/texts/582"], "page_nos": [], "uuid": "aa16e9c3-2c68-4136-98c7-98bd3128b6d1"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 25, "source_chunk_idxs": [31], "num_tokens": 432, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nMethods\nMRI\nAs a component of the assessments at age 45 years, study members were scanned using a Siemens MAGNETOM Skyra (Siemens Healthineers) 3T scanner equipped with a 64-channel head/neck coil at the Pacific Radiology Group imaging center in Dunedin, New Zealand. High-resolution T1-weighted images were obtained using an MP-RAGE sequence with the following parameters: repetition time (TR) = 2,400 ms; echo time (TE) = 1.98 ms; 208 sagittal slices; flip angle, 9°; field of view (FOV), 224 mm; matrix = 256 × 256 px; slice thickness = 0.9 mm with no gap (voxel size 0.9 × 0.875 × 0.875 mm); and total scan time = 6 min and 52 s. Three-dimensional (3D) fluid-attenuated inversion recovery (FLAIR) images were obtained with the following parameters: TR = 8,000 ms; TE = 399 ms; 160 sagittal slices; FOV = 240 mm; matrix = 232 × 256 px; slice thickness = 1.2 mm (voxel size 0.9 × 0.9 × 1.2 mm); and total scan time = 5 min and 38 s. Additionally, a gradient echo field map was acquired with the following parameters: TR = 712 ms; TE = 4.92 and 7.38 ms; 72 axial slices; FOV = 200 mm; matrix = 100 × 100 px; slice thickness = 2.0 mm (voxel size 2 mm isotropic); and total scan time = 2 min and 25 s. Of the 938 study members seen at phase 45, 63 declined to participate in MRI scanning, that is, 875 study members completed the MRI scanning protocol. Scanned study members did not differ from other living participants in terms of childhood neurocognitive functioning or childhood socioeconomic status (see the attrition analysis in Extended Data Figs.\n1\nand\n2", "doc_items_refs": ["#/texts/584", "#/texts/585", "#/texts/586", "#/texts/587"], "page_nos": [], "uuid": "08b4a851-3fd8-4b65-b9a6-264aee93d44d"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 26, "source_chunk_idxs": [32, 33], "num_tokens": 289, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nMethods\nMRI\n). Of these 875 study members for whom data was available, four were excluded because of major incidental findings or previous injuries (for example, large tumors or extensive damage to the brain or skull), nine because of missing FLAIR or field map scans, one because of poor surface mapping yielding and one because of missing the Pace of Aging variable. This yielded a final training sample of 860 study members (see Supplementary Fig.\n4\nfor the inclusion details).\nStructural MRI data were processed using FreeSurfer v.6.0 (ref.\n36\n). Specifically, T1-weighted images were processed and refined with 3D FLAIR images using the recon-all pipeline.\n\nDunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nMethods\nPace of Aging\nParticipants' pace of biological aging was measured as changes in 19 biomarkers of study members' cardiovascular, metabolic, pulmonary, kidney, immune and dental systems across ages 26, 32, 38 and 45 years. This measure quantifies participants' rate of aging in year-equivalent units of physiological decline per chronological year. The average participant experienced 1 year of physiological decline per year, that is, a mean (s.d.) Pace of Aging of 1 (0.3)\n2\n. See the 'Statistical analysis' section for more details.", "doc_items_refs": ["#/texts/588", "#/texts/589", "#/texts/590", "#/texts/591", "#/texts/592", "#/texts/593", "#/texts/595", "#/texts/596", "#/texts/597"], "page_nos": [], "uuid": "a1c9ae5f-df4a-4ec5-b814-1a0ff56b8475"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 27, "source_chunk_idxs": [34], "num_tokens": 512, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nMethods\nPhysical functioning\nOne-legged balance was measured using the unipedal stance test as the maximum time achieved across three trials of the test with eyes closed\n84\n,\n85\n,\n86\n. Gait speed (meters per second) was assessed with the 6-m-long GAITRite Electronic Walkway (CIR Systems) with 2-m acceleration and 2-m deceleration before and after the walkway, respectively. Gait speed was assessed under three walking conditions: usual gait speed (walk at a normal pace from a standing start, measured as a mean of two walks) and two challenge paradigms, dual-task gait speed (walk at a normal pace while reciting alternate letters of the alphabet out loud, starting with the letter 'A', measured as a mean of two walks) and maximum gait speed (walk as fast as safely possible, measured as a mean of three walks). Gait speed was correlated across the three walk conditions\n87\n. To increase reliability and take advantage of the variation in all three walk conditions (usual gait and the two challenge paradigms), we calculated the mean of the three highly correlated individual walk conditions to generate our primary measure of composite gait speed. The step in place test was measured as the number of times the right knee was lifted to mid-thigh height (measured as the height half-way between the knee cap and the iliac crest) in 2 min at a self-directed pace\n88\n,\n89\n. Chair rises were measured as the number of stands with no hands completed in 30 s from a seated position\n88\n,\n90\n. Handgrip strength was measured for each hand (elbow held at 90°, upper arm held tight against the trunk) as the maximum value achieved across three trials using a Jamar digital dynamometer\n91\n,\n92\n. Analyses using handgrip strength controlled for BMI. Visuomotor coordination was measured as the time to completion of the grooved pegboard test. Scores were reversed so that higher values corresponded to better performance. Physical limitations were measured with the RAND 36-Item Health Survey 1.0 physical functioning scale. Responses ('limited a lot', 'limited a little', 'not limited at all') assessed difficulty with completing several activities (for example, climbing several flights of stairs, walking more than 1 km, participating in strenuous sports). Scores were reversed to reflect physical limitations so that a high score indicates more limitations.", "doc_items_refs": ["#/texts/599", "#/texts/600", "#/texts/601", "#/texts/602", "#/texts/603", "#/texts/604", "#/texts/605", "#/texts/606", "#/texts/607", "#/texts/608", "#/texts/609", "#/texts/610", "#/texts/611", "#/texts/612", "#/texts/613", "#/texts/614", "#/texts/615", "#/texts/616", "#/texts/617", "#/texts/618", "#/texts/619"], "page_nos": [], "uuid": "53ab8041-131d-41d6-9330-a3a22981965e"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 28, "source_chunk_idxs": [35], "num_tokens": 339, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nMethods\nSubjective health and age appearance\nWe obtained reports about study members' health and age appearance from three sources: self-reports; informant impressions; and staff impressions. For self-reports, we asked study members about their own impressions of how old they looked: 'Do you think you look older, younger, or about your actual age?' Response options were younger than their age, about their actual age, or older than their age. We also asked study members to rate their age perceptions in years: 'How old do you feel?' For informant impressions, informants who knew a study member well (94% response rate) were asked: 'Compared to others their age, do you think they (the study member) look younger or older than others their age? Response options were: 'much younger', 'a bit younger', 'about the same', 'a bit older' or 'much older'. For staff impressions, four members of the Dunedin Study unit staff completed a brief questionnaire describing each study member. To assess age appearance, staff used a seven-item scale to assign a 'relative age' to each study member (1 = young-looking, 7 = old-looking). Correlations between self-ratings, informant ratings and staff ratings ranged from 0.34 to 0.52. All reporters rated the study member's general health using the following response options: excellent, very good, good, fair or poor. Correlations between self-ratings, informant ratings and staff ratings ranged from\nr\n= 0.48 to\nr\n= 0.55.", "doc_items_refs": ["#/texts/621", "#/texts/622", "#/texts/623", "#/texts/624", "#/texts/625"], "page_nos": [], "uuid": "2af09180-276e-489b-aaa7-1b999e3af79d"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 29, "source_chunk_idxs": [36, 37], "num_tokens": 451, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nMethods\nCognitive functioning\nThe Wechsler Adult Intelligence Scale, Fourth Edition was administered at age 45 years, yielding the adult IQ. In addition to full-scale IQ, the Wechsler Adult Intelligence Scale, Fourth Edition yields indexes of four specific cognitive functional domains: processing speed; working memory; perceptual reasoning; and verbal comprehension. The Wechsler Intelligence Scale for Children-Revised was administered at ages 7, 9 and 11 years. To increase the baseline reliability, the three scores were averaged, yielding the childhood IQ. We measured cognitive decline by studying adult IQ scores after controlling for childhood IQ scores. We focused on change in overall IQ given evidence that aging-related slopes are correlated across all cognitive functions, indicating that research on cognitive decline may be best focused on a highly reliable summary index, rather than focused on individual functions\n93\n.\n\nDunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nMethods\nFacial age\nFacial age was based on two measurements of perceived age by an independent panel of eight people. First, age range was assessed by an independent panel of four raters, who were presented with standardized (non-smiling) digital facial photographs of study members when they were 45 years old. Raters, who were kept blind to the actual age of study members, used a Likert scale to categorize each study member into a 5-year age range (that is, from 20 to 24 years old and up to 70+ years old). Interrater reliability was 0.77. The scores for each study member were averaged across all raters. Second, relative age was assessed by a different panel of four raters, who were told that all photos were of people aged 45 years old. These raters then used a 7-item Likert scale to assign a 'relative age' to each participant (that is, 1 = 'young-looking' to 7 = 'old-looking'). Interrater reliability was 0.79. The measure of perceived age at 45 years (that is, facial age) was derived by standardizing and averaging age range and relative age scores.", "doc_items_refs": ["#/texts/627", "#/texts/628", "#/texts/629", "#/texts/631"], "page_nos": [], "uuid": "d3c304b4-fbc8-44cb-8559-a1a46c4fcf49"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 30, "source_chunk_idxs": [38, 39], "num_tokens": 257, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nMethods\nFacial age\nHCP\nThe HCP is a publicly available dataset that includes 1,206 participants with extensive MRI data\n49\n. HCP data access is managed by the WU-Minn HCP consortium. All participants provided written informed consent. Specifically, we used data from 45 participants who completed the scan protocol a second time (with a mean interval between scans of approximately 140 days) allowing for the calculation of test-retest reliability. All participants were free of current psychiatric or neurological illness and were between 25 and 35 years of age. The mean age of the HCP test-retest sample analyzed was 30.3 years (s.d. = 3.3 years, range = 22-35 years) at the first time point.\n\nDunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nMethods\nMRI\nStructural MRI data were analyzed using the HCP minimal preprocessing pipeline\n94\n. Briefly, T1-weighted images were processed using a custom FreeSurfer recon-all pipeline optimized for structural MRI with a higher resolution than 1 mm isotropic. Details on HCP MRI data acquisition have been described elsewhere\n94\n.", "doc_items_refs": ["#/texts/633", "#/texts/634", "#/texts/635", "#/texts/637", "#/texts/638", "#/texts/639", "#/texts/640", "#/texts/641"], "page_nos": [], "uuid": "1e88666e-3a03-4b9d-be8e-e5bf2b179fa5"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 31, "source_chunk_idxs": [40, 41], "num_tokens": 330, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nMethods\nMRI\nADNI\nThe primary goal of ADNI is to test whether serial MRI, positron emission tomography, other biological markers and clinical and neuropsychological assessments can be combined to measure the progression of neurodegeneration in participants with MCI, AD and CN older adults (\nadni.loni.usc.edu\n)\n95\n. Cognitive and diagnostic data were downloaded on 12 June 2022. MRI data curated from the Alzheimer's Disease Sequencing Project collection were downloaded on 7 December 2023. ADNI was approved by the institutional review boards of all the participating institutions. All participants provided written informed consent. The ADNI sample demographic information can be found in Supplementary Table\n17\n.\n\nDunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nMethods\nMRI\nT1-weighted scans were collected using either 1.5T or 3T scanners. MRI acquisition parameters varied across ADNI sites and waves; however, the targets for acquisition were isotropic 1-mm\n3\nvoxels\n96\n. Raw T1-weighted images were processed using longitudinal FreeSurfer v.6.0. Scans were excluded for low quality if they did not have a quality control rating of 'pass' from the ADNI investigators or if segmentation failed visual inspection. Scans were also excluded if participants were missing demographic data, such as age, sex or diagnosis (Supplementary Fig.\n5\n). Further details on the MRI methods in ADNI can be found at\nadni.loni.usc.edu\n.", "doc_items_refs": ["#/texts/643", "#/texts/644", "#/texts/645", "#/texts/646", "#/texts/647", "#/texts/648", "#/texts/649", "#/texts/651", "#/texts/652", "#/texts/653", "#/texts/654", "#/texts/655", "#/texts/656", "#/texts/657", "#/texts/658", "#/texts/659"], "page_nos": [], "uuid": "4c9c8fb4-7c24-46fd-9184-6bbfa040af77"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 32, "source_chunk_idxs": [42], "num_tokens": 504, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nMethods\nCognitive and behavioral functioning\nADNI participants completed several cognitive and behavioral assessments at the time of scanning. The ADAS-Cog is a structured scale that evaluates memory, reasoning, language, orientation, ideational praxis and constructional praxis\n97\n. Delayed word recall and number cancellation are included in addition to the 11 standard ADAS items\n98\n. The test is scored for errors, ranging from 0 (best performance) to 85 (worst performance). The MMSE is a screening instrument that evaluates orientation, memory, attention, concentration, naming, repetition and comprehension, and ability to create a sentence and to copy two overlapping pentagons\n99\n. The MMSE is scored as the number of correctly completed items ranging from 0 (worst performance) to 30 (best performance). The MoCA is designed to detect people at the MCI stage of cognitive dysfunction\n100\n. The scale ranges from 0 (worst performance) to 30 (best performance). The RAVLT is a list learning task that assesses learning and memory. On each of five learning trials, 15 unrelated nouns are presented orally at the rate of one word per second and immediate free recall of the words is elicited. After a 30-min delay filled with unrelated testing, free recall of the original 15-word list is elicited. Both immediate recall and percentage forgotten are used. The LogMem tests I and II (delayed paragraph recall) are from the Wechsler Memory Scale-Revised. Free recall of one short story is elicited immediately after being read aloud to the participant and again after a 30-min delay. The total bits of information recalled after the delay interval (maximum score = 25) are analyzed. The Trail Making Test, Part B, consists of 25 circles, either numbered (one through 13) or containing letters (A through L). Participants connect the circles while alternating between numbers and letters (for example, A to 1, 1 to B, B to 2, 2 to C). Time to complete (300 s maximum) is the primary measure of interest. The FAQ is a self-report measure of instrumental ADLs, such as preparing meals, performing chores, keeping a schedule and traveling outside of one's neighborhood\n101\n. Each unique cognitive testing measure was paired with the participant's most temporally proximate brain scan within 6 months of cognitive testing.", "doc_items_refs": ["#/texts/661", "#/texts/662", "#/texts/663", "#/texts/664", "#/texts/665", "#/texts/666", "#/texts/667", "#/texts/668", "#/texts/669", "#/texts/670", "#/texts/671"], "page_nos": [], "uuid": "9886d89f-f510-4001-8a8b-634c923c65ed"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 33, "source_chunk_idxs": [43, 44, 45], "num_tokens": 283, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nMethods\nCognitive status\nADNI participants were classified into CN, MCI or dementia groups by ADNI study physicians based on subjective memory complaints, multiple neurocognitive and behavioral assessment scores, and level of impairment in ADLs. Complete diagnostic criteria can be found at\nadni.loni.usc.edu\n. Each individual scan was categorized according to the most temporally proximate cognitive diagnosis received by that participant.\n\nDunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nMethods\nEducation\nEducation level was measured according to self-reported years of education. For the purposes of visualization in Fig.\n5e\n, participants were grouped according to the following thresholds: less than high school: 16 years.\n\nDunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nMethods\nEducation\nUKB\nUKB is a UK population-based prospective study of 502,486 participants between the ages of 40 and 69 at baseline assessment\n102\n. We analyzed data from 42,583 participants who underwent brain MRI. The data used in these analyses were downloaded in April 2023. UKB was approved by the North West Multi-centre for Research Ethics Committee. All participants provided written informed consent. UKB sample demographic information can be found in Supplementary Table\n17\n.", "doc_items_refs": ["#/texts/673", "#/texts/674", "#/texts/675", "#/texts/677", "#/texts/678", "#/texts/679", "#/texts/681", "#/texts/682", "#/texts/683", "#/texts/684", "#/texts/685"], "page_nos": [], "uuid": "0cfe766d-37ae-4f2e-b34f-668297dda053"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 34, "source_chunk_idxs": [46], "num_tokens": 393, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nMethods\nMRI\nMRI methods for UKB have been described in detail elsewhere\n103\n. Briefly, MRI data were collected using three identical 3T Siemens Skyra scanners with a 32-channel Siemens head coil. T1-weighted images were obtained using a 3D MP-RAGE with the following parameters: TR = 2,000 ms; inversion time = 880 ms; 208 sagittal slices, matrix = 256 × 256 px; slice thickness = 1 mm with no gap; and total scan time = 4 min and 52 s. Our study made use of imaging-derived phenotypes generated using an image-processing pipeline developed and run on behalf of UKB\n103\n. As part of this pipeline, raw T1-weighted images were processed using the cross-sectional FreeSurfer v.6.0. All brain measures used in the cross-sectional analyses presented in this study were derived from the outputs of this FreeSurfer pipeline. We excluded UKB participants with a very low signal-to-noise ratio and highly unusual summary morphometrics indicative of low-quality reconstruction (Supplementary Fig.\n6\n).\nTo measure change in hippocampal volume in the subset of UKB participants with longitudinal MRI data, we reprocessed all T1-weighted images for this subset of participants using the longitudinal FreeSurfer v.6.0 pipeline\n104\n. This allowed us to avoid the known biases that can be introduced by different processing stages of the longitudinal pipeline in different hardware and software environments. Specifically, we reprocessed both time points of each participant's T1-weighted scans with the cross-sectional recon-all pipeline\n105\n. Then, we built an unbiased within-participant template\n106\nusing robust, inverse, consistent registration\n107\nand reprocessed each T1-weighted scan through the automated longitudinal pipeline\n104\n.", "doc_items_refs": ["#/texts/687", "#/texts/688", "#/texts/689", "#/texts/690", "#/texts/691", "#/texts/692", "#/texts/693", "#/texts/694", "#/texts/695", "#/texts/696", "#/texts/697", "#/texts/698", "#/texts/699", "#/texts/700", "#/texts/701", "#/texts/702", "#/texts/703", "#/texts/704"], "page_nos": [], "uuid": "cc439ee3-ff0c-49c7-a4ad-20d46b93bf06"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 35, "source_chunk_idxs": [47, 48], "num_tokens": 299, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nMethods\nCognitive functioning\nUKB participants completed a battery of cognitive tests at the time of MRI. We investigated cognitive functioning using the following measures: Reaction Time (field ID = 20023), Fluid Intelligence (field ID = 20016), Numeric Memory (field ID = 4282), Trail A (field ID = 6348) and Trail B (field ID = 6350), symbol digit substitution (field ID = 23324), Tower Rearranging (field ID = 21004) and Matrix Completion (field ID = 6373). The details of these cognitive tests have been described elsewhere\n108\n.\n\nDunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nMethods\nFrailty and self-reported health\nTo further investigate aging-related health, we used the Fried Frailty Index\n53\n. Briefly, the Fried Frailty Index is based on meeting the criteria for declining functioning across five domains: unintentional weight loss; exhaustion; weakness; physical inactivity; and slow walking speed. Index scores range from 0 to 5, with higher scores indicating greater frailty\n109\n. During their imaging visit, UKB participants were also asked to rate their overall health as 'poor', 'fair', 'good' or 'excellent'. We used these ratings to investigate self-reported overall health (field ID = 2178).", "doc_items_refs": ["#/texts/706", "#/texts/707", "#/texts/708", "#/texts/710", "#/texts/711", "#/texts/712", "#/texts/713", "#/texts/714"], "page_nos": [], "uuid": "87731bcc-c6dd-4322-acd2-131d188ecad3"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 36, "source_chunk_idxs": [49, 50], "num_tokens": 491, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nMethods\nDisease and mortality records\nTo assess the influence of DunedinPACNI on aging-related disease and mortality risk in UKB, we used variables from algorithmically defined health outcomes. Briefly, algorithmically defined outcomes are generated by combining information from baseline assessments (self-reported medical conditions, operations and medications) with linked data from hospital admissions and death registries. Because of the relatively small number of aging-related disease diagnoses at the follow-up, we defined aging-related morbidity as being diagnosed with myocardial infarction (field ID = 42000), chronic obstructive pulmonary disease (field ID = 42016), dementia (field ID = 42018) or stroke (field ID = 42006). Furthermore, we defined the risk of chronic disease as the emergence of one or more of these diagnoses among participants who were healthy at the time of scanning (that is, baseline). Mortality was quantified during the follow-up from death records (field ID = 40000).\n\nDunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nMethods\nEducation, income and ethnicity\nTo test the association between DunedinPACNI and socioeconomic gradients of health, we tested whether UKB participants differed in DunedinPACNI scores as a function of educational attainment and household income. We grouped participants into three categories according to their self-reported educational qualifications (field ID = 6138) following prior work\n110\n. Specifically, these groups were: high (college or university degree); medium (A/AS level or equivalent or O level/GCSE or equivalent); and low (none of these). We also tested whether UKB participants differed in DunedinPACNI scores as a function of household income (field ID = 738).\nWe also conducted sensitivity analyses while restricting the UKB sample to either only low-income or only non-White participants. We considered participants as having a low income if they reported making less than £18,000 per year in household income. We considered participants to be non-White if they did not report their ethnic background (field ID = 21000) as 'any other White background', 'British', 'do not know', 'Irish', 'prefer not to answer' or 'White'.", "doc_items_refs": ["#/texts/716", "#/texts/718", "#/texts/719", "#/texts/720", "#/texts/721"], "page_nos": [], "uuid": "f52ca0a9-c971-4911-859d-5cd33cd67ae9"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 37, "source_chunk_idxs": [51, 52, 53, 54], "num_tokens": 456, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nMethods\nEducation, income and ethnicity\nBrainLat\nBrainLat is a multimodal neuroimaging dataset of patients with neurodegenerative diseases and healthy adult controls collected in Argentina, Chile, Colombia, Mexico and Peru\n63\n. We analyzed neuroimaging data from 368 individuals who were either cognitively healthy or diagnosed with AD or behavioral variant FTD. The BrainLat study was approved by the institutional ethical boards of each recruitment site. All participants, or their legal representatives, provided written informed consent. The BrainLat demographic data can be found in Supplementary Table\n17\n.\n\nDunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nMethods\nMRI\nThe MRI methods for BrainLat have been described in detail elsewhere\n63\n. Briefly, T1-weighted MP-RAGE scans were collected on either 1.5 or 3T scanners. Acquisition parameters varied across sites, but scans most frequently had isometric 1-mm\n3\nvoxels. Scans were downloaded and then processed using FreeSurfer v.6.0. Participants were excluded if they failed the automated FreeSurfer quality metrics or a visual quality check of segmentation output (Supplementary Fig.\n7\n).\n\nDunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nMethods\nDiagnostic classification\nAll participants included could speak fluent Spanish and had adequate visual and auditory capacity for testing. Participants were classified as CN if they had a modified clinical dementia rating of 0, an MMSE score above 25 and lacked a history of substance abuse, and neurological or psychiatric disorders. Patients were classified into the AD or FTD groups according to the National Institute of Neurological Disorders and Stroke-Alzheimer Disease and Related Disorders working group for probable AD or probable behavioral variant FTD. Diagnosis was supported using appropriate MRI or positron emission tomography imaging when needed\n63\n.\n\nDunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nMethods\nCognitive status\nBrainLat participants were evaluated with the MoCA. The MoCA is designed to detect people at the MCI stage of cognitive dysfunction\n100\n. The scale ranges from 0 (worst performance) to 30 (best performance).", "doc_items_refs": ["#/texts/723", "#/texts/724", "#/texts/725", "#/texts/726", "#/texts/727", "#/texts/729", "#/texts/730", "#/texts/731", "#/texts/732", "#/texts/733", "#/texts/734", "#/texts/735", "#/texts/737", "#/texts/738", "#/texts/739", "#/texts/741", "#/texts/742", "#/texts/743"], "page_nos": [], "uuid": "60ffcd71-0b77-4c97-a9a1-adfad02081b2"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 38, "source_chunk_idxs": [55], "num_tokens": 338, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nMethods\nStatistical analyses\nPace of Aging\nThe derivation of Pace of Aging has been described elsewhere\n1\n,\n2\n. Briefly, we measured a panel of the following 19 biomarkers (Fig.\n1a\n) at ages 26, 32, 38, and 45 years: BMI, waist/hip ratio, HbA1c, leptin, blood pressure (mean arterial pressure), cardiorespiratory fitness (VO\n2\nmax), forced vital capacity ratio (FEV\n1\n/FVC), FEV\n1\n, total cholesterol, triglycerides, HDL, lipoprotein(a), apolipoprotein B100/A1 ratio, eGFR, blood urea nitrogen, hsCRP, white blood cell count, mean periodontal AL and the number of dental-caries-affected tooth surfaces (tooth decay). To calculate each study member's Pace of Aging, we first transformed the biomarker values to a standardized scale. For each biomarker at each wave, we standardized values according to the age 26 distribution. Next, we calculated each study member's slope for each of the 19 biomarkers using a mixed-effects growth model that regressed the biomarker's level on age. Finally, we combined information from the 19 slopes of the biomarkers using a unit-weighting scheme. We calculated each study member's Pace of Aging as the sum of age-dependent annual changes in biomarker\nz\n-scores. Biomarker standardization was performed separately for men and women.", "doc_items_refs": ["#/texts/746", "#/texts/747", "#/texts/748", "#/texts/749", "#/texts/750", "#/texts/751", "#/texts/752", "#/texts/753", "#/texts/754", "#/texts/755", "#/texts/756", "#/texts/757", "#/texts/758", "#/texts/759", "#/texts/760"], "page_nos": [], "uuid": "442bb819-6c5f-4cdb-a8f4-e6ff71f69e53"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 39, "source_chunk_idxs": [56], "num_tokens": 462, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nMethods\nStatistical analyses\nDunedinPACNI\nA schematic of DunedinPACNI model development can be found in Fig.\n1\n. We trained an elastic net regression model to estimate the Pace of Aging from structural neuroimaging phenotypes in 860 Dunedin Study members at age 45 years (for the attrition analysis and inclusion criteria see Extended Data Figs.\n1\nand\n2\nand Supplementary Fig.\n4\n). We selected 315 FreeSurfer measures as predictors from the following categories: regional CT, regional cortical SA, regional cortical GMV, regional cortical GWR and 'ASEG' volumes (that is, regional subcortical GMV, ventricular volumes and bilateral volume of white matter hypointensities). All cortical data were parcellated according to the Desikan-Killiany Atlas\n111\n. Note that although many ADNI scans do not pass quality control (Supplementary Fig.\n5\n), FreeSurfer is a robust segmentation method, especially in healthy individuals\n112\n. Four phenotypes from the 'ASEG' volumes were excluded because of insufficient variance in the Dunedin Study (left and right white matter hypointensities, left and right non-white matter hypointensities). Model training was performed using the caret package in R. We conducted a grid search across a range of\nα\nand\nλ\nvalues. We used 100 repetitions of tenfold cross-validation to estimate model performance in held-out participants. The effect of sex was regressed from the Pace of Aging before model training. To prevent information leak during cross-validation, we regressed sex from each training set and applied the resulting\nβ\nweights to each test set. This approach ensured that our model only used information from the training set, including covariate regression, when calculating predictions in each test set. We selected optimal tuning parameters according to the highest variance explained and lowest mean absolute error. The optimal tuning parameters were\nα\n= 0.214 and\nλ\n= 0.100. Using these parameters, we fitted the model to the entire\nn\n= 860 sample. The raw elastic net regression model weights can be found in Supplementary Table\n18\n.", "doc_items_refs": ["#/texts/762", "#/texts/763", "#/texts/764", "#/texts/765", "#/texts/766", "#/texts/767", "#/texts/768", "#/texts/769", "#/texts/770", "#/texts/771", "#/texts/772", "#/texts/773", "#/texts/774", "#/texts/775", "#/texts/776", "#/texts/777", "#/texts/778", "#/texts/779", "#/texts/780", "#/texts/781", "#/texts/782", "#/texts/783", "#/texts/784", "#/texts/785", "#/texts/786", "#/texts/787", "#/texts/788", "#/texts/789", "#/texts/790"], "page_nos": [], "uuid": "f527dcfb-9b6d-4b66-a625-616b3cf85dc5"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 40, "source_chunk_idxs": [57, 58], "num_tokens": 474, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nMethods\nStatistical analyses\nDunedinPACNI\nTo generate DunedinPACNI scores in HCP, ADNI, UKB and BrainLat participants, we applied the regression weights from the DunedinPACNI model to FreeSurfer-derived phenotypes in each dataset and summed the products and model intercept. In ADNI, UKB and BrainLat, DunedinPACNI scores were correlated with chronological age (ADNI:\nr\n= 0.37; UKB:\nr\n= 0.50; BrainLat:\nr\n= 0.37; Supplementary Fig.\n8\n).\nIn addition, we conducted the same procedure again without GWR because this measure is not always distributed in public datasets. We observed slightly reduced model accuracy when GWR was not included. DunedinPACNI estimates without GWR phenotypes showed excellent test-retest reliability in HCP. DunedinPACNI estimates were similar with and without GWR phenotypes in ADNI, UKB and BrainLat (see Supplementary Figs.\n2\nand\n9\nfor more details).\n\nDunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nMethods\nStatistical analyses\nBrain age gap\nWe submitted raw T1-weighted images from ADNI, UKB and BrainLat to the publicly available brainageR algorithm (v.2.1). This model, which has been described in detail elsewhere\n113\n, is trained to predict chronological age in a sample of healthy, cognitively unimpaired individuals aged 18-92 years. This algorithm was selected because it generates highly reliable estimates among published algorithms\n64\n. Briefly, brainageR is estimated by first segmenting and normalizing T1-weighted images using SPM12. Next, coefficients derived from a Gaussian process regression model predicting chronological age in a training dataset (\nn\n= 2,001) are applied to morphometric features from brain segmentations to predict participants' chronological age. Brain age gap was subsequently estimated by subtracting actual chronological age from predicted age\n113\n. Notably, 15 ADNI scans failed the brain age gap pipeline (14 failed visual inspection of segmentation, one error when computing the predicted age). These scans were excluded from all brain age gap analyses, including comparative analyses with DunedinPACNI.", "doc_items_refs": ["#/texts/791", "#/texts/792", "#/texts/793", "#/texts/794", "#/texts/795", "#/texts/796", "#/texts/797", "#/texts/798", "#/texts/799", "#/texts/800", "#/texts/801", "#/texts/802", "#/texts/803", "#/texts/804", "#/texts/806", "#/texts/807", "#/texts/808", "#/texts/809", "#/texts/810", "#/texts/811", "#/texts/812", "#/texts/813", "#/texts/814"], "page_nos": [], "uuid": "f75957d5-ac11-438b-8369-db86de39b88c"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 41, "source_chunk_idxs": [59, 60, 61], "num_tokens": 440, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nMethods\nStatistical analyses\nDunedin Study validation analyses\nTo first test the validity of DunedinPACNI in the Dunedin Study training sample, we tested for linear associations between DunedinPACNI scores and one-legged balance, gait speed, step in place, chair stands, grip strength, visuomotor coordination, subjective physical limitations, subjective health, cognitive function, child-to-adult cognitive decline and facial aging while controlling for sex. We compared these effect sizes to associations between each of these measures and the original, longitudinal Pace of Aging.\n\nDunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nMethods\nStatistical analyses\nTest-retest reliability\nWe used the HCP dataset to assess the test-retest reliability of DunedinPACNI. Reliability was quantified using a two-way mixed-effects intraclass correlation coefficient (3,1) with session modeled as a fixed effect, participant as a random effect and the test-retest interval as an effect of no interest\n114\n.\n\nDunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nMethods\nStatistical analyses\nCognitive and physical functioning\nWe first used linear regression models to test for associations between DunedinPACNI and scores on tests of cognition, physical function and health in ADNI and UKB. All analyses controlled for age and sex. In ADNI, we calculated robust standard errors to account for nonindependence from repeated observations. We also tested the standardized differences in DunedinPACNI scores between three groups based on cognitive status: CN, MCI and dementia. All group difference comparisons controlled for age and sex. We again calculated robust standard errors to account for nonindependence and conduced a sensitivity analysis while controlling for\nAPOE\nε4 carriership. We repeated these analyses with brain age gap. Notably, when conducting analyses on the combined effects of DunedinPACNI and brain age gap on cognitive outcomes in ADNI, we restricted the sample to the first time point of each measure. These analyses included only one observation per participant, allowing us to more easily combine effect sizes and CIs.", "doc_items_refs": ["#/texts/816", "#/texts/818", "#/texts/819", "#/texts/820", "#/texts/822", "#/texts/823", "#/texts/824"], "page_nos": [], "uuid": "fda3f928-7bc8-4310-9691-4c2307f7e865"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 42, "source_chunk_idxs": [62, 63], "num_tokens": 418, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nMethods\nStatistical analyses\nDementia survival analysis\nWe conducted a Cox proportional hazards regression using the baseline DunedinPACNI scores of ADNI participants to predict their probability of cognitive decline or clinical conversion to dementia during the follow-up window. Conversion in CN participants was defined as having a diagnosis of CN at baseline but a diagnosis of MCI or dementia at the end of the follow-up. Conversion in participants with MCI was defined as having a diagnosis of MCI at baseline and a diagnosis of dementia by the end of the follow-up. Participants who had a baseline diagnosis of dementia or transitioned from MCI to CN were not included in this analysis. The analysis controlled for sex, age at baseline and length of the observation window. We investigated the influence of AD genetic risk on these results by conducting all analyses while additionally controlling for\nAPOE\nε4 carriership. We repeated these analyses for brain age gap.\n\nDunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nMethods\nStatistical analyses\nPrediction of hippocampal atrophy rates\nWe used repeated MRI measurements from ADNI (\nn\n= 1,302) and UKB (\nn\n= 4,601) to generate estimates of change in hippocampal GMV. We used longitudinal ComBat on ADNI MRI data to remove differential scanner effects\n115\n. Next, using all available time points for each participant, we generated multilevel linear models for bilateral hippocampal volume with random effects for both participant and age. Using these models, we derived trajectories to track change in hippocampal GMV for each participant. We then tested whether each participant's baseline DunedinPACNI scores could predict their subsequent rate of hippocampal atrophy. These analyses controlled for age, sex and length of the observation period. We investigated the influence of AD genetic risk on these results by conducting these analyses while additionally controlling for\nAPOE\nε4 carriership. We repeated these analyses for brain age gap.", "doc_items_refs": ["#/texts/826", "#/texts/827", "#/texts/828", "#/texts/830", "#/texts/831", "#/texts/832", "#/texts/833", "#/texts/834", "#/texts/835", "#/texts/836", "#/texts/837", "#/texts/838"], "page_nos": [], "uuid": "39691707-d5d5-40a2-b9e0-077b567c7e14"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 43, "source_chunk_idxs": [64, 65], "num_tokens": 330, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nMethods\nStatistical analyses\nMorbidity and mortality survival analyses\nTo investigate the association between DunedinPACNI and morbidity, we used UKB data to calculate the standardized differences in DunedinPACNI scores between three groups based on the number of lifetime chronic disease diagnosis (0, 1, 2+). Next, we conducted a Cox proportional hazards regression using UKB participants' baseline DunedinPACNI scores to predict the onset of a chronic aging-related disease (\nn\n= 827 emergent diagnoses: myocardial infarction, chronic obstructive pulmonary disease, dementia or stroke) in participants who had never previously received any of these diagnoses at the time of scanning (\nn\n= 40,753). Similarly, to investigate the association between DunedinPACNI and mortality, we conducted a Cox proportional hazards regression using UKB participants' baseline DunedinPACNI scores to predict death (\nn\n= 757 deaths). Both models controlled for baseline age, time to onset and sex. We repeated these analyses for brain age gap.\n\nDunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nMethods\nStatistical analyses\nSocioeconomic inequality analyses\nTo investigate whether DunedinPACNI reflected gradients of socioeconomic inequality\n57\n, we first tested for linear relationships between DunedinPACNI and years of education in ADNI and UKB. We also tested for a linear relationship between DunedinPACNI and household income in UKB. These analyses controlled for sex and age. In ADNI, we included only the first MRI observation per participant.", "doc_items_refs": ["#/texts/840", "#/texts/841", "#/texts/842", "#/texts/843", "#/texts/844", "#/texts/845", "#/texts/846", "#/texts/848", "#/texts/849", "#/texts/850"], "page_nos": [], "uuid": "e1a52e2e-ef3b-45f5-816a-ef2aa412407f"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 44, "source_chunk_idxs": [66, 67, 68], "num_tokens": 463, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nMethods\nStatistical analyses\nReplication in a Latin American sample\nTo investigate whether DunedinPACNI generalizes to samples of individuals who are underrepresented in neuroimaging research\n59\n, we tested whether the degree of acceleration in DunedinPACNI among ADNI participants with dementia was similar in BrainLat participants with dementia. We tested for standardized differences by comparing the AD and FTD groups to the CN group, respectively. We also tested for linear associations between DunedinPACNI and MoCA scores. All analyses in this sample controlled for age and sex. We then compared the magnitude of acceleration among BrainLat participants with dementia to the previously identified acceleration among ADNI participants with dementia. Lastly, we compared the strength of the linear association between DunedinPACNI and MoCA scores in BrainLat participants to the previously identified association in ADNI participants.\n\nDunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nMethods\nStatistical analyses\nComparison with hippocampal and ventricular volume\nWe investigated how DunedinPACNI differs from two commonly used MRI-based measures of brain aging: hippocampal volume and ventricular volume. We calculated hippocampal volume as the sum of left and right hippocampal GMV measures derived from FreeSurfer. Likewise, we calculated ventricular volume as the sum of the left and right lateral ventricular volume measures. We first repeated cross-sectional associations with cognition, frailty and poor health in UKB, substituting DunedinPACNI with hippocampal volume or ventricular volume. Next, we conducted this same procedure with our Cox proportional hazards regression models of chronic disease and mortality risk in UKB, and cognitive decline risk among CN ADNI participants. Lastly, we compared coefficients for all analyses while including DunedinPACNI and either hippocampal volume or ventricular volume in the respective models. All analyses controlled for age and sex.\nAll visualizations were generated using the R package ggplot2 (ref.\n116\n).\n\nDunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nMethods\nReporting summary\nFurther information on research design is available in the\nNature Portfolio Reporting Summary\nlinked to this article.", "doc_items_refs": ["#/texts/852", "#/texts/853", "#/texts/854", "#/texts/856", "#/texts/857", "#/texts/858", "#/texts/859", "#/texts/861", "#/texts/862", "#/texts/863"], "page_nos": [], "uuid": "73133636-d6cb-445f-b2ff-05897fb721fc"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 45, "source_chunk_idxs": [69, 70, 71], "num_tokens": 449, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nData availability\nThe Dunedin Study data are available via managed access. Researchers who wish to use the Dunedin Study data are invited to submit a concept paper proposing the data analysis project they wish to carry out, subject to the approval of the Dunedin Study investigators. Complete instructions on accessing the Dunedin Study data can be found at\nhttps://sites.duke.edu/moffittcaspiprojects/data-use-guidelines/\n. The HCP data are publicly available at\nwww.humanconnectomeproject.org/data/\n. The ADNI data are publicly available at\nhttps://adni.loni.usc.edu/\n. Researchers can apply to access all UKB data at\nhttps://ams.ukbiobank.ac.uk/ams/\n. The BrainLat data are publicly available at\nwww.synapse.org/Synapse:syn51549340/wiki/624187\n. Source data for Fig.\n1b\n, Fig.\n2a,b\n, Fig.\n3a,b\n, Fig.\n4b\n, Fig.\n5a\n, Fig.\n6\nand Fig.\n7\n, and Extended Data Figs.\n1\n-\n3\nand\n5\n-\n9\n) are published with this article.\n\nDunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nCode availability\nThe DunedinPACNI algorithm is publicly available at GitHub (\nhttps://github.com/etw11/DunedinPACNI\n). All scripts used in the analyses presented in this article are publicly available at GitHub (\nhttps://github.com/etw11/WhitmanElliott\\_2024\n).\n\nDunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nChange history\n- 03 July 2025 In the version of the article initially published, Terrie Moffitt was incorrectly listed as an equally contributing author. This has now been corrected so that Ethan Whitman and Maxwell Elliott are listed as the two equally contributing authors in the HTML and PDF versions of the article.", "doc_items_refs": ["#/texts/865", "#/texts/866", "#/texts/867", "#/texts/868", "#/texts/869", "#/texts/870", "#/texts/871", "#/texts/872", "#/texts/873", "#/texts/874", "#/texts/875", "#/texts/876", "#/texts/877", "#/texts/878", "#/texts/879", "#/texts/880", "#/texts/881", "#/texts/882", "#/texts/883", "#/texts/884", "#/texts/885", "#/texts/886", "#/texts/887", "#/texts/888", "#/texts/889", "#/texts/890", "#/texts/891", "#/texts/892", "#/texts/893", "#/texts/894", "#/texts/895", "#/texts/896", "#/texts/897", "#/texts/899", "#/texts/900", "#/texts/901", "#/texts/902", "#/texts/903", "#/texts/905"], "page_nos": [], "uuid": "e6af0e43-fc2f-4260-893e-77d7e4df761e"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 46, "source_chunk_idxs": [72], "num_tokens": 478, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nReferences\n1. Belsky, D. W. et al. Quantification of biological aging in young adults.\nProc. Natl Acad. Sci. USA\n112\n, E4104-E4110 (2015).\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n2. Elliott, M. L. et al. Disparities in the pace of biological aging among midlife adults of the same chronological age have implications for future frailty risk and policy.\nNat. Aging\n1\n, 295-308 (2021).\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n3. Kuo, P.-L. et al. Longitudinal phenotypic aging metrics in the Baltimore Longitudinal Study of Aging.\nNat. Aging\n2\n, 635-643 (2022).\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n4. Moqri, M. et al. Biomarkers of aging for the identification and evaluation of longevity interventions.\nCell\n186\n, 3758-3775 (2023).\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n5. Moqri, M. et al. Validation of biomarkers of aging.\nNat. Med.\n30\n, 360-372 (2024).\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n6. Justice, J. N. &amp; Kritchevsky, S. B. Putting epigenetic biomarkers to the test for clinical trials.\neLife\n9\n, e58592 (2020).\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n7. Melton, L. Scientists hone tools to measure aging and rejuvenation interventions.\nNat. Biotechnol.\n41\n, 1359-1361 (2023).\nArticle\nCAS\nPubMed\nGoogle Scholar\n8. Ubaida-Mohien, C. et al. Blood biomarkers for healthy aging.\nGerontology\n69\n, 1167-1174 (2023).\nArticle\nCAS\nPubMed\nGoogle Scholar\n9. Horvath, S. &amp; Raj, K. DNA methylation-based biomarkers and the epigenetic clock theory of ageing.\nNat. Rev. Genet.\n19\n, 371-384 (2018).\nArticle\nCAS\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/907", "#/texts/908", "#/texts/909", "#/texts/910", "#/texts/911", "#/texts/912", "#/texts/913", "#/texts/914", "#/texts/915"], "page_nos": [], "uuid": "d5411a1d-c8d0-4e7d-a4eb-4684cf390df9"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 47, "source_chunk_idxs": [73], "num_tokens": 482, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nReferences\n10. Rutledge, J., Oh, H. &amp; Wyss-Coray, T. Measuring biological age using omics data.\nNat. Rev. Genet.\n23\n, 715-727 (2022).\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n11. Hannum, G. et al. Genome-wide methylation profiles reveal quantitative views of human aging rates.\nMol. Cell\n49\n, 359-367 (2013).\nArticle\nCAS\nPubMed\nGoogle Scholar\n12. Horvath, S. DNA methylation age of human tissues and cell types.\nGenome Biol.\n14\n, R115 (2013).\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n13. Zhang, Q. et al. Improved precision of epigenetic clock estimates across tissues and its implication for biological ageing.\nGenome Med.\n11\n, 54 (2019).\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n14. Raffington, L. &amp; Belsky, D. W. Integrating DNA methylation measures of biological aging into social determinants of health research.\nCurr. Environ. Health Rep.\n9\n, 196-210 (2022).\nArticle\nPubMed\nGoogle Scholar\n15. Lu, A. T. et al. DNA methylation GrimAge strongly predicts lifespan and healthspan.\nAging\n11\n, 303-327 (2019).\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n16. Levine, M. E. et al. An epigenetic biomarker of aging for lifespan and healthspan.\nAging\n10\n, 573-591 (2018).\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n17. Sehgal, R. et al. Systems Age: a single blood methylation test to quantify aging heterogeneity across 11 physiological systems. Preprint at\nbioRxiv\nhttps://doi.org/10.1101/2023.07.13.548904\n(2024).\n18. Moffitt, T. E. Behavioral and social research to accelerate the geroscience translation agenda.\nAgeing Res. Rev.\n63\n, 101146 (2020).\nArticle\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/916", "#/texts/917", "#/texts/918", "#/texts/919", "#/texts/920", "#/texts/921", "#/texts/922", "#/texts/923", "#/texts/924"], "page_nos": [], "uuid": "17c159de-37a7-4a85-89d0-54d6bee11c3c"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 48, "source_chunk_idxs": [74], "num_tokens": 468, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nReferences\n19. Poulton, R., Guiney, H., Ramrakha, S. &amp; Moffitt, T. E. The Dunedin study after half a century: reflections on the past, and course for the future.\nJ. R. Soc. N. Z.\n53\n, 446-465 (2023).\nArticle\nPubMed\nGoogle Scholar\n20. Belsky, D. W. et al. DunedinPACE, a DNA methylation biomarker of the pace of aging.\neLife\n11\n, e73420 (2022).\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n21. Whitman, E. T. et al. A blood biomarker of the pace of aging is associated with brain structure: replication across three cohorts.\nNeurobiol. Aging\n136\n, 23-33 (2024).\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n22. Sugden, K. et al. Association of pace of aging measured by blood-based DNA methylation with age-related cognitive impairment and dementia.\nNeurology\n99\n, e1402-e1413 (2022).\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n23. Faul, J. D. et al. Epigenetic-based age acceleration in a representative sample of older Americans: associations with aging-related morbidity and mortality.\nProc. Natl Acad. Sci. USA\n120\n, e2215840120 (2023).\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n24. Harris, K. M. et al. Sociodemographic and lifestyle factors and epigenetic aging in US young adults: NIMHD social epigenomics program.\nJAMA Netw. Open\n7\n, e2427889 (2024).\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n25. Guida, J. L. et al. Associations of seven measures of biological age acceleration with frailty and all-cause mortality among adult survivors of childhood cancer in the St. Jude Lifetime Cohor.\nNat. Cancer\n5\n, 731-741 (2024).\nArticle\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/925", "#/texts/926", "#/texts/927", "#/texts/928", "#/texts/929", "#/texts/930", "#/texts/931"], "page_nos": [], "uuid": "23938307-b7e4-4a8c-b357-3b9edc02f39c"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 49, "source_chunk_idxs": [75], "num_tokens": 503, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nReferences\n26. Cole, J. H. et al. Predicting brain age with deep learning from raw imaging data results in a reliable and heritable biomarker.\nNeuroimage\n163\n, 115-124 (2017).\nArticle\nPubMed\nGoogle Scholar\n27. Bashyam, V. M. et al. MRI signatures of brain age and disease over the lifespan based on a deep brain network and 14 468 individuals worldwide.\nBrain\n143\n, 2312-2324 (2020).\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n28. Yin, C. et al. Anatomically interpretable deep learning of brain age captures domain-specific cognitive impairment.\nProc. Natl Acad. Sci. USA\n120\n, e2214634120 (2023).\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n29. Korbmacher, M. et al. Brain asymmetries from mid- to late life and hemispheric brain age.\nNat. Commun.\n15\n, 956 (2024).\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n30. Han, L. K. M. et al. Brain aging in major depressive disorder: results from the ENIGMA major depressive disorder working group.\nMol. Psychiatry\n26\n, 5124-5139 (2021).\nArticle\nCAS\nPubMed\nGoogle Scholar\n31. Sluiskes, M. H. et al. Clarifying the biological and statistical assumptions of cross-sectional biological age predictors: an elaborate illustration using synthetic and real data.\nBMC Med. Res. Methodol.\n24\n, 58 (2024).\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n32. Butler, E. R. et al. Pitfalls in brain age analyses.\nHum. Brain Mapp.\n42\n, 4092-4101 (2021).\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n33. Vidal-Pineiro, D. et al. Individual variations in 'brain age' relate to early-life factors more than to longitudinal brain change.\neLife\n10\n, e69995 (2021).\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n34. Biondo, F. et al. Brain-age is associated with progression to dementia in memory clinic patients.\nNeuroimage Clin.\n36\n, 103175 (2022).\nArticle\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/932", "#/texts/933", "#/texts/934", "#/texts/935", "#/texts/936", "#/texts/937", "#/texts/938", "#/texts/939", "#/texts/940"], "page_nos": [], "uuid": "65aff012-98d4-4ee0-b573-8af763534976"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 50, "source_chunk_idxs": [76], "num_tokens": 487, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nReferences\n35. Brain and body are more intertwined than we knew.\nNature\n623\n, 223-224 (2023).\n36. Fischl, B. FreeSurfer.\nNeuroimage\n62\n, 774-781 (2012).\nArticle\nPubMed\nGoogle Scholar\n37. Hsu, C.-W., Chang, C.-C. &amp; Lin, C.-J.\nA Practical Guide to Support Vector Classification\n(National Taiwan Univ., 2016);\nwww.csie.ntu.edu.tw/~cjlin/papers/guide/guide.pdf\n38. Belsky, D. W. et al. Quantification of the pace of biological aging in humans through a blood test, the DunedinPoAm DNA methylation algorithm.\neLife\n9\n, e54870 (2020).\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n39. Haufe, S. et al. On the interpretation of weight vectors of linear models in multivariate neuroimaging.\nNeuroimage\n87\n, 96-110 (2014).\nArticle\nPubMed\nGoogle Scholar\n40. Vidal-Piñeiro, D. et al. Accelerated longitudinal gray/white matter contrast decline in aging in lightly myelinated cortical regions.\nHum. Brain Mapp.\n37\n, 3669-3684 (2016).\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n41. Grydeland, H., Walhovd, K. B., Tamnes, C. K., Westlye, L. T. &amp; Fjell, A. M. Intracortical myelin links with performance variability across the human lifespan: results from T1- and T2-weighted MRI myelin mapping and diffusion tensor imaging.\nJ. Neurosci.\n33\n, 18618-18630 (2013).\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n42. Storsve, A. B. et al. Differential longitudinal changes in cortical thickness, surface area and volume across the adult life span: regions of accelerating and decelerating change.\nJ. Neurosci.\n34\n, 8488-8498 (2014).\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/941", "#/texts/942", "#/texts/943", "#/texts/944", "#/texts/945", "#/texts/946", "#/texts/947", "#/texts/948"], "page_nos": [], "uuid": "2f2acf2f-8795-40af-ad4c-842d84d8df0d"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 51, "source_chunk_idxs": [77], "num_tokens": 465, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nReferences\n43. Natu, V. S. et al. Apparent thinning of human visual cortex during childhood is associated with myelination.\nProc. Natl Acad. Sci. USA\n116\n, 20750-20759 (2019).\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n44. Raz, N. et al. Regional brain changes in aging healthy adults: general trends, individual differences and modifiers.\nCereb. Cortex\n15\n, 1676-1689 (2005).\nArticle\nPubMed\nGoogle Scholar\n45. Salat, D. H. et al. Thinning of the cerebral cortex in aging.\nCereb. Cortex\n14\n, 721-730 (2004).\nArticle\nPubMed\nGoogle Scholar\n46. Planche, V. et al. Structural progression of Alzheimer's disease over decades: the MRI staging scheme.\nBrain Commun.\n4\n, fcac109 (2022).\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n47. Salat, D. H. et al. Age-associated alterations in cortical gray and white matter signal intensity and gray to white matter contrast.\nNeuroimage\n48\n, 21-28 (2009).\nArticle\nCAS\nPubMed\nGoogle Scholar\n48. Walhovd, K. B. et al. Effects of age on volumes of cortex, white matter and subcortical structures.\nNeurobiol. Aging\n26\n, 1261-1270 (2005).\nArticle\nPubMed\nGoogle Scholar\n49. Van Essen, D. C. et al. The WU-Minn Human Connectome Project: an overview.\nNeuroimage\n80\n, 62-79 (2013).\nArticle\nPubMed\nGoogle Scholar\n50. Fortea, J. et al.\nAPOE4\nhomozygozity represents a distinct genetic form of Alzheimer's disease.\nNat. Med.\n30\n, 1284-1291 (2024).\nArticle\nCAS\nPubMed\nGoogle Scholar\n51. Jack, C. R. Jr et al. Rates of hippocampal atrophy correlate with change in clinical status in aging and AD.\nNeurology\n55\n, 484-489 (2000).\nArticle\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/949", "#/texts/950", "#/texts/951", "#/texts/952", "#/texts/953", "#/texts/954", "#/texts/955", "#/texts/956", "#/texts/957"], "page_nos": [], "uuid": "67b56970-caf4-49f9-8593-d6bd6cc5f370"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 52, "source_chunk_idxs": [78], "num_tokens": 481, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nReferences\n52. Jiang, R. et al. Associations of physical frailty with health outcomes and brain structure in 483 033 middle-aged and older adults: a population-based study from the UK Biobank.\nLancet Digit. Health\n5\n, e350-e359 (2023).\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n53. Fried, L. P. et al. Frailty in older adults: evidence for a phenotype.\nJ. Gerontol. A Biol. Sci. Med. Sci.\n56\n, M146-M157 (2001).\nArticle\nCAS\nPubMed\nGoogle Scholar\n54. Idler, E. L. &amp; Benyamini, Y. Self-rated health and mortality: a review of twenty-seven community studies.\nJ. Health Soc. Behav.\n38\n, 21-37 (1997).\nArticle\nCAS\nPubMed\nGoogle Scholar\n55. Chen-Xu, J. et al. Subnational inequalities in years of life lost and associations with socioeconomic factors in pre-pandemic Europe, 2009-19: an ecological study.\nLancet Public Health\n9\n, e166-e177 (2024).\nArticle\nPubMed\nGoogle Scholar\n56. Balaj, M. et al. Parental education and inequalities in child mortality: a global systematic review and meta-analysis.\nLancet\n398\n, 608-620 (2021).\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n57. Marmot, M. G. et al. Health inequalities among British civil servants: the Whitehall II study.\nLancet\n337\n, 1387-1393 (1991).\nArticle\nCAS\nPubMed\nGoogle Scholar\n58. Greene, A. S. et al. Brain-phenotype models fail for individuals who defy sample stereotypes.\nNature\n609\n, 109-118 (2022).\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n59. Baez, S., Alladi, S. &amp; Ibanez, A. Global South research is critical for understanding brain health, ageing and dementia.\nClin. Transl. Med.\n13\n, e1486 (2023).\nArticle\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/958", "#/texts/959", "#/texts/960", "#/texts/961", "#/texts/962", "#/texts/963", "#/texts/964", "#/texts/965"], "page_nos": [], "uuid": "624b59b8-9d75-4190-b626-270f68d0ebd8"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 53, "source_chunk_idxs": [79], "num_tokens": 450, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nReferences\n60. Moguilner, S. et al. Brain clocks capture diversity and disparities in aging and dementia across geographically diverse populations.\nNat. Med.\n30\n, 3646-3657 (2024).\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n61. Stephan, B. C. M. et al. Prediction of dementia risk in low-income and middle-income countries (the 10/66 Study): an independent external validation of existing models.\nLancet Glob. Health\n8\n, e524-e535 (2020).\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n62. Mills, M. C. &amp; Rahal, C. The GWAS Diversity Monitor tracks diversity by disease in real time.\nNat. Genet.\n52\n, 242-243 (2020).\nArticle\nCAS\nPubMed\nGoogle Scholar\n63. Prado, P. et al. The BrainLat project, a multimodal neuroimaging dataset of neurodegeneration from underrepresented backgrounds.\nSci. Data\n10\n, 889 (2023).\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n64. Dörfel, R. P. et al. Prediction of brain age using structural magnetic resonance imaging: a comparison of accuracy and test-retest reliability of publicly available software packages.\nHum. Brain Mapp.\n44\n, 6139-6148 (2023).\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n65. Belsky, D. W. et al. Eleven telomere, epigenetic clock, and biomarker-composite quantifications of biological aging: do they measure the same thing?.\nAm. J. Epidemiol.\n187\n, 1220-1230 (2018).\nPubMed\nGoogle Scholar\n66. Moqri, M. et al. A unified framework for systematic curation and evaluation of aging biomarkers. Preprint at\nRes. Sq.\nhttps://doi.org/10.21203/rs.3.rs-4481437/v1\n(2024).", "doc_items_refs": ["#/texts/966", "#/texts/967", "#/texts/968", "#/texts/969", "#/texts/970", "#/texts/971", "#/texts/972"], "page_nos": [], "uuid": "ccb54706-6faf-4545-91fa-c8c491ef2ffc"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 54, "source_chunk_idxs": [80], "num_tokens": 487, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nReferences\n67. Brayne, C. &amp; Moffitt, T. E. The limitations of large-scale volunteer databases to address inequalities and global challenges in health and aging.\nNat. Aging\n2\n, 775-783 (2022).\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n68. Wig, G. S. et al. Participant diversity is necessary to advance brain aging research.\nTrends Cogn. Sci.\n28\n, 92-96 (2024).\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n69. Falk, E. B. et al. What is a representative brain? Neuroscience meets population science.\nProc. Natl Acad. Sci. USA\n110\n, 17615-17622 (2013).\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n70. Elliott, M. L. et al. Brain morphometry in older adults with and without dementia using extremely rapid structural scans.\nNeuroimage\n276\n, 120173 (2023).\nArticle\nPubMed\nGoogle Scholar\n71. Greene, D. J. et al. Behavioral interventions for reducing head motion during MRI scans in children.\nNeuroimage\n171\n, 234-245 (2018).\nArticle\nPubMed\nGoogle Scholar\n72. Jack, C. R. Jr, Petersen, R. C., O'Brien, P. C. &amp; Tangalos, E. G. MR-based hippocampal volumetry in the diagnosis of Alzheimer's disease.\nNeurology\n42\n, 183-188 (1992).\nArticle\nPubMed\nGoogle Scholar\n73. Kannel, W. B., Wolf, P. A., Verter, J. &amp; McNamara, P. M. Epidemiologic assessment of the role of blood pressure in stroke. The Framingham study.\nJAMA\n214\n, 301-310 (1970).\nArticle\nCAS\nPubMed\nGoogle Scholar\n74. Sehl, M. E., Carroll, J. E., Horvath, S. &amp; Bower, J. E. The acute effects of adjuvant radiation and chemotherapy on peripheral blood epigenetic age in early stage breast cancer patients.\nNPJ Breast Cancer\n6\n, 23 (2020).\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/973", "#/texts/974", "#/texts/975", "#/texts/976", "#/texts/977", "#/texts/978", "#/texts/979", "#/texts/980"], "page_nos": [], "uuid": "6915b764-90d4-4830-88c8-36e63311f8d5"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 55, "source_chunk_idxs": [81], "num_tokens": 494, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nReferences\n75. Sehgal, R. et al. DNAm aging biomarkers are responsive: insights from 51 longevity interventional studies in humans. Preprint at\nbioRxiv\nhttps://doi.org/10.1101/2024.10.22.619522\n(2024).\n76. Melzer, D., Pilling, L. C. &amp; Ferrucci, L. The genetics of human ageing.\nNat. Rev. Genet.\n21\n, 88-101 (2020).\nArticle\nCAS\nPubMed\nGoogle Scholar\n77. Kim, K. et al. Association of adverse childhood experiences with accelerated epigenetic aging in midlife.\nJAMA Netw. Open\n6\n, e2317987 (2023).\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n78. Reuben, A. et al. Association of childhood lead exposure with MRI measurements of structural brain integrity in midlife.\nJAMA\n324\n, 1970-1979 (2020).\nArticle\nCAS\nPubMed\nGoogle Scholar\n79. Lee, H., Lee, M. W., Warren, J. R. &amp; Ferrie, J. Childhood lead exposure is associated with lower cognitive functioning at older ages.\nSci. Adv.\n8\n, eabn5164 (2022).\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n80. Livingston, G. et al. Dementia prevention, intervention, and care: 2020 report of the Lancet Commission.\nLancet\n396\n, 413-446 (2020).\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n81. Barzilai, N., Crandall, J. P., Kritchevsky, S. B. &amp; Espeland, M. A. Metformin as a tool to target aging.\nCell Metab.\n23\n, 1060-1065 (2016).\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n82. Kraus, W. E. et al. 2 years of calorie restriction and cardiometabolic risk (CALERIE): exploratory outcomes of a multicentre, phase 2, randomised controlled trial.\nLancet Diabetes Endocrinol.\n7\n, 673-683 (2019).\nArticle\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/981", "#/texts/982", "#/texts/983", "#/texts/984", "#/texts/985", "#/texts/986", "#/texts/987", "#/texts/988"], "page_nos": [], "uuid": "b1b821e1-7673-4e86-ba05-7fafb1cc049e"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 56, "source_chunk_idxs": [82], "num_tokens": 445, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nReferences\n83. Richmond-Rakerd, L. S. et al. Clustering of health, crime and social-welfare inequality in 4 million citizens from two nations.\nNat. Hum. Behav.\n4\n, 255-264 (2020).\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n84. Springer, B. A., Marin, R., Cyhan, T., Roberts, H. &amp; Gill, N. W. Normative values for the unipedal stance test with eyes open and closed.\nJ. Geriatr. Phys. Ther.\n30\n, 8-15 (2007).\nArticle\nPubMed\nGoogle Scholar\n85. Bohannon, R. W., Larkin, P. A., Cook, A. C., Gear, J. &amp; Singer, J. Decrease in timed balance test scores with aging.\nPhys. Ther.\n64\n, 1067-1070 (1984).\nArticle\nCAS\nPubMed\nGoogle Scholar\n86. Vereeck, L., Wuyts, F., Truijen, S. &amp; Van de Heyning, P. Clinical assessment of balance: normative data, and gender and age effects.\nInt. J. Audiol.\n47\n, 67-75 (2008).\nArticle\nPubMed\nGoogle Scholar\n87. Rasmussen, L. J. H. et al. Association of neurocognitive and physical function with gait speed in midlife.\nJAMA Netw. Open\n2\n, e1913123 (2019).\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n88. Jones, C. J. &amp; Rikli, R. E. Measuring functional fitness of older adults.\nJ. Act. Aging\n2002\n, 24-30 (2002).\nGoogle Scholar\n89. Rikli, R. E. &amp; Jones, C. J. Functional fitness normative scores for community-residing older adults, ages 60-94.\nJ. Aging Phys. Act.\n7\n, 162-181 (1999).\nArticle\nGoogle Scholar", "doc_items_refs": ["#/texts/989", "#/texts/990", "#/texts/991", "#/texts/992", "#/texts/993", "#/texts/994", "#/texts/995"], "page_nos": [], "uuid": "29a9779c-1154-4408-b768-dadbe5deb97e"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 57, "source_chunk_idxs": [83], "num_tokens": 469, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nReferences\n90. Jones, C. J., Rikli, R. E. &amp; Beam, W. C. A 30-s chair-stand test as a measure of lower body strength in community-residing older adults.\nRes. Q. Exerc. Sport\n70\n, 113-119 (1999).\nArticle\nCAS\nPubMed\nGoogle Scholar\n91. Mathiowetz, V. et al. Grip and pinch strength: normative data for adults.\nArch. Phys. Med. Rehabil.\n66\n, 69-74 (1985).\nCAS\nPubMed\nGoogle Scholar\n92. Rantanen, T. et al. Midlife hand grip strength as a predictor of old age disability.\nJAMA\n281\n, 558-560 (1999).\nArticle\nCAS\nPubMed\nGoogle Scholar\n93. Tucker-Drob, E. M., Brandmaier, A. M. &amp; Lindenberger, U. Coupled cognitive changes in adulthood: a meta-analysis.\nPsychol. Bull.\n145\n, 273-301 (2019).\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n94. Glasser, M. F. et al. The minimal preprocessing pipelines for the Human Connectome Project.\nNeuroimage\n80\n, 105-124 (2013).\nArticle\nPubMed\nGoogle Scholar\n95. Veitch, D. P. et al. The Alzheimer's Disease Neuroimaging Initiative in the era of Alzheimer's disease treatment: a review of ADNI studies from 2021 to 2022.\nAlzheimers Dement.\n20\n, 652-694 (2024).\nArticle\nPubMed\nGoogle Scholar\n96. Jack, C. R. Jr et al. The Alzheimer's Disease Neuroimaging Initiative (ADNI): MRI methods.\nJ. Magn. Reson. Imaging\n27\n, 685-691 (2008).\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n97. Rosen, W. G., Mohs, R. C. &amp; Davis, K. L. A new rating scale for Alzheimer's disease.\nAm. J. Psychiatry\n141\n, 1356-1364 (1984).\nArticle\nCAS\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/996", "#/texts/997", "#/texts/998", "#/texts/999", "#/texts/1000", "#/texts/1001", "#/texts/1002", "#/texts/1003"], "page_nos": [], "uuid": "499c8e0a-2ab1-41a5-b4f3-33f729bbdc46"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 58, "source_chunk_idxs": [84], "num_tokens": 485, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nReferences\n98. Mohs, R. C. et al. Development of cognitive instruments for use in clinical trials of antidementia drugs: additions to the Alzheimer's Disease Assessment Scale that broaden its scope. The Alzheimer's Disease Cooperative Study.\nAlzheimer Dis. Assoc. Disord.\n11\n, S13-S21 (1997).\nArticle\nPubMed\nGoogle Scholar\n99. Folstein, M. F., Folstein, S. E. &amp; McHugh, P. R. 'Mini-mental state'. A practical method for grading the cognitive state of patients for the clinician.\nJ. Psychiatr. Res.\n12\n, 189-198 (1975).\nArticle\nCAS\nPubMed\nGoogle Scholar\n100. Nasreddine, Z. S. et al. The Montreal Cognitive Assessment, MoCA: a brief screening tool for mild cognitive impairment.\nJ. Am. Geriatr. Soc.\n53\n, 695-699 (2005).\nArticle\nPubMed\nGoogle Scholar\n101. Pfeffer, R. I., Kurosaki, T. T., Harrah, C. H. Jr, Chance, J. M. &amp; Filos, S. Measurement of functional activities in older adults in the community.\nJ. Gerontol.\n37\n, 323-329 (1982).\nArticle\nCAS\nPubMed\nGoogle Scholar\n102. Sudlow, C. et al. UK biobank: an open access resource for identifying the causes of a wide range of complex diseases of middle and old age.\nPLoS Med.\n12\n, e1001779 (2015).\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n103. Alfaro-Almagro, F. et al. Image processing and quality control for the first 10,000 brain imaging datasets from UK Biobank.\nNeuroimage\n166\n, 400-424 (2018).\nArticle\nPubMed\nGoogle Scholar\n104. Reuter, M., Schmansky, N. J., Rosas, H. D. &amp; Fischl, B. Within-subject template estimation for unbiased longitudinal image analysis.\nNeuroimage\n61\n, 1402-1418 (2012).\nArticle\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/1004", "#/texts/1005", "#/texts/1006", "#/texts/1007", "#/texts/1008", "#/texts/1009", "#/texts/1010"], "page_nos": [], "uuid": "81a88dec-b43c-48ef-a59a-e4ce0490fb2c"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 59, "source_chunk_idxs": [85], "num_tokens": 511, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nReferences\n105. Fischl, B. &amp; Dale, A. M. Measuring the thickness of the human cerebral cortex from magnetic resonance images.\nProc. Natl Acad. Sci. USA\n97\n, 11050-11055 (2000).\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n106. Reuter, M. &amp; Fischl, B. Avoiding asymmetry-induced bias in longitudinal image processing.\nNeuroimage\n57\n, 19-21 (2011).\nArticle\nPubMed\nGoogle Scholar\n107. Reuter, M., Rosas, H. D. &amp; Fischl, B. Highly accurate inverse consistent registration: a robust approach.\nNeuroimage\n53\n, 1181-1196 (2010).\nArticle\nPubMed\nGoogle Scholar\n108. Fawns-Ritchie, C. &amp; Deary, I. J. Reliability and validity of the UK Biobank cognitive tests.\nPLoS ONE\n15\n, e0231627 (2020).\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n109. Williams, D. M., Jylhävä, J., Pedersen, N. L. &amp; Hägg, S. A frailty index for UK biobank participants.\nJ. Gerontol. A Biol. Sci. Med. Sci.\n74\n, 582-587 (2019).\nArticle\nPubMed\nGoogle Scholar\n110. Chadeau-Hyam, M. et al. Education, biological ageing, all-cause and cause-specific mortality and morbidity: UK biobank cohort study.\nEClinicalMedicine\n29-30\n, 100658 (2020).\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n111. Desikan, R. S. et al. An automated labeling system for subdividing the human cerebral cortex on MRI scans into gyral based regions of interest.\nNeuroimage\n31\n, 968-980 (2006).\nArticle\nPubMed\nGoogle Scholar\n112. Alfaro-Almagro, F. et al. Confound modelling in UK Biobank brain imaging.\nNeuroimage\n224\n, 117002 (2021).\nArticle\nPubMed\nGoogle Scholar\n113. Cole, J. H. et al. Brain age predicts mortality.\nMol. Psychiatry\n23\n, 1385-1392 (2018).\nArticle\nCAS\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/1011", "#/texts/1012", "#/texts/1013", "#/texts/1014", "#/texts/1015", "#/texts/1016", "#/texts/1017", "#/texts/1018", "#/texts/1019"], "page_nos": [], "uuid": "a359e5d5-98c0-4130-86c7-fa68a195ddaf"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 60, "source_chunk_idxs": [86], "num_tokens": 160, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nReferences\n114. Shrout, P. E. &amp; Fleiss, J. L. Intraclass correlations: uses in assessing rater reliability.\nPsychol. Bull.\n86\n, 420-428 (1979).\nArticle\nCAS\nPubMed\nGoogle Scholar\n115. Beer, J. C. et al. Longitudinal ComBat: a method for harmonizing longitudinal multi-scanner imaging data.\nNeuroimage\n220\n, 117129 (2020).\nArticle\nPubMed\nGoogle Scholar\n116. Wilkinson, L. Ggplot2: elegant graphics for data analysis by WICKHAM, H.\nBiometrics\n67\n, 678-679 (2011).\nArticle\nGoogle Scholar\nDownload references", "doc_items_refs": ["#/texts/1020", "#/texts/1021", "#/texts/1022", "#/texts/1023"], "page_nos": [], "uuid": "5504fce1-8d2d-438d-88c6-9b0eddc02f57"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 61, "source_chunk_idxs": [87], "num_tokens": 510, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nAcknowledgements\nThis research received support from the National Institute on Aging (grant no. R01AG049789 to A.R.H. and T.E.M.; grant no. R01AG032282 to A.C. and T.E.M.; grant no. R01AG073207 to A.C. and T.E.M.) and the UK Medical Research Council (grant no. MR/X021149/1 to A.C. and T.E.M.). The Dunedin Multidisciplinary Health and Development Research Unit is supported by the New Zealand Health Research Council (program grant no. 16-604). We thank the Dunedin Study members, Unit research staff, the previous Study Director, Emeritus Distinguished Professor, the late R. Poulton, for his leadership during the study's research transition from young adulthood to aging (2000-2023), and Study founder P. A. Silva. The Dunedin Unit is located within the Ngāi Tahu tribal area who we acknowledge as first peoples, tangata whenua (people of this land). This research has been conducted using the UKB Resource under application no. 67237. Data collection and sharing for ADNI is funded by the National Institute on Aging (National Institutes of Health grant no. U19 AG024904). The grantee organization is the Northern California Institute for Research and Education. In the past, ADNI has also received funding from the National Institute of Biomedical Imaging and Bioengineering, the Canadian Institutes of Health Research and private sector contributions through the Foundation for the NIH, including generous contributions from the following: AbbVie, Alzheimer's Association, Alzheimer's Drug Discovery Foundation, Araclon Biotech, BioClinica, Biogen, Bristol Myers Squibb, CereSpir, Cogstate, Eisai, Elan Pharmaceuticals, Eli Lilly and Company, EuroImmun, F. Hoffmann-La Roche and its affiliated company Genentech, Fujirebio, GE Healthcare, IXICO, Janssen Alzheimer Immunotherapy Research &amp; Development, Johnson &amp; Johnson Pharmaceutical Research &amp; Development, Lumosity, Lundbeck, Merck &amp; Co., Meso Scale Diagnostics, NeuroRx Research,", "doc_items_refs": ["#/texts/1025"], "page_nos": [], "uuid": "d4370721-896c-4e54-8141-7d5a2d516791"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 62, "source_chunk_idxs": [88, 89], "num_tokens": 109, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nAcknowledgements\nNeurotrack Technologies, Novartis Pharmaceuticals Corporation, Pfizer, Piramal Imaging, Servier, Takeda Pharmaceutical Company and Transition Therapeutics. We thank BrainLat and associated investigators for sharing the BrainLat dataset.\n\nDunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nAuthor information\nAuthor notes\n1. These authors contributed equally: Ethan T. Whitman, Maxwell L. Elliott.", "doc_items_refs": ["#/texts/1025", "#/texts/1027", "#/texts/1028"], "page_nos": [], "uuid": "5b75cf7d-0180-4458-8af8-bc81e654dd90"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 63, "source_chunk_idxs": [90], "num_tokens": 436, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nAuthor information\nAuthors and Affiliations\n1. Department of Psychology and Neuroscience, Duke University, Durham, NC, USA Ethan T. Whitman, Annchen R. Knodt, Karen Sugden, Benjamin S. Williams, Avshalom Caspi, Terrie E. Moffitt &amp; Ahmad R. Hariri\n2. Department of Psychology, Center for Brain Science, Harvard University, Cambridge, MA, USA Maxwell L. Elliott\n3. Department of Psychology, University of Otago, Dunedin, New Zealand Wickliffe C. Abraham\n4. Department of Medicine, University of Otago, Christchurch, New Zealand Tim J. Anderson &amp; Tracy R. Melzer\n5. New Zealand Brain Research Institute, Christchurch, New Zealand Tim J. Anderson &amp; Tracy R. Melzer\n6. Department of Neurology, Christchurch Hospital, Waitaha Canterbury, Te Whatu Ora-Health New Zealand, Christchurch, New Zealand Tim J. Anderson\n7. Department of Medicine, University of Otago, Dunedin, New Zealand Nicholas J. Cutfield\n8. Dunedin Multidisciplinary Health and Development Research Unit, Department of Psychology, University of Otago, Dunedin, New Zealand Sean Hogan, David Ireland, Sandhya Ramrakha &amp; Reremoana Theodore\n9. Te Kura Mahi ā-Hirikapo, School of Psychology, Speech and Hearing, University of Canterbury, Christchurch, New Zealand Tracy R. Melzer\n10. Pacific Radiology Canterbury, Christchurch, New Zealand Tracy R. Melzer\n11. King's College London, Social, Genetic, and Developmental Psychiatry Centre, Institute of Psychiatry, Psychology, &amp; Neuroscience, London, UK Avshalom Caspi &amp; Terrie E. Moffitt\n12. PROMENTA, Department of Psychology, University of Oslo, Oslo, Norway Avshalom Caspi &amp; Terrie E. Moffitt\n13. Department of Psychiatry and Behavioral Sciences, Duke University, Durham, NC, USA Avshalom Caspi &amp; Terrie E. Moffitt\nAuthors", "doc_items_refs": ["#/texts/1030", "#/texts/1031", "#/texts/1032", "#/texts/1033", "#/texts/1034", "#/texts/1035", "#/texts/1036", "#/texts/1037", "#/texts/1038", "#/texts/1039", "#/texts/1040", "#/texts/1041", "#/texts/1042", "#/texts/1043"], "page_nos": [], "uuid": "8b75718d-e32b-4320-8ee6-9e4897479b37"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 64, "source_chunk_idxs": [91], "num_tokens": 307, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nAuthor information\nAuthors and Affiliations\n1. Ethan T. Whitman\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n2. Maxwell L. Elliott\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n3. Annchen R. Knodt\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n4. Wickliffe C. Abraham\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n5. Tim J. Anderson\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n6. Nicholas J. Cutfield\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n7. Sean Hogan\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n8. David Ireland\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n9. Tracy R. Melzer\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n10. Sandhya Ramrakha\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n11. Karen Sugden\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n12. Reremoana Theodore\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n13. Benjamin S. Williams\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n14. Avshalom Caspi\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n15. Terrie E. Moffitt\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n16. Ahmad R. Hariri\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/1044", "#/texts/1045", "#/texts/1046", "#/texts/1047", "#/texts/1048", "#/texts/1049", "#/texts/1050", "#/texts/1051", "#/texts/1052", "#/texts/1053", "#/texts/1054", "#/texts/1055", "#/texts/1056", "#/texts/1057", "#/texts/1058", "#/texts/1059"], "page_nos": [], "uuid": "c75adda1-5344-4ffb-8d65-f0f9c32c2cc0"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 65, "source_chunk_idxs": [92, 93, 94, 95, 96], "num_tokens": 456, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nAuthor information\nContributions\nE.T.W., M.L.E., A.R.K., A.C., T.E.M. and A.R.H. designed the research. E.T.W., M.L.E., A.R.K., W.C.A., T.J.A., N.J.C., S.H., D.I., T.R.M., S.R., K.S., R.T., B.S.W., A.C., T.E.M. and A.R.H. performed the research. E.T.W., M.L.E. and A.R.K. analyzed the data. E.T.W., M.L.E., A.R.K., A.C., T.E.M. and A.R.H. wrote the paper.\n\nDunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nAuthor information\nCorresponding authors\nCorrespondence to\nEthan T. Whitman\nor\nTerrie E. Moffitt\n.\n\nDunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nEthics declarations\nCompeting interests\nK.S., A.C. and T.E.M. are listed as inventors of DunedinPACE, a Duke University and University of Otago invention licensed to TruDiagnostic for commercial uses; however, the DunedinPACE algorithm is open access for research purposes. The other authors declare no competing interests.\n\nDunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nPeer review\nPeer review information\nNature Aging\nthanks Denise C. Park and the other, anonymous, reviewer(s) for their contribution to the peer review of this work.\n\nDunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nAdditional information\nPublisher's note\nSpringer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations.", "doc_items_refs": ["#/texts/1061", "#/texts/1063", "#/texts/1064", "#/texts/1065", "#/texts/1066", "#/texts/1067", "#/texts/1070", "#/texts/1073", "#/texts/1074", "#/texts/1076", "#/texts/1077"], "page_nos": [], "uuid": "5e043804-b156-40bf-bf8e-7980f1066a65"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 66, "source_chunk_idxs": [97], "num_tokens": 431, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nExtended data\nExtended Data Fig. 1 Dunedin Study attrition analysis using IQ.\nNo significant differences in childhood IQ were found between the full cohort, those still alive, those seen at Phase 45, or those scanned at Phase 45. Those who were deceased by the Phase 45 data collection had significantly lower childhood IQ's than those who were still alive (t = 2.09, p = 0.04). Center lines of boxes represent the median. Lower and upper hinges of boxes represent the 25th and 75th percentiles. Whiskers show the range. The red line connects the means of each distribution. We report childhood IQ because it is known to be a strong predictor of late-life health outcomes, as shown by many cohort studies from many nations. Childhood IQ predicts health and social outcomes in adulthood, and these outcomes include physical functions, cognitive decline, mental health, inflammation, metabolic syndrome, disease incidence, dementia, mortality, and also neuroimaging-based, genomic, and epigenetic indicators of health. Based on the literature, we report three groups: study members who died before age 45, and thus could not have taken part in data collection, study members who were alive and thus could take part, and study members who actually did take part. We compared these three groups to the original birth cohort. The figure shows that the small group of study members who had died before age 45 had significantly lower mean childhood IQ as a group. Some of the early deaths were Dunedin Study members who had more disadvantages in their lives leading to poorer health and increased risk of early mortality. Study members who died of childhood diseases may have been already unwell at the time of IQ testing, which could have lowered their scores. However, cohort members who are still alive and cohort members who took part in data collection did not differ from the full original cohort on their mean childhood IQ; they still represent population variation on this key health risk factor. Abbreviations: IQ = intelligence quotient.\nSource data", "doc_items_refs": ["#/texts/1080", "#/texts/1081"], "page_nos": [], "uuid": "d35784f3-4ca2-40e8-a92e-727c1cc40aa4"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 67, "source_chunk_idxs": [98], "num_tokens": 376, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nExtended data\nExtended Data Fig. 2 Dunedin Study attrition analysis using SES.\nNo significant differences were found between the full cohort, those deceased, those alive, those seen at Phase 45, or those scanned at Phase 45 on childhood SES. Center lines of boxes represent the median. Lower and upper hinges of boxes represent the 25th and 75th percentiles. Whiskers show the range. The red line connects the means of each distribution. We report childhood SES because it is known to be a strong predictor of late-life health outcomes, as shown by many cohort studies from many nations. Childhood SES separately predicts health and social outcomes in adulthood, and these outcomes include physical functions, cognitive decline, mental health, inflammation, metabolic syndrome, disease incidence, dementia, mortality, and also neuroimaging-based, genomic, and epigenetic indicators of health. Based on the literature, we report three groups: study members who died before age 45, and thus could not have taken part in data collection, study members who were alive and thus could take part, and study members who actually did take part. We compared these three groups to the original birth cohort. The figure shows that the small group of study members who had died before age 45 had somewhat lower mean childhood SES as a group. Some of the early deaths were Dunedin Study members who had more disadvantages in their lives leading to poorer health and increased risk of early mortality. However, cohort members who are still alive and cohort members who took part in data collection did not differ from the full original cohort on their mean childhood SES; they still represent population variation on this key health risk factor. Abbreviations: SES = socioeconomic status.\nSource data", "doc_items_refs": ["#/texts/1083", "#/texts/1084"], "page_nos": [], "uuid": "aa9798ee-bc11-46a8-8503-0047f8d59ee4"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 68, "source_chunk_idxs": [99], "num_tokens": 280, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nExtended data\nExtended Data Fig. 3 Associations with DunedinPACNI while excluding participants who go on to have cognitive decline or have high genetic risk for Alzheimer's Disease in the UK Biobank.\na\n. Forest plot of associations between cognitive, frailty, health, and social class measures and DunedinPACNI with and without inclusion of participants who later develop dementia or who carry two\nAPOE\nE4 risk alleles. Effects are presented as standardized beta coefficients with error bars as 95% confidence intervals. Note that for visualization, the signs of some outcomes were flipped, such that higher scores for all outcomes reflected worse performance or health.\nb\n. Forest plot of DunedinPACNI hazard ratios for chronic disease and mortality with and without inclusion of participants who develop dementia or carry two\nAPOE\nE4 risk alleles. Effects are presented as hazard ratios with error bars as 95% confidence intervals. Exact sample sizes for all tests are presented in Supplementary Table\n4\n. Abbreviations: DSST = Digit Symbol Substitution Task, HR = hazard ratio, IQ = intelligence quotient, Matrix = Matrix Pattern Completion, RT = Reaction Time, Tower = Tower Rearranging, TrailsA = Trail Making Test Part A, TrailsB = Trail Making Test Part B, VM = Visual Memory, WM = Working Memory.\nSource data", "doc_items_refs": ["#/texts/1086", "#/texts/1087", "#/texts/1088", "#/texts/1089", "#/texts/1090", "#/texts/1091", "#/texts/1092", "#/texts/1093", "#/texts/1094", "#/texts/1095", "#/texts/1096"], "page_nos": [], "uuid": "cf9aca88-0eb7-4b01-967c-0d676a2e74a0"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 69, "source_chunk_idxs": [100, 101], "num_tokens": 424, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nExtended data\nExtended Data Fig. 4 DunedinPACNI prediction of cognitive decline in ADNI with full follow-up window.\nSurvival curve of the relative proportion of 624 cognitively normal ADNI participants at baseline who remained cognitively normal during the follow-up window grouped by slow, average, and fast baseline DunedinPACNI scores. Censored timepoints (that is, points when participants either converted to MCI/dementia or were lost to follow-up) are shown with cross marks. Note that relatively few participants have &gt;9 years of follow-up. Abbreviations: ADNI = Alzheimer's Disease Neuroimaging Initiative, SD = standard deviation.\n\nDunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nExtended data\nExtended Data Fig. 5 Comparison of DunedinPACNI and brain age gap associations with clinical outcomes in BrainLat.\na\n. Forest plots of DunedinPACNI and brain age gap standardized mean differences between dementia groups and healthy controls in BrainLat. Error bars represent 95% confidence intervals. Lighter shades represent the effect size for each measure while controlling for the other measure (that is, effect of DunedinPACNI when controlling for brain age gap, and vice versa).\nb\n. Forest plots of DunedinPACNI and brain age gap absolute standardized association effect sizes with the MoCA. Error bars represent 95% confidence intervals. Lighter shades represent the effect size for each measure while controlling for the other measure (that is, effect of DunedinPACNI when controlling for brain age gap, and vice versa).\nc\n. Forest plot of absolute standardized associations between DunedinPACNI alone, brain age gap alone, and their combined associations with MoCA scores in BrainLat. Error bars represent 95% confidence intervals. Exact sample sizes for all tests are presented in Supplementary Tables\n10\n,\n11\n). Abbreviations: AD = Alzheimer's dementia, FTD = frontotemporal dementia, MoCA = Montreal Cognitive Assessment, SDs = standard deviations.\nSource data", "doc_items_refs": ["#/texts/1098", "#/texts/1100", "#/texts/1101", "#/texts/1102", "#/texts/1103", "#/texts/1104", "#/texts/1105", "#/texts/1106", "#/texts/1107", "#/texts/1108", "#/texts/1109", "#/texts/1110"], "page_nos": [], "uuid": "c833584d-bfac-4cef-948f-01c2ad128e6f"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 70, "source_chunk_idxs": [102], "num_tokens": 471, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nExtended data\nExtended Data Fig. 6 Combined effects of DunedinPACNI and brain age gap were generally more sensitive to clinical outcomes.\na\n. Forest plots for effect sizes for DunedinPACNI alone, brain age gap alone, and their combined associations with clinical outcomes. Combined effects were considered to be the sum of beta coefficients when both DunedinPACNI and brain age gap were included in a model while controlling for age and sex. Error bars represent 95% confidence intervals. Note that for visualization, the signs of some outcomes were flipped, such that higher scores for all outcomes reflected worse performance or health.\nb\n. Forest plots of hazard ratios for risk of cognitive decline, dementia, chronic disease, and death. Combined effects were considered to be the products of respective hazard ratios for DunedinPACNI and brain age gap included in a model while controling for age and sex. Error bars represent 95% confidence intervals. Exact sample sizes for each test in\na\n. and\nb\n. are reported in Supplementary Tables\n2\n,\n3\n,\n7\n-\n9\n). Note that for cognitive tests in ADNI, only baseline observations were used in this analysis to facilitate combination of effects. Thus, sample sizes for these tests are reflected by the number of individuals, not observations, in the sample. This information is provided in Supplementary Table\n2\n. Abbreviations: ADAS-Cog = Alzheimer's Disease Assessment Scale - Cognitive Subscale 13, ADLs = activities of daily living, ADNI = Alzheimer's Disease Neuroimaging Initiative, CI = confidence interval, CN = cognitively normal, Cog. = cognitive, DSST = Digit Symbol Substitution Task, FAQ = Functional Activities Questionnaire, Hipp. = hippocampal, HR = hazard ratio, IQ = intelligence quotient, LogMemory = Logical Memory, Matrix = Matrix Pattern Completion, MCI = mild cognitive impairment, MMSE = Mini-Mental State Exam, MoCA = Montreal Cognitive Assessment, RT = Reaction Time, RAVLT = Rey Auditory Visual Learning Test, SD = standard deviation, Tower = Tower Rearranging, TrailsA = Trail Making Test Part A, TrailsB = Trail Making Test Part B, VM = Visual Memory, WM = Working Memory.\nSource data", "doc_items_refs": ["#/texts/1112", "#/texts/1113", "#/texts/1114", "#/texts/1115", "#/texts/1116", "#/texts/1117", "#/texts/1118", "#/texts/1119", "#/texts/1120", "#/texts/1121", "#/texts/1122", "#/texts/1123", "#/texts/1124", "#/texts/1125", "#/texts/1126", "#/texts/1127", "#/texts/1128", "#/texts/1129", "#/texts/1130"], "page_nos": [], "uuid": "ab069d0a-7ec3-440e-8140-25ecb093a5c2"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 71, "source_chunk_idxs": [103], "num_tokens": 322, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nExtended data\nExtended Data Fig. 7 Cross-sectional cognitive associations with DunedinPACNI, hippocampal volume, and ventricular volume in the UK Biobank.\na\n. Forest plot of associations between cognitive measures and DunedinPACNI and hippocampal volume. Effects are presented as standardized beta coefficients with error bars as 95% confidence intervals. Note that we flipped the direction of hippocampal associations to match the direction of DunedinPACNI.\nb\n. Forest plot of associations between cognitive measures and DunedinPACNI and ventricular volume. Effects are presented as standardized beta coefficients with error bars as 95% confidence intervals. Lighter shades represent the effect size for each measure while controlling for the other measure (that is, effect of DunedinPACNI when controlling for hippocampal or ventricular volume, and vice versa). Note that for visualization, the signs of some outcomes were flipped, such that higher scores for all outcomes reflected worse performance or health. Exact effect sizes and sample sizes for each test are presented in Supplementary Table\n12\n,\n13\n). Abbreviations: DSST = Digit Symbol Substitution Task, Hipp. = hippocampus, IQ = intelligence quotient, Matrix = Matrix Pattern Completion, RT = Reaction Time, Tower = Tower Rearranging, TrailsA = Trail Making Test Part A, TrailsB = Trail Making Test Part B, Vent. = ventricle, vol. = volume, VM = Visual Memory, WM = Working Memory.\nSource data", "doc_items_refs": ["#/texts/1132", "#/texts/1133", "#/texts/1134", "#/texts/1135", "#/texts/1136", "#/texts/1137", "#/texts/1138", "#/texts/1139", "#/texts/1140"], "page_nos": [], "uuid": "0148f0a0-0ca1-485d-aff3-b6cae3f8a0b4"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 72, "source_chunk_idxs": [104, 105], "num_tokens": 505, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nExtended data\nExtended Data Fig. 8 Cross-sectional frailty and health associations with DunedinPACNI, hippocampal volume, and ventricular volume in the UK Biobank.\na\n. Forest plot of associations between frailty and health measures and DunedinPACNI and hippocampal volume. Effects are presented as standardized beta coefficients with error bars as 95% confidence intervals. Note that we flipped the direction of hippocampal associations to match the direction of DunedinPACNI.\nb\n. Forest plot of associations between frailty and health measures and DunedinPACNI and ventricle volume. Effects are presented as standardized beta coefficients with error bars as 95% confidence intervals. Lighter shades represent the effect size for each measure while controlling for the other measure (that is, effect of DunedinPACNI when controlling for hippocampal or ventricular volume, and vice versa). Exact sample sizes for each test are presented in Supplementary Table\n12\n,\n13\n). Abbreviations: Hipp. = hippocampus, Vent. = ventricle, vol. = volume.\nSource data\n\nDunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nExtended data\nExtended Data Fig. 9 Cognitive decline, disease, and mortality prediction by DunedinPACNI, hippocampal volume, and ventricular volume.\na\n. Cognitive decline prediction among cognitively normal ADNI participants,\nb\n. Chronic disease prediction in UK Biobank.\nC\n. Mortality prediction in UK Biobank. Gray points indicate hazard ratios for each brain measure while covarying for sex and age at scan. The blue point indicates the DunedinPACNI hazard ratio while also covarying for hippocampal volume. The pink point indicates the DunedinPACNI hazard ratio while covarying for ventricular volume. The orange points indicate the hippocampal and ventricular volume hazard ratios while covarying for DunedinPACNI. Note that we flipped the direction of hippocampal associations to match the direction of DunedinPACNI. Error bars on all plots represent 95% confidence intervals. Exact sample sizes for each test are presented in Supplementary Table\n14\n). Abbreviations: ADNI = Alzheimer's Disease Neuroimaging Initiative, Hipp. = hippocampus, HR = hazard ratio, UKB = UK Biobank, Vent. = ventricle, vol. = volume.\nSource data", "doc_items_refs": ["#/texts/1142", "#/texts/1143", "#/texts/1144", "#/texts/1145", "#/texts/1146", "#/texts/1147", "#/texts/1148", "#/texts/1149", "#/texts/1150", "#/texts/1152", "#/texts/1153", "#/texts/1154", "#/texts/1155", "#/texts/1156", "#/texts/1157", "#/texts/1158", "#/texts/1159", "#/texts/1160"], "page_nos": [], "uuid": "344133c4-e8b0-4a50-94af-1fe99dbc50f7"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 73, "source_chunk_idxs": [106, 107, 108, 109, 110, 111, 112, 113], "num_tokens": 276, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nSupplementary information\nSupplementary Information\nSupplementary Figs. 1-9 and Tables 1-18.\n\nDunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nSupplementary information\nSupplementary Table 18\nRaw elastic net regression weights from the DunedinPACNI algorithm.\n\nDunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nSource data\nSource Data Fig. 1\nStatistical source data for Fig. 1.\n\nDunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nSource data\nSource Data Fig. 2\nStatistical source data for Fig. 2.\n\nDunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nSource data\nSource Data Fig. 3\nStatistical source data for Fig. 3.\n\nDunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nSource data\nSource Data Fig. 4\nStatistical source data for Fig. 4.\n\nDunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nSource data\nSource Data Fig. 5\nStatistical source data for Fig. 5.\n\nDunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nSource data\nSource Data Fig. 6\nStatistical source data for Fig. 6.", "doc_items_refs": ["#/texts/1163", "#/texts/1166", "#/texts/1169", "#/texts/1171", "#/texts/1173", "#/texts/1175", "#/texts/1177", "#/texts/1179"], "page_nos": [], "uuid": "d7153c28-2144-4835-8163-efc1811ee8e3"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 74, "source_chunk_idxs": [114, 115, 116, 117, 118, 119, 120], "num_tokens": 262, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nSource data\nSource Data Fig. 7\nStatistical source data for Fig. 7.\n\nDunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nSource data\nSource Data Extended Data Fig. 1\nStatistical source data for Extended Data Fig. 1.\n\nDunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nSource data\nSource Data Extended Data Fig. 2\nStatistical source data for Extended Data Fig. 2.\n\nDunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nSource data\nSource Data Extended Data Fig. 3\nStatistical source data for Extended Data Fig. 3.\n\nDunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nSource data\nSource Data Extended Data Fig. 5\nStatistical source data for Extended Data Fig. 5.\n\nDunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nSource data\nSource Data Extended Data Fig. 6\nStatistical source data for Extended Data Fig. 6.\n\nDunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nSource data\nSource Data Extended Data Fig. 7\nStatistical source data for Extended Data Fig. 7.", "doc_items_refs": ["#/texts/1181", "#/texts/1183", "#/texts/1185", "#/texts/1187", "#/texts/1189", "#/texts/1191", "#/texts/1193"], "page_nos": [], "uuid": "97cfae78-ef11-4f38-81d0-00e8586c3de3"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 75, "source_chunk_idxs": [121, 122, 123], "num_tokens": 275, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nSource data\nSource Data Extended Data Fig. 8\nStatistical source data for Extended Data Fig. 8.\n\nDunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nSource data\nSource Data Extended Data Fig. 9\nStatistical source data for Extended Data Fig. 9.\n\nDunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nRights and permissions\nOpen Access\nThis article is licensed under a Creative Commons Attribution 4.0 International License, which permits use, sharing, adaptation, distribution and reproduction in any medium or format, as long as you give appropriate credit to the original author(s) and the source, provide a link to the Creative Commons licence, and indicate if changes were made. The images or other third party material in this article are included in the article's Creative Commons licence, unless indicated otherwise in a credit line to the material. If material is not included in the article's Creative Commons licence and your intended use is not permitted by statutory regulation or exceeds the permitted use, you will need to obtain permission directly from the copyright holder. To view a copy of this licence, visit\nhttp://creativecommons.org/licenses/by/4.0/\n.\nReprints and permissions", "doc_items_refs": ["#/texts/1195", "#/texts/1197", "#/texts/1199", "#/texts/1200", "#/texts/1201", "#/texts/1202", "#/texts/1203"], "page_nos": [], "uuid": "4c35df2e-b88e-4d37-9298-96bf304ddc4c"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 76, "source_chunk_idxs": [124, 125, 126], "num_tokens": 265, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nAbout this article\nCite this article\nWhitman, E.T., Elliott, M.L., Knodt, A.R.\net al.\nDunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease.\nNat Aging\n5\n, 1619-1636 (2025). https://doi.org/10.1038/s43587-025-00897-z\nDownload citation\n- Received : 10 October 2024\n- Accepted : 12 May 2025\n- Published : 01 July 2025\n- Issue date : August 2025\n- DOI : https://doi.org/10.1038/s43587-025-00897-z\n\nDunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nThis article is cited by\n- How fast are you ageing? Ordinary brain scans reveal the pace\nNature\n(2025)\n- Heidi Ledford\nDownload PDF\n\nDunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nAssociated content\nHow fast are you ageing? Ordinary brain scans reveal the pace\n- Heidi Ledford\nNature\nNews\n01 Jul 2025\nAdvertisement", "doc_items_refs": ["#/texts/1206", "#/texts/1207", "#/texts/1208", "#/texts/1209", "#/texts/1210", "#/texts/1211", "#/texts/1212", "#/texts/1213", "#/texts/1214", "#/texts/1215", "#/texts/1216", "#/texts/1217", "#/texts/1219", "#/texts/1220", "#/texts/1221", "#/texts/1224", "#/texts/1225", "#/texts/1226", "#/texts/1227", "#/texts/1228"], "page_nos": [], "uuid": "df51b424-22ae-427b-bf18-7f597627ed9b"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 77, "source_chunk_idxs": [127, 128, 129, 130, 131], "num_tokens": 265, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nExplore content\n- Research articles\n- Reviews &amp; Analysis\n- News &amp; Comment\n- Current issue\n- Collections\n- Follow us on Twitter\n- Sign up for alerts\n- RSS feed\n\nDunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nAbout the journal\n- Aims &amp; Scope\n- Journal Information\n- Journal Metrics\n- About the Editors\n- Research Cross-Journal Editorial Team\n- Reviews Cross-Journal Editorial Team\n- Our publishing models\n- Editorial Values Statement\n- Editorial Policies\n- Content Types\n- Conferences\n- Presubmission inquiries\n- Contact\n\nDunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nPublish with us\n- Submission Guidelines\n- For Reviewers\n- Language editing services\n- Open access funding\n- Submit manuscript\n\nDunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nSearch\nSearch articles by subject, keyword or author\nShow results from\nAll journals\nThis journal\nSearch\nAdvanced search\n\nDunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nSearch\nQuick links\n- Explore articles by subject\n- Find a job\n- Guide to authors\n- Editorial policies\nNature Aging (\nNat Aging\n)\nISSN 2662-8465 (online)", "doc_items_refs": ["#/texts/1230", "#/texts/1231", "#/texts/1232", "#/texts/1233", "#/texts/1234", "#/texts/1235", "#/texts/1236", "#/texts/1237", "#/texts/1239", "#/texts/1240", "#/texts/1241", "#/texts/1242", "#/texts/1243", "#/texts/1244", "#/texts/1245", "#/texts/1246", "#/texts/1247", "#/texts/1248", "#/texts/1249", "#/texts/1250", "#/texts/1251", "#/texts/1253", "#/texts/1254", "#/texts/1255", "#/texts/1256", "#/texts/1257", "#/texts/1259", "#/texts/1260", "#/texts/1261", "#/texts/1262", "#/texts/1263", "#/texts/1264", "#/texts/1266", "#/texts/1267", "#/texts/1268", "#/texts/1269", "#/texts/1270", "#/texts/1271", "#/texts/1272", "#/texts/1273"], "page_nos": [], "uuid": "c46c25a7-5a51-439f-96a8-90c442258f8d"}
{"doc_id": "2025__DunedinPACNI_estimates_the_longitudinal_Pace_of_Aging_from_a_single_brain_image___W4411900345", "source_path": "<redacted:source_path>", "chunk_id": 78, "source_chunk_idxs": [132, 133, 134, 135, 136, 137, 138, 139], "num_tokens": 451, "text": "DunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nnature.com sitemap\nAbout Nature Portfolio\n- About us\n- Press releases\n- Press office\n- Contact us\n\nDunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nnature.com sitemap\nDiscover content\n- Journals A-Z\n- Articles by subject\n- protocols.io\n- Nature Index\n\nDunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nnature.com sitemap\nPublishing policies\n- Nature portfolio policies\n- Open access\n\nDunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nnature.com sitemap\nAuthor & Researcher services\n- Reprints &amp; permissions\n- Research data\n- Language editing\n- Scientific editing\n- Nature Masterclasses\n- Research Solutions\n\nDunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nnature.com sitemap\nLibraries & institutions\n- Librarian service &amp; tools\n- Librarian portal\n- Open research\n- Recommend to library\n\nDunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nnature.com sitemap\nAdvertising & partnerships\n- Advertising\n- Partnerships &amp; Services\n- Media kits\n- Branded content\n\nDunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nnature.com sitemap\nProfessional development\n- Nature Awards\n- Nature Careers\n- Nature Conferences\n\nDunedinPACNI estimates the longitudinal Pace of Aging from a single brain image to track health and disease\nnature.com sitemap\nRegional websites\n- Nature Africa\n- Nature China\n- Nature India\n- Nature Japan\n- Nature Middle East\n- Privacy Policy\n- Use of cookies\n- Your privacy choices/Manage cookies\n- Legal notice\n- Accessibility statement\n- Terms &amp; Conditions\n- Your US state privacy rights\nImage Hyperlink.\n© 2025 Springer Nature Limited\nClose banner\nClose\nNature Briefing\nSign up for the\nNature Briefing\nnewsletter - what matters in science, free to your inbox daily.\nEmail address\nSign up\nI agree my information will be processed in accordance with the\nNature\nand Springer Nature Limited\nPrivacy Policy\n.\nClose banner\nClose\nGet the most important science stories of the day, free in your inbox.\nSign up for Nature Briefing", "doc_items_refs": ["#/texts/1276", "#/texts/1277", "#/texts/1278", "#/texts/1279", "#/texts/1281", "#/texts/1282", "#/texts/1283", "#/texts/1284", "#/texts/1286", "#/texts/1287", "#/texts/1289", "#/texts/1290", "#/texts/1291", "#/texts/1292", "#/texts/1293", "#/texts/1294", "#/texts/1296", "#/texts/1297", "#/texts/1298", "#/texts/1299", "#/texts/1301", "#/texts/1302", "#/texts/1303", "#/texts/1304", "#/texts/1306", "#/texts/1307", "#/texts/1308", "#/texts/1310", "#/texts/1311", "#/texts/1312", "#/texts/1313", "#/texts/1314", "#/texts/1315", "#/texts/1316", "#/texts/1317", "#/texts/1318", "#/texts/1319", "#/texts/1320", "#/texts/1321", "#/texts/1322", "#/texts/1323", "#/texts/1324", "#/texts/1325", "#/texts/1326", "#/texts/1327", "#/texts/1328", "#/texts/1329", "#/texts/1330", "#/texts/1331", "#/texts/1332", "#/texts/1333", "#/texts/1334", "#/texts/1335", "#/texts/1336", "#/texts/1337", "#/texts/1338", "#/texts/1339", "#/texts/1340"], "page_nos": [], "uuid": "d875f9f3-c630-4fba-9b4c-ede5369b263a"}
