{"doc_id": "2025__Stem_cell_therapy_use_in_patients_with_dementia_a_systematic_review__W4410277989", "source_path": "<redacted:source_path>", "chunk_id": 0, "source_chunk_idxs": [0, 1], "num_tokens": 297, "text": "Stem cell therapy use in patients with dementia: a systematic review | International Journal of Emergency Medicine | Full Text\nSkip to main content\nAdvertisement\nSearch\n- Explore journals\n- Get published\n- About BMC\n- My account\nSearch all BMC articles\nSearch\nInternational Journal of Emergency Medicine\n- Home\n- About\n- Articles\n- Submission Guidelines\n- Submit manuscript\nStem cell therapy use in patients with dementia: a systematic review\nDownload PDF\nDownload PDF\n- Review\n- Open access\n- Published: 12 May 2025\n\nStem cell therapy use in patients with dementia: a systematic review\n- Olivier Uwishema\nORCID: orcid.org/0000-0002-0692-9027\n1\n,\n- Malak Ghezzawi\nORCID: orcid.org/0009-0009-0702-0139\n1\n,\n2\n,\n- Magda Wojtara\nORCID: orcid.org/0000-0001-6903-0206\n1\n,\n3\n,\n- Ignatius N Esene\nORCID: orcid.org/0000-0001-8785-8875\n4\n&amp;\n- ...\n- Kehinde Obamiro\nORCID: orcid.org/0000-0002-0265-1953\n5\nShow authors\nInternational Journal of Emergency Medicine\nvolume 18\n, Article number: 95 ( 2025 )\nCite this article\n- 3092 Accesses\n- 3 Citations\n- 14 Altmetric\n- Metrics details", "doc_items_refs": ["#/texts/1", "#/texts/2", "#/texts/3", "#/texts/4", "#/texts/5", "#/texts/6", "#/texts/7", "#/texts/8", "#/texts/9", "#/texts/10", "#/texts/11", "#/texts/12", "#/texts/13", "#/texts/14", "#/texts/15", "#/texts/16", "#/texts/17", "#/texts/18", "#/texts/19", "#/texts/20", "#/texts/21", "#/texts/23", "#/texts/24", "#/texts/25", "#/texts/26", "#/texts/27", "#/texts/28", "#/texts/29", "#/texts/30", "#/texts/31", "#/texts/32", "#/texts/33", "#/texts/34", "#/texts/35", "#/texts/36", "#/texts/37"], "page_nos": [], "uuid": "65d1c30f-1ce2-417e-9e98-4856b7ae275e"}
{"doc_id": "2025__Stem_cell_therapy_use_in_patients_with_dementia_a_systematic_review__W4410277989", "source_path": "<redacted:source_path>", "chunk_id": 1, "source_chunk_idxs": [2, 3, 4], "num_tokens": 259, "text": "Stem cell therapy use in patients with dementia: a systematic review\nAbstract\nBackground\nStem cell therapy (SCT) is increasingly recognized for its potential in managing cognitive impairment, particularly that of dementia. The application of SCT aims to restore cognitive functioning in people living with dementia. Beyond pre-clinical studies, several clinical trials have evaluated specific stem cell (SC) types for their efficacy in treating dementia.\n\nStem cell therapy use in patients with dementia: a systematic review\nAbstract\nAims & Objectives\nTo assess the status and efficacy of pre-clinical and clinical studies utilizing SCs as a therapeutic approach for dementia.\n\nStem cell therapy use in patients with dementia: a systematic review\nAbstract\nMethods\nA systematic review was conducted using two electronic databases: MEDLINE and Embase. We reviewed studies on the application of SCs in dementia, focusing on the following aspects: Animal models used in pre-clinical studies, tissue sources of SCs and donor species, and administrative routes and outcome assessments. Included papers comprised randomized control trials (RCTs) and original studies, while those involving adjuvant therapies for dementia were excluded. Quality assessment criteria included relevance to the research question, type of SCs, stage of SC transplantation, duration and route of administration, methods for outcome assessment, and the total number of animals implicated.", "doc_items_refs": ["#/texts/40", "#/texts/42", "#/texts/44"], "page_nos": [], "uuid": "9d650daf-65dc-45a9-ac26-1794b5f1bc67"}
{"doc_id": "2025__Stem_cell_therapy_use_in_patients_with_dementia_a_systematic_review__W4410277989", "source_path": "<redacted:source_path>", "chunk_id": 2, "source_chunk_idxs": [5], "num_tokens": 282, "text": "Stem cell therapy use in patients with dementia: a systematic review\nAbstract\nResults\nA total of 32 papers were included, encompassing 21 clinical trials and 11 preclinical studies. The preclinical studies employed various transgenic animal models to evaluate SCT outcomes. Animal models of dementia, particularly transgenic mice, have proven instrumental in replicating human disease mechanisms. These models facilitate understanding of pathophysiology and preclinical testing of therapeutic interventions. Studies utilizing SCT demonstrated notable improvements in spatial memory, reduced neuroinflammation, and protection against amyloid-beta (Aβ) toxicity. Key mechanisms included modulation of inflammation, microglial immune responses, neurogenesis support, and anti-amyloidogenic effects. Preclinical studies predominantly employed human placenta-derived mesenchymal stem cells (PD-MSCs), umbilical cord-derived MSCs (U-MSCs), and induced pluripotent stem cell-derived neuronal precursors. Administration routes varied, with stereotactic and intravenous injections targeting affected brain regions. Reductions in inflammatory markers such as IL-1β, TNF-α, and increases in anti-inflammatory cytokines like IL-4 and IL-10 were observed. These outcomes emphasize the immunomodulatory and neuroprotective capacities of SCT.", "doc_items_refs": ["#/texts/46"], "page_nos": [], "uuid": "668230d1-1192-4224-949a-4c278028d697"}
{"doc_id": "2025__Stem_cell_therapy_use_in_patients_with_dementia_a_systematic_review__W4410277989", "source_path": "<redacted:source_path>", "chunk_id": 3, "source_chunk_idxs": [6, 7], "num_tokens": 273, "text": "Stem cell therapy use in patients with dementia: a systematic review\nAbstract\nConclusion\nSCT shows promise in addressing dementia-related pathologies by leveraging diverse therapeutic mechanisms. Continued refinement of preclinical models and translational research is essential to bridge gaps between preclinical findings and clinical applications, potentially paving the way for novel treatments for dementia.\n\nStem cell therapy use in patients with dementia: a systematic review\nIntroduction\nStem cells and their therapeutic potential\nStem cells (SCs) are undifferentiated cells with the unique ability to self-renew and differentiate into specialized cell types, making them a cornerstone of regenerative medicine [\n1\n,\n2\n,\n3\n]. This unique capacity allows SCs to spontaneously generate organ-specific cells under appropriate conditions, pivotal in tissue and regenerative medicine [\n1\n,\n2\n,\n3\n]. Among the various types of stem cells, human-induced pluripotent stem cells (hiPSCs) have emerged as a groundbreaking innovation [\n3\n]. Derived from adult somatic cells, such as fibroblasts, hiPSCs can be reprogrammed to a pluripotent state, enabling them to generate virtually any cell type in the body [\n3\n]. The advent of hiPSCs has unlocked vast potential for therapeutic applications across various diseases, including neurodegenerative disorders [\n1\n,\n2\n].", "doc_items_refs": ["#/texts/48", "#/texts/51", "#/texts/52", "#/texts/53", "#/texts/54", "#/texts/55", "#/texts/56", "#/texts/57", "#/texts/58", "#/texts/59", "#/texts/60", "#/texts/61", "#/texts/62", "#/texts/63", "#/texts/64", "#/texts/65", "#/texts/66", "#/texts/67", "#/texts/68", "#/texts/69", "#/texts/70", "#/texts/71"], "page_nos": [], "uuid": "a9e56524-18ce-459a-acb8-78306908dab8"}
{"doc_id": "2025__Stem_cell_therapy_use_in_patients_with_dementia_a_systematic_review__W4410277989", "source_path": "<redacted:source_path>", "chunk_id": 4, "source_chunk_idxs": [8, 9], "num_tokens": 353, "text": "Stem cell therapy use in patients with dementia: a systematic review\nIntroduction\nThe global burden of neurodegenerative diseases\nNeurodegenerative diseases, including Alzheimer's disease (AD), Parkinson's disease (PD), Huntington's disease (HD), and other forms of dementia represent a significant and growing public health challenge [\n4\n]. According to the World Health Organization (WHO), dementia alone affects approximately 55 million individuals globally, with projections expecting it to rise to 78 million and 139 million by 2030 and 2050, respectively [\n5\n]. These conditions are characterized by the progressive loss of neuronal structure and function, leading to debilitating symptoms such as memory loss, cognitive decline, and motor dysfunction [\n6\n]. Despite decades of research, current treatments for neurodegenerative diseases remain largely palliative, focusing on symptom management rather than addressing the underlying causes of neuronal degeneration [\n7\n,\n8\n,\n9\n].\n\nStem cell therapy use in patients with dementia: a systematic review\nIntroduction\nLimitations of current therapies\nExisting therapeutic strategies for neurodegenerative diseases, such as cholinesterase inhibitors and NMDA receptor antagonists, offer only modest benefits and are often associated with significant side effects, including gastrointestinal disturbances, dizziness, and cognitive worsening [\n9\n,\n10\n,\n11\n]. These treatments do not halt or reverse disease progression, highlighting the urgent need for innovative approaches that target the root causes of neurodegeneration [\n9\n,\n10\n,\n11\n]. Stem cell-based therapies have emerged as a promising alternative, offering the potential to replace lost or damaged neurons, modulate inflammatory responses, and promote tissue repair [\n10\n,\n11\n].", "doc_items_refs": ["#/texts/73", "#/texts/74", "#/texts/75", "#/texts/76", "#/texts/77", "#/texts/78", "#/texts/79", "#/texts/80", "#/texts/81", "#/texts/82", "#/texts/83", "#/texts/84", "#/texts/85", "#/texts/87", "#/texts/88", "#/texts/89", "#/texts/90", "#/texts/91", "#/texts/92", "#/texts/93", "#/texts/94", "#/texts/95", "#/texts/96", "#/texts/97", "#/texts/98", "#/texts/99", "#/texts/100", "#/texts/101", "#/texts/102", "#/texts/103"], "page_nos": [], "uuid": "f03be26d-ad07-494f-918f-baef57ea36e6"}
{"doc_id": "2025__Stem_cell_therapy_use_in_patients_with_dementia_a_systematic_review__W4410277989", "source_path": "<redacted:source_path>", "chunk_id": 5, "source_chunk_idxs": [10, 11], "num_tokens": 386, "text": "Stem cell therapy use in patients with dementia: a systematic review\nIntroduction\nStem cell therapy: A promising frontier\nStem cell therapy (SCT) encompasses a range of approaches, including the use of mesenchymal stem cells (MSCs), embryonic stem cells (ESCs), human-induced pluripotent stem cells (hiPSCs), and neural stem cells (NSCs). Each of these cell types has unique properties that make them suitable for different therapeutic applications [\n6\n,\n12\n]. For example, MSCs are known for their immunomodulatory and anti-inflammatory effects, while NSCs have the potential to differentiate into neurons and glial cells, making them particularly valuable for treating brain disorders [\n6\n,\n12\n]. Additionally, advances in 3D cell culture techniques have led to the development of cerebral organoids, which mimic the structure and function of specific brain regions. These organoids provide a valuable platform for studying disease mechanisms and testing potential therapies in a controlled environment [\n12\n].\n\nStem cell therapy use in patients with dementia: a systematic review\nIntroduction\nThe role of stem cells in dementia\nDementia, a broad category of brain disorders, is characterized by impaired neuronal function, leading to symptoms such as memory loss, communication difficulties, and cognitive decline, as defined by the Dementia Society of America [\n13\n]. Alzheimer's disease, the most common form of dementia, is associated with the accumulation of amyloid-beta plaques and tau protein tangles, which disrupt neuronal communication and trigger cell death [\n14\n]. Stem cell therapy offers a promising approach to addressing these pathological changes by promoting neurogenesis, reducing inflammation, and enhancing synaptic connectivity. Preclinical studies have demonstrated the potential of SCT to improve cognitive function and reduce pathological hallmarks in animal models of dementia, paving the way for clinical translation [\n9\n,\n10\n,\n11\n].", "doc_items_refs": ["#/texts/105", "#/texts/106", "#/texts/107", "#/texts/108", "#/texts/109", "#/texts/110", "#/texts/111", "#/texts/112", "#/texts/113", "#/texts/114", "#/texts/115", "#/texts/117", "#/texts/118", "#/texts/119", "#/texts/120", "#/texts/121", "#/texts/122", "#/texts/123", "#/texts/124", "#/texts/125", "#/texts/126", "#/texts/127"], "page_nos": [], "uuid": "717c618f-53b2-463c-9df8-47f1dff62f4a"}
{"doc_id": "2025__Stem_cell_therapy_use_in_patients_with_dementia_a_systematic_review__W4410277989", "source_path": "<redacted:source_path>", "chunk_id": 6, "source_chunk_idxs": [12, 13], "num_tokens": 288, "text": "Stem cell therapy use in patients with dementia: a systematic review\nIntroduction\nObjectives of this systematic review\nRecent studies underscore the potential of SCT in mitigating AD progression, demonstrating their role in tissue and regenerative medicine [\n9\n,\n10\n,\n11\n]. Thus, in this review, we conducted a systematic analysis to explore the potential applications of SCT in neurodegenerative diseases. By synthesizing current research, we aimed to illustrate the rapid advancements in SCT and advocate for continued exploration of SC-based therapies to foster neurogenesis and develop innovative treatments for such challenging conditions.\n\nStem cell therapy use in patients with dementia: a systematic review\nMethods\nThe search was conducted across three major databases: MEDLINE, EMBASE, and ClinicalTrials.gov, covering studies published until July 2024. Our search strategy employed Boolean operators combining terms such as \"Stem cells OR Dementia,\" \"Mesenchymal stem cells AND Dementia,\" and \"Treatment of Dementia AND Stem cells.\" To ensure reproducibility, we documented the exact search strings and filters used for each database. The search results were exported to a reference management software (EndNote X9) for deduplication and initial screening. The PRISMA flow chart (Fig.\n1\n) provides a detailed overview of the study selection process, including the number of records identified, duplicates removed, and studies excluded at each stage.", "doc_items_refs": ["#/texts/129", "#/texts/130", "#/texts/131", "#/texts/132", "#/texts/133", "#/texts/134", "#/texts/135", "#/texts/137", "#/texts/138", "#/texts/139"], "page_nos": [], "uuid": "dcc743c7-7de3-4bb1-946a-e264bc3eff39"}
{"doc_id": "2025__Stem_cell_therapy_use_in_patients_with_dementia_a_systematic_review__W4410277989", "source_path": "<redacted:source_path>", "chunk_id": 7, "source_chunk_idxs": [14, 15], "num_tokens": 326, "text": "Stem cell therapy use in patients with dementia: a systematic review\nMethods\nInclusion and exclusion criteria\nOur review included randomized controlled trials (RCTs) that specifically examined the use of stem cells (SCs) as a therapeutic intervention for dementia. To maintain a focused analysis on SC-based treatments, we excluded studies investigating adjuvant therapies, such as pharmacological agents, cognitive stimulation, or non-invasive brain stimulation techniques. Additionally, studies that did not report primary outcomes related to cognitive function, behavioral changes, or neuropathological improvements were excluded. This criterion ensured that our analysis concentrated on the direct application and efficacy of SCs in addressing dementia-related neurodegeneration. Only full-text, peer-reviewed articles in English were considered.\n\nStem cell therapy use in patients with dementia: a systematic review\nMethods\nStudy selection\nThe study selection process was conducted in two phases: Two independent reviewers screened the titles and abstracts of all identified records to determine eligibility based on the predefined inclusion and exclusion criteria. To ensure consistency, the reviewers employed standardized screening sheets and participated in a calibration exercise prior to the screening process. Discrepancies between reviewers were resolved through discussion, and a third senior investigator was consulted when consensus could not be reached. The full texts of potentially eligible studies were independently reviewed by the same two reviewers. Employing standardized screening sheets and following a calibration exercise, the reviewers assessed the studies in duplicate to ensure accuracy. Studies that met the inclusion criteria were selected for data extraction, while those that did not meet the criteria were excluded, with reasons for exclusion documented for transparency.", "doc_items_refs": ["#/texts/141", "#/texts/143"], "page_nos": [], "uuid": "07418120-315c-4bf2-99fa-edb21df45dd9"}
{"doc_id": "2025__Stem_cell_therapy_use_in_patients_with_dementia_a_systematic_review__W4410277989", "source_path": "<redacted:source_path>", "chunk_id": 8, "source_chunk_idxs": [16, 17], "num_tokens": 410, "text": "Stem cell therapy use in patients with dementia: a systematic review\nMethods\nData extraction and quality assessment\nData extraction was performed using a standardized template to ensure consistency across studies. Two reviewers independently extracted data from the included studies, and discrepancies were resolved through discussion. The following key parameters were extracted:\n1. 1. Study Characteristics: Author, year, country, study design, and sample size.\n2. 2. Intervention Details: Type of stem cells used (e.g., MSCs, ESCs, hiPSCs, NSCs), species and tissue sources, stage of transplantation, duration and route of administration, and dosage.\n3. 3. Outcome Measures: Cognitive function improvements, behavioral changes, neuropathological outcomes, and safety profiles.\n4. 4. Study Quality Indicators: Randomization, blinding, and transparency in reporting key study details.\nQuality assessment criteria included adherence to the research question and transparency in reporting key study details. The quality assessment was conducted independently by two reviewers, and discrepancies were resolved through discussion.\n\nStem cell therapy use in patients with dementia: a systematic review\nMethods\nData analysis\nThe collected data were analyzed through a systematic approach to assess the efficacy and outcomes of SCT in both pre-clinical and clinical settings. The qualitative data from the included studies, including descriptions of cognitive function improvements, behavioral changes, and neuropathological outcomes, were systematically reviewed and synthesized. Findings were categorized by stem cell type, disease stage, and route of administration to identify trends and patterns in therapeutic effects. The results were compared across different studies to identify trends and patterns in the therapeutic effects of SCT. Data from pre-clinical studies, including animal models, stem cell sources, and treatment outcomes, were systematically reviewed and synthesized to evaluate their translational potential to human clinical applications. Findings were categorized by animal model (e.g., transgenic mice, rat models of AD) and outcome measures (e.g., amyloid-beta reduction, synaptic plasticity improvements).", "doc_items_refs": ["#/texts/145", "#/texts/146", "#/texts/147", "#/texts/148", "#/texts/149", "#/texts/150", "#/texts/152"], "page_nos": [], "uuid": "20455ff2-be9a-40ae-bc79-b2919670a2ea"}
{"doc_id": "2025__Stem_cell_therapy_use_in_patients_with_dementia_a_systematic_review__W4410277989", "source_path": "<redacted:source_path>", "chunk_id": 9, "source_chunk_idxs": [18], "num_tokens": 194, "text": "Stem cell therapy use in patients with dementia: a systematic review\nResults\nWe searched Medline, Embase, and ClinicalTrials.gov databases, identifying a total of 4419 studies (4287 from Medline and Embase, and 132 from ClinicalTrials.gov). After removing duplicates, 4104 articles were screened by title and abstract, resulting in 436 potentially relevant studies. Following full-text screening, 32 studies met our inclusion criteria, including\n21 clinical trials\nand\n11 preclinical studies\n. Refer to Fig.\n1\nfor a detailed description (Fig.\n1\n). This study was also registered in PROSPERO under the number\nCRD42025640270\n. A title and abstract screening was performed according to PRISMA standards (the link below): https://www.crd.york.ac.uk/PROSPERO/view/CRD42025640270.\nFig. 1", "doc_items_refs": ["#/texts/154", "#/texts/155", "#/texts/156", "#/texts/157", "#/texts/158", "#/texts/159", "#/texts/160", "#/texts/161", "#/texts/162", "#/texts/163", "#/texts/164", "#/texts/165"], "page_nos": [], "uuid": "a846bddd-3b87-4572-82a0-aa49160f75f4"}
{"doc_id": "2025__Stem_cell_therapy_use_in_patients_with_dementia_a_systematic_review__W4410277989", "source_path": "<redacted:source_path>", "chunk_id": 10, "source_chunk_idxs": [19], "num_tokens": 433, "text": "Stem cell therapy use in patients with dementia: a systematic review\nResults\nPre-Clinical studies\nDementia represents the foremost etiology of disability among individuals aged over 65 years, with its prevalence steadily increasing. Current therapeutic options fail to address key symptoms like psychomotor agitation, aggression, depression, and reduced physical activity [\n15\n]. Behavioral and psychological symptoms afflict at least 90% of dementia patients [\n15\n]. Given the absence of definitive pharmacological interventions, elucidating disease pathophysiology and exploring novel therapeutic agents are paramount. Animal models serve as indispensable tools in these endeavors [\n16\n]. Continued refinement of these models through ongoing research promises to bridge the translational dearth between preclinical findings and clinical applications [\n16\n].\nEffective animal models must rigorously replicate human disease mechanisms to facilitate the development of efficacious treatments. Small animal models, such as mice and rats, offer distinct advantages including cost-effectiveness, reproducibility, and suitability for investigating related human pathophysiology and therapeutic pathways [\n17\n]. Animal models of AD encompass spontaneous, interventional, and genetically modified varieties [\n16\n]. However, while spontaneous models hold appeal, they pose challenges comprising the risk of zoonoses, maintenance costs, and variability in reproducibility due to extended lifespans [\n16\n].\nAdvances in genetic manipulation have facilitated the development of transgenic animal models that exhibit characteristics akin to AD, particularly in mice, preferred for their ease of genetic modification and shorter lifespans [\n16\n]. Rats, with physiological similarities closer to humans, offer advantages in studying motor behaviors but are hindered by technical limitations in genetic engineering [\n16\n]. For appropriate interpretation of study results, the influence of the genetic background on transgenic phenotypes must be carefully considered [\n16\n].\nAnimal models not only deepen our understanding of disease pathophysiology but also serve as essential tools for preclinical validation of potential therapeutic interventions [\n18\n]. Over the past two decades, substantial progress has been made in refining animal models for dementia research and evaluating therapeutic candidates [\n19\n].", "doc_items_refs": ["#/texts/167", "#/texts/168", "#/texts/169", "#/texts/170", "#/texts/171", "#/texts/172", "#/texts/173", "#/texts/174", "#/texts/175", "#/texts/176", "#/texts/177", "#/texts/178", "#/texts/179", "#/texts/180", "#/texts/181", "#/texts/182", "#/texts/183", "#/texts/184", "#/texts/185", "#/texts/186", "#/texts/187", "#/texts/188", "#/texts/189", "#/texts/190", "#/texts/191", "#/texts/192", "#/texts/193", "#/texts/194"], "page_nos": [], "uuid": "864d1211-0711-45e7-855d-2a11a2a2db10"}
{"doc_id": "2025__Stem_cell_therapy_use_in_patients_with_dementia_a_systematic_review__W4410277989", "source_path": "<redacted:source_path>", "chunk_id": 11, "source_chunk_idxs": [20], "num_tokens": 500, "text": "Stem cell therapy use in patients with dementia: a systematic review\nResults\nPre-Clinical studies\nTable\n1\nsummarizes the outcomes of preclinical studies utilizing various SCT for the management of dementia in transgenic mouse models [\n20\n,\n21\n,\n22\n,\n23\n,\n24\n]. The table categorizes SCT based on different cell classes, including Human PD-MSCs, Human U-MSCs, and others, each tested in specific transgenic models, that of B6C3-Tg (APPswe/PSEN1dE9) and Tg2576 (APPswe). Injection types varied, encompassing intravenous and stereotactic approaches, tailored to target affected brain regions effectively.\nOutcomes observed across studies predominantly focused on improvements in spatial memory, assessed through tasks like the Morris water maze and novel object recognition tests. Additionally, reductions in inflammatory markers such as interleukins (ILs) and tumor necrosis factor (TNF) were reported, indicating potential neuroprotective effects. Mechanistic insights highlighted included neurotrophic support, modulation of microglial responses, and protection against amyloid-beta (Aβ) neurotoxicity, underscoring the multifaceted approaches of SCT in mitigating dementia-related pathologies.\nTable\n2\npresents a detailed overview of SCT outcomes in dementia therapeutics, specifically focusing on diverse transgenic mouse models and their responses to various SC types [\n25\n,\n26\n,\n27\n,\n28\n,\n29\n,\n30\n]. The table categorizes SCT based on cell classes such as Human PD-MSCs, Human U-MSCs, and others, each evaluated in models including Aβ1-42-infused and specific transgenic strains like that of B6C3-Tg (APPswe/PSEN1dE9) and Tg2576 (APPswe).\nInjection methods varied and included intravenous and stereotactic administration, both tailored to optimize therapeutic delivery and efficacy in experimental contexts. Reported outcomes predominantly highlighted improvements in spatial memory performance, often assessed using the Morris water maze test. Additionally, reductions in pro-inflammatory cytokines such as IL-1β and TNF-α, coupled with increases in anti-inflammatory cytokines like IL-4 and IL-10, underscored the immunomodulatory effects of SCT in mitigating neuroinflammation.", "doc_items_refs": ["#/texts/195", "#/texts/196", "#/texts/197", "#/texts/198", "#/texts/199", "#/texts/200", "#/texts/201", "#/texts/202", "#/texts/203", "#/texts/204", "#/texts/205", "#/texts/206", "#/texts/207", "#/texts/208", "#/texts/209", "#/texts/210", "#/texts/211", "#/texts/212", "#/texts/213", "#/texts/214", "#/texts/215", "#/texts/216", "#/texts/217", "#/texts/218", "#/texts/219", "#/texts/220", "#/texts/221", "#/texts/222", "#/texts/223", "#/texts/224"], "page_nos": [], "uuid": "866cdb2f-1dd7-4e29-9841-a360ceaed6ea"}
{"doc_id": "2025__Stem_cell_therapy_use_in_patients_with_dementia_a_systematic_review__W4410277989", "source_path": "<redacted:source_path>", "chunk_id": 12, "source_chunk_idxs": [21, 22], "num_tokens": 419, "text": "Stem cell therapy use in patients with dementia: a systematic review\nResults\nPre-Clinical studies\nMechanistic insights elucidated included neurogenesis support, modulation of microglial immune responses, and protection against Aβ-induced neurotoxicity, emphasizing the diverse therapeutic mechanisms employed by SCT in combating dementia pathology.\n\nStem cell therapy use in patients with dementia: a systematic review\nResults\nClinical studies involving stem cell therapy in dementia cases\nSeveral clinical trials investigating SCTs for dementia are currently at different stages. Our review identified 21 trials, of which 6 have been completed, with results available for 4. Six trials are actively recruiting or awaiting initiation, while the statuses of 6 trials were undisclosed, 2 trials withdrawn, and 1 trial no longer available. Most trials examined employed human MSCs delivered via intravenous, intracerebral, and intraventricular routes, with intranasal administration also under exploration for its potential benefits. Table\n3\nsummarizes these trials, detailing their recruitment status, phase, cell type, route of administration, and key findings.\nAmong the completed trials, NCT01297218 investigated the employment of human UCB-MSCs administered via intracerebral infusion [\n30\n]. The study reported acute adverse events in all nine subjects during a 12-week follow-up period, with no serious adverse events observed over a 24-month follow-up. Importantly, no dose-limiting toxicities were reported, highlighting the safety profile of this approach [\n30\n]. In contrast, the trial registered under NCT02054208 [\n31\n], which utilized human UCB-MSCs administered via intraventricular infusion, reported acute adverse events within 36 h of administration. The most common adverse events included fever (\nn\n= 9), headache (\nn\n= 7), nausea (\nn\n= 5), and vomiting (\nn\n= 4), all of which resolved spontaneously within 36 h. Serious adverse events were observed in three participants; however, no dose-limiting toxicities were reported [\n31\n].", "doc_items_refs": ["#/texts/225", "#/texts/227", "#/texts/228", "#/texts/229", "#/texts/230", "#/texts/231", "#/texts/232", "#/texts/233", "#/texts/234", "#/texts/235", "#/texts/236", "#/texts/237", "#/texts/238", "#/texts/239", "#/texts/240", "#/texts/241", "#/texts/242", "#/texts/243", "#/texts/244", "#/texts/245", "#/texts/246"], "page_nos": [], "uuid": "d8415de7-1f11-4f32-9203-ebd02f20e4eb"}
{"doc_id": "2025__Stem_cell_therapy_use_in_patients_with_dementia_a_systematic_review__W4410277989", "source_path": "<redacted:source_path>", "chunk_id": 13, "source_chunk_idxs": [23], "num_tokens": 443, "text": "Stem cell therapy use in patients with dementia: a systematic review\nResults\nClinical studies involving stem cell therapy in dementia cases\nSeveral ongoing trials are exploring different SCT approaches. For instance, NCT03724136 is currently recruiting participants to investigate the use of BM-MSCs administered via intravenous fractionation, with results yet to be published [\n32\n]. Similarly, NCT04388982 aims to evaluate the efficacy of MSC-derived exosomes administered via nasal drip, with results pending publication [\n33\n]. A notable withdrawal due to the novel coronavirus disease 2019 (COVID-19) pandemic is documented in NCT04228666, which planned to investigate the application of Hope Biosciences' autologous A-MSCs via intravenous infusion [\n34\n]. The trial was halted without published findings [\n34\n]. Moreover, trials such as NCT03117738, utilizing autologous A-MSC via intravenous infusion, reported serious adverse events in three out of eleven subjects, underscoring the importance of rigorous safety monitoring in SCT trials [\n35\n].\nIn summary, although a number of clinical trials have shown encouraging results about the safety and possible effectiveness of SCT in the management of dementia, variability in outcomes and difficulties like adverse events require ongoing research and standardized methodologies to advance SCT as a viable therapeutic option.\nPre-clinical studies have extensively assessed the safety and efficacy of SCT using murine models, yet translating these findings into clinical trials has been limited. This discrepancy stems from the complex ethical considerations and uncertainties circumventing the safety of stem cell transplantation in human subjects. Globally, regulatory frameworks and policy interventions govern the funding and conduct of human clinical trials involving SCT [\n36\n,\n37\n]. Selecting the appropriate cell source and type is crucial for enhancing the success of SCT. Notably, MSCs are favored in clinical trials targeting neurodegenerative diseases due to their ability to differentiate into non-hematopoietic stromal and neural cell lines, alongside their low immunogenicity [\n38\n,\n39\n].", "doc_items_refs": ["#/texts/247", "#/texts/248", "#/texts/249", "#/texts/250", "#/texts/251", "#/texts/252", "#/texts/253", "#/texts/254", "#/texts/255", "#/texts/256", "#/texts/257", "#/texts/258", "#/texts/259", "#/texts/260", "#/texts/261", "#/texts/262", "#/texts/263", "#/texts/264", "#/texts/265", "#/texts/266", "#/texts/267"], "page_nos": [], "uuid": "edeb7dab-e048-46b6-aaf0-986baee41b7e"}
{"doc_id": "2025__Stem_cell_therapy_use_in_patients_with_dementia_a_systematic_review__W4410277989", "source_path": "<redacted:source_path>", "chunk_id": 14, "source_chunk_idxs": [24], "num_tokens": 407, "text": "Stem cell therapy use in patients with dementia: a systematic review\nResults\nClinical studies involving stem cell therapy in dementia cases\nTable\n4\nprovides a comprehensive overview of various SC types investigated in human clinical trials for neurodegenerative disorders [\n40\n]. Pluripotent stem cells (PSCs), such as that of human-induced embryonic stem cells (hiESCs) and hiPSCs, offer potential for cell-replacement therapy and modeling neurodegenerative diseases in vitro [\n40\n]. However, challenges include phenotype instability and ethical controversy which hinder their widespread application [\n40\n]. Multipotent stem cells like that of NSCs and neural crest stem cells (NCSCs) present advantages such as neuroregenerative capabilities without the need for immunosuppressants, yet they face limitations in differentiation potential and self-renewal capacity. Additionally, MSCs derived from bone marrow and the blood of the umbilical cord are extensively studied for their anti-inflammatory properties and potential in tissue repair [\n40\n]. Nevertheless, optimal dosing and administration routes remain unresolved issues due to several factors [\n40\n]. The optimal dosing and routes of administration for mesenchymal stem cells (MSCs) remain unresolved due to several factors. MSCs derived from different sources (e.g., bone marrow, adipose tissue) exhibit variability in properties, making standardization difficult [\n40\n]. Additionally, the survival and distribution of MSCs vary depending on the delivery route, such as intravenous or intracerebral injection, with systemic delivery often resulting in low cell homing to the target site [\n40\n]. The dynamic inflammatory environment post-injury further complicates timing and effectiveness. Moreover, the lack of large-scale clinical trials with standardized protocols hinders the establishment of evidence-based guidelines [\n40\n]. These findings highlight the diverse landscape of SC types under investigation, each presenting unique advantages and challenges in advancing neuroregenerative therapies.", "doc_items_refs": ["#/texts/268", "#/texts/269", "#/texts/270", "#/texts/271", "#/texts/272", "#/texts/273", "#/texts/274", "#/texts/275", "#/texts/276", "#/texts/277", "#/texts/278", "#/texts/279", "#/texts/280", "#/texts/281", "#/texts/282", "#/texts/283", "#/texts/284", "#/texts/285", "#/texts/286"], "page_nos": [], "uuid": "2ff17611-43f3-4f95-bc93-f1d91ad2b583"}
{"doc_id": "2025__Stem_cell_therapy_use_in_patients_with_dementia_a_systematic_review__W4410277989", "source_path": "<redacted:source_path>", "chunk_id": 15, "source_chunk_idxs": [25], "num_tokens": 455, "text": "Stem cell therapy use in patients with dementia: a systematic review\nResults\nQuality assessment\nAll 32 articles collected were thoroughly analyzed for adherence to the research question.\nVarious types of stem cells were investigated across clinical and preclinical studies:\n- BM-MSCs: Bone Marrow-Derived Mesenchymal Stem Cells.\n- iPSCs: Induced Pluripotent Stem Cells.\n- NSCs: Neural Stem Cells.\n- PD-MSCs: Placenta-Derived Mesenchymal Stem Cells.\n- U-MSCs: Umbilical Cord Warton's Jelly-Derived Mesenchymal Stem Cells.\n- U-MSC-NCs: Neuron-like Cells differentiated from Umbilical Cord Warton's Jelly-Derived Mesenchymal Stem Cells.\n- UCB-MSCs: Umbilical Cord Blood-Derived Mesenchymal Stem Cells.\n- MSCs-Exos: Exosomes from Allogenic Adipose Mesenchymal Stem Cells.\n- HB-adMSCs: Hope Biosciences Autologous Mesenchymal Stem Cells.\n- AD-MSCs: Adipose-Derived Mesenchymal Stem Cells.\n- LMSCs: Longeveron Mesenchymal Stem Cells.\n- AD-SVF: Autologous Adipose-Derived Stromal Vascular Fraction.\nThe age of recruited subjects for the trials was unspecified in the literature and thus not included in the review.\nStem cells were administered via various routes:\n- Bilateral intra-hippocampal stereotactic injection.\n- Bilateral intraventricular stereotactic injection.\n- Intravenous infusion.\n- Intracerebral infusion.\n- Intraventricular infusion.\n- Intranasal infusion.\nThe duration of administration was not specified in the reviewed works.\nMethods used to evaluate outcomes in stem cell trials included:\n- Donor cell migration and differentiation.\n- Spatial memory.\n- Levels of phosphorylated tau proteins and amyloid β-plaques.\n- Expression of pro-inflammatory cytokines.\n- Levels of neural microglia.\n- Severity of adverse events.\n- Dose-limiting toxicity.\nThe number of animals implicated for stem cell transplantation was not specified in the review.", "doc_items_refs": ["#/texts/288", "#/texts/289", "#/texts/290", "#/texts/291", "#/texts/292", "#/texts/293", "#/texts/294", "#/texts/295", "#/texts/296", "#/texts/297", "#/texts/298", "#/texts/299", "#/texts/300", "#/texts/301", "#/texts/302", "#/texts/303", "#/texts/304", "#/texts/305", "#/texts/306", "#/texts/307", "#/texts/308", "#/texts/309", "#/texts/310", "#/texts/311", "#/texts/312", "#/texts/313", "#/texts/314", "#/texts/315", "#/texts/316", "#/texts/317", "#/texts/318", "#/texts/319"], "page_nos": [], "uuid": "755908c0-b564-4588-b17c-f81ca0f5b9f7"}
{"doc_id": "2025__Stem_cell_therapy_use_in_patients_with_dementia_a_systematic_review__W4410277989", "source_path": "<redacted:source_path>", "chunk_id": 16, "source_chunk_idxs": [26, 27], "num_tokens": 411, "text": "Stem cell therapy use in patients with dementia: a systematic review\nDiscussion\nGiven the increasing global prevalence of dementia, AD remains a major area of research for developing effective treatments. SCTs have shown promise in promoting neuroprotection, enhancing neurogenesis, and modulating inflammatory responses in the brain. This review aims to evaluate the status and efficacy of preclinical and clinical studies involving stem cells as a therapeutic approach for AD, highlighting both advances and challenges in the field.\n\nStem cell therapy use in patients with dementia: a systematic review\nDiscussion\nMechanisms and efficacy of SCTs\nOur review reveals that MSCs derived from sources such as human placenta and umbilical cord show neuroprotective effects in preclinical studies, with improvements in memory and reductions in inflammation. These findings align with the current literature, which suggests that MSCs exert their effects through various mechanisms, such as the release of neurotrophic factors, reduction in amyloid-beta toxicity, and modulation of immune responses [\n56\n]. However, despite consistent evidence of the benefits of MSCs, the precise molecular pathways through which these therapies act remain unclear. While several studies support the neurotrophic effects of MSCs [\n57\n,\n58\n], the complex interaction between these factors and the neurodegenerative processes in AD needs further investigation.\nCompared to other therapeutic strategies, such as anti-amyloid antibody treatments or small molecule drugs, SCTs offer a more comprehensive approach. Traditional treatments typically target a single pathological mechanism (e.g., amyloid-beta or tau aggregation), while SCTs may address multiple aspects of AD pathology, including neuroinflammation and cell regeneration [\n59\n,\n60\n]. This multi-faceted approach could provide broader therapeutic benefits, especially for AD, which involves complex, interconnected processes. However, the complexity of these mechanisms poses a challenge for translating SCTs into clinical practice, as their effects may vary depending on the type of stem cells, delivery methods, and disease stage.", "doc_items_refs": ["#/texts/321", "#/texts/323", "#/texts/324", "#/texts/325", "#/texts/326", "#/texts/327", "#/texts/328", "#/texts/329", "#/texts/330", "#/texts/331", "#/texts/332", "#/texts/333", "#/texts/334"], "page_nos": [], "uuid": "c5df059b-9afe-452a-9fa1-e8bafc0435e9"}
{"doc_id": "2025__Stem_cell_therapy_use_in_patients_with_dementia_a_systematic_review__W4410277989", "source_path": "<redacted:source_path>", "chunk_id": 17, "source_chunk_idxs": [28], "num_tokens": 341, "text": "Stem cell therapy use in patients with dementia: a systematic review\nDiscussion\nSafety and clinical outcomes\nThe clinical trials reviewed in this study generally demonstrate a favorable safety profile for SCTs, particularly when cells are delivered through less invasive methods like intravenous infusion. This mirrors findings in other studies, where stem cell-based treatments are generally considered safe, especially when autologous or well-characterized allogeneic cells are used [\n61\n,\n62\n]. However, as noted in our review, certain delivery methods, such as intracerebral or intraventricular injections, are associated with higher risks, including infection or immune response. This observation is consistent with previous studies, which highlight the risks linked to direct central nervous system administration of stem cells [\n31\n,\n63\n,\n64\n].\nDespite the generally positive safety profile, variability in clinical outcomes is evident. Some trials report favorable cognitive improvements, while others show limited efficacy, reflecting the challenges of SCTs in neurodegenerative diseases. To date, only a limited number of trials have been completed, revealing challenges in achieving a sustained cognitive improvement among dementia populations. For instance, a study by He et al. (2017) noted initial cognitive gains three months post-transplantation with human UCB-MSCs, as assessed by the Mini-Mental State Exam (MMSE) and Barthel Index scoring system [\n65\n]. However, these gains regressed to baseline levels by six months, attributed to factors such as insufficient cell infusion and advanced dementia stages at study entry [\n65\n]. This underscores the complexity of translating successful preclinical outcomes to human trials and highlights the need for refined cellular models in future clinical research.", "doc_items_refs": ["#/texts/336", "#/texts/337", "#/texts/338", "#/texts/339", "#/texts/340", "#/texts/341", "#/texts/342", "#/texts/343", "#/texts/344", "#/texts/345", "#/texts/346", "#/texts/347", "#/texts/348", "#/texts/349", "#/texts/350", "#/texts/351"], "page_nos": [], "uuid": "a129486f-d790-401c-9163-dd26977db4b5"}
{"doc_id": "2025__Stem_cell_therapy_use_in_patients_with_dementia_a_systematic_review__W4410277989", "source_path": "<redacted:source_path>", "chunk_id": 18, "source_chunk_idxs": [29], "num_tokens": 268, "text": "Stem cell therapy use in patients with dementia: a systematic review\nDiscussion\nSafety and clinical outcomes\nWhile some studies show significant cognitive improvements and behavior changes [\n66\n,\n67\n], others yield inconclusive results [\n68\n]. This variability can be attributed to factors like patient heterogeneity, stem cell types, and differences in cognitive assessments used in trials [\n66\n,\n67\n]. Standardizing methodologies and patient populations in future trials is essential to draw more definitive conclusions about SCT efficacy [\n68\n]. Despite the promising preclinical results, clinical translation remains challenging. A recent trial by Kim et al. (2015) showed minimal therapeutic improvements with MSCs delivered via stereotactic injection over a 24-month follow-up period [\n30\n] Similarly, other trials report modest cognitive and behavioral improvements, highlighting the difficulty of translating preclinical success into clinical outcomes [\n69\n,\n70\n]. In contrast, intravenous (I.V.) administration of MSCs has shown better results, improving inflammation and neurocognitive function with lower doses compared to stereotactic injection [\n69\n,\n70\n]. However, variability in factors such as MSC source, dosage, and delivery method complicates drawing definitive conclusions, although local injections may reduce systemic loss and enhance targeted effects [\n69\n,\n70\n].", "doc_items_refs": ["#/texts/352", "#/texts/353", "#/texts/354", "#/texts/355", "#/texts/356", "#/texts/357", "#/texts/358", "#/texts/359", "#/texts/360", "#/texts/361", "#/texts/362", "#/texts/363", "#/texts/364", "#/texts/365", "#/texts/366", "#/texts/367", "#/texts/368", "#/texts/369", "#/texts/370", "#/texts/371", "#/texts/372", "#/texts/373", "#/texts/374", "#/texts/375", "#/texts/376", "#/texts/377", "#/texts/378"], "page_nos": [], "uuid": "565bad9c-d745-494c-bc64-3c0cac5350ea"}
{"doc_id": "2025__Stem_cell_therapy_use_in_patients_with_dementia_a_systematic_review__W4410277989", "source_path": "<redacted:source_path>", "chunk_id": 19, "source_chunk_idxs": [30], "num_tokens": 391, "text": "Stem cell therapy use in patients with dementia: a systematic review\nDiscussion\nFuture perspectives of stem cell therapy in treating dementia\nIn 2015, there were 46.8 million dementia patients globally, a number expected to reach 131.5 million by 2050 [\n71\n]. SC research has revitalized hopes for managing neurodegenerative diseases. Experimental studies employing animal models have demonstrated promising results, sparking increasing interest in the potential of SCT as a treatment for these conditions [\n72\n]. The global SCT market, valued at $10.9 billion in 2010, surged to $51.26 billion by 2017 [\n72\n].\nMSCs, including those derived from adipose tissue and umbilical cord blood, are emerging as viable candidates for SCT, contrasting with the challenges associated with neural stem cells NSCs. BM-MSCs are difficult to extract and cultivate, limiting their clinical utility. Despite these challenges, recent studies highlight AD-MSCs and UCB-MSCs as promising therapies for AD and other neurodegenerative disorders. However, ESCs pose risks such as immune rejection and tumorigenesis, which complicate their therapeutic application [\n73\n].\nWhile preclinical findings are promising, significant hurdles must be overcome before SCT can be tailored into effective treatments for dementia. Decades of research have underscored the potential of SC therapies to revolutionize treatments for conditions like multiple sclerosis, PD, and age-related macular degeneration. However, the unique nature of SC-based therapeutics raises complex policy and regulatory challenges. Healthcare authorities must develop robust legislative frameworks to support the ethical and safe progression of SC research, particularly in the context of treating dementia. In summary, the field of SC research for the management of dementia has a bright future ahead of it, but careful monitoring and regulatory assistance are needed to guarantee the safe and efficient development of novel therapeutics.", "doc_items_refs": ["#/texts/380", "#/texts/381", "#/texts/382", "#/texts/383", "#/texts/384", "#/texts/385", "#/texts/386", "#/texts/387", "#/texts/388", "#/texts/389", "#/texts/390"], "page_nos": [], "uuid": "c01d7af8-d7a3-4fb5-9b0c-0a05e0f55180"}
{"doc_id": "2025__Stem_cell_therapy_use_in_patients_with_dementia_a_systematic_review__W4410277989", "source_path": "<redacted:source_path>", "chunk_id": 20, "source_chunk_idxs": [31, 32, 33], "num_tokens": 451, "text": "Stem cell therapy use in patients with dementia: a systematic review\nDiscussion\nLimitations\nDespite the comprehensive approach taken in this review, several limitations must be acknowledged. Firstly, the included studies exhibited significant heterogeneity in terms of study design, stem cell types, routes of administration, dosages, and outcome measures. This heterogeneity limited our ability to perform a formal meta-analysis and may have introduced variability in the findings. Additionally, there is a potential for publication bias, as studies with positive results are more likely to be published than those with negative or inconclusive findings, which could lead to an overestimation of the effectiveness of SCT in treating dementia. Ethical and practical constraints may have limited the scope and execution of some studies, particularly in patient recruitment and the use of certain SC types. The absence of longitudinal data tracking patients over extended periods reduces the ability to assess the durability and progression of treatment effects. Lastly, most of the included studies were conducted in specific regions and may not represent the global population, with variations in genetic, environmental, and healthcare factors potentially influencing the outcomes and applicability of SCT in different populations.\n\nStem cell therapy use in patients with dementia: a systematic review\nConclusion\nOur review sheds light on the landscape of clinical and pre-clinical trials investigating SCT for managing dementia. Pre-clinical trials using animal models have shown promising results, indicating the potential of SCT in dementia treatment. There is a growing interest in conducting clinical trials to further explore SCT applications in human subjects. However, the outcomes of current clinical trials suggest that significant success in treating complex medical conditions like dementia with SCT has not yet been achieved. Therefore, pre-clinical trials, while informative, may not reliably predict success and efficacy in human clinical trials. Moving forward, there is a critical need for improved clinical trial methodologies and advanced models in stem cell research to delineate the most effective approaches for treating dementia. Continued research and rigorous clinical investigation are essential to realize the potential of SCT in addressing the challenges of neurodegenerative diseases.\n\nStem cell therapy use in patients with dementia: a systematic review\nData availability\nNo datasets were generated or analysed during the current study.", "doc_items_refs": ["#/texts/392", "#/texts/394", "#/texts/396"], "page_nos": [], "uuid": "bd63d222-481f-4ddc-9081-5b88eed4d134"}
{"doc_id": "2025__Stem_cell_therapy_use_in_patients_with_dementia_a_systematic_review__W4410277989", "source_path": "<redacted:source_path>", "chunk_id": 21, "source_chunk_idxs": [34], "num_tokens": 378, "text": "Stem cell therapy use in patients with dementia: a systematic review\nAbbreviations\nAβ:\namyloid-beta\nAD:\nAlzheimer's disease\nAD-MSC:\nadipose-derived mesenchymal stem cell\nAD-SVF:\nautologous adipose-derived stromal vascular fraction\nBM-MSC:\nbone marrow-derived mesenchymal stem cell\nCOVID:\nnovel coronavirus disease 2019\nCOX:\ncyclooxygenase\nCNS:\ncentral nervous system\nESC:\nembryonic stem cell\nHB-adMSC:\nHope Biosciences autologous mesenchymal stem cell\nHD:\nHuntington's disease\nhiESC:\nhuman-induced embryonic stem cell\nhiPSC:\nhuman-induced pluripotent stem cell\nIL:\ninterleukin\niPSC:\ninduced pluripotent stem cell\nLMSCs:\nlongeveron mesenchymal stem cell\nPD:\nParkinson's disease\nPDMSC:\nplacenta-derived mesenchymal stem cell\nPGE:\nprostaglandin E\nPSC:\npluripotent stem cell\nPTGER:\nprostaglandin E receptor\nMMSE:\nMini-Mental State Exam\nMSC:\nmesenchymal stem cell\nMSC-Exos:\nexosomes from allogenic adipose mesenchymal stem cell\nNCSC:\nneural crest stem cell\nNSC:\nneural stem cell\nRCT:\nrandomized control trial\nSC:\nstem cell\nSCT:\nstem cell therapy\nSR:\nsystematic review\nTNF:\ntumor necrosis factor\nU-MSC:\numbilical cord Warton's jelly-derived mesenchymal stem cell\nU-MSC-NC:\nneuron-like cell differentiated from umbilical cord Warton's jelly-derived mesenchymal stem cell\nUCB-MSC:\numbilical cord blood-derived mesenchymal stem cell\nWHO:\nWorld Health Organization", "doc_items_refs": ["#/texts/398", "#/texts/399", "#/texts/400", "#/texts/401", "#/texts/402", "#/texts/403", "#/texts/404", "#/texts/405", "#/texts/406", "#/texts/407", "#/texts/408", "#/texts/409", "#/texts/410", "#/texts/411", "#/texts/412", "#/texts/413", "#/texts/414", "#/texts/415", "#/texts/416", "#/texts/417", "#/texts/418", "#/texts/419", "#/texts/420", "#/texts/421", "#/texts/422", "#/texts/423", "#/texts/424", "#/texts/425", "#/texts/426", "#/texts/427", "#/texts/428", "#/texts/429", "#/texts/430", "#/texts/431", "#/texts/432", "#/texts/433", "#/texts/434", "#/texts/435", "#/texts/436", "#/texts/437", "#/texts/438", "#/texts/439", "#/texts/440", "#/texts/441", "#/texts/442", "#/texts/443", "#/texts/444", "#/texts/445", "#/texts/446", "#/texts/447", "#/texts/448", "#/texts/449", "#/texts/450", "#/texts/451", "#/texts/452", "#/texts/453", "#/texts/454", "#/texts/455", "#/texts/456", "#/texts/457", "#/texts/458", "#/texts/459", "#/texts/460", "#/texts/461", "#/texts/462", "#/texts/463", "#/texts/464", "#/texts/465", "#/texts/466", "#/texts/467"], "page_nos": [], "uuid": "27f49674-36bc-4876-84ec-0420f734f87c"}
{"doc_id": "2025__Stem_cell_therapy_use_in_patients_with_dementia_a_systematic_review__W4410277989", "source_path": "<redacted:source_path>", "chunk_id": 22, "source_chunk_idxs": [35], "num_tokens": 466, "text": "Stem cell therapy use in patients with dementia: a systematic review\nReferences\n1. Rahimi Darehbagh R, Seyedoshohadaei SA, Ramezani R, Rezaei N. Stem cell therapies for neurological disorders: current progress, challenges, and future perspectives. Eur J Med Res. 2024;29(1):386-20.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n2. He Z. Research progress and prospects of mesenchymal stem cells for neurodegenerative disease treatment. In: Gao X, editor. Biological sciences and environmental health. 1 ed. CRC; 2025. pp. 37-42.\n3. Llorente IL, Hatanaka EA, Meadow ME, Xie Y, Lowry WE, Carmichael ST. Reliable generation of glial enriched progenitors from human fibroblast-derived iPSCs. Stem Cell Res. 2021;55:102458.\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n4. Sivandzade F, Cucullo L. Regenerative stem cell therapy for neurodegenerative diseases: an overview. Int J Mol Sci. 2021;22(4):1-21.\nArticle\nGoogle Scholar\n5. World Health Organization. Dementia 2023 [Available from:\nhttps://www.who.int/news-room/fact-sheets/detail/dementia\n6. Duncan T, Valenzuela M. Alzheimer's disease, dementia, and stem cell therapy. Stem Cell Res Ther. 2017;8(1):1-9.\nArticle\nCAS\nGoogle Scholar\n7. Gago M, Machado A, Rocha S. Current clinical approaches in neurodegenerative diseases. In: Salgado A, editor. Handbook of innovations in central nervous system regenerative medicine. United States: Elsevier; 2020. pp. 79-124.\nChapter\nGoogle Scholar\n8. Singh K, Gupta JK, Kumar S, Soni U. A review of the common neurodegenerative disorders: current therapeutic approaches and the potential role of bioactive peptides. Curr Protein Pept Sci. 2024;25(7):507-26.\nArticle\nCAS\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/469", "#/texts/470", "#/texts/471", "#/texts/472", "#/texts/473", "#/texts/474", "#/texts/475", "#/texts/476"], "page_nos": [], "uuid": "52c152a0-44a2-4daf-b82c-bcc990dbed4a"}
{"doc_id": "2025__Stem_cell_therapy_use_in_patients_with_dementia_a_systematic_review__W4410277989", "source_path": "<redacted:source_path>", "chunk_id": 23, "source_chunk_idxs": [36], "num_tokens": 500, "text": "Stem cell therapy use in patients with dementia: a systematic review\nReferences\n9. Rezaei S, Morshedi K, Shafabakhsh R, Mahjoubin-Tehran M. Current therapies for neurological disorders and their limitations. Phytonutrients and Neurological Disorders: Therapeutic and Toxicological Aspects2023. pp. 107- 30.\n10. Li J, Haj Ebrahimi A, Ali AB. Advances in therapeutics to alleviate cognitive decline and neuropsychiatric symptoms of Alzheimer's disease. Int J Mol Sci. 2024;25(10):5169.\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n11. Chvojkova M, Kolar D, Kovacova K, Cejkova L, Misiachna A, Hakenova K, et al. Pro-cognitive effects of dual Tacrine derivatives acting as cholinesterase inhibitors and NMDA receptor antagonists. Biomed Pharmacother. 2024;176:116821.\nArticle\nCAS\nPubMed\nGoogle Scholar\n12. Guy B, Zhang JS, Duncan LH, Johnston RJ. Human neural organoids: models for developmental neurobiology and disease. Dev Biol. 2021;478:102-21.\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n13. Jean KRP, Dotson VMP. Dement Neurologic Clin. 2024;42(4):793-807.\n14. Tsering W, Lolo K, Phillips JL, Golde T, Prokop S. Accumulation of novel Amyloidosis-associated proteins in the progression of Alzheimer's disease. Alzheimer's Dement. 2024;20(S1):n/a-n/a.\n15. Yakimicki ML, Edwards NE, Richards E, Beck AM. Animal-Assisted intervention and dementia: A systematic review. Los Angeles, CA: SAGE; 2019. pp. 9-29.\nGoogle Scholar\n16. Esquerda-Canals G, Montoliu-Gaya L, Güell-Bosch J, Villegas S. Mouse models of Alzheimer's disease. J Alzheimers Dis. 2017;57(4):1171-83.\nArticle\nCAS\nPubMed\nGoogle Scholar\n17. Venkat PCM, Chen J. Models and mechanisms of vascular dementia. Exp Neurol. 2015.", "doc_items_refs": ["#/texts/477", "#/texts/478", "#/texts/479", "#/texts/480", "#/texts/481", "#/texts/482", "#/texts/483", "#/texts/484", "#/texts/485"], "page_nos": [], "uuid": "ad2bd0f7-d126-49a2-905f-645e5a34e44e"}
{"doc_id": "2025__Stem_cell_therapy_use_in_patients_with_dementia_a_systematic_review__W4410277989", "source_path": "<redacted:source_path>", "chunk_id": 24, "source_chunk_idxs": [37], "num_tokens": 479, "text": "Stem cell therapy use in patients with dementia: a systematic review\nReferences\n18. Porsolt RD, Roux S, Wettstein JG. Animal models of dementia. Drug Dev Res. 1995;35(4):214-29.\nArticle\nCAS\nGoogle Scholar\n19. Anand A, Banik A, Thakur K, Masters CL. The animal models of dementia and Alzheimer's disease for pre-clinical testing and clinical translation. Curr Alzheimer Res. 2012;9(9):1010-29.\nArticle\nCAS\nPubMed\nGoogle Scholar\n20. Xuan AG, Luo M, Ji WD, Long DH. Effects of engrafted neural stem cells in Alzheimer's disease rats. Neurosci Lett. 2009;450(2):167-71.\nArticle\nCAS\nPubMed\nGoogle Scholar\n21. Park D, Yang G, Bae DK, Lee SH, Yang Y-H, Kyung J, et al. Human adipose tissue-derived mesenchymal stem cells improve cognitive function and physical activity in ageing mice. J Neurosci Res. 2013;91(5):660-70.\nArticle\nCAS\nPubMed\nGoogle Scholar\n22. Munoz JR, Stoutenger BR, Robinson AP, Spees JL, Prockop DJ. Human Stem/Progenitor Cells from Bone Marrow Promote Neurogenesis of Endogenous Neural Stem Cells in the Hippocampus of Mice. Proceedings of the National Academy of Sciences - PNAS. 2005;102(50):18171-6.\n23. Teixeira FG, Carvalho MM, Neves-Carvalho A, Panchalingam KM, Behie LA, Pinto L, et al. Secretome of mesenchymal progenitors from the umbilical cord acts as modulator of neural/glial proliferation and differentiation. Stem Cell Rev. 2015;11(2):288-97.\nArticle\nCAS\nGoogle Scholar\n24. Oh SH, Kim HN, Park HJ, Shin JY, Lee PH. Mesenchymal stem cells increase hippocampal neurogenesis and neuronal differentiation by enhancing the Wnt signaling pathway in an Alzheimer's disease model. Cell Transplant. 2015;24(6):1097-109.\nArticle\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/486", "#/texts/487", "#/texts/488", "#/texts/489", "#/texts/490", "#/texts/491", "#/texts/492"], "page_nos": [], "uuid": "20b7367a-31bf-4fba-8fef-8bf6dbce0b0c"}
{"doc_id": "2025__Stem_cell_therapy_use_in_patients_with_dementia_a_systematic_review__W4410277989", "source_path": "<redacted:source_path>", "chunk_id": 25, "source_chunk_idxs": [38], "num_tokens": 461, "text": "Stem cell therapy use in patients with dementia: a systematic review\nReferences\n25. Ra JC, Shin IS, Kim SH, Kang SK, Kang BC, Lee HY, et al. Safety of intravenous infusion of human adipose tissue-derived mesenchymal stem cells in animals and humans. Stem Cells Dev. 2011;20(8):1297-308.\nArticle\nCAS\nPubMed\nGoogle Scholar\n26. Pang ZP, Yang N, Vierbuchen T, Ostermeier A, Fuentes DR, Yang TQ, et al. Induction of human neuronal cells by defined transcription factors. Nat (London). 2011;476(7359):220-3.\nArticle\nCAS\nGoogle Scholar\n27. Liu X, Li F, Stubblefield EA, Blanchard B, Richards TL, Larson GA, et al. Direct reprogramming of human fibroblasts into dopaminergic neuron-like cells. Cell Res. 2012;22(2):321-32.\nArticle\nCAS\nPubMed\nGoogle Scholar\n28. Eckert A, Huang L, Gonzalez R, Kim H-S, Hamblin MH, Lee J-P. Bystander effect fuels human induced pluripotent stem Cell-Derived neural stem cells to quickly attenuate early stage neurological deficits after stroke. Stem Cells Translational Med. 2015;4(7):841-51.\nArticle\nGoogle Scholar\n29. Fujiwara N, Shimizu J, Takai K, Arimitsu N, Saito A, Kono T, et al. Restoration of Spatial memory dysfunction of human APP Transgenic mice by transplantation of neuronal precursors derived from human iPS cells. Neurosci Lett. 2013;557:129-34.\nArticle\nCAS\nPubMed\nGoogle Scholar\n30. Kim HJ, Seo SW, Chang JW, Lee JI, Kim CH, Chin J, et al. Stereotactic brain injection of human umbilical cord blood mesenchymal stem cells in patients with Alzheimer's disease dementia: A phase 1 clinical trial. Alzheimer's Dementia: Translational Res Clin Interventions. 2015;1(2):95-102.\nGoogle Scholar", "doc_items_refs": ["#/texts/493", "#/texts/494", "#/texts/495", "#/texts/496", "#/texts/497", "#/texts/498"], "page_nos": [], "uuid": "f6d24099-d152-4eee-8f89-6fb7c0220255"}
{"doc_id": "2025__Stem_cell_therapy_use_in_patients_with_dementia_a_systematic_review__W4410277989", "source_path": "<redacted:source_path>", "chunk_id": 26, "source_chunk_idxs": [39], "num_tokens": 482, "text": "Stem cell therapy use in patients with dementia: a systematic review\nReferences\n31. Kim HJ, Cho KR, Jang H, Lee NK, Jung YH, Kim JP, et al. Intracerebroventricular injection of human umbilical cord blood mesenchymal stem cells in patients with Alzheimer's disease dementia: a phase I clinical trial. Alzheimers Res Ther. 2021;13(1):154.\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n32. ClinicalTrials.gov. Alzheimer's Autism and Cognitive Impairment Stem Cell Treatment Study (ACIST) 2018 [Available from:\nhttps://clinicaltrials.gov/study/NCT03724136\n33. ClinicalTrials.gov. The Safety and the Efficacy Evaluation of Allogenic Adipose MSC-Exos in Patients With Alzheimer's Disease 2020 [Available from:\nhttps://clinicaltrials.gov/study/NCT04388982\n34. ClinicalTrials.gov. A Clinical Trial to Determine the Safety and Efficacy of Hope Biosciences Autologous Mesenchymal Stem Cell Therapy (HB-adMSCs) for the Treatment of Alzheimer's Disease 2020 [Available from:\nhttps://clinicaltrials.gov/study/NCT04228666\n35. ClinicalTrials.gov. A Study to Evaluate the Safety and Efficacy of AstroStem in Treatment of Alzheimer's Disease 2017 [Available from:\nhttps://clinicaltrials.gov/study/NCT03117738\n36. Liras A. Future research and therapeutic applications of human stem cells: general, regulatory, and bioethical aspects. J Translational Med. 2010;8(1):131.\nArticle\nGoogle Scholar\n37. Condic ML, Rao M. Alternative sources of pluripotent stem cells: ethical and scientific issues revisited. Stem Cells Dev. 2010;19(8):1121-9.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n38. Wei X, Yang X, Han ZP, Qu FF, Shao L, Shi YF. Mesenchymal stem cells: a new trend for cell therapy. Acta Pharmacol Sin. 2013;34(6):747-54.\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/499", "#/texts/500", "#/texts/501", "#/texts/502", "#/texts/503", "#/texts/504", "#/texts/505", "#/texts/506"], "page_nos": [], "uuid": "04c32af2-8bb4-4eab-b887-f87b8692d8f1"}
{"doc_id": "2025__Stem_cell_therapy_use_in_patients_with_dementia_a_systematic_review__W4410277989", "source_path": "<redacted:source_path>", "chunk_id": 27, "source_chunk_idxs": [40], "num_tokens": 495, "text": "Stem cell therapy use in patients with dementia: a systematic review\nReferences\n39. Kun J, Yongqi Z, Lei Z. New prospects for stem cell therapy in Alzheimer's disease. In: Xinhua Z, editor. Hippocampus. Rijeka: IntechOpen; 2021. Ch. 9.\nGoogle Scholar\n40. Martínez-Morales PL, Revilla A, Ocaña I, González C, Sainz P, McGuire D, et al. Progress in stem cell therapy for major human neurological disorders. Stem Cell Rev. 2013;9(5):685-99.\nArticle\nGoogle Scholar\n41. ClinicalTrials.gov. Alzheimer's Disease Stem Cells Multiple Infusions 2019 [Available from:\nhttps://clinicaltrials.gov/study/NCT04040348\n42. ClinicalTrials.gov. The Long-Term Safety and Efficacy Follow-Up Study of Subjects Who Completed the Phase I Clinical Trial of Neurostem\n®\n-AD 2012 [Available from:\nhttps://clinicaltrials.gov/study/NCT01696591\n43. ClinicalTrials.gov. Neurologic Stem Cell Treatment Study (NEST) 2016 [Available from:\nhttps://clinicaltrials.gov/study/NCT02795052\n44. ClinicalTrials.gov. Autologous Human Adipose-Derived Mesenchymal Stem Cells in Alzheimer's Disease [Available from:\nhttps://clinicaltrials.gov/study/NCT04855955\n45. ClinicalTrials.gov. Safety and exploratory efficacy study of UCMSCs in patients with Alzheimer's disease (SEESUPAD) 2021 [Available from:\nhttps://clinicaltrials.gov/ct2/show/NCT02672306\n46. ClinicalTrials.gov. Safety and Efficiency of Umbilical Cord-derived Mesenchymal Stem Cells(UC-MSC) in Patients With Alzheimer's Disease (SEMAD) 2012 [Available from:\nhttps://clinicaltrials.gov/study/NCT01547689\n47. ClinicalTrials.gov, Lomecel. -B Infusion Versus Placebo in Patients With Alzheimer's Disease 2016 [Available from:\nhttps://clinicaltrials.gov/study/NCT02600130", "doc_items_refs": ["#/texts/507", "#/texts/508", "#/texts/509", "#/texts/510", "#/texts/511", "#/texts/512", "#/texts/513", "#/texts/514", "#/texts/515"], "page_nos": [], "uuid": "703e93fe-1aab-4702-a5a2-450706e7e535"}
{"doc_id": "2025__Stem_cell_therapy_use_in_patients_with_dementia_a_systematic_review__W4410277989", "source_path": "<redacted:source_path>", "chunk_id": 28, "source_chunk_idxs": [41], "num_tokens": 484, "text": "Stem cell therapy use in patients with dementia: a systematic review\nReferences\n48. ClinicalTrials.gov. Exploratory Efficacy Study of NEUROSTEM\n®\nin Subjects Who Control Group of NEUROSTEM\n®\n2021 [Available from:\nhttps://clinicaltrials.gov/study/NCT04954534\n49. ClinicalTrials.gov. Follow-up Study of Safety and Efficacy in Subjects Who Completed NEUROSTEM\n®\nPhase-I/IIa Clinical Trial. 2017 [Available from:\nhttps://clinicaltrials.gov/study/NCT03172117?cond=NCT03172117%26;rank=1\n50. ClinicalTrials.gov. Study to Assess the Safety and Effects of Autologous Adipose-Derived Stromal Cells in Patients With Alzheimer's Disease 2016 [Available from:\nhttps://clinicaltrials.gov/study/NCT02912169?tab=history%26;a=2\n51. ClinicalTrials.gov. Study to Evaluate the Safety and Efficacy of AstroStem in Treatment of Alzheimer's Disease 2023 [Available from:\nhttps://clinicaltrials.gov/study/NCT04482413\n52. ClinicalTrials.gov. Autologous Stem/Stromal Cells in Neurological Disorders and Disease (NDD) 2020 [Available from:\nhttps://clinicaltrials.gov/study/NCT03297177\n53. ClinicalTrials.gov. Safety and Clinical Outcomes With Amniotic and Umbilical Cord Tissue Therapy for Numerous Medical Conditions 2019 [Available from:\nhttps://clinicaltrials.gov/study/NCT03899298?cond=NCT03899298%26;rank=1\n54. ClinicalTrials.gov. Mesenchymal Stem Cells for the Treatment of Various Chronic and Acute Conditions 2020 [Available from:\nhttps://clinicaltrials.gov/study/NCT04684602\n55. ClinicalTrials.gov. Evaluation of the Safety and Potential Therapeutic Effects of CB-AC-02 in Patients With Alzheimer's Disease 2016 [Available from:\nhttps://clinicaltrials.gov/study/NCT02899091", "doc_items_refs": ["#/texts/516", "#/texts/517", "#/texts/518", "#/texts/519", "#/texts/520", "#/texts/521", "#/texts/522", "#/texts/523"], "page_nos": [], "uuid": "69a96854-fe75-4cdc-89c5-9c40c2e0ae68"}
{"doc_id": "2025__Stem_cell_therapy_use_in_patients_with_dementia_a_systematic_review__W4410277989", "source_path": "<redacted:source_path>", "chunk_id": 29, "source_chunk_idxs": [42], "num_tokens": 509, "text": "Stem cell therapy use in patients with dementia: a systematic review\nReferences\n56. Zhang R, Li C, Du R, Yuan Y, Zhao B, Zhang Y, et al. Mesenchymal stem cells: as a multi-target cell therapy for clearing β-amyloid deposition in Alzheimer's disease. Biocell. 2022;46(3):583-92.\nArticle\nCAS\nGoogle Scholar\n57. Li Q, Guo A-y, Chen Z, Wang H, Gao F, Lei Q, et al. Mesenchymal stem Cell-Derived microvesicles support ex vivo expansion of cord Blood-Derived CD34 + Cells. Stem Cells Int. 2016;2016(2016):1-13.\nGoogle Scholar\n58. Zhang K, Du X, Gao Y, Liu S, Xu Y. Mesenchymal stem cells for treating Alzheimer's disease: cell therapy and chemical reagent pretreatment. J Alzheimers Dis. 2023;93(3):863.\nArticle\nCAS\nPubMed\nGoogle Scholar\n59. Ou C-M, Xue W-W, Liu D, Ma L, Xie H-T, Ning K. Stem cell therapy in Alzheimer's disease: current status and perspectives. Front NeuroSci. 2024;18.\n60. Madar P, Nagalapur P, Chaudhari S, Sharma D, Koparde A, Buchade R, et al. The unveiling of therapeutic targets for Alzheimer's disease: an integrative review. Curr Top Med Chem. 2024;24(10):850.\nArticle\nCAS\nPubMed\nGoogle Scholar\n61. Feizi H, Hosseini M-S, Seyedi-Sahebari S, Karimi H, Mosaddeghi-Heris R, Sadigh-Eteghad S, et al. A systematic review of clinical efficacy and safety of cell-based therapies in Alzheimer's disease. Dement Neuropsychologia. 2024;18:e20240147.\nArticle\nGoogle Scholar\n62. Belousova E, Salikhova D, Maksimov Y, Nebogatikov V, Sudina A, Goldshtein D, et al. Proposed mechanisms of cell therapy for Alzheimer's disease. Int J Mol Sci. 2024;25(22):12378.\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/524", "#/texts/525", "#/texts/526", "#/texts/527", "#/texts/528", "#/texts/529", "#/texts/530"], "page_nos": [], "uuid": "14865ae4-8cb0-48b0-8335-c9b0c9291d6a"}
{"doc_id": "2025__Stem_cell_therapy_use_in_patients_with_dementia_a_systematic_review__W4410277989", "source_path": "<redacted:source_path>", "chunk_id": 30, "source_chunk_idxs": [43], "num_tokens": 466, "text": "Stem cell therapy use in patients with dementia: a systematic review\nReferences\n63. Lee G, Glicksman M, Patel R, Vanjani N, Kumthekar P, DDEL-10. retrospective review of intra-csf drug, delivery: safety and drug distribution profiles of intracerebroventricular (ICV). Lumbar intrathecal (LIT), and intra-cisterna magna (ICM) Injections. Neuro-oncology. (Charlottesville Va). 2023;25(Supplement5):v103-v.\n64. Chauhan NB, Siegel GJ. Intracerebroventricular passive immunization in Transgenic mouse models of Alzheimer's disease. Expert Rev Vaccines. 2004;3(6):717-25.\nArticle\nCAS\nPubMed\nGoogle Scholar\n65. He Y, Jin X, Wang J, Meng M, Hou Z, Tian W, et al. Umbilical cord-derived mesenchymal stem cell transplantation for treating elderly vascular dementia. Cell Tissue Banking. 2017;18(1):53-9.\nArticle\nPubMed\nGoogle Scholar\n66. Blurton-Jones M, Kitazawa M, Martinez-Coria H, Castello NA, Müller F-J, Loring JF et al. Neural stem cells improve cognition via BDNF in a transgenic model of Alzheimer disease. Proceedings of the National Academy of Sciences - PNAS. 2009;106(32):13594-9.\n67. Wang Q, Matsumoto Y, Shindo T, Miyake K, Shindo A, Kawanishi M, et al. Neural stem cells transplantation in cortex in a mouse model of Alzheimer's disease. J Med Invest. 2006;53(1-2):61.\nArticle\nPubMed\nGoogle Scholar\n68. Regmi S, Liu DD, Shen M, Kevadiya BD, Ganguly A, Primavera R, et al. Mesenchymal stromal cells for the treatment of Alzheimer's disease: strategies and limitations. Front Mol Neurosci. 2022;15:1011225.\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/531", "#/texts/532", "#/texts/533", "#/texts/534", "#/texts/535", "#/texts/536"], "page_nos": [], "uuid": "88b86092-1ea3-4197-8d00-0b035879a829"}
{"doc_id": "2025__Stem_cell_therapy_use_in_patients_with_dementia_a_systematic_review__W4410277989", "source_path": "<redacted:source_path>", "chunk_id": 31, "source_chunk_idxs": [44], "num_tokens": 371, "text": "Stem cell therapy use in patients with dementia: a systematic review\nReferences\n69. Brody M, Agronin M, Herskowitz BJ, Bookheimer SY, Small GW, Hitchinson B, et al. Results and insights from a phase I clinical trial of Lomecel-B for Alzheimer's disease. Alzheimer's Dement. 2023;19(1):261-73.\nArticle\nCAS\nGoogle Scholar\n70. Oliva AA, Brody M, Agronin M, Herskowitz B, Bookheimer SY, Hitchinson B, et al. Safety and efficacy of Lomecel-B in patients with mild Alzheimer's disease: results of a double-blinded, randomized, placebo-controlled phase 1 clinical trial. Alzheimer's Dement. 2021;17(S9):na-na.\nArticle\nGoogle Scholar\n71. Prince M, Bryce R, Albanese E, Wimo A, Ribeiro W, Ferri CP. The global prevalence of dementia: A systematic review and metaanalysis. Alzheimer's Dement. 2013;9(1):63-e752.\nArticle\nGoogle Scholar\n72. Zhang F-Q, Jiang J-L, Zhang J-T, Niu H, Fu X-Q, Zeng L-L. Current status and future prospects of stem cell therapy in Alzheimer's disease. Neural Regeneration Res. 2020;15(2):242-50.\nArticle\nCAS\nGoogle Scholar\n73. Clément F, Grockowiak E, Zylbersztejn F, Fossard G, Gobert S, Maguer-Satta V. Stem cell manipulation, gene therapy and the risk of cancer stem cell emergence. Stem Cell Invest. 2017;4(7):67.\nArticle\nGoogle Scholar\nDownload references", "doc_items_refs": ["#/texts/537", "#/texts/538", "#/texts/539", "#/texts/540", "#/texts/541", "#/texts/542"], "page_nos": [], "uuid": "2345b2ef-eb41-41fe-a45d-266601ed184d"}
{"doc_id": "2025__Stem_cell_therapy_use_in_patients_with_dementia_a_systematic_review__W4410277989", "source_path": "<redacted:source_path>", "chunk_id": 32, "source_chunk_idxs": [45, 46, 47], "num_tokens": 308, "text": "Stem cell therapy use in patients with dementia: a systematic review\nAcknowledgements\nWe would like to thank Oli Health Magazine Organization (OHMO)'s members for their contributions and support for this manuscript.\n\nStem cell therapy use in patients with dementia: a systematic review\nFunding\nWe have not received any financial support for this manuscript.\n\nStem cell therapy use in patients with dementia: a systematic review\nAuthor information\nAuthors and Affiliations\n1. Department of Research and Education, Oli Health Magazine Organization, Kigali, Rwanda Olivier Uwishema, Malak Ghezzawi &amp; Magda Wojtara\n2. American University of Beirut, Beirut, Lebanon Malak Ghezzawi\n3. University of California, Los Angeles David Geffen School of Medicine, Los Angeles, USA Magda Wojtara\n4. Neurosurgery Division, Faculty of Health Sciences, University of Bamenda, Bambili, Cameroon Ignatius N Esene\n5. James Cook University Central Queensland Centre for Rural and Remote Health, Emerald, QLD, Australia Kehinde Obamiro\nAuthors\n1. Olivier Uwishema\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n2. Malak Ghezzawi\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n3. Magda Wojtara\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n4. Ignatius N Esene\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n5. Kehinde Obamiro\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/544", "#/texts/546", "#/texts/549", "#/texts/550", "#/texts/551", "#/texts/552", "#/texts/553", "#/texts/554", "#/texts/555", "#/texts/556", "#/texts/557", "#/texts/558", "#/texts/559"], "page_nos": [], "uuid": "6d6ac3a9-74ef-4847-b1c5-26bb2da64ed2"}
{"doc_id": "2025__Stem_cell_therapy_use_in_patients_with_dementia_a_systematic_review__W4410277989", "source_path": "<redacted:source_path>", "chunk_id": 33, "source_chunk_idxs": [48, 49, 50, 51], "num_tokens": 274, "text": "Stem cell therapy use in patients with dementia: a systematic review\nAuthor information\nContributions\nO.U: Supervising the draft, Conceptualization, Literature selection/rating, Reviewing and Editing, and Project Administration. M.G: Writing the first draft, Literature selection/rating, and Revising. K.O: Writing the first draft, Literature selection/rating, and Revising.Data collection and Assembly: O.U, M.G, M.W, I.N.E, K.OM.W: Reviewed and edited the first draftI.N.E: Reviewed and edited the second draftO.U: Reviewed and edited the second draftK.O: Reviewed and edited the third draftO.U: Reviewed and edited the final draftManuscript writing: O.U, M. G, M.W, I.N.E, K.O Final approval of manuscript: All authors (O.U, M. G, M.W, I.N.E, K.O ).\n\nStem cell therapy use in patients with dementia: a systematic review\nAuthor information\nCorresponding author\nCorrespondence to\nOlivier Uwishema\n.\n\nStem cell therapy use in patients with dementia: a systematic review\nEthics declarations\nEthics Approval\nNot Applicable.\n\nStem cell therapy use in patients with dementia: a systematic review\nEthics declarations\nConsent for publication\nNot Applicable.", "doc_items_refs": ["#/texts/561", "#/texts/563", "#/texts/564", "#/texts/565", "#/texts/568", "#/texts/570"], "page_nos": [], "uuid": "13d21442-7b7b-41ba-be8e-d76eeae3f1c5"}
{"doc_id": "2025__Stem_cell_therapy_use_in_patients_with_dementia_a_systematic_review__W4410277989", "source_path": "<redacted:source_path>", "chunk_id": 34, "source_chunk_idxs": [52, 53, 54, 55], "num_tokens": 343, "text": "Stem cell therapy use in patients with dementia: a systematic review\nEthics declarations\nCompeting interests\nThe authors declare no competing interests.\n\nStem cell therapy use in patients with dementia: a systematic review\nEthics declarations\nRegistration on Prospero\nhttps://www.crd.york.ac.uk/PROSPERO/view/CRD42025640270\n.\n\nStem cell therapy use in patients with dementia: a systematic review\nAdditional information\nPublisher's note\nSpringer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations.\n\nStem cell therapy use in patients with dementia: a systematic review\nRights and permissions\nOpen Access\nThis article is licensed under a Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International License, which permits any non-commercial use, sharing, distribution and reproduction in any medium or format, as long as you give appropriate credit to the original author(s) and the source, provide a link to the Creative Commons licence, and indicate if you modified the licensed material. You do not have permission under this licence to share adapted material derived from this article or parts of it. The images or other third party material in this article are included in the article's Creative Commons licence, unless indicated otherwise in a credit line to the material. If material is not included in the article's Creative Commons licence and your intended use is not permitted by statutory regulation or exceeds the permitted use, you will need to obtain permission directly from the copyright holder. To view a copy of this licence, visit\nhttp://creativecommons.org/licenses/by-nc-nd/4.0/\n.\nReprints and permissions", "doc_items_refs": ["#/texts/572", "#/texts/574", "#/texts/575", "#/texts/578", "#/texts/580", "#/texts/581", "#/texts/582", "#/texts/583", "#/texts/584"], "page_nos": [], "uuid": "43cefe6d-c006-416e-82be-0ecec9c00f21"}
{"doc_id": "2025__Stem_cell_therapy_use_in_patients_with_dementia_a_systematic_review__W4410277989", "source_path": "<redacted:source_path>", "chunk_id": 35, "source_chunk_idxs": [56, 57, 58, 59], "num_tokens": 262, "text": "Stem cell therapy use in patients with dementia: a systematic review\nAbout this article\nCite this article\nUwishema, O., Ghezzawi, M., Wojtara, M.\net al.\nStem cell therapy use in patients with dementia: a systematic review.\nInt J Emerg Med\n18\n, 95 (2025). https://doi.org/10.1186/s12245-025-00876-6\nDownload citation\n- Received : 09 January 2025\n- Accepted : 15 March 2025\n- Published : 12 May 2025\n- DOI : https://doi.org/10.1186/s12245-025-00876-6\n\nStem cell therapy use in patients with dementia: a systematic review\nAbout this article\nKeywords\n- Dementia\n- Stem cell therapy\n- Preclinical studies\n- Transgenic animal models\n- Neuroinflammation\n- Amyloid-beta\nDownload PDF\nAdvertisement\n\nStem cell therapy use in patients with dementia: a systematic review\nAbout this article\nKeywords\nInternational Journal of Emergency Medicine\nISSN: 1865-1380\n\nStem cell therapy use in patients with dementia: a systematic review\nAbout this article\nKeywords\nContact us\n- General enquiries:\njournalsubmissions@springernature.com", "doc_items_refs": ["#/texts/587", "#/texts/588", "#/texts/589", "#/texts/590", "#/texts/591", "#/texts/592", "#/texts/593", "#/texts/594", "#/texts/595", "#/texts/596", "#/texts/597", "#/texts/599", "#/texts/600", "#/texts/601", "#/texts/602", "#/texts/603", "#/texts/604", "#/texts/605", "#/texts/606", "#/texts/608", "#/texts/610"], "page_nos": [], "uuid": "551f7658-7461-415f-a1d0-0aec33d54fc8"}
