{"doc_id": "2025__Speech-language_therapy_and_occupational_therapy_for_patients_with_mild_cognitiv__W4412956792", "source_path": "<redacted:source_path>", "chunk_id": 0, "source_chunk_idxs": [0, 1, 2], "num_tokens": 387, "text": "Speech-language therapy and occupational therapy for patients with mild cognitive impairment and dementia: a retrospective cohort study using German health claims data | BMC Health Services Research | Full Text\nSkip to main content\nAdvertisement\nSearch\n- Explore journals\n- Get published\n- About BMC\n- My account\nSearch all BMC articles\nSearch\nBMC Health Services Research\n- Home\n- About\n- Articles\n- Submission Guidelines\n- Collections\n- Join the Board\n- Submit manuscript\nSpeech-language therapy and occupational therapy for patients with mild cognitive impairment and dementia: a retrospective cohort study using German health claims data\nDownload PDF\nDownload PDF\n- Research\n- Open access\n- Published: 05 August 2025\n\nSpeech-language therapy and occupational therapy for patients with mild cognitive impairment and dementia: a retrospective cohort study using German health claims data\n- Fiona Dörr\n1\n,\n- Daniela Holle\n1\n,\n- Bashar Morouj\n2\n,\n- Dominik Obermüller\n2\n,\n- Sascha Sommer\n1\n,\n- Markus Wübbeler\n1\n&amp;\n- ...\n- Kerstin Bilda\n1\nShow authors\nBMC Health Services Research\nvolume 25\n, Article number: 1026 ( 2025 )\nCite this article\n- 827 Accesses\n- Metrics details\n\nSpeech-language therapy and occupational therapy for patients with mild cognitive impairment and dementia: a retrospective cohort study using German health claims data\nAbstract\nBackground\nDementia is a complex, multifactorial syndrome characterised by cognitive decline and impaired daily functioning, representing a major risk factor for long-term care dependency. As the prevalence of dementia will increase due to demographic change, healthcare systems face growing challenges, including timely diagnosis, equitable access to care, and managing the rising demand for health services. Speech-language therapy (SLT) and occupational therapy (OT) can help maintain cognitive function and quality of life, particularly in the early stages of dementia or mild cognitive impairment (MCI). However, their utilisation in Germany remains poorly understood.", "doc_items_refs": ["#/texts/1", "#/texts/2", "#/texts/3", "#/texts/4", "#/texts/5", "#/texts/6", "#/texts/7", "#/texts/8", "#/texts/9", "#/texts/10", "#/texts/11", "#/texts/12", "#/texts/13", "#/texts/14", "#/texts/15", "#/texts/16", "#/texts/17", "#/texts/18", "#/texts/19", "#/texts/20", "#/texts/21", "#/texts/22", "#/texts/23", "#/texts/25", "#/texts/26", "#/texts/27", "#/texts/28", "#/texts/29", "#/texts/30", "#/texts/31", "#/texts/32", "#/texts/33", "#/texts/34", "#/texts/35", "#/texts/36", "#/texts/37", "#/texts/38", "#/texts/39", "#/texts/42"], "page_nos": [], "uuid": "d1644516-7584-4d0c-9795-8af0c8c657d2"}
{"doc_id": "2025__Speech-language_therapy_and_occupational_therapy_for_patients_with_mild_cognitiv__W4412956792", "source_path": "<redacted:source_path>", "chunk_id": 1, "source_chunk_idxs": [3, 4, 5], "num_tokens": 442, "text": "Speech-language therapy and occupational therapy for patients with mild cognitive impairment and dementia: a retrospective cohort study using German health claims data\nAbstract\nObjective\nThis study evaluates the utilisation and prescription patterns of SLT and OT among people with dementia or MCI and explores factors associated with therapy use, based on German claims data.\n\nSpeech-language therapy and occupational therapy for patients with mild cognitive impairment and dementia: a retrospective cohort study using German health claims data\nAbstract\nMethods\nA retrospective cohort study was conducted using routinely collected data from the research database of the Institute for Applied Health Research Berlin (InGef), including anonymised health records of 5 million individuals in Germany. The dataset covered the period from 2017 to 2022. Incident cases of dementia or MCI were tracked for two years following diagnosis to assess therapy use and prescription patterns. Different facets associated with therapy use were analysed using multivariable logistic regression.\n\nSpeech-language therapy and occupational therapy for patients with mild cognitive impairment and dementia: a retrospective cohort study using German health claims data\nAbstract\nResults\nA total of 63,496 individuals (58% female, 42% male) were included (81.8% with dementia, 18.2% with MCI). Of these, 4.2% received SLT and 10.3% received OT (at least one prescription within the two-year follow-up period).\nMale sex (Odds Ratio [OR] 1.24, 95% confidence interval [CI] 1.09-1.40) and certain dementia types were significantly associated with higher odds of receiving SLT compared to individuals with Alzheimer's disease (AD): dementia classified elsewhere (OR 3.34, 95% CI 2.46-4.53), vascular dementia (OR 1.71, 95% CI: 1.36-2.15), and MCI (OR 1.61, 95% CI: 1.28-2.03). In contrast, these dementia types were associated with lower odds of receiving OT. Older age was negatively associated with SLT use, whereas no consistent age-related pattern was observed for OT utilisation.", "doc_items_refs": ["#/texts/44", "#/texts/46", "#/texts/48", "#/texts/49"], "page_nos": [], "uuid": "0bdcd542-9872-4d3d-8b08-fd2e54a113c6"}
{"doc_id": "2025__Speech-language_therapy_and_occupational_therapy_for_patients_with_mild_cognitiv__W4412956792", "source_path": "<redacted:source_path>", "chunk_id": 2, "source_chunk_idxs": [6, 7, 8], "num_tokens": 436, "text": "Speech-language therapy and occupational therapy for patients with mild cognitive impairment and dementia: a retrospective cohort study using German health claims data\nAbstract\nConclusion\nOur findings reveal low utilisation of SLT and OT, highlighting significant gaps in allied health service provision for people with dementia or MCI. These results underscore the need for improved referral pathways and targeted strategies to better integrate allied health professionals into routine dementia care.\n\nSpeech-language therapy and occupational therapy for patients with mild cognitive impairment and dementia: a retrospective cohort study using German health claims data\nAbstract\nTrial registration\nThe study was not registered.\nPeer Review reports\n\nSpeech-language therapy and occupational therapy for patients with mild cognitive impairment and dementia: a retrospective cohort study using German health claims data\nIntroduction\nDementia is one of the leading causes of disability and care dependency among older adults worldwide, currently affecting an estimated 55 million people [\n1\n], including approximately 1.8 million in Germany [\n2\n]. The syndrome is characterised by a progressive decline in cognitive functions and daily living abilities, resulting in impairments in orientation, communication, and episodic memory. In addition to age, modifiable factors such as cardiovascular health, lifestyle behaviours, and psychosocial conditions increase the risk of developing dementia [\n1\n,\n3\n].\nAlzheimer's disease (AD) is the most common form of dementia, accounting for 60-80% of all cases, followed by vascular dementia (5-10%) and less common types such as dementia with Lewy bodies (5%) and frontotemporal dementia (3%) [\n4\n]. Clinically, dementia is staged into three phases (mild, moderate and severe), and is often preceded by mild cognitive impairment (MCI), a multifactorial condition characterised by measurable cognitive decline that does not interfere with independent daily functioning [\n5\n]. In Germany, an estimated 3.7 million people are affected by MCI [\n6\n]. As a major risk syndrome with a threefold increased likelihood of progressing to dementia [\n7\n], MCI represents a critical window for early detection and timely intervention to decelerate or prevent further cognitive decline [\n8\n].", "doc_items_refs": ["#/texts/51", "#/texts/53", "#/texts/54", "#/texts/56", "#/texts/57", "#/texts/58", "#/texts/59", "#/texts/60", "#/texts/61", "#/texts/62", "#/texts/63", "#/texts/64", "#/texts/65", "#/texts/66", "#/texts/67", "#/texts/68", "#/texts/69", "#/texts/70", "#/texts/71", "#/texts/72", "#/texts/73", "#/texts/74", "#/texts/75"], "page_nos": [], "uuid": "756f8313-79f3-4b12-9fb2-4b73e0b5192a"}
{"doc_id": "2025__Speech-language_therapy_and_occupational_therapy_for_patients_with_mild_cognitiv__W4412956792", "source_path": "<redacted:source_path>", "chunk_id": 3, "source_chunk_idxs": [9], "num_tokens": 322, "text": "Speech-language therapy and occupational therapy for patients with mild cognitive impairment and dementia: a retrospective cohort study using German health claims data\nIntroduction\nWhile pharmacological treatments (e.g., rivastigmine, galantamine) offer limited symptomatic relief [\n5\n], newer promising approaches such as lecanemab aim to slow disease progression by targeting neuropathological processes in the early stages of dementia and in individuals with MCI [\n9\n]. Besides, allied health professionals (AHPs), including speech-language therapists (SLTs) and occupational therapists (OTs), provide essential non-pharmacological interventions to support cognitive function, daily living abilities, and quality of life [\n10\n,\n11\n]. These interventions target both cognitive and functional impairment and are delivered in individual or group-based formats. Collectively, they are referred to as cognitive interventions and may also be provided by neuropsychologists, nurses, or social workers [\n5\n]. However, SLTs and OTs are the main providers of reimbursable cognitive therapies in German outpatient care [\n12\n], delivering the majority of services across more than 20,000 therapy practices [\n13\n]. By contrast, only around 200 neuropsychologists currently work in an outpatient capacity [\n14\n]. Nurses and social workers typically provide cognitive interventions as part of in-house care and support services, which are not widely available and cannot be directly prescribed. SLTs and OTs are thus central to the structured and reimbursed provision of cognitive interventions.", "doc_items_refs": ["#/texts/76", "#/texts/77", "#/texts/78", "#/texts/79", "#/texts/80", "#/texts/81", "#/texts/82", "#/texts/83", "#/texts/84", "#/texts/85", "#/texts/86", "#/texts/87", "#/texts/88", "#/texts/89", "#/texts/90", "#/texts/91", "#/texts/92"], "page_nos": [], "uuid": "c16e7118-7941-46f5-b71d-71498bafebef"}
{"doc_id": "2025__Speech-language_therapy_and_occupational_therapy_for_patients_with_mild_cognitiv__W4412956792", "source_path": "<redacted:source_path>", "chunk_id": 4, "source_chunk_idxs": [10], "num_tokens": 443, "text": "Speech-language therapy and occupational therapy for patients with mild cognitive impairment and dementia: a retrospective cohort study using German health claims data\nIntroduction\nCognitive interventions include cognitive stimulation therapy (CST), cognitive training (CT), and cognitive rehabilitation. CST is a group-based program focusing on memory, attention, and communication. CT targets specific cognitive functions through structured exercises, while rehabilitation typically involves environmental modifications and caregiver training [\n5\n]. In recent years, the role of SLTs in cognitive dementia care has received growing attention, as progressive language and communication impairments occur in all neurodegenerative dementia types [\n15\n,\n16\n] and are often under-recognised [\n15\n]. Symptoms such as word-finding difficulties or problems following complex conversations are among the earliest symptoms of MCI and early-stage AD [\n15\n,\n17\n]. While often overlooked in typical dementia subtypes [\n15\n], language impairments are the core diagnostic criterion in rarer forms such as primary progressive aphasia (PPA) [\n5\n]. Overall, communication impairments are considered one of the most significant unmet needs in people with dementia (PWD) [\n15\n]. SLT specifically addresses language as a cognitive function and supports communicative participation. SLT interventions may include cognitive training like word-retrieval exercises or naming therapy, and caregiver-based communication strategies [\n18\n]. These interventions are individually tailored in close consultation with patients, families, and interdisciplinary teams [\n19\n]. In addition, SLTs provide dysphagia therapy, which becomes relevant in up to 85% of individuals in later stages of dementia [\n20\n,\n21\n].\nOT typically addresses broader cognitive functioning and daily-life performance, as well as neuropsychiatric symptoms and care partner support in PWD/MCI [\n22\n]. Depression commonly occurs in association with MCI and dementia, and behavioural and psychological symptoms of dementia are frequent across the disease continuum [\n5\n]. Various approaches are used, including CST, reminiscence therapy (e.g. biographical memory work), and neuropsychological memory training techniques such as spaced retrieval or errorless learning [\n23\n].", "doc_items_refs": ["#/texts/93", "#/texts/94", "#/texts/95", "#/texts/96", "#/texts/97", "#/texts/98", "#/texts/99", "#/texts/100", "#/texts/101", "#/texts/102", "#/texts/103", "#/texts/104", "#/texts/105", "#/texts/106", "#/texts/107", "#/texts/108", "#/texts/109", "#/texts/110", "#/texts/111", "#/texts/112", "#/texts/113", "#/texts/114", "#/texts/115", "#/texts/116", "#/texts/117", "#/texts/118", "#/texts/119", "#/texts/120", "#/texts/121", "#/texts/122", "#/texts/123", "#/texts/124", "#/texts/125", "#/texts/126"], "page_nos": [], "uuid": "72688ff2-c195-496b-9ab2-949d72f3765c"}
{"doc_id": "2025__Speech-language_therapy_and_occupational_therapy_for_patients_with_mild_cognitiv__W4412956792", "source_path": "<redacted:source_path>", "chunk_id": 5, "source_chunk_idxs": [11], "num_tokens": 422, "text": "Speech-language therapy and occupational therapy for patients with mild cognitive impairment and dementia: a retrospective cohort study using German health claims data\nIntroduction\nMeta-analyses indicate that cognitive interventions may slow cognitive decline [\n8\n,\n24\n] and reduce depressive symptoms in individuals with MCI [\n25\n]. Evidence from controlled trials suggests positive effects on cognition, communication and quality of life in people with mild to moderate dementia [\n18\n,\n26\n,\n27\n,\n28\n,\n29\n], and potential benefits for communicative participation and quality of life have also been reported in moderate to severe stages [\n18\n]. CST is among the most extensively studied approaches and is considered cost-effective compared to standard care [\n30\n]. SLT-based partner-communication training has been shown to reduce caregiver burden [\n31\n,\n32\n], which is a major factor contributing to the institutionalisation of PWD [\n10\n].\nDespite this growing body of evidence, little is known about the real-world implementation of SLT and OT in dementia care. Although current guidelines recommend cognitive interventions, particularly in early stages [\n5\n], few studies have investigated how SLT and OT are used in practice. Available studies are based on small and incomplete samples [\n33\n,\n34\n,\n35\n] and do not differentiate between treatment indications. As a result, it remains unclear whether the treatments were prescribed primarily to address dementia-related cognitive impairment or other comorbidities, such as dysphagia [\n33\n,\n34\n,\n35\n]. Given the increasing complexity of dementia care, it is essential to use all available resources effectively, particularly in order to prevent the transition from MCI to dementia and to slow disease progression where possible. Real-world care data offer an opportunity to address this evidence gap by providing insights into actual service use, prescription patterns, and influencing factors [\n36\n].\nThis study therefore aims to:\n1. I. describe the use of SLT and OT by PWD/MCI in Germany within the first two years after diagnosis and\n2. II. examine socio-demographic and clinical factors associated with the use of SLT and OT.", "doc_items_refs": ["#/texts/127", "#/texts/128", "#/texts/129", "#/texts/130", "#/texts/131", "#/texts/132", "#/texts/133", "#/texts/134", "#/texts/135", "#/texts/136", "#/texts/137", "#/texts/138", "#/texts/139", "#/texts/140", "#/texts/141", "#/texts/142", "#/texts/143", "#/texts/144", "#/texts/145", "#/texts/146", "#/texts/147", "#/texts/148", "#/texts/149", "#/texts/150", "#/texts/151", "#/texts/152", "#/texts/153", "#/texts/154", "#/texts/155", "#/texts/156", "#/texts/157", "#/texts/158", "#/texts/159", "#/texts/160", "#/texts/161", "#/texts/162", "#/texts/163", "#/texts/164", "#/texts/165", "#/texts/166", "#/texts/167", "#/texts/168", "#/texts/169", "#/texts/170", "#/texts/171", "#/texts/172", "#/texts/173"], "page_nos": [], "uuid": "fd348bbc-d411-45d0-833a-65d296148017"}
{"doc_id": "2025__Speech-language_therapy_and_occupational_therapy_for_patients_with_mild_cognitiv__W4412956792", "source_path": "<redacted:source_path>", "chunk_id": 6, "source_chunk_idxs": [12], "num_tokens": 201, "text": "Speech-language therapy and occupational therapy for patients with mild cognitive impairment and dementia: a retrospective cohort study using German health claims data\nMethods\nStudy Design\nThis study was a retrospective longitudinal study using routinely collected claims-based data administrated by the Institute of Applied Health Research Berlin (InGef) research database. The dataset covered the period from 1 January 2017 to 31 December 2022. To examine the use of SLT and OT, all incident cases with an initial diagnosis of dementia or MCI between 1 January 2017 and 31 December 2020 (inclusion period) were identified and followed for an individual observation period of two years from the date of diagnosis. The study was descriptive; thus, no hypotheses were pre-specified. It was designed, conducted, and analysed in accordance with guidelines and recommendations for good practice in secondary data analysis [\n37\n]. Reporting followed the RECORD statement for observational studies using routinely collected health data [\n38\n] (see Supplementary Material, Table\nS1\n).", "doc_items_refs": ["#/texts/176", "#/texts/177", "#/texts/178", "#/texts/179", "#/texts/180", "#/texts/181", "#/texts/182"], "page_nos": [], "uuid": "88d7e377-fbb4-460b-98ef-44a0605e7588"}
{"doc_id": "2025__Speech-language_therapy_and_occupational_therapy_for_patients_with_mild_cognitiv__W4412956792", "source_path": "<redacted:source_path>", "chunk_id": 7, "source_chunk_idxs": [13], "num_tokens": 324, "text": "Speech-language therapy and occupational therapy for patients with mild cognitive impairment and dementia: a retrospective cohort study using German health claims data\nMethods\nData Source\nThe InGef database [\n39\n] is an anonymised health claims database containing longitudinal data on approximately 9 million individuals in Germany. These individuals are insured with one of over 60 statutory health insurance (SHI) funds, primarily company or guild-based insurance funds. Claims data can be traced back over a period of six years. For this analysis, an age- and sex representative sample of approximately 5 million individuals from 2017 to 2022 was selected. The database included socio-demographic data such as age, sex and region of residence, as well as diagnoses from outpatient and inpatient sectors. It also contained information on healthcare services and procedures, reimbursed non-pharmacological therapies, medical aids, and pharmaceuticals. Each diagnosis or treatment included information on the profession of the treating physician. Diagnoses were coded according to the German Modification of the international Classification of Diseases 10th Revision (ICD-10-GM). Non-pharmacological therapies were documented by corresponding therapeutic appliance item numbers according to the specifications of the German Catalogue of Therapeutic Appliances. All patient-level data were de-identified in compliance with German Data Protection Regulation (§ 67 Abs. 2 SGB X i.V.m. Art. 4 Nr. 1 DSGVO), and the use of the database for health services research was fully compliant with German federal law. Subsequently, ethical approval was not required for this study.", "doc_items_refs": ["#/texts/184", "#/texts/185", "#/texts/186"], "page_nos": [], "uuid": "211af030-bbf9-47b4-b81d-4c1614318e99"}
{"doc_id": "2025__Speech-language_therapy_and_occupational_therapy_for_patients_with_mild_cognitiv__W4412956792", "source_path": "<redacted:source_path>", "chunk_id": 8, "source_chunk_idxs": [14], "num_tokens": 447, "text": "Speech-language therapy and occupational therapy for patients with mild cognitive impairment and dementia: a retrospective cohort study using German health claims data\nMethods\nPopulation\nAdult patients aged 18 years and older were included in the study population if they were continuously insured with one of the SHI organisations included in the InGef database during the observation period or until death. This criterion ensured the availability of complete claims data, independent of healthcare utilisation frequency. Analyses of patient characteristics and therapy utilisation were conducted in the subpopulation with a newly confirmed diagnosis of dementia or MCI. Only psychiatric diagnoses from Chapter V of the ICD-10-GM indicating clinically manifest dementia or MCI were considered: F00.-* (Dementia in AD), F01.-* (vascular dementia), F02.-* (dementia in other diseases classified elsewhere), F03 (unspecified dementia), and F06.7 (MCI). The code F02 refers to dementia as a consequence of other diseases classified elsewhere in the ICD-10-GM system, such as Parkinson's disease or Pick's disease. The code unspecified dementia is used when clinical criteria for dementia are met, but no specific etiology can yet be established, unlike F00-F02, which reflect defined underlying causes.\nDiagnoses had to be documented either in outpatient care or as a main or secondary hospital discharge diagnosis. An outpatient diagnosis was considered confirmed if it was documented in two separate quarters in the index year (year of the initial diagnosis) or by two different physicians in the same quarter. To determine the incidence, a disease-free period of one year prior to the initial diagnosis was required. Incident cases from 2017 onwards were identified by using 2016 as a validation period. Patients firstly diagnosed with MCI or any form of dementia between 1 January 2017 and 31 December 2020 who could be followed for two years or until death were included (patient-individual period). An incident case entered the study population at the beginning of the quarter in which the dementia/MCI diagnosis was first documented. Study exit was defined as the end of the observation period or death. There were no exclusion criteria.", "doc_items_refs": ["#/texts/188", "#/texts/189"], "page_nos": [], "uuid": "5ba8acaa-d0db-459b-bb25-214218062c4a"}
{"doc_id": "2025__Speech-language_therapy_and_occupational_therapy_for_patients_with_mild_cognitiv__W4412956792", "source_path": "<redacted:source_path>", "chunk_id": 9, "source_chunk_idxs": [15], "num_tokens": 420, "text": "Speech-language therapy and occupational therapy for patients with mild cognitive impairment and dementia: a retrospective cohort study using German health claims data\nMethods\nMeasures\nThe primary outcome was the use of SLT and OT by PWD/MCI. According to the German Catalogue of Therapeutic Services, these services must be prescribed by physicians to be reimbursed by the health insurers related to different indication codes. These codes also indicate the medical reason for the treatment. However, these codes often cover a wide range of conditions and do not provide information about the exact underlying disease. For this reason, the study linked the ICD diagnosis data to the use of SLT and OT on an individual basis.\nThe first step of the analysis assessed the overall proportion of patients who received SLT or OT, regardless of the indication. The second step examined whether these patients were being specifically treated concerning their diagnosis of dementia/MCI. In the case of SLT, a distinction was made between therapy for cognitive communication impairments (indication code: SP5) and therapy for dysphagia (indication code: SC), as these are dementia-related interventions. As both indications can be prescribed for different neurological conditions, physicians have the option to voluntarily document up to four ICD codes relevant to treatment on the prescription. These were also checked to see if a dementia/MCI diagnosis was recorded (dementia-specification of the prescription). OT already has a dementia-specific code (PS5 until 12/2020, PS4 since 1/2021) that allowed billing for cognitive training or psycho-functional treatment [\n12\n]. In the following, we refer to OT prescriptions using this code as \"dementia- specific OT\". Different services may be ordered per prescription (e.g. 30 min of individual SLT or OT cognitive training). SLT prescriptions typically cover 10-20 therapy sessions, and OT prescription 10 sessions. A home visit could be added to any prescription. Group therapy was available for both SLT, focusing on communication, and for OT, focusing on dementia- specific interventions [\n12", "doc_items_refs": ["#/texts/191", "#/texts/192", "#/texts/193", "#/texts/194", "#/texts/195"], "page_nos": [], "uuid": "01281bd8-ff95-4e4f-ae12-f8819877216a"}
{"doc_id": "2025__Speech-language_therapy_and_occupational_therapy_for_patients_with_mild_cognitiv__W4412956792", "source_path": "<redacted:source_path>", "chunk_id": 10, "source_chunk_idxs": [16], "num_tokens": 257, "text": "Speech-language therapy and occupational therapy for patients with mild cognitive impairment and dementia: a retrospective cohort study using German health claims data\nMethods\nMeasures\n]. Definitions and codes of all variables used are provided in the Supplementary Material (Table S2). Patients who received at least one prescription during the follow-up period were considered to be patients who received treatment. Additionally, the number of prescriptions per patient and the number of therapy sessions billed were quantified. For each prescription, the professional subject of the prescribing physician was identified. The regularity of therapy provision was also assessed. Regular care was defined as having at least one prescription in at least three of the eight quarters of follow-up. With regard to socio-demographic factors, age and sex were examined. Age was calculated in the quarter of the initial diagnosis and patients were grouped into age categories ranging from: 18-64, 65-69, 70-74, 75-79, 80-84, 85-89, ≥ 90 years. Clinical variables included the type of dementia and the clinical discipline of the prescribing physician. If multiple diagnoses were recorded in the index quarter, the first-listed diagnosis was used. All experts relevant for the treatment of dementia/MCI were included.", "doc_items_refs": ["#/texts/196"], "page_nos": [], "uuid": "5e5dbbf8-2d1c-45fe-a04d-6e45cd1b9af9"}
{"doc_id": "2025__Speech-language_therapy_and_occupational_therapy_for_patients_with_mild_cognitiv__W4412956792", "source_path": "<redacted:source_path>", "chunk_id": 11, "source_chunk_idxs": [17], "num_tokens": 332, "text": "Speech-language therapy and occupational therapy for patients with mild cognitive impairment and dementia: a retrospective cohort study using German health claims data\nMethods\nAnalysis\nTo assess the utilisation of SLT and OT during the two-year patient-specific follow-up, absolute and relative frequencies of therapy use were calculated for each included indication. The number of prescriptions and billed therapy sessions were summarised using the mean, median, and interquartile range (IQR).\nTo examine associations between patient characteristics and therapy utilisation, multivariate logistic regression models were applied separately for each therapy indication (SLT: communication impairment, SLT: dysphagia, OT). The dependent variable in each model was binary, indicating whether the patient received at least one prescription for the respective therapy during the follow-up period (yes/no). Predictor variables included age (categorised as: 18-64, 65-69, 70-74, 75-79, 80-84, 85-89, and ≥ 90 years), sex (male/female), and dementia diagnosis (AD, vascular dementia, dementia classified elsewhere, unspecified dementia, and MCI). The regression models were calculated using a 95% confidence level (α = 0.05). Results are reported as odds ratios (ORs) with corresponding 95% confidence intervals (CI) and p-values. All analyses were exploratory and performed by InGef staff using the statistical software R [\n40\n], version 4.0.2 (available at:\nhttps://www.r-project.org/\n).", "doc_items_refs": ["#/texts/198", "#/texts/199", "#/texts/200", "#/texts/201", "#/texts/202", "#/texts/203"], "page_nos": [], "uuid": "195dc0d7-f38f-49ae-9220-c6717efcae3b"}
{"doc_id": "2025__Speech-language_therapy_and_occupational_therapy_for_patients_with_mild_cognitiv__W4412956792", "source_path": "<redacted:source_path>", "chunk_id": 12, "source_chunk_idxs": [18, 19], "num_tokens": 273, "text": "Speech-language therapy and occupational therapy for patients with mild cognitive impairment and dementia: a retrospective cohort study using German health claims data\nResults\nPopulation size\nOut of the sample of 5 million insured persons in the InGef database, 3,672,464 were aged 18 years or older and continuously insured in the period 2017-2022 or until death. Fig.\n1\nshows the data flow.\nFig. 1\n\nSpeech-language therapy and occupational therapy for patients with mild cognitive impairment and dementia: a retrospective cohort study using German health claims data\nResults\nStudy population\nA total of 63,496 individuals were included in the study cohort, including 51,941 PWD (81.8%) and 11,555 persons with MCI (18.2%). During individual follow-up, 18,018 participants (28.4%) died. The median age at first diagnosis was 82 years (IQR: [10]) for PWD and 76 years (IQR: [14]) for those with MCI. The majority of patients were female (58.0%). Most PWD were diagnosed with unspecified dementia (45.4%), followed by vascular dementia (17.9%) and AD (15.5%). Table\n1\nsummarises the descriptive characteristics of the study population.", "doc_items_refs": ["#/texts/206", "#/texts/207", "#/texts/208", "#/texts/209", "#/texts/211", "#/texts/212", "#/texts/213"], "page_nos": [], "uuid": "0fcda2e4-1003-4d55-abbc-434e9a02b4a0"}
{"doc_id": "2025__Speech-language_therapy_and_occupational_therapy_for_patients_with_mild_cognitiv__W4412956792", "source_path": "<redacted:source_path>", "chunk_id": 13, "source_chunk_idxs": [20], "num_tokens": 320, "text": "Speech-language therapy and occupational therapy for patients with mild cognitive impairment and dementia: a retrospective cohort study using German health claims data\nResults\nUtilisation of SLT and OT\nOverall, 4.2% (\nn\n= 2,661) of the study population received SLT, while 10.3% (\nn\n= 6,525) received OT, indicating that OT was prescribed more than twice as often as SLT. A total of 1.8% (\nn\n= 1,141) received both therapies. In sum, 12.7% (\nn\n= 8,045) received at least one of these servicesAmong those receiving OT (\nn\n= 6,525), only 42.8% were treated specifically for dementia (\nn\n= 2,795). The remaining PWD/MCI underwent therapy for other indications, e.g. spinal or central nervous system disorders.\nRegarding SLT, 76.2% (\nn\n= 2,028) of all patients who received therapy (\nn\n= 2661) were treated for dementia-related reasons. These were proportionally distributed between the two primary indications: 38.6% for SLT communication and 37.6% for SLT dysphagia disorders (see Table\n1\n). The remaining patients who received SLT were treated for unrelated indications, most commonly motor speech or voice disorders.\nAs shown in Fig.\n2\n, the proportion of individuals with MCI among those receiving SLT or OT ranged between 14.3% and 22.6%, depending on the indication.\nFig. 2", "doc_items_refs": ["#/texts/215", "#/texts/216", "#/texts/217", "#/texts/218", "#/texts/219", "#/texts/220", "#/texts/221", "#/texts/222", "#/texts/223", "#/texts/224", "#/texts/225", "#/texts/226", "#/texts/227", "#/texts/228", "#/texts/229", "#/texts/230", "#/texts/231", "#/texts/232", "#/texts/233", "#/texts/234", "#/texts/235", "#/texts/236", "#/texts/237", "#/texts/238"], "page_nos": [], "uuid": "274cb9f0-d3c9-499a-90b7-2598585e2d40"}
{"doc_id": "2025__Speech-language_therapy_and_occupational_therapy_for_patients_with_mild_cognitiv__W4412956792", "source_path": "<redacted:source_path>", "chunk_id": 14, "source_chunk_idxs": [21], "num_tokens": 424, "text": "Speech-language therapy and occupational therapy for patients with mild cognitive impairment and dementia: a retrospective cohort study using German health claims data\nResults\nPrescribing patterns\nDuring the two-year observation period, patients who received dementia-related SLT had a median of three prescriptions for communication therapy (IQR: [4]) and two prescriptions for dysphagia therapy (IQR: [3]). An explicit reference to a dementia or MCI diagnosis was documented on only a small proportion of these prescriptions (8.2% communication prescriptions, 2.4% dysphagia prescriptions).\nFor dementia-specific OT, the median number of prescriptions was two (IQR: [4]). Approximately half of the patients received therapy on a regular basis (SLT for communication: 55.3%, dementia-specific OT: 45.2%).\nIn SLT, substantial discrepancies were observed between the mean and median numbers of prescriptions and reimbursed therapy sessions, which may be due to extreme outliers.\nThe majority of SLT for communication impairment (85.6%) and dysphagia (92.3%) was documented as home-based therapy sessions. A high proportion of OT prescriptions for dementia also included home visits (50.9%). Further details are presented in Table\n2\n.\nMost patients with SLT for communication impairments received a prescription for 45 min therapy (77.8% of all prescriptions issued), followed by 30 min (15.3%). Group therapy was rarely prescribed (0.7%). A similar pattern was observed in dysphagia therapy, where 45 min-sessions were most commonly prescribed (69.8%), followed by 30-minute sessions (23.4%).\nIn dementia-specific OT, cognitive training was the most frequently prescribed intervention (55.7%), closely followed by psycho-functional treatment (42.3%). Group therapy accounted for only 1.9% of all prescribed services.", "doc_items_refs": ["#/texts/240", "#/texts/241", "#/texts/242", "#/texts/243", "#/texts/244", "#/texts/245", "#/texts/246", "#/texts/247"], "page_nos": [], "uuid": "09273b98-b908-4eae-af61-bf0897c36985"}
{"doc_id": "2025__Speech-language_therapy_and_occupational_therapy_for_patients_with_mild_cognitiv__W4412956792", "source_path": "<redacted:source_path>", "chunk_id": 15, "source_chunk_idxs": [22], "num_tokens": 164, "text": "Speech-language therapy and occupational therapy for patients with mild cognitive impairment and dementia: a retrospective cohort study using German health claims data\nResults\nPrescribing patterns\nNeurologists accounted for the largest proportion of SLT prescriptions for communication impairments (34.6%) and dementia-specific OT prescriptions (44.2%), followed by general practitioners (SLT: 33.2%, OT: 20.8%) and internists with a specialisation in geriatric care (SLT: 19.1%, OT: 10.2%). In contrast, dysphagia therapy was most frequently prescribed by general practitioners (40.5%), followed by neurologists (22.0%) and geriatric internists (21.0%).", "doc_items_refs": ["#/texts/248"], "page_nos": [], "uuid": "95f99a33-6da8-4c92-85de-5a0d6db83aaf"}
{"doc_id": "2025__Speech-language_therapy_and_occupational_therapy_for_patients_with_mild_cognitiv__W4412956792", "source_path": "<redacted:source_path>", "chunk_id": 16, "source_chunk_idxs": [23], "num_tokens": 382, "text": "Speech-language therapy and occupational therapy for patients with mild cognitive impairment and dementia: a retrospective cohort study using German health claims data\nResults\nAssociation of socio-demographic and clinical factors with the utilisation of SLT and OT services\nMultivariate logistic regression models were conducted separately for each indication to examine factors associated with the use of SLT (for communication impairment and dysphagia) and dementia-specific OT.\nFor SLT, both sex and type of dementia were significant predictors. Men were more likely than women to receive SLT for both communication (OR1.24, 95% CI 1.09-1.40) and dysphagia (OR 1.53, 95% CI 1.35-1.73). Regarding dementia type, individuals diagnosed with dementia classified elsewhere had substantially higher odds of receiving SLT- more than three times higher for communication therapy (OR 3.34, 95% CI 2.46-4.53) and over four times higher for dysphagia therapy (OR 4.12, 95% CI 3.04-5.55) compared to patients with AD. Vascular dementia was also significantly associated with higher SLT use (communication: OR 1.71, 95% CI 1.36-2.15; dysphagia: OR 1.86, 95% CI 1.47-2.36). MCI was associated with higher SLT use only for communication (OR 1.61, 95% CI 1.28-2.03), but not for dysphagia. This indicated that certain dementia types were significantly more likely to receive SLT compared to AD.\nAge showed a consistent negative association: compared with those aged 18-64, all older groups had progressively lower odds of receiving SLT. Detailed trends are shown in Figures\nS1\nand\nS2\n(Supplementary Material).", "doc_items_refs": ["#/texts/250", "#/texts/251", "#/texts/252", "#/texts/253", "#/texts/254", "#/texts/255", "#/texts/256"], "page_nos": [], "uuid": "41e85f85-560e-4f57-a38c-c3d8455643a0"}
{"doc_id": "2025__Speech-language_therapy_and_occupational_therapy_for_patients_with_mild_cognitiv__W4412956792", "source_path": "<redacted:source_path>", "chunk_id": 17, "source_chunk_idxs": [24, 25], "num_tokens": 499, "text": "Speech-language therapy and occupational therapy for patients with mild cognitive impairment and dementia: a retrospective cohort study using German health claims data\nResults\nAssociation of socio-demographic and clinical factors with the utilisation of SLT and OT services\nIn contrast, the use of OT followed a different pattern. Higher odds were observed in the 65-69 (OR 1.46, 95% CI 1.18-1.81) and 75-79 (OR 1.34, 95% CI 1.14-1.60) age groups, but there was no consistent trend across age groups. In particular, people aged ≥ 85 years were less likely to receive OT than younger groups. In contrast to SLT, there were no significant sex differences in OT use. Dementia type again played a role: vascular dementia (OR 0.39, 95% CI 0.34-0.44), dementia classified elsewhere (OR 0.26, 95% CI 0.18-0.35), unspecified dementia and MCI were all associated with significantly lower odds of OT use compared to AD. Complete model results are presented in Table\n3\n.\n\nSpeech-language therapy and occupational therapy for patients with mild cognitive impairment and dementia: a retrospective cohort study using German health claims data\nDiscussion\nSummary of findings\nThis study analysed the utilisation and prescription patterns of SLT and OT in PWD/MCI in Germany, using data from the InGef database (\nn\n= 63,496). Within two years of diagnosis, only 1.6% of patients received SLT for communication impairments, and 4.4% received dementia- specific OT, indicating an overall low uptake of cognitive interventions for dementia- and MCI-related symptoms. Approximately half of the patients received therapy on a regular basis (SLT: 55.3%, OT: 45.2%), and services were mainly provided in home-based settings (SLT: 85.6%, OT: 50.9%).\nMultivariable logistic regression showed that male sex and certain dementia types (e.g. vascular dementia and dementia classified elsewhere) were associated with higher SLT use, whereas increasing age was associated with lower utilisation. In contrast, OT use was lower among individuals with non-AD and MCI, and showed no consistent association with age. Overall, the results suggest disparities in therapy access depending on male sex, younger age and type of dementia.", "doc_items_refs": ["#/texts/257", "#/texts/258", "#/texts/259", "#/texts/262", "#/texts/263", "#/texts/264", "#/texts/265"], "page_nos": [], "uuid": "3e828681-5f1f-4f77-ad63-2458ce4ff871"}
{"doc_id": "2025__Speech-language_therapy_and_occupational_therapy_for_patients_with_mild_cognitiv__W4412956792", "source_path": "<redacted:source_path>", "chunk_id": 18, "source_chunk_idxs": [26], "num_tokens": 461, "text": "Speech-language therapy and occupational therapy for patients with mild cognitive impairment and dementia: a retrospective cohort study using German health claims data\nDiscussion\nDiscussion of findings\nTo our knowledge, this is the first comprehensive study on SLT and OT use among PWD/MCI in Germany, based on a large, representative dataset. Previous research has primarily focused on PWD and relied on survey-based methods, often without indication-specific analyses. For example, Wübbeler et al. [\n34\n] examined the use of physiotherapy and OT by\nn\n= 560 caregivers of PWD in dementia networks throughout Germany. The results showed a comparatively higher use of OT (15.5%), but did not differentiate by indication. Kohler et al. 2014 [\n35\n] reported utilisation rates more comparable to our findings: only 3.1% of study participants (\nn\n= 203 PWD) received OT and 1.9% received SLT. A meta-analysis by Michalowsky et al. [\n33\n] (\nn\n= 103,980) found an average of 6.9 therapy sessions per year for PWD living at home, compared with 10.2 sessions in residential care. In contrast, our study revealed substantially higher therapy volumes: a median of 60 sessions per patient for SLT and 34 for OT within two years of diagnosis. However, the data reported by Michalowsky et al. [\n33\n] are only partially comparable due to differences in the combination of therapy services, calculation methods and time periods analysed [\n33\n].\nIt should be noted that the study period also includes the COVID-19 pandemic and the associated lockdowns in Germany (March-May 2020 and November 2020-May 2021) [\n41\n]. Routine data from Germany's largest statutory health insurer showed that the overall utilisation of SLT and OT decreased in 2020 by 7.5% and 6.2%, respectively, compared to 2019. However, by the end of 2020, utilisation had largely returned to pre-pandemic levels [\n42\n]. Given this relatively short disruption and the two-year observation period per individual, the pandemic is unlikely to have had a substantial influence on the overall findings.", "doc_items_refs": ["#/texts/267", "#/texts/268", "#/texts/269", "#/texts/270", "#/texts/271", "#/texts/272", "#/texts/273", "#/texts/274", "#/texts/275", "#/texts/276", "#/texts/277", "#/texts/278", "#/texts/279", "#/texts/280", "#/texts/281", "#/texts/282", "#/texts/283", "#/texts/284", "#/texts/285", "#/texts/286", "#/texts/287", "#/texts/288"], "page_nos": [], "uuid": "0d565393-486c-492f-b82e-ead4f5409751"}
{"doc_id": "2025__Speech-language_therapy_and_occupational_therapy_for_patients_with_mild_cognitiv__W4412956792", "source_path": "<redacted:source_path>", "chunk_id": 19, "source_chunk_idxs": [27], "num_tokens": 419, "text": "Speech-language therapy and occupational therapy for patients with mild cognitive impairment and dementia: a retrospective cohort study using German health claims data\nDiscussion\nDiscussion of findings\nIn addition to external factors such as the pandemic, therapy utilisation must also be viewed in the clinical context of disease progression in dementia. This perspective is lacking in the cited studies. According to observational studies, the average disease duration from diagnosis to death is 4.3-5.1 years (IQR: 2.3-8.0) [\n43\n]. In clinical practice, continuous therapy over the entire course of the disease is rarely implemented, as the intensity of treatment is typically prioritised during phases of higher expected benefit [\n44\n]. For this reason, our study focused on the first two years following diagnosis. It should be noted, however, that the coding of a formal diagnosis does not necessarily reflect the actual onset of dementia. Dementia is often diagnosed at an advanced stage. According to a survey of\nn\n= 276 PWD in Germany, the median time between first symptoms and formal diagnosis was 16 months [\n45\n]. With that in mind, the diagnosis of MCI represents a timely opportunity for early intervention and monitoring to achieve a delay in disease progression [\n46\n].\nIn our study, one in five patients who received cognitive interventions from an SLT and one in seven patients who received cognitive interventions from an OT had a diagnosis of MCI. This indicates that the treatment of individuals with MCI is already part of current clinical practice. However, this level of care provision should be further developed and standardised to ensure earlier and more consistent support for this patient group. The majority of people with MCI in our sample received SLT for communication impairments, and logistic regression confirmed a positive association between MCI and SLT utilisation. This is particularly notable, as language and communication disorders are strong predictors of the progression from MCI to dementia [\n17\n]. SLTs can therefore play a special role in dementia care, taking on important tasks such as monitoring and early detection [\n46\n].", "doc_items_refs": ["#/texts/289", "#/texts/290", "#/texts/291", "#/texts/292", "#/texts/293", "#/texts/294", "#/texts/295", "#/texts/296", "#/texts/297", "#/texts/298", "#/texts/299", "#/texts/300", "#/texts/301", "#/texts/302", "#/texts/303", "#/texts/304"], "page_nos": [], "uuid": "09977fc9-816a-4178-a5d4-a0e873a5e8d8"}
{"doc_id": "2025__Speech-language_therapy_and_occupational_therapy_for_patients_with_mild_cognitiv__W4412956792", "source_path": "<redacted:source_path>", "chunk_id": 20, "source_chunk_idxs": [28], "num_tokens": 364, "text": "Speech-language therapy and occupational therapy for patients with mild cognitive impairment and dementia: a retrospective cohort study using German health claims data\nDiscussion\nDiscussion of findings\nOverall, OT was prescribed more frequently than SLT. This aligns with the well-established role of OT in dementia care, which is supported by reimbursement policies and its inclusion in both the German S3 guideline on dementia [\n5\n] and the national dementia strategy [\n47\n]. In contrast, SLT is mentioned less frequently and remains underrepresented in interdisciplinary research and care models [\n26\n]. Nonetheless, the international discourse increasingly recognises the relevance of SLT in dementia care [\n48\n]. Leading professional associations such as the American Speech-Language-Hearing Association (ASHA) [\n19\n] and the Royal College of Speech Therapists (RCSLT) [\n49\n] have published position papers outlining the profession's scope and responsibilities within interdisciplinary dementia care teams. According to ASHA´s annual survey, communication disorders in dementia now represent the second largest treatment group in the adult sector [\n50\n]. This level of visibility and professional recognition has yet to be established in the German context.\nOur findings also indicate that SLTs were only marginally involved in the treatment of dysphagia among PWD. Given that the German S3 guideline explicitly mandates SLT involvement in swallowing therapy [\n5\n], a higher utilisation rate would have been expected. One possible explanation is that dysphagia typically occurs in later stages of dementia and may not have been captured during the two-year follow-up period. Additionally, it is likely that the small number of patients with MCI who received dysphagia therapy were treated for comorbid conditions such as stroke or Parkinson's disease, rather than for dementia-related symptoms.", "doc_items_refs": ["#/texts/305", "#/texts/306", "#/texts/307", "#/texts/308", "#/texts/309", "#/texts/310", "#/texts/311", "#/texts/312", "#/texts/313", "#/texts/314", "#/texts/315", "#/texts/316", "#/texts/317", "#/texts/318", "#/texts/319", "#/texts/320", "#/texts/321", "#/texts/322"], "page_nos": [], "uuid": "1b411028-d170-48f6-b3de-9f10bcdcaaa5"}
{"doc_id": "2025__Speech-language_therapy_and_occupational_therapy_for_patients_with_mild_cognitiv__W4412956792", "source_path": "<redacted:source_path>", "chunk_id": 21, "source_chunk_idxs": [29], "num_tokens": 231, "text": "Speech-language therapy and occupational therapy for patients with mild cognitive impairment and dementia: a retrospective cohort study using German health claims data\nDiscussion\nDiscussion of findings\nIn general, SLT utilisation must be interpreted in the context of the underlying data structure. Unlike OT, it is not possible to reliably determine from the available data whether SLT was prescribed for dementia/MCI or for other comorbid conditions. Since treatment-relevant diagnoses are not required on prescriptions, our findings may overestimate dementia-specific SLT use. This interpretation is further supported by the logistic regression results, which showed significantly higher odds of receiving SLT among patients with vascular dementia and dementia associated with other neurological diseases compared to those with AD. This suggests that SLT was often prescribed to address comorbidities rather than dementia symptoms. Its established use in conditions such as stroke and Parkinson's disease may explain the more frequent application in these dementia subtypes. In contrast, OT was less frequently prescribed for non-AD patients, possibly reflecting its stronger emphasis in clinical research and treatment guidelines for AD compared to other dementia types [\n22\n].", "doc_items_refs": ["#/texts/323", "#/texts/324", "#/texts/325"], "page_nos": [], "uuid": "b3f8064b-0a59-4ed7-98a0-a21b6ed3f3c3"}
{"doc_id": "2025__Speech-language_therapy_and_occupational_therapy_for_patients_with_mild_cognitiv__W4412956792", "source_path": "<redacted:source_path>", "chunk_id": 22, "source_chunk_idxs": [30], "num_tokens": 451, "text": "Speech-language therapy and occupational therapy for patients with mild cognitive impairment and dementia: a retrospective cohort study using German health claims data\nDiscussion\nDiscussion of findings\nIn addition to clinical characteristics, individual health behaviours and attitudes may influence therapy utilisation. These factors can be systematised using Andersen's behavioural model of health services utilisation, which distinguishes between three core components: predisposing characteristics, enabling resources, and individual need. Predisposing factors include demographic and social characteristics [\n51\n]. Our findings point to disparities in predisposing characteristics: Men were significantly more likely to receive SLT. This is particularly noteworthy given that women are not only more frequently affected by dementia, but also assume the majority of informal caregiving responsibilities, providing up to 70% of care hours for PWD [\n1\n]. These findings may reflect sex-based differences in referral patterns or help-seeking behaviour. It is also plausible that women, as primary caregivers, are more actively involved in organising healthcare and therapy services-potentially leading to higher therapy uptake among male patients [\n52\n]. In addition, biological and cognitive factors may contribute to these disparities. Research suggests that women with early-stage AD or MCI tend to outperform men on verbal memory tasks, potentially delaying the recognition of language-related deficits and subsequent referral to SLT [\n53\n]. Similarly, older people were consistently less likely to receive SLT, even though communication and swallowing difficulties typically increase as dementia progresses. In contrast, our findings did not show a consistent age-related trend in OT use, although previous studies suggest that older age and a higher number of comorbidities are associated with increased OT utilisation [\n34\n].\nEnabling or impeding factors refer to individual and structural resources that influence access to care, including educational level, socioeconomic status and physical accessibility [\n51\n]. Among PWD, restricted mobility and the need for support from care partners are well-documented barriers to therapy use [\n10\n]. Notably, our results indicate that both SLT and OT were more frequently provided through home visits, suggesting that increased awareness of this care modality may help to overcome some of these structural barriers.", "doc_items_refs": ["#/texts/326", "#/texts/327", "#/texts/328", "#/texts/329", "#/texts/330", "#/texts/331", "#/texts/332", "#/texts/333", "#/texts/334", "#/texts/335", "#/texts/336", "#/texts/337", "#/texts/338", "#/texts/339", "#/texts/340", "#/texts/341"], "page_nos": [], "uuid": "35dc4be8-670c-4429-9e1c-b2d64678f98a"}
{"doc_id": "2025__Speech-language_therapy_and_occupational_therapy_for_patients_with_mild_cognitiv__W4412956792", "source_path": "<redacted:source_path>", "chunk_id": 23, "source_chunk_idxs": [31], "num_tokens": 402, "text": "Speech-language therapy and occupational therapy for patients with mild cognitive impairment and dementia: a retrospective cohort study using German health claims data\nDiscussion\nDiscussion of findings\nThe third component-individual need-includes perceived and professionally evaluated health needs [\n51\n]. Among PWD/MCI, limited awareness of available services may restrict therapy utilisation [\n10\n]. Moreover, individual-level barriers such as low health literacy, entrenched health behaviours, and psychological factors, including comorbid affective disorders such as depression, can further compromise the perceived relevance and uptake of therapeutic services [\n54\n].\nFinally, Andersen's model also incorporates contextual factors, including those on the provider side [\n51\n]. In Germany, usually PWD/MCI firstly get in touch with general practitioners, as they typically make the initial diagnosis and coordinate referrals to AHP-led service [\n55\n]. Existing research [\n10\n,\n56\n,\n57\n] highlights several practical and attitudinal barriers that contribute to explain the restricted use of these interventions. One commonly assumed explanation is the perception of financial restrictions. While AHP services are generally subject to budgetary limits in Germany, dementia is classified as a special prescription need, which exempts these therapies from standard cost-effectiveness evaluations [\n58\n]. This suggests that formal structural restrictions may not represent the main barrier. Qualitative findings by Wangler et al. (2020) [\n56\n] comprising\nn\n= 41 general practitioners, display additional practice-level barriers, including time and resource constraints, as well as scepticism regarding the benefits of non-pharmacological therapies [\n56\n]. This form of therapeutic nihilism is also reflected in international surveys, with both medical professionals and AHPs expressing concerns about whether PWD can meaningfully engage in or benefit from cognitive interventions [\n10\n,\n57\n]. Such attitudes may contribute to under-diagnosis, low referral rates and missed opportunities for supportive care [\n57\n].", "doc_items_refs": ["#/texts/342", "#/texts/343", "#/texts/344", "#/texts/345", "#/texts/346", "#/texts/347", "#/texts/348", "#/texts/349", "#/texts/350", "#/texts/351", "#/texts/352", "#/texts/353", "#/texts/354", "#/texts/355", "#/texts/356", "#/texts/357", "#/texts/358", "#/texts/359", "#/texts/360", "#/texts/361", "#/texts/362", "#/texts/363", "#/texts/364", "#/texts/365", "#/texts/366", "#/texts/367", "#/texts/368", "#/texts/369", "#/texts/370", "#/texts/371", "#/texts/372", "#/texts/373"], "page_nos": [], "uuid": "bab5d0df-4eca-49ed-a25f-8abb92aa2bdd"}
{"doc_id": "2025__Speech-language_therapy_and_occupational_therapy_for_patients_with_mild_cognitiv__W4412956792", "source_path": "<redacted:source_path>", "chunk_id": 24, "source_chunk_idxs": [32], "num_tokens": 452, "text": "Speech-language therapy and occupational therapy for patients with mild cognitive impairment and dementia: a retrospective cohort study using German health claims data\nDiscussion\nDiscussion of findings\nThese perceptions may stem from a lack of knowledge and training about effective cognitive interventions for dementia-related cognitive decline. Targeted education is needed to address this gap, not only for prescribers but also for AHPs involved in dementia care [\n10\n,\n55\n]. Therapists themselves often report uncertainty, for instance, in setting realistic and measurable therapy goals for PWD/MCI [\n57\n]. This is particularly evident in the area of SLT [\n48\n]. In Germany, dementia-specific interventions are not a standard part of SLT training programmes, whereas OT education typically includes relevant competencies [\n59\n,\n60\n]. This indicates the need for improved education, training programmes and clear guidelines to support therapists in practice. In addition to training, strengthening collaboration between OTs, SLTs, and neuropsychologists within an interdisciplinary cognitive rehabilitation framework is essential. Clearer role delineation, joint diagnostic and therapeutic planning could support more effective teamwork and improve care [\n26\n].\nAnother barrier to therapy access is a general shortage of qualified professionals available to deliver SLT and OT services in Germany [\n61\n]. To address this, more resource-efficient formats should be considered. One promising approach is group therapy, which allows a single therapist to treat several patients simultaneously. Despite its potential, group-based cognitive interventions such as CST remain underutilised in practice. This finding highlights the need for further research into barriers to implementation and the development of strategies to increase uptake. Additional research is also needed to evaluate the optimal duration, intensity, and cost-effectiveness of cognitive interventions for PWD/MCI in real-world care settings. Given that our findings indicate a median of 34-60 sessions per patient over two years, this may serve as a feasible benchmark for routine care. Cognitive interventions that also aim to reduce carer burden - as well as communication or educational training in a group setting - offer further potential [\n62\n]. Finally, it is equally important to ensure that both health professionals and PWD/MCI have access to explicit and comprehensive information about available therapeutic services.", "doc_items_refs": ["#/texts/374", "#/texts/375", "#/texts/376", "#/texts/377", "#/texts/378", "#/texts/379", "#/texts/380", "#/texts/381", "#/texts/382", "#/texts/383", "#/texts/384", "#/texts/385", "#/texts/386", "#/texts/387", "#/texts/388", "#/texts/389", "#/texts/390", "#/texts/391", "#/texts/392", "#/texts/393"], "page_nos": [], "uuid": "0e662fff-d7b6-413b-a58e-02fdde524928"}
{"doc_id": "2025__Speech-language_therapy_and_occupational_therapy_for_patients_with_mild_cognitiv__W4412956792", "source_path": "<redacted:source_path>", "chunk_id": 25, "source_chunk_idxs": [33], "num_tokens": 440, "text": "Speech-language therapy and occupational therapy for patients with mild cognitive impairment and dementia: a retrospective cohort study using German health claims data\nLimitations\nThe study is notable for its large, unselected, nationwide sample, which allows a robust estimate of the use of SLT and OT among PWD/MCI in Germany. Although only a limited number of SHI funds are included in the InGef database, previous analyses of the external validity show a good correspondence between the data set and the German population [\n39\n]. The use of routine data reduces the risk of bias due to non-response, recall or selection bias. Moreover, secondary data allow the inclusion of multimorbid and institutionalised individuals, who are often excluded from primary surveys. These characteristics make routine data particularly valuable for dementia-related health services research [\n63\n].\nNevertheless, the findings must be interpreted with caution, as claims data are primarily collected for billing purposes. They reflect diagnostic and prescribing behaviour rather than actual disease prevalence or clinical needs and are subject to limitations regarding data quality and validity. This is particularly relevant in the context of diagnosing MCI, dementia, and its subtypes, as dementia diagnoses in claims data are not standardised and do not correspond to prospective clinical assessments. In outpatient care, misclassifications and the frequent use of unspecific diagnoses are common, as also reflected in our analysis. Furthermore, the diagnosis of MCI is used heterogeneously in clinical practice and may represent a wide range of underlying conditions [\n5\n].\nClinical parameters such as disease severity, functional status, or exact duration of diagnosis could not be assessed. Additionally, it was not possible to determine whether patients who received SLT or OT had previously undergone similar treatment prior to their dementia or MCI diagnosis. Therefore, the entire analysis must be interpreted in the context of possible confounding by other diseases. This applies in particular to affective disorders [\n5\n], which may confound therapy utilisation patterns by influencing diagnosis, patient engagement, or referral behaviour. For a more accurate analysis, co-morbidities should have been included.", "doc_items_refs": ["#/texts/395", "#/texts/396", "#/texts/397", "#/texts/398", "#/texts/399", "#/texts/400", "#/texts/401", "#/texts/402", "#/texts/403", "#/texts/404", "#/texts/405"], "page_nos": [], "uuid": "0f397212-19c7-49d9-a171-2be48b2cc43b"}
{"doc_id": "2025__Speech-language_therapy_and_occupational_therapy_for_patients_with_mild_cognitiv__W4412956792", "source_path": "<redacted:source_path>", "chunk_id": 26, "source_chunk_idxs": [34, 35], "num_tokens": 324, "text": "Speech-language therapy and occupational therapy for patients with mild cognitive impairment and dementia: a retrospective cohort study using German health claims data\nLimitations\nAnother key limitation relates to the specificity of treatment indications. Due to structural limitations in the German billing system, it was not always possible to determine whether SLT was prescribed for dementia-related symptoms or for other neurological conditions. This ambiguity may have led to an overestimation of dementia-specific SLT use. Furthermore, the data solely captures treatments billed to the SHIs, not those services that were excluded from reimbursement. Prescriptions from self-pay patients could not be included. Patients with private health insurance were excluded from the dataset, which may limit generalisability of the findings to the entire population.\n\nSpeech-language therapy and occupational therapy for patients with mild cognitive impairment and dementia: a retrospective cohort study using German health claims data\nConclusion\nSLT and OT are valuable resources in non-pharmacological dementia care. This study is the first comprehensive analysis of SLT and OT utilisation among PWD/MCI in Germany using nationwide health claims data. Our findings show that these services remain underutilised in routine care. The low uptake of SLT and OT, particularly among people with MCI, suggests missed opportunities for early intervention. The disparities observed in utilisation according to sex, age, and dementia type may reflect barriers to access and referral. Further research is needed to explore these disparities and develop targeted strategies to improve care pathways and integrate SLT and OT more effectively into routine dementia care.", "doc_items_refs": ["#/texts/406", "#/texts/408"], "page_nos": [], "uuid": "963b9d96-b661-4040-8b9e-58acfd8969bf"}
{"doc_id": "2025__Speech-language_therapy_and_occupational_therapy_for_patients_with_mild_cognitiv__W4412956792", "source_path": "<redacted:source_path>", "chunk_id": 27, "source_chunk_idxs": [36, 37], "num_tokens": 348, "text": "Speech-language therapy and occupational therapy for patients with mild cognitive impairment and dementia: a retrospective cohort study using German health claims data\nData availability\nThe data used in this study cannot be made available in the manuscript, the supplemental files, or in a public repository due to German data protection laws (Bundesdatenschutzgesetz). To facilitate the replication of results, anonymized data used for this study are stored on a secure drive at the InGef - Institute for Applied Health Research Berlin GmbH. Access to the raw data used in this study can only be provided to external parties under the conditions of a cooperation contract and can be accessed upon request, after written approval (info@ingef.de), if required.\n\nSpeech-language therapy and occupational therapy for patients with mild cognitive impairment and dementia: a retrospective cohort study using German health claims data\nAbbreviations\nAD:\nAlzheimer's Disease/ Alzheimer's Dementia\nASHA:\nAmerican Speech-Language-Hearing Association\nCST:\nCognitive stimulation therapy\nDSGVO:\nGerman Data Protection Regulation (Datenschutz-Grundverordnung)\nICD:\nInternational classification of Diseases\nInGef:\nInstitute of Applied Health Research Berlin\nMCI:\nMild cognitive impairment\nOT:\nOccupational therapy\nPWD:\nPeople with dementia\nPWD/MCI:\nPeople with dementia or mild cognitive impairment\nPS5/4:\nIndication code dementia syndromes\nRECORD:\nReporting of studies Conducted using Observational Routinely-collected health Data Statement\nRCSLT:\nRoyal College of Speech and Language Therapists\nSC:\nIndication code Swallowing disorders\nSGB:\nGerman Social Code (Sozialgesetzbuch)\nSHI:\nStatutory health insurance\nSLT:\nSpeech-Language therapy\nSP5:\nIndication code Speech disorders after completing speech development", "doc_items_refs": ["#/texts/410", "#/texts/412", "#/texts/413", "#/texts/414", "#/texts/415", "#/texts/416", "#/texts/417", "#/texts/418", "#/texts/419", "#/texts/420", "#/texts/421", "#/texts/422", "#/texts/423", "#/texts/424", "#/texts/425", "#/texts/426", "#/texts/427", "#/texts/428", "#/texts/429", "#/texts/430", "#/texts/431", "#/texts/432", "#/texts/433", "#/texts/434", "#/texts/435", "#/texts/436", "#/texts/437", "#/texts/438", "#/texts/439", "#/texts/440", "#/texts/441", "#/texts/442", "#/texts/443", "#/texts/444", "#/texts/445", "#/texts/446", "#/texts/447"], "page_nos": [], "uuid": "aa3f4799-33fc-4828-ae97-773769214c5b"}
{"doc_id": "2025__Speech-language_therapy_and_occupational_therapy_for_patients_with_mild_cognitiv__W4412956792", "source_path": "<redacted:source_path>", "chunk_id": 28, "source_chunk_idxs": [38], "num_tokens": 473, "text": "Speech-language therapy and occupational therapy for patients with mild cognitive impairment and dementia: a retrospective cohort study using German health claims data\n8. References\n1. World Health Organisation. Dementia.\nhttps://www.who.int/news-room/fact-sheets/detail/dementia\n.(2025). Accessed 20 Jan 2025.\n2. Blotenberg I, Hoffmann W, Thyrian JR. Dementia in germany: epidemiology and prevention potential. Dtsch Arztebl Int. 2023;10(120):470-6.\nGoogle Scholar\n3. Livingston G, Huntley J, Liu KY, Costafreda SG, Selbæk G, Alladi S, et al. Dementia prevention, intervention, and care: 2024 report of the lancet standing commission. Lancet. 2024;404(10452):572-628.\nArticle\nPubMed\nGoogle Scholar\n4. Alzheimer's A. 2024 Alzheimer's disease facts and figures. Alzheimers Dement. 2024;20(5):3708-821.\nGoogle Scholar\n5. DGN e. V. DGPPN e. V, Herausgeber. S3-Leitlinie Demenzen, Version 5.0 28.02.2025\nhttps://register.awmf.org/de/leitlinien/detail/038-013\n. Accessed 12 Mar 2025.\n6. Hlavka JP, Mattke S, Liu JL. Assessing the preparedness of the health care system infrastructure in six European countries for an alzheimer's treatment. Rand Health Q. 2019;8(3):2.\nPubMed\nPubMed Central\nGoogle Scholar\n7. Peterson K, Anderson J, Bourne D, Charns MP, Gorin SS, Hynes DM, et al. Health care coordination theoretical frameworks: a systematic scoping review to increase their Understanding and use in practice. J Gen Intern Med. 2019;34:90-8.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n8. Lissek V, Suchan B. Preventing dementia? Interventional approaches in mild cognitive impairment. Neurosci Biobehav Rev. 2021;122:143-64.\nArticle\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/449", "#/texts/450", "#/texts/451", "#/texts/452", "#/texts/453", "#/texts/454", "#/texts/455", "#/texts/456"], "page_nos": [], "uuid": "6e084257-e240-499d-a529-ba695950670a"}
{"doc_id": "2025__Speech-language_therapy_and_occupational_therapy_for_patients_with_mild_cognitiv__W4412956792", "source_path": "<redacted:source_path>", "chunk_id": 29, "source_chunk_idxs": [39], "num_tokens": 406, "text": "Speech-language therapy and occupational therapy for patients with mild cognitive impairment and dementia: a retrospective cohort study using German health claims data\n8. References\n9. van Dyck CH, Swanson CJ, Aisen P, Bateman RJ, Chen C, Gee M, et al. Lecanemab in early alzheimer's disease. N Engl J Med. 2023;388(1):9-21.\nArticle\nPubMed\nGoogle Scholar\n10. Layton N, Devanny C, Hill K, Swaffer K, Russell G, Low LF, et al. The right to rehabilitation for people with dementia: A codesign approach to barriers and solutions. Health Expect. 2024;27(5):e70036.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n11. World Health Organization. Package of interventions for rehabilitation. Module 3. Neurological conditions. 2023\nhttps://www.who.int/publications/i/item/9789240071131\n. Accessed 18 Dez 2024.\n12. Gemeinsamer Bundesausschuss (G-BA). Richtlinie des gemeinsamen bundesausschusses Über die verordnung von Heilmitteln in der vertragsärztlichen versorgung (Heilmittel-Richtlinie/HeilM-RL). Berlin: G-BA; 2024.\nGoogle Scholar\n13. Waltersbacher A. Heilmittelbereicht 2023/2024 ergotherapie, sprachtherapie,physiotherapie, podologie. Berlin Wissenschaftliches Institut der AOK (WidO). 2024.\nhttps://www.wido.de/publikationen-produkte/buchreihen/heilmittelbericht/\n. Accessed 20 Jan 2025.", "doc_items_refs": ["#/texts/457", "#/texts/458", "#/texts/459", "#/texts/460", "#/texts/461"], "page_nos": [], "uuid": "d616fbf6-dd96-4ad5-ae5f-1bc382c880cb"}
{"doc_id": "2025__Speech-language_therapy_and_occupational_therapy_for_patients_with_mild_cognitiv__W4412956792", "source_path": "<redacted:source_path>", "chunk_id": 30, "source_chunk_idxs": [40], "num_tokens": 512, "text": "Speech-language therapy and occupational therapy for patients with mild cognitive impairment and dementia: a retrospective cohort study using German health claims data\n8. References\n14. Ärzteschaft. Neuropsychologen befürchten Verschlechterung der ambulanten Versorgung. Deutsches Ärzteblatt. 2019.\nhttps://www.aerzteblatt.de/news/neuropsychologen-befuerchten-verschlechterung-der-ambulanten-versorgung-6037e1a4-26f3-4c90-89e9-f0fe9e55a701\n. Accessed 2 Dez 2024.\n15. Suárez-González A, Cassani A, Gopalan R, Stott J, Savage S. When it is not primary progressive aphasia: a scoping review of spoken Language impairment in other neurodegenerative dementias. Alzheimers Dement (Amst). 2021;7(1):e12205.\nGoogle Scholar\n16. Macoir J. Language impairment in vascular dementia: A clinical review. J Geriatr Psychiatry Neurol. 2024;37(2):87-95.\nArticle\nPubMed\nGoogle Scholar\n17. McCullough KC, Bayles KA, Bouldin ED. Language performance of individuals at risk for mild cognitive impairment. J Speech Lang Hear Res. 2019;62(3):706-22.\nArticle\nPubMed\nGoogle Scholar\n18. Swan K, Hopper M, Wenke R, Jackson C, Till T, Conway E. Speech-language pathologist interventions for communication in moderate-severe dementia: A systematic review. Am J Speech Lang Pathol. 2018;27(2):836-52.\nArticle\nPubMed\nGoogle Scholar\n19. American Speech-Language-Hearing Association. Dementia [Practice portal]. (n.d.)\nhttps://www.asha.org/Practice-Portal/Clinical-Topics/Dementia\n/ Accessed 28 Nov 2024.\n20. Espinosa-Val MC, Martín-Martínez A, Graupera M, Arias O, Elvira A, Cabré M, et al. Prevalence, risk factors, and complications of oropharyngeal dysphagia in older patients with dementia. Nutrients. 2020;12(3):863.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/462", "#/texts/463", "#/texts/464", "#/texts/465", "#/texts/466", "#/texts/467", "#/texts/468"], "page_nos": [], "uuid": "4225478a-b1e3-41d3-9fae-458bce027e86"}
{"doc_id": "2025__Speech-language_therapy_and_occupational_therapy_for_patients_with_mild_cognitiv__W4412956792", "source_path": "<redacted:source_path>", "chunk_id": 31, "source_chunk_idxs": [41], "num_tokens": 496, "text": "Speech-language therapy and occupational therapy for patients with mild cognitive impairment and dementia: a retrospective cohort study using German health claims data\n8. References\n21. Mira A, Gonçalves R, Rodrigues IT. Dysphagia in alzheimer's disease: a systematic review. Dement Neuropsychol. 2022;16(3):261-9.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n22. Smallfield S, Metzger L, Green M, Henley L, Rhodus EK. Occupational therapy practice guidelines for adults living with alzheimer's disease and related neurocognitive disorders. Am J Occup Ther. 2024;78(1):7801397010.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n23. Jeon Y-H, Krein L, O'Connor CM, Mowszowski L, Duffy S, Seeher K, et al. A systematic review of quality dementia clinical guidelines for the development of who's package of interventions for rehabilitation. Gerontol. 2023;63(9):1536-55.\nArticle\nGoogle Scholar\n24. Sherman DS, Mauser J, Nuno M, Sherzai D. The efficacy of cognitive intervention in mild cognitive impairment (MCI): a meta-analysis of outcomes on neuropsychological measures. Neuropsychol Rev. 2017;27:440-84.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n25. Xu Z, Wen S, Dexing Z, Chi-Ho CV, Wong SY-S. Comparative effectiveness of non-pharmacological interventions for depressive symptoms in mild cognitive impairment: systematic review with network meta-analysis. Aging Ment Health. 2022;26(11):2129-35.\nArticle\nPubMed\nGoogle Scholar\n26. Hockley A, Moll D, Littlejohns J, Collett Z, Henshall C. Do communication interventions affect the quality-of-life of people with dementia and their families? A systematic review. Aging Ment Health. 2023;27(9):1-10.\nArticle\nGoogle Scholar\n27. Woods B, Rai HK, Elliott E, Aguirre E, Orrell M, Spector A. Cognitive stimulation to improve cognitive functioning in people with dementia. Cochrane Database Syst Rev. 2023;1(1):CD005562.", "doc_items_refs": ["#/texts/469", "#/texts/470", "#/texts/471", "#/texts/472", "#/texts/473", "#/texts/474", "#/texts/475"], "page_nos": [], "uuid": "950610cf-70d1-40b9-9770-4c5c4537cf96"}
{"doc_id": "2025__Speech-language_therapy_and_occupational_therapy_for_patients_with_mild_cognitiv__W4412956792", "source_path": "<redacted:source_path>", "chunk_id": 32, "source_chunk_idxs": [42], "num_tokens": 488, "text": "Speech-language therapy and occupational therapy for patients with mild cognitive impairment and dementia: a retrospective cohort study using German health claims data\n8. References\n28. Bahar-Fuchs A, Martyr A, Goh AM, Sabates J, Clare L. Cognitive training for people with mild to moderate dementia. Cochrane Database Syst Rev. 2019;3(3):CD013069.\n29. Woods B, O'Philbin L, Farrell EM, Spector AE, Orrell M. Reminiscence therapy for dementia. Cochrane Database Syst Rev. 2018;3(3):CD001120.\n30. Eaglestone G, Gkaintatzi E, Jiang H, Stoner C, Pacella R, McCrone P. Cost-Effectiveness of Non-pharmacological interventions for mild cognitive impairment and dementia: A systematic review of economic evaluations and a review of reviews. Pharmacoecon Open. 2023;7(6):887-914.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n31. Savundranayagam MY, Hummert ML, Montgomery RJ. Investigating the effects of communication problems on caregiver burden. Journals Gerontol Ser B: Psychol Sci Social Sci. 2005;60(1):S48-55.\nArticle\nGoogle Scholar\n32. Balvert SC, Del Sordo GC, Milders MV. The efficacy of dyadic interventions for community-dwelling people with dementia and their caregivers: a systematic review and meta-analysis. Ageing Res Rev. 2024;96:102258.\n33. Michalowsky B, Kaczynski A, Hoffmann W. Ökonomische und gesellschaftliche herausforderungen der demenz in Deutschland-Eine metaanalyse. Bundesgesundheitsbl Gesundheitsforsch Gesundheitsschutz. 2019;62:981-92.\nArticle\nGoogle Scholar\n34. Wübbeler M, Thyrian JR, Michalowsky B, Hertel J, Laporte Uribe F, Wolf-Ostermann K et al. Nonpharmacological therapies and provision of aids in outpatient dementia networks in germany: utilization rates and associated factors. J Multidiscip Healthc. 2015;8:229-36.", "doc_items_refs": ["#/texts/476", "#/texts/477", "#/texts/478", "#/texts/479", "#/texts/480", "#/texts/481", "#/texts/482"], "page_nos": [], "uuid": "94628f08-2d90-46e1-866d-15a058dc3b17"}
{"doc_id": "2025__Speech-language_therapy_and_occupational_therapy_for_patients_with_mild_cognitiv__W4412956792", "source_path": "<redacted:source_path>", "chunk_id": 33, "source_chunk_idxs": [43], "num_tokens": 496, "text": "Speech-language therapy and occupational therapy for patients with mild cognitive impairment and dementia: a retrospective cohort study using German health claims data\n8. References\n35. Kohler L, Meinke-Franze C, Hein J, Fendrich K, Heymann R, Thyrian JR, et al. Does an interdisciplinary network improve dementia care? Results from the IDemUck-study. Curr Alzheimer Res. 2014;11(6):538-48.\nArticle\nPubMed\nPubMed Central\nCAS\nGoogle Scholar\n36. Laux G. Use of electronic patient records for health services research. In: Wensing M, Ullrich C, editors. Foundations of health services Research - Principles, methods and topics. Cham: Springer Nature; 2024. pp. p111-129.\nGoogle Scholar\n37. Swart E, Gothe H, Geyer S, Jaunzeme J, Maier B, Grobe T, et al. Gute praxis sekundärdatenanalyse (GPS): Leitlinien und empfehlungen. Good practice of secondary data analysis (GPS): guidelines and recommendations. Third revision 2012/2014. Gesundheitswesen. 2015;77(02):120-6.\nPubMed\nCAS\nGoogle Scholar\n38. Benchimol EI, Smeeth L, Guttmann A, Harron K, Moher D, Petersen I, et al. The reporting of studies conducted using observational Routinely-collected health data (RECORD) statement. PLoS Med. 2015;12(10):e1001885.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n39. Ludwig M, Enders D, Basedow F, Walker J, Jacob J. Sampling strategy, characteristics and representativeness of the InGef research database. Public Health. 2022;206:57-62.\nArticle\nPubMed\nCAS\nGoogle Scholar\n40. R Core Team. R: A Language and Environment for Statistical Computing [Internet]. Vienna, Austria. 2016. Available from:\nhttps://www.R-project.org/\n41. Bundesministerium für Gesundheit. Coronavirus-Pandemie: Was geschah wann? 2023\nhttps://www.bundesgesundheitsministerium.de/coronavirus/chronik-coronavirus.html\n. Accessed 8 Apr 2025.", "doc_items_refs": ["#/texts/483", "#/texts/484", "#/texts/485", "#/texts/486", "#/texts/487", "#/texts/488", "#/texts/489"], "page_nos": [], "uuid": "a968174d-4aa0-4c60-8e56-4ac0962c8397"}
{"doc_id": "2025__Speech-language_therapy_and_occupational_therapy_for_patients_with_mild_cognitiv__W4412956792", "source_path": "<redacted:source_path>", "chunk_id": 34, "source_chunk_idxs": [44], "num_tokens": 478, "text": "Speech-language therapy and occupational therapy for patients with mild cognitive impairment and dementia: a retrospective cohort study using German health claims data\n8. References\n42. Waltersbacher A. Heilmittelbericht 2021/2022 ergotherapie, sprachtherapie, physiotherapie, podologie. Berlin Wissenschaftliches Institut der AOK (WidO); 2022.\nhttps://www.wido.de/publikationen-produkte/buchreihen/heilmittelbericht/\n. Accessed 20 Jan 2025.\n43. Haaksma ML, Eriksdotter M, Rizzuto D, Leoutsakos JS, Olde Rikkert MGM, Melis RJF, et al. Survival time tool to guide care planning in people with dementia. Neurology. 2020;94(5):e538-48.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n44. Bayles K, McCullough K, Tomoeda CK. Cognitive-communication disorders of MCI and dementia: definition, assessment, and clinical management. 3rd ed. San Diego: Plural Publishing; 2020.\nGoogle Scholar\n45. Wolff F, Dietzel N, Karrer L, Kratzer A, Hess M, Gräßel E, et al. Zeitgerechte diagnosestellung Bei menschen Mit demenz: der Bayerische demenz survey (BayDem). Gesundheitswesen. 2020;82(01):23-9.\nArticle\nPubMed\nGoogle Scholar\n46. Lanzi AM, Saylor AK, Cohen ML. Survey results of speech-language pathologists working with cognitive-communication disorders: improving practices for mild cognitive impairment and early-stage dementia from alzheimer's disease. Am J Speech Lang Pathol. 2022;31(4):1653-71.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n47. Bundesministerium für Familie. Senioren, Frauen und jugend, bundesministerium für gesundheit. Nationale Demenzstrategie.2020\nhttps://www.nationale-demenzstrategie.de/\n. Accessed 4 Dez 2024.", "doc_items_refs": ["#/texts/490", "#/texts/491", "#/texts/492", "#/texts/493", "#/texts/494", "#/texts/495"], "page_nos": [], "uuid": "67d1cfbf-3146-41e2-acb1-6340f007861e"}
{"doc_id": "2025__Speech-language_therapy_and_occupational_therapy_for_patients_with_mild_cognitiv__W4412956792", "source_path": "<redacted:source_path>", "chunk_id": 35, "source_chunk_idxs": [45], "num_tokens": 444, "text": "Speech-language therapy and occupational therapy for patients with mild cognitive impairment and dementia: a retrospective cohort study using German health claims data\n8. References\n48. Mayer JF, Green MR, White LW, Lemley T. Perspectives of Speech-Language pathologists and students on providing care to people living with dementia: A scoping review. Am J Speech Lang Pathol. 2023;32(5):2351-73.\nArticle\nPubMed\nGoogle Scholar\n49. The Royal College of Speech and Language Therapists (RCSLT). Dementia Position Paper 2024.\nhttps://www.rcslt.org/wp-content/uploads/2024/05/Dementia-guidance\\_position-paper\\_2024.pdf\n. Accessed 2 Feb 2025.\n50. American Speech-Language-Hearing Association. ASHA 2021 SLP health care survey: Caseload characteristics 2023. 2023\nhttps://www.asha.org/siteassets/surveys/2023-slp-hc-survey-caseload-characteristics.pdf\n. Accessed 18 Jan 2025.\n51. Andersen R, Davidson P, Sebastian E. Improving access to care in Kominski changing the US health care system. 2014. 33-63.\nhttps://media.johnwiley.com.au/product\\_data/excerpt/44/07879852/0787985244.pdf\n. Accessed 9 June 2025.\n52. Poisson VO, Poulos RG, Withall AL, Reilly A, Emerson L, O'Connor CMC. A mixed method study exploring gender differences in dementia caregiving. Dementia. 2023;22(8):1862-85.\nArticle\nPubMed\nGoogle Scholar\n53. Sundermann EE, Biegon A, Rubin LH, Lipton RB, Landau S, Maki PM. Does the female advantage in verbal memory contribute to underestimating alzheimer's disease pathology in women versus men?? J Alzheimers Dis. 2017;56(3):947-57.\nArticle\nPubMed\nPubMed Central\nCAS\nGoogle Scholar", "doc_items_refs": ["#/texts/496", "#/texts/497", "#/texts/498", "#/texts/499", "#/texts/500", "#/texts/501"], "page_nos": [], "uuid": "ea02c75f-7611-4e9a-9fd5-eae4936df36a"}
{"doc_id": "2025__Speech-language_therapy_and_occupational_therapy_for_patients_with_mild_cognitiv__W4412956792", "source_path": "<redacted:source_path>", "chunk_id": 36, "source_chunk_idxs": [46], "num_tokens": 433, "text": "Speech-language therapy and occupational therapy for patients with mild cognitive impairment and dementia: a retrospective cohort study using German health claims data\n8. References\n54. Sorrentino M, Fiorilla C, Mercogliano M, Stilo I, Esposito F, Moccia M, et al. Barriers for access and utilization of dementia care services in europe: a systematic review. BMC Geriatr. 2025;25(1):162.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n55. Wangler J, Jansky M. What requirements do primary care physicians have with regard to dementia diagnostics and dementia care? - a survey study among general practitioners in Germany 2022/2023. Arch Public Health. 2023;81(1):155.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n56. Wangler J, Jansky M. Dementia diagnostics in general practitioner care. Wien Med Wochenschr. 2020;170(9):230-7.\nArticle\nPubMed\nGoogle Scholar\n57. Cations M, May N, Crotty M, Low L-F, Clemson L, Whitehead C, et al. Health professional perspectives on rehabilitation for people with dementia. Gerontol. 2020;60(3):503-12.\nArticle\nGoogle Scholar\n58. Kassenärztliche Bundesvereinigung KBV. Diagnoseliste langfristiger Heilmittelbedarf/ besonderer Verordnungsbedarf/ Blankoverordnungen. 2025\nhttps://www.kbv.de/media/sp/Heilmittel\\_Diagnoseliste\\_Webversion.pdf.Accessed\n3 Apr 2025.\n59. Bundesrepublik Deutschland. Ausbildungs- und Prüfungsordnung für Logopäden (LogAPrO).\nhttps://www.gesetze-im-internet.de/logapro/BJNR018920980.html\n(1980) Accessed 26 Jan 2025.", "doc_items_refs": ["#/texts/502", "#/texts/503", "#/texts/504", "#/texts/505", "#/texts/506", "#/texts/507"], "page_nos": [], "uuid": "c8847744-e2d5-4296-9cc7-a06d1c72ca29"}
{"doc_id": "2025__Speech-language_therapy_and_occupational_therapy_for_patients_with_mild_cognitiv__W4412956792", "source_path": "<redacted:source_path>", "chunk_id": 37, "source_chunk_idxs": [47], "num_tokens": 434, "text": "Speech-language therapy and occupational therapy for patients with mild cognitive impairment and dementia: a retrospective cohort study using German health claims data\n8. References\n60. Bundesrepublik Deutschland. Ausbildungs- und Prüfungsverordnung für Ergotherapeutinnen und Ergotherapeuten (Ergotherapeuten-Ausbildungs- und Prüfungsverordnung - ErgThAPrV).\nhttps://www.gesetze-im-internet.de/ergthaprv/BJNR173100999.html\n(1999). Accessed 16 Jan 202561.\n61. Bundesagentur für Arbeit. Blickpunkt Arbeitsmarkt - Fachkräfteengpassanalyse. 2023. Nürnberg: Statistik/Arbeitsmarksberichterstattung. 2024.\nhttps://statistik.arbeitsagentur.de/SiteGlobals/Forms/Suche/Einzelheftsuche\\_Formular.html;jsessionid=8E86E52127DBBF58C5500D45368027BF?nn=20626&amp;topic\\_f=fachkraefte-engpassanalyse\n. Accessed 6 Feb 2025.\n62. Eggenberger E, Heimerl K, Bennett MI. Communication skills training in dementia care: a systematic review of effectiveness, training content, and didactic methods in different care settings. Int Psychogeriatr. 2013;25(3):345-58.\nArticle\nPubMed\nGoogle Scholar\n63. Schubert I, Köster I, Küpper-Nybelen J, Ihle P. Versorgungsforschung Mit GKV-Routinedaten. Bundesgesundheitsblatt-Gesundheitsforschung-Gesundheitsschutz. 2008;10(51):1095-105.\nArticle\nGoogle Scholar\nDownload references", "doc_items_refs": ["#/texts/508", "#/texts/509", "#/texts/510", "#/texts/511", "#/texts/512"], "page_nos": [], "uuid": "da0694c7-4b39-456c-9f17-1c47ebc633ed"}
{"doc_id": "2025__Speech-language_therapy_and_occupational_therapy_for_patients_with_mild_cognitiv__W4412956792", "source_path": "<redacted:source_path>", "chunk_id": 38, "source_chunk_idxs": [48, 49, 50], "num_tokens": 394, "text": "Speech-language therapy and occupational therapy for patients with mild cognitive impairment and dementia: a retrospective cohort study using German health claims data\nAcknowledgements\nThis research was completed using routine data provided by InGef. Funding for data analysis was provided by Bochum University of Applied Sciences. Open Access funding enabled and organised by the graduate School for Applied Research in North Rhine Westphalia (PK NRW) and the Project DEAL.\n\nSpeech-language therapy and occupational therapy for patients with mild cognitive impairment and dementia: a retrospective cohort study using German health claims data\nFunding\nOpen Access funding enabled and organized by Projekt DEAL. Not applicable.\n\nSpeech-language therapy and occupational therapy for patients with mild cognitive impairment and dementia: a retrospective cohort study using German health claims data\nAuthor information\nAuthors and Affiliations\n1. Department of Nursing, Midwifery and Therapeutic Sciences, Bochum University of Applied Sciences. Location Health Campus, Gesundheitscampus 6-8, Bochum, 44801, Germany Fiona Dörr, Daniela Holle, Sascha Sommer, Markus Wübbeler &amp; Kerstin Bilda\n2. InGef-Institute for Applied Health Research Berlin GmbH, Otto-Ostrowski- Str. 5, Berlin, 10249, Germany Bashar Morouj &amp; Dominik Obermüller\nAuthors\n1. Fiona Dörr\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n2. Daniela Holle\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n3. Bashar Morouj\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n4. Dominik Obermüller\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n5. Sascha Sommer\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n6. Markus Wübbeler\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n7. Kerstin Bilda\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/514", "#/texts/516", "#/texts/519", "#/texts/520", "#/texts/521", "#/texts/522", "#/texts/523", "#/texts/524", "#/texts/525", "#/texts/526", "#/texts/527", "#/texts/528"], "page_nos": [], "uuid": "a4b4747a-04f7-4e9e-bc3f-547bebb4f231"}
{"doc_id": "2025__Speech-language_therapy_and_occupational_therapy_for_patients_with_mild_cognitiv__W4412956792", "source_path": "<redacted:source_path>", "chunk_id": 39, "source_chunk_idxs": [51, 52, 53], "num_tokens": 289, "text": "Speech-language therapy and occupational therapy for patients with mild cognitive impairment and dementia: a retrospective cohort study using German health claims data\nAuthor information\nContributions\nF.D., K.B., S.S. conceived the concept and the design of the study. F.D. prepared the data analysis and wrote a first draft of this paper. B.M. and D.O. analysed the claims data. K.B., D.H., S.S., M.W., D.O. and B.M. were responsible for critical intellectual advice regarding content aspects of the study and supported finalizing this manuscript. All authors gave final approval of the version to be published.\n\nSpeech-language therapy and occupational therapy for patients with mild cognitive impairment and dementia: a retrospective cohort study using German health claims data\nAuthor information\nCorresponding author\nCorrespondence to\nFiona Dörr\n.\n\nSpeech-language therapy and occupational therapy for patients with mild cognitive impairment and dementia: a retrospective cohort study using German health claims data\nEthics declarations\nEthics approval and consent to participate\nThe study was conducted in accordance with the ethical principles of the Declaration of Helsinki. All patient-level data in the InGef research database are de-identified to comply with German data protection regulations. Use of the study database for health services research is therefore fully compliant with German federal law and, accordingly, ethical approval and informed consent of the patient was not needed.", "doc_items_refs": ["#/texts/530", "#/texts/532", "#/texts/533", "#/texts/534", "#/texts/537"], "page_nos": [], "uuid": "dbe62a6a-ca8b-442c-a536-a85aa7f3402b"}
{"doc_id": "2025__Speech-language_therapy_and_occupational_therapy_for_patients_with_mild_cognitiv__W4412956792", "source_path": "<redacted:source_path>", "chunk_id": 40, "source_chunk_idxs": [54, 55, 56, 57], "num_tokens": 329, "text": "Speech-language therapy and occupational therapy for patients with mild cognitive impairment and dementia: a retrospective cohort study using German health claims data\nEthics declarations\nConsent for publication\nNot applicable.\n\nSpeech-language therapy and occupational therapy for patients with mild cognitive impairment and dementia: a retrospective cohort study using German health claims data\nEthics declarations\nCompeting interests\nThe authors declare no competing interests.\n\nSpeech-language therapy and occupational therapy for patients with mild cognitive impairment and dementia: a retrospective cohort study using German health claims data\nAdditional information\nPublisher's note\nSpringer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations.\n\nSpeech-language therapy and occupational therapy for patients with mild cognitive impairment and dementia: a retrospective cohort study using German health claims data\nRights and permissions\nOpen Access\nThis article is licensed under a Creative Commons Attribution 4.0 International License, which permits use, sharing, adaptation, distribution and reproduction in any medium or format, as long as you give appropriate credit to the original author(s) and the source, provide a link to the Creative Commons licence, and indicate if changes were made. The images or other third party material in this article are included in the article's Creative Commons licence, unless indicated otherwise in a credit line to the material. If material is not included in the article's Creative Commons licence and your intended use is not permitted by statutory regulation or exceeds the permitted use, you will need to obtain permission directly from the copyright holder. To view a copy of this licence, visit\nhttp://creativecommons.org/licenses/by/4.0/\n.\nReprints and permissions", "doc_items_refs": ["#/texts/539", "#/texts/541", "#/texts/544", "#/texts/548", "#/texts/549", "#/texts/550", "#/texts/551", "#/texts/552"], "page_nos": [], "uuid": "d8340c71-c058-449e-9364-3f830ccbc516"}
{"doc_id": "2025__Speech-language_therapy_and_occupational_therapy_for_patients_with_mild_cognitiv__W4412956792", "source_path": "<redacted:source_path>", "chunk_id": 41, "source_chunk_idxs": [58, 59, 60, 61], "num_tokens": 326, "text": "Speech-language therapy and occupational therapy for patients with mild cognitive impairment and dementia: a retrospective cohort study using German health claims data\nAbout this article\nCite this article\nDörr, F., Holle, D., Morouj, B.\net al.\nSpeech-language therapy and occupational therapy for patients with mild cognitive impairment and dementia: a retrospective cohort study using German health claims data.\nBMC Health Serv Res\n25\n, 1026 (2025). https://doi.org/10.1186/s12913-025-13149-y\nDownload citation\n- Received : 25 April 2025\n- Accepted : 01 July 2025\n- Published : 05 August 2025\n- DOI : https://doi.org/10.1186/s12913-025-13149-y\n\nSpeech-language therapy and occupational therapy for patients with mild cognitive impairment and dementia: a retrospective cohort study using German health claims data\nAbout this article\nKeywords\n- Dementia\n- Mild cognitive impairment\n- Cognitive interventions\n- Speech-language therapy\n- Occupational therapy\n- Allied health professionals\n- Claims data\n- Health services research\nDownload PDF\nAdvertisement\n\nSpeech-language therapy and occupational therapy for patients with mild cognitive impairment and dementia: a retrospective cohort study using German health claims data\nAbout this article\nKeywords\nBMC Health Services Research\nISSN: 1472-6963\n\nSpeech-language therapy and occupational therapy for patients with mild cognitive impairment and dementia: a retrospective cohort study using German health claims data\nAbout this article\nKeywords\nContact us\n- General enquiries:\njournalsubmissions@springernature.com", "doc_items_refs": ["#/texts/555", "#/texts/556", "#/texts/557", "#/texts/558", "#/texts/559", "#/texts/560", "#/texts/561", "#/texts/562", "#/texts/563", "#/texts/564", "#/texts/565", "#/texts/567", "#/texts/568", "#/texts/569", "#/texts/570", "#/texts/571", "#/texts/572", "#/texts/573", "#/texts/574", "#/texts/575", "#/texts/576", "#/texts/578", "#/texts/580"], "page_nos": [], "uuid": "82ea6af3-1add-4336-b5af-48645fdf418a"}
