{"doc_id": "2025__A_comprehensive_review_on_novel_opportunities_for_Alzheimer_therapy_by_targeting__W4413033438", "source_path": "<redacted:source_path>", "chunk_id": 0, "source_chunk_idxs": [0, 1, 2], "num_tokens": 288, "text": "A comprehensive review on novel opportunities for Alzheimer therapy by targeting BIN1 | Egyptian Journal of Medical Human Genetics | Full Text\nSkip to main content\nAdvertisement\nSearch\n- Get published\n- Explore Journals\n- Books\n- About\n- My account\nSearch all SpringerOpen articles\nSearch\nEgyptian Journal of Medical Human Genetics\n- About\n- Articles\n- Submission Guidelines\n- Submit manuscript\nA comprehensive review on novel opportunities for Alzheimer therapy by targeting BIN1\nDownload PDF\nDownload PDF\n- Review\n- Open access\n- Published: 07 August 2025\n\nA comprehensive review on novel opportunities for Alzheimer therapy by targeting BIN1\n- Trina Saha\n1\n&amp;\n- Dipanjan Karati\nORCID: orcid.org/0000-0003-0734-6015\n1\nEgyptian Journal of Medical Human Genetics\nvolume 26\n, Article number: 134 ( 2025 )\nCite this article\n- 393 Accesses\n- Metrics details\n\nA comprehensive review on novel opportunities for Alzheimer therapy by targeting BIN1\nAbstract\nBackground\nAlzheimer's disease is a neurological disease marked by memory loss, cognitive decline, and behavioral abnormalities. The major frequent cause of dementia is AD, with an estimated 50 million or more individuals affected globally, these days. Several conventional susceptibility genes have been found in preliminary research, such as the Amyloid Precursor Protein, Apolipoprotein E (APOE) for late onset AD (LOAD), Presenilin genes 1 and 2 for early onset AD (EOAD).", "doc_items_refs": ["#/texts/1", "#/texts/2", "#/texts/3", "#/texts/4", "#/texts/5", "#/texts/6", "#/texts/7", "#/texts/8", "#/texts/9", "#/texts/10", "#/texts/11", "#/texts/12", "#/texts/13", "#/texts/14", "#/texts/15", "#/texts/16", "#/texts/17", "#/texts/18", "#/texts/19", "#/texts/20", "#/texts/21", "#/texts/23", "#/texts/24", "#/texts/25", "#/texts/26", "#/texts/27", "#/texts/28", "#/texts/29", "#/texts/30", "#/texts/33"], "page_nos": [], "uuid": "25e7b7b5-2ced-4012-8f35-d5903c5c1f32"}
{"doc_id": "2025__A_comprehensive_review_on_novel_opportunities_for_Alzheimer_therapy_by_targeting__W4413033438", "source_path": "<redacted:source_path>", "chunk_id": 1, "source_chunk_idxs": [3, 4, 5], "num_tokens": 443, "text": "A comprehensive review on novel opportunities for Alzheimer therapy by targeting BIN1\nAbstract\nObjective\nIn this review paper we highlight the effect of\nBIN1\nin AD.\n\nA comprehensive review on novel opportunities for Alzheimer therapy by targeting BIN1\nAbstract\nMethod of study\nA total of 110 articles were retrieved from Google Scholar, PubMed and ScienceDirect using various keywords. After full-text evaluation and applying the literature selection criteria, 98 articles were selected in the review. Only studies published in English, covering the human, animal or in vitro aspects of Alzheimer's disease are included in this list. Articles that were not written in English, treated other topics, were not examining BIN1 or Alzheimer's disease, were abstracts from conferences, editorials, letters, short papers with missing data or repeated studies were all excluded. From the initial screening, applying the right criteria resulted in 98 articles being chosen for this review to explore and understand BIN1's connection to Alzheimer's disease.\n\nA comprehensive review on novel opportunities for Alzheimer therapy by targeting BIN1\nAbstract\nResults\nResearch revealed a significant locus of susceptibility for LOAD on the Bridging Integrator 1 (\nBIN1\n) that is situated on chromosome 2q14.3 and is identified at the time of the most significant susceptibility gene of LOAD. Neuronal circuits connected synaptically are the medium via which tau disease spread, yet the fundamental mechanisms remain unknown.\nBIN1\n-amphiphysin 2 is most common genetic risk factor for late onset AD. In brain illness, the neuronal isoform of\nBIN1\n-amphiphysin 2 is downregulated. BIN1, or amphiphysin II, is a Bin/Amphiphysin/Rvs (BAR) domain containing protein that controls membrane curvature and participates in clathrin-dependent endocytosis. Changes in BIN1 expression levels have been shown to impair endocytic flux, likely due to problems with vesicle scission and trafficking. Additionally, preventing endocytosis by blocking dyamin also lowers Tau pathology propagation. The cytoplasmic membrane binding protein\nBIN1\nis involved in subcellular trafficking and endocytosis.", "doc_items_refs": ["#/texts/35", "#/texts/36", "#/texts/37", "#/texts/39", "#/texts/41", "#/texts/42", "#/texts/43", "#/texts/44", "#/texts/45", "#/texts/46", "#/texts/47", "#/texts/48", "#/texts/49"], "page_nos": [], "uuid": "861b1579-ab73-459f-88bf-69e1c4398109"}
{"doc_id": "2025__A_comprehensive_review_on_novel_opportunities_for_Alzheimer_therapy_by_targeting__W4413033438", "source_path": "<redacted:source_path>", "chunk_id": 2, "source_chunk_idxs": [6], "num_tokens": 157, "text": "A comprehensive review on novel opportunities for Alzheimer therapy by targeting BIN1\nAbstract\nConclusion\nThe most frequent BIN1 variants are found in non-coding regions immediately upstream of the gene, and it is thus likely that their impact is regulatory and not structural. The variants can influence the levels of BIN1 or splicing between isoforms, especially the distribution of isoforms. In AD, there is a significant change in expression of BIN1 isoforms, where there is an upregulation of shorter glial-specific isoforms and a downregulation of longer neuronal isoforms. Such isoform imbalance can interfere with neuronal function and play a role in AD pathogenesis, making it essential to target BIN1 splicing regulation as a therapeutic modality.", "doc_items_refs": ["#/texts/51"], "page_nos": [], "uuid": "d91f1709-9790-4fda-a973-1f604ef9504f"}
{"doc_id": "2025__A_comprehensive_review_on_novel_opportunities_for_Alzheimer_therapy_by_targeting__W4413033438", "source_path": "<redacted:source_path>", "chunk_id": 3, "source_chunk_idxs": [7], "num_tokens": 506, "text": "A comprehensive review on novel opportunities for Alzheimer therapy by targeting BIN1\nIntroduction\nA complicated, multifactorial, neurodegenerative disease Alzheimer's disease (AD) is the primary reason for dementia in the elderly and causes significant burdens for those who are affected, those who care for them, and society as a whole [\n1\n]. Heritability estimates for AD range from 59% to 78%, and the risk of the disease is influenced by genetic susceptibility at several loci and interactions among these genes [\n2\n]. The sole unquestionably documented susceptibility genes for early onset familial AD have long been amyloid precursor protein (APP) and the presenilin genes 1 and 2 (PSEN1, PSEN2), while apolipoprotein E (APOE) is the only susceptibility gene that has been proven for common late onset AD (LOAD). In addition to APOE4, nine more genes/loci have been found recently through extensive genome-wide association studies (GWAS) [\n3\n,\n4\n,\n5\n]. Extensive genome-wide correlation additional common variations linked to AD susceptibility have been found and replicated by investigation. These variants include\nBIN1\n, CR1, CLU, CD33, CD2AP, ABCA7, EPHA1, PICALIM, MS4A4A, and MD4A6A. The list is further expanded to include HLA-DRB5, SORL1, PTK2B, SLC24A4, INPP5D, DSG2, NME8, MEF2C, ZCWPW1, FERMT2, CELF1 and CASS4 in the most recent meta-analysis [\n6\n] to the date (with about 75,000 individuals). The risk of AD is associated with an uncommon variation in TREM2 [\n7\n,\n8\n]. Furthermore, AD is linked to a significant amplification of hexanucleotide repeats in C9oborf72 [\n9\n]. APOE has an important role in the metabolism of lipids and in repairing the damaged neurons of the central nervous system [\n10\n]. E2, E3, E4 are the most common isomers of APOE. It is recently been found that one of the biggest risk factors for LOAD is the Bridging Integrator 1 (\nBIN1\n).\nBIN1", "doc_items_refs": ["#/texts/54", "#/texts/55", "#/texts/56", "#/texts/57", "#/texts/58", "#/texts/59", "#/texts/60", "#/texts/61", "#/texts/62", "#/texts/63", "#/texts/64", "#/texts/65", "#/texts/66", "#/texts/67", "#/texts/68", "#/texts/69", "#/texts/70", "#/texts/71", "#/texts/72", "#/texts/73", "#/texts/74", "#/texts/75", "#/texts/76", "#/texts/77", "#/texts/78", "#/texts/79"], "page_nos": [], "uuid": "e5b35bb7-6d5b-4d8e-aa2b-e46d63858586"}
{"doc_id": "2025__A_comprehensive_review_on_novel_opportunities_for_Alzheimer_therapy_by_targeting__W4413033438", "source_path": "<redacted:source_path>", "chunk_id": 4, "source_chunk_idxs": [8], "num_tokens": 120, "text": "A comprehensive review on novel opportunities for Alzheimer therapy by targeting BIN1\nIntroduction\nwhich is found on the chromosome 2q14.4, has been shown to have higher transcript levels in AD brains, particularly in the neurons that have neurofibrillary tangles. Its precise function in AD is unknown, but it is believed to play a part in the control of inflammation, endocytosis, trafficking and the immune system, calcium transients and apoptosis [\n11\n,\n12\n]. Furthermore, recent reports suggest that BIN1 can directly alter tau pathology, albeit with minimal impact on APP processing.", "doc_items_refs": ["#/texts/80", "#/texts/81", "#/texts/82", "#/texts/83", "#/texts/84"], "page_nos": [], "uuid": "565b1ac8-a446-4e56-aaa8-3105ccf2deff"}
{"doc_id": "2025__A_comprehensive_review_on_novel_opportunities_for_Alzheimer_therapy_by_targeting__W4413033438", "source_path": "<redacted:source_path>", "chunk_id": 5, "source_chunk_idxs": [9], "num_tokens": 503, "text": "A comprehensive review on novel opportunities for Alzheimer therapy by targeting BIN1\nBIN1 genetics and isoforms\nBIN1 is the second most significant gene that increases the risk of AD [\n13\n,\n14\n].\nBIN1\nis primarily recognized as a proapoptotic suppressor of tumors that interacts with MYC, it is presently the major significant locus for genetic vulnerability in the load, second only to APOE. It can primarily influence the tau pathology pathway, which in turn affects the risk of AD.\nBIN1\nis also known as Amphiphysin II, which belongs to the family-Bin/Amphiphysin/Rvs (BAR).\nBIN1\nwas initially discovered to be a protein that interacted with the MYC oncoprotein's N-terminus [\n15\n]. It was then cloned due to its sequence similarity to the Amphiphysin 1, which is a protein that is primarily expressed in the brain [\n16\n,\n17\n].\nBIN1\nis an encoder of at least 20 exons and is found on chromosome 2q14.3. [\n18\n]. Wechsler-Reya et al. first identified 19 exons. An omitted exon-called exon 6a was found between exons 6 and 7. As\nBIN1\ntranscripts undergo extensive differential splicing, it results in the generation of a wide variety of\nBIN1\nsplice variants with varying distributions of tissue [\n19\n]. The inclusion of four exons-6a,10,12 (which includes the set of another type of exons unique to the brain-12A-D)-and 13 is the main area of variation among the major forms. Nucleocytoskeletal adaptor protein\nBIN1\nis widely expressed and exists in several tissue-specific isoforms, including the largest and brain-specific isoform (iso1) as well as a smaller ubiquitous isoform (iso9) [\n11\n]. Neuronal\nBIN1\nis known to play a role in vesicular transport, clathrin-mediated endocytosis, and membrane curvatures regulation [\n20\n,\n21\n,\n22\n]. The evolutionarily conserved BAR domain of\nBIN1\nis responsible for binding the plasma membrane and generating membrane curvature in all isoforms. Brain-specific isoforms have a clathrin-AP2 binding region (CLAP) domain that interacts with AP-2 and clathrin, two endocytosis mediators [Figure\n1", "doc_items_refs": ["#/texts/86", "#/texts/87", "#/texts/88", "#/texts/89", "#/texts/90", "#/texts/91", "#/texts/92", "#/texts/93", "#/texts/94", "#/texts/95", "#/texts/96", "#/texts/97", "#/texts/98", "#/texts/99", "#/texts/100", "#/texts/101", "#/texts/102", "#/texts/103", "#/texts/104", "#/texts/105", "#/texts/106", "#/texts/107", "#/texts/108", "#/texts/109", "#/texts/110", "#/texts/111", "#/texts/112", "#/texts/113", "#/texts/114", "#/texts/115", "#/texts/116", "#/texts/117", "#/texts/118", "#/texts/119", "#/texts/120", "#/texts/121", "#/texts/122", "#/texts/123", "#/texts/124", "#/texts/125", "#/texts/126", "#/texts/127"], "page_nos": [], "uuid": "70468e75-e8c6-4ebf-8843-861432e50c8e"}
{"doc_id": "2025__A_comprehensive_review_on_novel_opportunities_for_Alzheimer_therapy_by_targeting__W4413033438", "source_path": "<redacted:source_path>", "chunk_id": 6, "source_chunk_idxs": [10], "num_tokens": 180, "text": "A comprehensive review on novel opportunities for Alzheimer therapy by targeting BIN1\nBIN1 genetics and isoforms\n]. Due to clathrin-mediated endocytosis of soluble tau and amyloid precursor protein (APP), these biological functions may associate\nBIN1\nwith beta amyloid and tau pathology [\n23\n,\n24\n,\n25\n,\n26\n]. It has also been proposed that\nBIN1\nregulates lipoprotein APOE-mediated synaptic repair. A new theory regarding the pathophysiological process of LOAD has emerged in the genes found by the GWAS. This theory suggests that the amyloid cascade hypothesis may hold relevance even in cases of non-monogenic AD, as LOAD is linked to a subtle but sneaky impairment in peripheral beta amyloid peptide [\n27\n].\nBIN1\n's function in AD pathogenesis and possible molecular mechanisms influencing AND risk [\n28\n].\nFig. 1", "doc_items_refs": ["#/texts/128", "#/texts/129", "#/texts/130", "#/texts/131", "#/texts/132", "#/texts/133", "#/texts/134", "#/texts/135", "#/texts/136", "#/texts/137", "#/texts/138", "#/texts/139", "#/texts/140", "#/texts/141", "#/texts/142", "#/texts/143", "#/texts/144", "#/texts/145", "#/texts/146", "#/texts/147"], "page_nos": [], "uuid": "a070c6f7-eb2c-4c27-b80d-a47c94915485"}
{"doc_id": "2025__A_comprehensive_review_on_novel_opportunities_for_Alzheimer_therapy_by_targeting__W4413033438", "source_path": "<redacted:source_path>", "chunk_id": 7, "source_chunk_idxs": [11], "num_tokens": 430, "text": "A comprehensive review on novel opportunities for Alzheimer therapy by targeting BIN1\nBIN1 in tau pathology\nAccording to GWAS,\nBIN1\nis the second major significant susceptibility locus for AD with a late onset.\nBIN1\nis subjected to intricate alternative splicing, resulting in the production of multiple isoforms that have distinct roles in various cellular processes, such as endocytosis [\n29\n]. Because of its involvement in endocytosis,\nBIN1\nmay have a role in the metabolism of APP. Because\nBIN1\nregulates cytoskeleton dynamics, it may also interact with proteins associated with microtubules, such as Tau [Figure\n2\n].\nBIN1\nexpression dysregulation may be the mechanism causing an increase in the risk of AD. In fact, the human brain exhibits altered\nBIN1\ntranscript levels [\n11\n]. Enhanced\nBIN1\nmRNA expression of the frontal cortex in AD patients, despite the inability to differentiate between isoforms [\n30\n]. An increase in\nBIN1\nmRNA expression that retains exon 7 in the neurons of AD patients' brains [\n31\n]. When the level in ubiquitous\nBIN1\nisoform 9 is increased, the level of BIN 1 isoform 1 protein is significantly decreased [\n31\n,\n32\n,\n33\n,\n34\n]. Reduced expression of\nBIN1\nisoforms in neurons and astrocytes that preserve exon 7 of AD brains [\n35\n]. The central regulation of the interactions between the environment and the genome is the epigenetic process of BIN 1 in AD. Research indicates that LOAD is caused by anomalies related to epigenetics, such as alterations in the methylation of DNA or histone modification, in addition to the impact of differences in several genes and environmental factors [\n36\n]. The pathogenesis of AD has been connected to these aberrant epigenetic modifications, which have also produced the integrative framework for comprehending the complex pathology of AD [\n37\n]. Pathological alterations in AD extend beyond changes in\nBIN1\nmRNA and protein levels, they also impact the\nBIN1\nphosphorylation and the cellular localization [\n38\n,\n39\n].\nFig. 2", "doc_items_refs": ["#/texts/149", "#/texts/150", "#/texts/151", "#/texts/152", "#/texts/153", "#/texts/154", "#/texts/155", "#/texts/156", "#/texts/157", "#/texts/158", "#/texts/159", "#/texts/160", "#/texts/161", "#/texts/162", "#/texts/163", "#/texts/164", "#/texts/165", "#/texts/166", "#/texts/167", "#/texts/168", "#/texts/169", "#/texts/170", "#/texts/171", "#/texts/172", "#/texts/173", "#/texts/174", "#/texts/175", "#/texts/176", "#/texts/177", "#/texts/178", "#/texts/179", "#/texts/180", "#/texts/181", "#/texts/182", "#/texts/183", "#/texts/184", "#/texts/185", "#/texts/186", "#/texts/187", "#/texts/188", "#/texts/189", "#/texts/190", "#/texts/191", "#/texts/192", "#/texts/193", "#/texts/194", "#/texts/195", "#/texts/196", "#/texts/197", "#/texts/198", "#/texts/199", "#/texts/200", "#/texts/201", "#/texts/202"], "page_nos": [], "uuid": "12e3001e-42e2-42fb-9300-00e9499b6c7a"}
{"doc_id": "2025__A_comprehensive_review_on_novel_opportunities_for_Alzheimer_therapy_by_targeting__W4413033438", "source_path": "<redacted:source_path>", "chunk_id": 8, "source_chunk_idxs": [12], "num_tokens": 512, "text": "A comprehensive review on novel opportunities for Alzheimer therapy by targeting BIN1\nNeurofibrillary tangle pathology\nAbnormal filament bundles accumulating in neurons form Neurofibrillary tangles (NFT). Perikarya, dendrites, and axons have all been found to contain the aberrant filaments that make up NFT. These filaments, which have been named \"paired Helical Filaments,\" (PHF), have been described as two filaments helicoidally twisted around one another [\n40\n]. They appear straight or exhibit regular constrictions. The microtubule-associated protein tau has been identified as the primary component of PHF, and a reliable and repeatable technique for detecting NFT is immunocytochemical labeling with anti-tau antibodies [\n41\n,\n42\n]. The first indications regarding the protein composition of PHF came from immunocytochemical studies, which also showed cytoskeletal proteins are connected to in situ and post-isolation processes. PHF and antibodies generated to isolate PHF fraction tau proteins have been shown to exhibit immunoreactivity for the microtubule-associated protein tau on a regular basis [\n43\n,\n44\n,\n45\n,\n46\n,\n47\n]. Numerous labs have sequenced the peptides produced by proteolytic digestion of PHF preparations, and they have discovered that the sequences match that of tau [\n43\n]. According to reports, just 10% of PHF's molecular mass is made up of the tau fragment that was separated from PHF [\n48\n]. Part of the sequence of ubiquitin is identical to another sequenced peptide that was isolated from PHF preparations. Additionally, ubiquitin has been immunocytochemically identified in a subset of PHF. It consists of a 76-amino acid polypeptide that is engaged in a variety of non-lysosomal, ATP-dependent proteolytic processes [\n49\n]. According to this mechanism, aberrant proteins that ubiquitin covalently binds to become targets for proteases that are specific to ubiquitinated proteins. The density of senile plaques is the basis for neurofibrillary tangle pathology in AD [\n50\n,\n51\n]. Senile plaques consist of a neuritic crown of dystrophic neurites encircling an extracellular deposit of amyloid fibrils [\n52", "doc_items_refs": ["#/texts/204", "#/texts/205", "#/texts/206", "#/texts/207", "#/texts/208", "#/texts/209", "#/texts/210", "#/texts/211", "#/texts/212", "#/texts/213", "#/texts/214", "#/texts/215", "#/texts/216", "#/texts/217", "#/texts/218", "#/texts/219", "#/texts/220", "#/texts/221", "#/texts/222", "#/texts/223", "#/texts/224", "#/texts/225", "#/texts/226", "#/texts/227", "#/texts/228", "#/texts/229", "#/texts/230", "#/texts/231"], "page_nos": [], "uuid": "e7ed7071-b30d-435a-a8a2-ed98fc17d3c5"}
{"doc_id": "2025__A_comprehensive_review_on_novel_opportunities_for_Alzheimer_therapy_by_targeting__W4413033438", "source_path": "<redacted:source_path>", "chunk_id": 9, "source_chunk_idxs": [13], "num_tokens": 267, "text": "A comprehensive review on novel opportunities for Alzheimer therapy by targeting BIN1\nNeurofibrillary tangle pathology\n]. Compared to senile plaques, the density of NFT was found to be more closely correlated with the severity of dementia, suggesting that the formation of NFTs is more closely associated with neuronal dysfunction [\n41\n,\n42\n,\n52\n,\n53\n]. AD diagnosis is based on semiquantitative assessments of the topography and NFT of senile plaques [\n54\n]. Neuropathological staging of AD occurred in 6 stages [\n54\n,\n55\n,\n56\n,\n57\n]. In stage1, the transentorhinal cortex, which lies between the temporal neocortex and the nearby entorhinal cortex, is where NFTs are initially discovered. In stage 2, NFT then emerge in the entorhinal cortex's layer pre-alpha. In stage 3 and 4, NFT levels rise to high concentrations in the entorhinal cortex and the hippocampal regions, which are indicative of clinically immature AD. In stages 5 and 6, the neocortical association area's NFT are abundant (where they are primarily found in layers 3 and 5). Besides that, some neuronal populations are resistant to NFT formation [\n58\n,\n59\n].", "doc_items_refs": ["#/texts/232", "#/texts/233", "#/texts/234", "#/texts/235", "#/texts/236", "#/texts/237", "#/texts/238", "#/texts/239", "#/texts/240", "#/texts/241", "#/texts/242", "#/texts/243", "#/texts/244", "#/texts/245", "#/texts/246", "#/texts/247", "#/texts/248", "#/texts/249", "#/texts/250", "#/texts/251", "#/texts/252", "#/texts/253", "#/texts/254"], "page_nos": [], "uuid": "5d9d72d0-ccfe-4adb-8730-d3d57f4b2547"}
{"doc_id": "2025__A_comprehensive_review_on_novel_opportunities_for_Alzheimer_therapy_by_targeting__W4413033438", "source_path": "<redacted:source_path>", "chunk_id": 10, "source_chunk_idxs": [14], "num_tokens": 499, "text": "A comprehensive review on novel opportunities for Alzheimer therapy by targeting BIN1\nCorrelation between BIN1 expression and neurofibrillary tangle pathology\nBIN1\nmay be the direct modulator of the tau pathology [\n30\n] but has little effect on the production of Aβ or processing of AβPP [\n60\n].\nBIN1\nis associated with the phenotype of muscle weakness and is also aberrantly expressed in types I (DM1) and type II (DM2) myotonic dystrophy [\n61\n,\n62\n]. Both types of myotonic dystrophy often show signs of neurodegeneration, as well as issues with Tau and NFT pathology [\n63\n,\n64\n,\n65\n,\n66\n,\n67\n]. Multiple regions of the AD brain had altered\nBIN1\nisoform expression, which is linked to NFT pathology. In the human brain, there is a correlation between\nBIN1\nexpression and the ZNF9 protein, which is also known as CNBP or the cellular nucleic acid binding protein [\n68\n]. DM2 is caused by the first intron of ZNF9. These findings imply that\nBIN1\nplays a probable modulatory role in tangle pathology in AD and that this function may be carried out in other human diseases that exhibit tau pathology. NFT is the major primary pathological characteristics in AD. Tau, a protein associated with microtubules, may regulate the consistency of microtubules in neurons; however, when tau undergoes aberrant modification, it separates from microtubules and causes pathological lesions. According to current research, aberrantly phosphorylated tau (p-tau) manifests comparatively early in brain development, and the particular p-tau confirmation has been linked to the pathophysiology of AD [\n69\n,\n70\n]. A growing body of research has identified the cellular pathways linked to tau-mediated neurodegeneration and tau as the possible therapeutic target for AD [\n71\n]. By means of a pulling force produced by the microtubules,\nBIN1\nmay be able to increase its intrinsic tubulating capacity through interaction with cytoplasmic linker protein 170 (CLIP-170), a microtubule-associated protein [\n72\n]. The physical communication between the\nBIN1\nand the tau protein in the transfected human neuroblastoma cells with these two proteins has been shown in recent studies, which strongly suggests that elevated\nBIN1", "doc_items_refs": ["#/texts/256", "#/texts/257", "#/texts/258", "#/texts/259", "#/texts/260", "#/texts/261", "#/texts/262", "#/texts/263", "#/texts/264", "#/texts/265", "#/texts/266", "#/texts/267", "#/texts/268", "#/texts/269", "#/texts/270", "#/texts/271", "#/texts/272", "#/texts/273", "#/texts/274", "#/texts/275", "#/texts/276", "#/texts/277", "#/texts/278", "#/texts/279", "#/texts/280", "#/texts/281", "#/texts/282", "#/texts/283", "#/texts/284", "#/texts/285", "#/texts/286", "#/texts/287", "#/texts/288", "#/texts/289", "#/texts/290", "#/texts/291", "#/texts/292", "#/texts/293", "#/texts/294", "#/texts/295", "#/texts/296", "#/texts/297", "#/texts/298"], "page_nos": [], "uuid": "ebb701c4-de3e-4fd2-90ad-21a2a39ee95e"}
{"doc_id": "2025__A_comprehensive_review_on_novel_opportunities_for_Alzheimer_therapy_by_targeting__W4413033438", "source_path": "<redacted:source_path>", "chunk_id": 11, "source_chunk_idxs": [15], "num_tokens": 57, "text": "A comprehensive review on novel opportunities for Alzheimer therapy by targeting BIN1\nCorrelation between BIN1 expression and neurofibrillary tangle pathology\nlevels increase the risk of AD through the tau pathway's interaction.\nBIN1\nmay influence the prepathological phases of tau-related AD pathogenesis.", "doc_items_refs": ["#/texts/299", "#/texts/300", "#/texts/301"], "page_nos": [], "uuid": "87e466aa-d828-4e18-acc0-34842cd84cfc"}
{"doc_id": "2025__A_comprehensive_review_on_novel_opportunities_for_Alzheimer_therapy_by_targeting__W4413033438", "source_path": "<redacted:source_path>", "chunk_id": 12, "source_chunk_idxs": [16], "num_tokens": 489, "text": "A comprehensive review on novel opportunities for Alzheimer therapy by targeting BIN1\nStructural basis of interaction between BIN1 and tau protein\nThe role of tau proteins in copolymerizing and facilitating the assembly of microtubules was first identified [\n73\n]. Tau is present in the adult human brain in six different isoforms, with amino acid values ranging from 352 to 441, which are produced by the alternative splicing of single mRNA that is transcribed from a gene found on chromosome 17 [\n74\n]. Tau is highly expressed in neurons, but it is also present in astrocytes and oligodendrocytes. Tau is found throughout the entire cell in developing neurons [\n75\n]. Despite the fact that the somatodendritic domain contains the pool of phosphorylated tau, it is concentrated in axons in mature neurons [\n76\n,\n77\n,\n78\n]. Highly phosphorylated tau is mislocalized to the synaptic compartments in AD, where it mediates synaptotoxicity and impairs synapse function [\n79\n,\n80\n,\n81\n,\n82\n]. The brain of an individual with advanced AD has less of the longest neuronal\nBIN1\nprotein isoform [\n83\n]. In comparison with controls, tau phosphorylated at S396/S404 was observed to build up at the synapses in both moderate and several phases of AD. The loss of cytoplasmic tau was accompanied by an accumulation of synaptic tau, indicating that reflect tau was missorted from the cytoplasm to the synapses. In both severe and moderate AD tissues, we discovered notable and substantial losses of cytoplasmic\nBIN1\n, which correlated inversely with increases in synaptic tau and positively with decreases in cytoplasmic tau. Additionally, it has been discovered that the phosphorylated (pSer396/404, PHF 1)\nBIN1\nand tau levels in the cytoplasmic fraction correlated negatively. Additionally, there was no discernible relationship between the amounts of\nBIN1\nin the total or synaptoneurosome fractions and either total or phosphorylated tau. The synapse's phosphorylated tau missorting could be aided by the loss of cytoplasmic\nBIN1\n. Since tau is linked to\nBIN1\n, we reasoned that reducing\nBIN1", "doc_items_refs": ["#/texts/303", "#/texts/304", "#/texts/305", "#/texts/306", "#/texts/307", "#/texts/308", "#/texts/309", "#/texts/310", "#/texts/311", "#/texts/312", "#/texts/313", "#/texts/314", "#/texts/315", "#/texts/316", "#/texts/317", "#/texts/318", "#/texts/319", "#/texts/320", "#/texts/321", "#/texts/322", "#/texts/323", "#/texts/324", "#/texts/325", "#/texts/326", "#/texts/327", "#/texts/328", "#/texts/329", "#/texts/330", "#/texts/331", "#/texts/332", "#/texts/333", "#/texts/334", "#/texts/335", "#/texts/336", "#/texts/337", "#/texts/338"], "page_nos": [], "uuid": "4257aa9a-01f8-4d3b-ade2-7b66a101f461"}
{"doc_id": "2025__A_comprehensive_review_on_novel_opportunities_for_Alzheimer_therapy_by_targeting__W4413033438", "source_path": "<redacted:source_path>", "chunk_id": 13, "source_chunk_idxs": [17], "num_tokens": 336, "text": "A comprehensive review on novel opportunities for Alzheimer therapy by targeting BIN1\nStructural basis of interaction between BIN1 and tau protein\nprotein levels would also reduce Tau. Phosphorylated Tau (pTau) levels in the HEK 239T rex cells did not drop following IgG treatment.\nBIN1\nmAb, decrease the levels of pTau and\nBIN1\n.\nBIN1\nand Tau have been shown to interact directly in numerous studies [\n30\n,\n84\n]. The PxxP motifs in Tau's central proline-rich region and the SH3 domain of\nBIN1\nmediate this interaction between Tau and\nBIN1\n. It's interesting to note that LVGCC-β1 harbors an SH3 domain that may potentially communicate with Tau. In AD and related tauopathies, the release and spread of modified tau proteins are intimately associated with synaptic tau [\n85\n,\n86\n]. Important extracellular tau signaling functions are made possible by the release of tau species that are soluble under physiological states; AD may cause this tau function to be lost [\n87\n,\n88\n]. The primary mechanism for tau release is synaptic activity. By altering AMPA receptor surface expression and trafficking,\nBIN1\nexpression modulation impacts dendritic spine morphology and AMPA receptor-mediated synaptic transmission. Basal tau release was significantly reduced by\nBIN1\nknockdown, but intracellular tau levels remained unchanged. In AD,\nBIN1\nloss will impair the function of extracellular tau additionally to enabling phosphorylated tau to incorrectly localize to synapses and cause toxicity.\nBIN1\nknockdown influences tau release. AD risk may be raised by\nBIN1\npolymorphism.", "doc_items_refs": ["#/texts/339", "#/texts/340", "#/texts/341", "#/texts/342", "#/texts/343", "#/texts/344", "#/texts/345", "#/texts/346", "#/texts/347", "#/texts/348", "#/texts/349", "#/texts/350", "#/texts/351", "#/texts/352", "#/texts/353", "#/texts/354", "#/texts/355", "#/texts/356", "#/texts/357", "#/texts/358", "#/texts/359", "#/texts/360", "#/texts/361", "#/texts/362", "#/texts/363", "#/texts/364", "#/texts/365", "#/texts/366", "#/texts/367", "#/texts/368", "#/texts/369", "#/texts/370", "#/texts/371"], "page_nos": [], "uuid": "b3a7503d-c1de-4b5f-afdd-b1e6a3ab6b5e"}
{"doc_id": "2025__A_comprehensive_review_on_novel_opportunities_for_Alzheimer_therapy_by_targeting__W4413033438", "source_path": "<redacted:source_path>", "chunk_id": 14, "source_chunk_idxs": [18], "num_tokens": 489, "text": "A comprehensive review on novel opportunities for Alzheimer therapy by targeting BIN1\nBIN1 as a therapeutic target for AD\nBIN1\nmay play a role in the pathophysiology of neurodegeneration, which opens up new avenues for research into AD. The relationship with the tau pathology should be given special attention since it may have an impact on neurofibrillary tangles, which are the primary pathological characteristic of AD brains. More significantly,\nBIN1\nknockdown has been shown to significantly suppress tau-mediated neurotoxicity [\n30\n]; as a result, targeting\nBIN1\nmay provide a novel approach to neuroprotection and the treatment of AD. Inhibiting\nBIN1\n's immunoregulatory target, IDO1, has also demonstrated substantial promise for AD [\n89\n]. In AD brains,\nBIN1\nmay have an impact on Ca (v) 1.2 trafficking and selectivity of calcium channel blockers, which may reduce tau load and enhance autophagy function-a feature that may also be essential for successful AD treatment [\n90\n]. It is anticipated that epigenetic control of\nBIN1\nexpression will offer a novel therapeutic avenue for AD patients if methylation alterations in\nBIN1\npromoter are demonstrated to exist in these individuals. HeLa cells'\nBIN1\nexpression was silenced by RNA interference (RNAi), which increased the secretion of Aβ40 and Aβ42, respectively [\n91\n]. Changes in the APP proteolytic processing of endosomes in cells devoid of\nBIN1\nexpression may have caused this effect. The endocytic trafficking of APP or BACE1 was impacted by\nBIN1\nloss, which encouraged the amyloidogenic processing of APP. Both phagocytic internalization of zymosan and the endocytic transferrin uptake of\nBIN1\n-/-fibroblasts were unaffected by the loss of\nBIN1\nfunction [\n92\n].\nBIN1\nRNAi knockdown resulted in endocytic abnormalities that changed Aβ production. Mature oligodendrocytes express tau, and attracting tau to the locations of process outgrowth is a crucial first step in the myelination process [\n93\n,\n94\n]. There was a significant correlation found between\nBIN1\nand the level of NFT pathology, but not between the amount of amyloid beta peptide or diffuse or neuritic plaques [\n95\n]. Genotypes for\nBIN1", "doc_items_refs": ["#/texts/373", "#/texts/374", "#/texts/375", "#/texts/376", "#/texts/377", "#/texts/378", "#/texts/379", "#/texts/380", "#/texts/381", "#/texts/382", "#/texts/383", "#/texts/384", "#/texts/385", "#/texts/386", "#/texts/387", "#/texts/388", "#/texts/389", "#/texts/390", "#/texts/391", "#/texts/392", "#/texts/393", "#/texts/394", "#/texts/395", "#/texts/396", "#/texts/397", "#/texts/398", "#/texts/399", "#/texts/400", "#/texts/401", "#/texts/402", "#/texts/403", "#/texts/404", "#/texts/405", "#/texts/406", "#/texts/407", "#/texts/408", "#/texts/409", "#/texts/410", "#/texts/411", "#/texts/412", "#/texts/413", "#/texts/414", "#/texts/415", "#/texts/416", "#/texts/417"], "page_nos": [], "uuid": "42b44f58-aed6-4797-833c-744017a45bf2"}
{"doc_id": "2025__A_comprehensive_review_on_novel_opportunities_for_Alzheimer_therapy_by_targeting__W4413033438", "source_path": "<redacted:source_path>", "chunk_id": 15, "source_chunk_idxs": [19], "num_tokens": 205, "text": "A comprehensive review on novel opportunities for Alzheimer therapy by targeting BIN1\nBIN1 as a therapeutic target for AD\nrs7561528 were significantly associated with hippocampal atrophy, as well as with the thickness of the entorhinal and the temporal pole cortical layers [\n96\n,\n97\n]. The\nBIN1\nrs7561528 loci influenced the expression of\nBIN1\n, and\nBIN1\n, PICALIM, EPHA1, and CD2AP, a putative convolution of genes encoding physically interacting proteins, were linked by several interacting proteins and appeared to have the coordinated evidence of the natural selection. Therefore, by regulating\nBIN1\nexpression, the rs7561528 polymorphism is thought to have a major role in the pathophysiology of AD [\n98\n]. Beyond the traditional treatment strategies for AD, which primarily focus on lowering Aβ production and increasing its clearance,\nBIN1\nmay provide new opportunities for investigating novel therapeutic strategies, potentially involving several molecular targets.", "doc_items_refs": ["#/texts/418", "#/texts/419", "#/texts/420", "#/texts/421", "#/texts/422", "#/texts/423", "#/texts/424", "#/texts/425", "#/texts/426", "#/texts/427", "#/texts/428", "#/texts/429", "#/texts/430", "#/texts/431", "#/texts/432", "#/texts/433", "#/texts/434"], "page_nos": [], "uuid": "a0ee1c36-5019-48b6-9e2b-524fda4a67b8"}
{"doc_id": "2025__A_comprehensive_review_on_novel_opportunities_for_Alzheimer_therapy_by_targeting__W4413033438", "source_path": "<redacted:source_path>", "chunk_id": 16, "source_chunk_idxs": [20], "num_tokens": 357, "text": "A comprehensive review on novel opportunities for Alzheimer therapy by targeting BIN1\nConclusion and future direction\nAfter APOE, BIN1 is the major significant genetic vulnerability locus in LOAD. The main way that BIN1 influences the risk of AD is through altering tau pathology. Aptosis, calcium homeostasis, and endocytosis/trafficking also impact cellular processes. Epigenetic changes significantly influence the pathogenesis of AD. Our discovery that the BIN1 promoter was methylated was linked to early pathological alterations in preclinical AD. This finding is in line with earlier research on brain tissue that demonstrated the relationship between tau tangle density and Aβ-load and methylation in BIN1.\nFurthermore, research on the relationship between AD pathology and BIN1 protein has confirmed that BIN1 plays a role in the early pathological alterations of AD. Regarding Aβ-related pathology specifically, it was previously believed that the BIN1 protein participates in the endocytosis, which may act as a pathway leading to the creation and distribution of APP. One trait linked to AD amyloid pathology was the abnormal build-up of BIN1 protein. Regarding tau-related pathology, it has been observed that elevated expression of the BIN1 protein intensifies tau-related pathology by directly binding to a proline-rich domain in tau through the SH3 domain, in addition to altering the endocytosis of tau protein. The BIN1 protein also modulates actin dynamics connected to tau. The BIN1 protein played a role in the pathological alterations associated with AD, as well as the way in which it impacted tau pathology and Aβ pathology. Because of BIN1's possible role in the pathophysiology of AD, targeting BIN1 may offer new avenues for treating AD.", "doc_items_refs": ["#/texts/436", "#/texts/437"], "page_nos": [], "uuid": "c31c9653-afc1-4895-aa58-fecd77280606"}
{"doc_id": "2025__A_comprehensive_review_on_novel_opportunities_for_Alzheimer_therapy_by_targeting__W4413033438", "source_path": "<redacted:source_path>", "chunk_id": 17, "source_chunk_idxs": [21, 22, 23], "num_tokens": 353, "text": "A comprehensive review on novel opportunities for Alzheimer therapy by targeting BIN1\nConclusion and future direction\nIn order to further promote the understanding and therapeutic application of BIN1 in AD, a number of critical areas should be targeted for intense exploration. Molecular studies should seek to elucidate the specific mechanisms by which BIN1 acts on Tau pathology, endocytosis, and cytoskeletal dynamics-using methods such as CRISPR-mediated gene editing, isoform-specific knockdown/overexpression models, and high-resolution protein interaction mapping. It is also necessary to explore BIN1's alternative splicing regulation, explicitly the upstream non-coding variants that potentially influence isoform expression in a cell-type specific fashion. Interventions therapeutically could involve the design of antisense oligonucleotides or small molecules to manipulate BIN1 splicing, reconstitute neuronal isoform expression, or interfere with BIN1-Tau interactions.\n\nA comprehensive review on novel opportunities for Alzheimer therapy by targeting BIN1\nAvailability of data and materials\nNot applicable.\n\nA comprehensive review on novel opportunities for Alzheimer therapy by targeting BIN1\nAbbreviations\nAD:\nAlzheimer Disease\nAPOE:\nApolipoprotein E\nAPP:\nAmyloid Precursor Protein\nAβ:\nAmyloid β\nBAR:\nBin/Amphiphysin/RVS\nBIN1\n:\nBrinding Integrator 1\nCLAP:\nClathrin Adaptor Protein\nGWAS:\nGenome-Wide Association Studies\nLOAD:\nLate Onset Alzheimer Disease\nNFT:\nNeurofibrillary Tangle\nPHF:\nPaired Helical Filaments\nPTau:\nPhosphorylated tau\nPSEN1:\nPresenilin gene 1\nPSEN2:\nPresenilin gene 2\nRNAi:\nRNA interference", "doc_items_refs": ["#/texts/438", "#/texts/440", "#/texts/442", "#/texts/443", "#/texts/444", "#/texts/445", "#/texts/446", "#/texts/447", "#/texts/448", "#/texts/449", "#/texts/450", "#/texts/451", "#/texts/452", "#/texts/453", "#/texts/454", "#/texts/455", "#/texts/456", "#/texts/457", "#/texts/458", "#/texts/459", "#/texts/460", "#/texts/461", "#/texts/462", "#/texts/463", "#/texts/464", "#/texts/465", "#/texts/466", "#/texts/467", "#/texts/468", "#/texts/469", "#/texts/470", "#/texts/471", "#/texts/472"], "page_nos": [], "uuid": "5f062155-823b-4a1c-b4db-f4abf47f675c"}
{"doc_id": "2025__A_comprehensive_review_on_novel_opportunities_for_Alzheimer_therapy_by_targeting__W4413033438", "source_path": "<redacted:source_path>", "chunk_id": 18, "source_chunk_idxs": [24], "num_tokens": 478, "text": "A comprehensive review on novel opportunities for Alzheimer therapy by targeting BIN1\nReferences\n1. Meur S, Mukherjee S, Roy S, Karati D (2024) Role of PIM Kinase Inhibitor in the Treatment of Alzheimer's Disease. Mol Neurobiol 30:1-5\nGoogle Scholar\n2. Harold D et al (2009) Genome-wide association study identifies variants at CLU and PICALM associated with Alzheimer's disease. Nat Genet 41:1088-1093\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n3. Sudwarts A, Ramesha S, Gao T, Ponnusamy M, Wang S, Hansen M, Kozlova A, Bitarafan S, Kumar P, Beaulieu-Abdelahad D, Zhang X (2022) BIN1 is a key regulator of proinflammatory and neurodegeneration-related activation in microglia. Mol Neurodegener 17(1):33\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n4. Zhu J, Liu X, Yin H, Gao Y, Yu H (2021) Convergent lines of evidence support BIN1 as a risk gene of Alzheimer's disease. Hum Genomics 15:1-9\nArticle\nGoogle Scholar\n5. Naj AC et al (2011) Common variants at MS4A4/. MS4A6E, CD2AP, CD33 and EPHA1 are associated with late -onset Alzheimer's disease. Nat Genet 43:436-441\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n6. Lambert JC, Ibrahim-Verbaas CA, Harold D, et al (2013) European Alzheimer's Disease Initiative (EADI); Genetic and Environmental Risk in Alzheimer's Disease; Alzheimer's Disease Genetic Consortium; Cohorts for Heat and Aging Research in Genomic Epidemiology. Meta-analysis of 74,046 individuals identifies 11 new susceptibility loci for Alzheimer's disease. Nat Genet. 45(12): 1452-1458\n7. Guerreiro R, Wojtas A, Bras J et al (2013) Alzheimer genetic analysis group. TREM2 variants in Alzheimer's disease. N Engl J Med 368:117-127\nArticle\nCAS\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/474", "#/texts/475", "#/texts/476", "#/texts/477", "#/texts/478", "#/texts/479", "#/texts/480"], "page_nos": [], "uuid": "6e7935fe-bef5-48a4-b532-42a058fe2233"}
{"doc_id": "2025__A_comprehensive_review_on_novel_opportunities_for_Alzheimer_therapy_by_targeting__W4413033438", "source_path": "<redacted:source_path>", "chunk_id": 19, "source_chunk_idxs": [25], "num_tokens": 488, "text": "A comprehensive review on novel opportunities for Alzheimer therapy by targeting BIN1\nReferences\n8. Jonsson T, Stefansson H, Steinberg S et al (2013) Variant of TREM2 associated with the risk of Alzheimer disease. N Engl J Med 368(2):107-116\nArticle\nCAS\nPubMed\nGoogle Scholar\n9. Kohli MA, John -WilliamsRajbhandhary KR et al (2013) Repeat expansions in the C9ORF72 gene contribute to Alzheimer disease in Caucasians. Neurobiol Aging 34(5):1519\nArticle\nGoogle Scholar\n10. Weisgraber KH, Mahely RW (1996) Human apolipoprotein E: the Alzheimer's disease connection. FASEB J 10:1485-1494\nArticle\nCAS\nPubMed\nGoogle Scholar\n11. Tan MS, Yu JT, Tan L (2013) Brinding Integrator 1 (BIN1): form, function, and Alzheimer's disease. Trends Mol Med 19:594-603\nArticle\nCAS\nPubMed\nGoogle Scholar\n12. Kingwell K (2013) Alzheimer disease:BIN1 variant increases risk of Alzheimer disease through tau. Nat Rev Neurol 9:184\nArticle\nPubMed\nGoogle Scholar\n13. Saha O, Melo de Farias AR, Pelletier A, Siedlecki-Wullich D, Landeira BS, Gadaut J, Carrier A, Vreulx AC, Guyot K, Shen Y, Bonnefond A (2024) The Alzheimer's disease risk gene BIN1 regulates activity-dependent gene expression in human-induced glutamatergic neurons. Mol Psychiatry 29(9):2634-2646\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n14. Wang J, Zhen Y, Yang J, Yang S, Zhu G (2024) Recognizing Alzheimer's disease from perspective of oligodendrocytes: phenomena or pathogenesis? CNS Neurosci Ther 30(3):e14688\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n15. Lichte B, Veh RW, Meyer HE (1992) Kilimann MW Amiphysin, a novel protein associated with synaptic vesicles. EMBO J 11:2521-2530\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/481", "#/texts/482", "#/texts/483", "#/texts/484", "#/texts/485", "#/texts/486", "#/texts/487", "#/texts/488"], "page_nos": [], "uuid": "1b435c7e-7802-4645-a63f-68ba54a4fa7e"}
{"doc_id": "2025__A_comprehensive_review_on_novel_opportunities_for_Alzheimer_therapy_by_targeting__W4413033438", "source_path": "<redacted:source_path>", "chunk_id": 20, "source_chunk_idxs": [26], "num_tokens": 493, "text": "A comprehensive review on novel opportunities for Alzheimer therapy by targeting BIN1\nReferences\n16. Leprince C, Romero F, Cussac D, Vayssiere B, Berger R, Tavitian A, Camonis JH (1997) A new member of the amphiphysin family connecting endocytosis and signal transduction pathways. J Biol Chem 272:15101-15105\nArticle\nCAS\nPubMed\nGoogle Scholar\n17. Wigge P, Kohler K, Vallis Y, Doyle CA, Owen D, Hunt SP, McMahon HT (1997) Amphiphysin heterodimers: potential role in clathrin - mediated endocytosis. Mol Biol Cell 8:2003-2015\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n18. Ren G, Vajjhala P, Lee JS, Winsor B, Munn AL. The BAR domain pr.\n19. Pineda-Lucena A, Ho CS, Mao DY, Sheng Y, Laister RC, Muhandiram R, Lu Y, Seet BT, Katz S, Szyperski T, Penn LZ (2005) A structure-based model of the c-Myc/Bin1 protein interaction shows alternative splicing of Bin1 and c-Myc phosphorylation are key binding determinants. J Mol Biol 351(1):182-194\nArticle\nCAS\nPubMed\nGoogle Scholar\n20. Leprince C, Le scolanMeunier EB et al (2003) Sorting nexin 4 and amphiphysin 2, a new partnership between endocytosis and intercellular trafficking. J Cell Sci 116:1937-1948\nArticle\nCAS\nPubMed\nGoogle Scholar\n21. Kajiho H, Saito K, Tsujita K, Kontani K, Araki Y, Kurosu H, Katada T (2003) RIN3: a novel Rab5 GEF interacting with amphiphysin II involved in the early endocytic pathway. J Cell Sci 116(20):4159-4168\nArticle\nCAS\nPubMed\nGoogle Scholar\n22. Adam J, Basnet N, Mizuno N (2015) Structural insights into the cooperative remodeling of membranes by amphiphysin/BIN1. Sci Rep 5:15452\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/489", "#/texts/490", "#/texts/491", "#/texts/492", "#/texts/493", "#/texts/494", "#/texts/495"], "page_nos": [], "uuid": "c672bda1-f35c-4740-8203-024f0100d86b"}
{"doc_id": "2025__A_comprehensive_review_on_novel_opportunities_for_Alzheimer_therapy_by_targeting__W4413033438", "source_path": "<redacted:source_path>", "chunk_id": 21, "source_chunk_idxs": [27], "num_tokens": 448, "text": "A comprehensive review on novel opportunities for Alzheimer therapy by targeting BIN1\nReferences\n23. Bohm C, Chen F, Sevalle J et al (2015) Current and future implications of basic and translational research on amyloid - β peptide production and removal pathways. Mol Cell Neurosci 66:3-11\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n24. Zhang YW, Thompson R, Zhang H et al (2011) APP processing in Alzheimer's disease. Mol Brain 4:3\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n25. Avila J, Gomez RamosBolos AM (2015) AD genetic risk factors and tau spreading. Front Aging Neurosci 7:99\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n26. Pooler AM, Phillips EC, Lau DH et al (2013) Physiological release of endogenous tau is stimulated by neuronal activity. EMBO Rep 14:389-394\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n27. Lambert JC, Amouyel P (2011) Genetics of Alzheimer's disease: new evidences for an old hypothesis? Curr Opin Genet Dev 21(3):295-301\nArticle\nCAS\nPubMed\nGoogle Scholar\n28. Jones L, Harold D, Williams J (2010) Genetic evidence for the involvement of lipid metabolism in Alzheimer's disease. Biochimica et Biophysica Acta (BBA)-Molecular and Cell Biology of Lipids 1801 (8) 754-61\n29. Iton T, De Camilli P (2006) BAR, F- BAR(EFC) and ENTH/ANTH domains in the regulation of membrane - cytosol interfaces and membrane curvature. Biochem Biophys Acta 1761:897-912\nGoogle Scholar\n30. Chapuis J, Hansmannel F, Gistelinck M, Mounier A, Van Cauwenberghe C, Kolen KV et al (2013) Increasd expression of BIN1 mediates Alzheimer genetic risk by modulating tau pathology. Mol Psychiatry 18(11):1225-1234\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/496", "#/texts/497", "#/texts/498", "#/texts/499", "#/texts/500", "#/texts/501", "#/texts/502", "#/texts/503"], "page_nos": [], "uuid": "d0d45659-563c-4d86-859f-0d1232ffd4ca"}
{"doc_id": "2025__A_comprehensive_review_on_novel_opportunities_for_Alzheimer_therapy_by_targeting__W4413033438", "source_path": "<redacted:source_path>", "chunk_id": 22, "source_chunk_idxs": [28], "num_tokens": 470, "text": "A comprehensive review on novel opportunities for Alzheimer therapy by targeting BIN1\nReferences\n31. De Rossi P, Van Buggina Prevot ClaytonVasquezSanfordAndrew VBLJBRJ et al (2016) Predominant expression of Alzheimer's disease -associated BIN1 in mature oligodendrocytes and localization to white matter tracts. Mol Neurodegener 11(1):59\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n32. De Rossi P, Nomura T, Andrew RJ, Masse NY, Sampathkumar V, Musial TF et al (2020) Neuronal BIN1 regulates presynaptic neurotransmitter release and memory consolidation. Cell Rep 30(10):3520-3535\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n33. Holler CJ, Davis PR, Beckett TL, Platt TL, Webb RL, Head E et al (2014) Brinding integrator 1 (BIN1) protein expression increases in the Alzheimer's disease brain and correlates with neurofibrillary tangle pathology. J Alzheimers Dis 42(4):1221-1227\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n34. Glennon EB, Whitehouse IJ, Miners JS, Kehoe PG, Love D, Kellett KA et al (2013) BIN1 is decreased in sporadic but not familial Alzheimer's disease or in aging. PLoS ONE 8(10):e78806\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n35. Taga M, Petyuk VA, White C, Marsh G, Ma Y, Klein HU et al (2020) BIN1 protein isoforms are differentially expressed in astrocytes, neurons, and microglia: neuronal and astrocyte BIN1 are implicated in tau pathology. Mol Neurodegener 15(1):44\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n36. Waseem Bihaqi S, Schumacher A, Maloney BK, LahiriNZawia DH (2012) Do epigenetic pathways initiate late onset Alzheimer disease (LOAD): towards a new paradigm. Curr Alzheimer Res 9(5):574-588\nArticle\nGoogle Scholar", "doc_items_refs": ["#/texts/504", "#/texts/505", "#/texts/506", "#/texts/507", "#/texts/508", "#/texts/509"], "page_nos": [], "uuid": "0edbf420-714d-40de-8fea-c8e4f301714c"}
{"doc_id": "2025__A_comprehensive_review_on_novel_opportunities_for_Alzheimer_therapy_by_targeting__W4413033438", "source_path": "<redacted:source_path>", "chunk_id": 23, "source_chunk_idxs": [29], "num_tokens": 436, "text": "A comprehensive review on novel opportunities for Alzheimer therapy by targeting BIN1\nReferences\n37. Mastroeni D, Grover A, Delvaux E, Whiteside C, Coleman PD, Rogers J (2011) Epigenetic mechanisms in Alzheimer's disease. Neurobiol Aging 32(7):1161-1180\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n38. Glennon EB,Lau DH-W, R.M.C. G, Taylor MFT, C,Opie-Martin S, Elliot C,et al (2020) Brinding integrator 1 protein loss in Alzheimer's disease promotes synaptic tau accumulation and disrupts tau release. Brain Communication\n39. Adams SL, Tilton K, Kozubek JA, Seshadri S, Delalle I (2016) Subcellular changes in brinding integrator 1 protein expression in the cerebral cortex during the progression of Alzheimer disease pathology. J Neuropathol Exp Neurol 75(8):779-790\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n40. Kidd M (1963) Paired helical filaments in electron microscopy of Alzheimer's disease. Nature 197:192-193\nArticle\nCAS\nPubMed\nGoogle Scholar\n41. Duyckaerts C, Brion JP, Hauw JJ, Flament- Durand J (1987) Comparison of immunocytochemistry with a specific antibody and Bodian's protargol method.Quantitative assessment of the density of neurofibrillary tangles and senile plaques in senile dementia of the Alzheimer type. Acta Neuropathol (Berl) 73:167-170\nArticle\nCAS\nPubMed\nGoogle Scholar\n42. Duyckaerts C, Deleare P, Haw JJ, Abbamondi- Pinto AL, Sorbi S, Allen L et al (1990) Rating of lesions in senile dementia of the Alzheimer type: Concordance between laboratories. a European multicenter study under the auspices of Eurage. J Neurol Sci 97:295-323\nArticle\nCAS\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/510", "#/texts/511", "#/texts/512", "#/texts/513", "#/texts/514", "#/texts/515"], "page_nos": [], "uuid": "b71d5c66-31f6-453a-bbee-6b28a7b703e3"}
{"doc_id": "2025__A_comprehensive_review_on_novel_opportunities_for_Alzheimer_therapy_by_targeting__W4413033438", "source_path": "<redacted:source_path>", "chunk_id": 24, "source_chunk_idxs": [30], "num_tokens": 457, "text": "A comprehensive review on novel opportunities for Alzheimer therapy by targeting BIN1\nReferences\n43. Wischik CM, Novák M, Thøgersen HC, Edwards PC, Runswick MJ, Jakes R, Walker JE, Milstein C, Roth M, Klug A (1988) Isolation of a fragment of tau derived from the core of the paired helical filament of Alzheimer disease. Proc Natl Acad Sci 85(12):4506-4510\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n44. Brion JP, Passareiro H, Nunez J, Flament DJ (1985) Mise en évidence immunologique de la protéine tau au niveau des lésions de dégénérescence neurofibrillaire de la maladie d'Alzheimer. Archives de Biol 95:229-235\nGoogle Scholar\n45. Delacourte A, Defossez A (1986) Alzheimer's disease: tau proteins, the promoting factors of microtubule assembly, are major components of paired helical filaments. J Neurol Sci 76(2-3):173-186\nArticle\nCAS\nPubMed\nGoogle Scholar\n46. KoSIK KS, Joachim CL, Selkoe DJ (1986) Microtubule-associated protein tau (tau) is a major antigenic component of paired helical filaments in Alzheimer disease. Proc Natl Acad Sci 83(11):4044-4048\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n47. Kondo J, Honda T, Mori H, Hamada Y, Miura R, Ogawara M, Ihara Y (1988) The carboxyl third of tau is tightly bound to paired helical filaments. Neuron 1(9):827-834\nArticle\nCAS\nPubMed\nGoogle Scholar\n48. Wischik CM, Novak M, Edwards PC, Klug A, Tichelaar W, Crowther R (1988) Structural characterization of the core of the paired helical filament of Alzheimer disease. Proc Natl Acad Sci 85(13):4884-4888\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/516", "#/texts/517", "#/texts/518", "#/texts/519", "#/texts/520", "#/texts/521"], "page_nos": [], "uuid": "8a8aa1ec-99ad-4bf5-91f7-dcbd86f3889a"}
{"doc_id": "2025__A_comprehensive_review_on_novel_opportunities_for_Alzheimer_therapy_by_targeting__W4413033438", "source_path": "<redacted:source_path>", "chunk_id": 25, "source_chunk_idxs": [31], "num_tokens": 497, "text": "A comprehensive review on novel opportunities for Alzheimer therapy by targeting BIN1\nReferences\n49. Brion J-P, Power D, Hue R, Couck AM, Anderton BH, Flamment Durand J (1986) Heterogeneity of ubiquitin immunoreactivity in neurofibrillary tangles of Alzheimer's disease. Neurochem Int 14:121-128\nArticle\nGoogle Scholar\n50. Khachaturian ZS (1985) Diagnosis of Alzheimer's disease. Arc Neurol 42:1097-1105\nArticle\nCAS\nGoogle Scholar\n51. Mirra SS, Heyman A, Mckeel D, Sumi SM, Crain BJ, Brownlee LM, Vogel FS, Hughes JP, van Belle G, Berg L (1991) The consortium to establish a registry for alzheimer's disease (CERAD) Part II. Standardization of the neuropathologic assessment of Alzheimer's disease. Neurology 41:479-486\nArticle\nCAS\nPubMed\nGoogle Scholar\n52. Delaere P, Duyckaerts C, Brion JP, Poulain V, Hauw JJ (1989) Tau, paired helical filaments and amyloid in the neocortex: a morphometric study of 15 cases with graded intellectual status in aging and senile dementia of Alzheimer type. Acta Neuropathol (Berl). 77:645-653\nArticle\nCAS\nPubMed\nGoogle Scholar\n53. Arriagada PV, Growdon JH (1992) Hedley - Whyte ET,Hyman BT: Neurofibrillary tangles but not senile plaques parallel duration and severity of Alzheimer's disease. Neurology 42:631-639\nArticle\nCAS\nPubMed\nGoogle Scholar\n54. The National Institute on Aging and Reagan Institute working group on diagnostic criteria for the neuropathologic E assessment of Alzheimer's disease: Consensus recommendations for the postmortem diagnosis of Alzheimer's disease. Neurobiol Aging 1997; 18: S1-S2.\n55. Arnold SE, Hyman BT, Flory J (1991) The topographical and neuroanatomical distribution of neurofibrillary tangles and neuritic plaques in cerebral cortex of patients with Alzheimer's disease. Cereb Cortex 1:103-116\nArticle\nCAS\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/522", "#/texts/523", "#/texts/524", "#/texts/525", "#/texts/526", "#/texts/527", "#/texts/528"], "page_nos": [], "uuid": "087b1b82-2226-4bcb-8aa5-34e853d0c601"}
{"doc_id": "2025__A_comprehensive_review_on_novel_opportunities_for_Alzheimer_therapy_by_targeting__W4413033438", "source_path": "<redacted:source_path>", "chunk_id": 26, "source_chunk_idxs": [32], "num_tokens": 471, "text": "A comprehensive review on novel opportunities for Alzheimer therapy by targeting BIN1\nReferences\n56. Braak H, Braak E (1991) Neuropathological stageing of Alzheimer - related changes. Acta Neuropathol ( Berl). 82:239-259\nArticle\nCAS\nPubMed\nGoogle Scholar\n57. Duyckaerts C, Bennecib M, Grignon Y, Uchihara T, He Y, Piette F, Hauw JJ (1997) Modeling the relation between neurofibrillary tangles and intellectual status. Neurobiol Aging 18:267-273\nArticle\nCAS\nPubMed\nGoogle Scholar\n58. Brion JP, Resibois A (1994) A subset of calretinin - positive neurons are abnormal in Alzheimer's disease. Acta Neuropathol (Berl) 88:33-43\nArticle\nCAS\nPubMed\nGoogle Scholar\n59. Morrison JH, Hof PR (1997) Life and death of neurons in the aging brain. Science 278:412-419\nArticle\nCAS\nPubMed\nGoogle Scholar\n60. Glennon EB, Whitehouse IJ, Miners JS, Kehoe PG, Love S, Kellett KA, Hooper NM (2013) BIN1 is decreased in sporadic but not familial Alzheimer's disease or in aging. PLoS ONE 8(10):e78806\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n61. Fugier C, Klein AF, Hammer C, Vassilopoulous S, Ivarsson Y, Toussaint A et al (2011) Misregulated alternative splicing of Bin1 is associated with T tubule alternations and muscle weakness in myotonic dystrophy. Nat Med 17:720-725\nArticle\nCAS\nPubMed\nGoogle Scholar\n62. Wang Y, Wang J, Gao L, Lafyatis R, Stamm S, Andreadis A (2005) Tau exons 2 and 10, which are misregulated in neurodegenerative diseases, are partly regulated by silencers which bind a SRp30c· SRp55 complex that either recruits or antagonizes htra2β1. J Biol Chem 280(14):14230-14239\nArticle\nCAS\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/529", "#/texts/530", "#/texts/531", "#/texts/532", "#/texts/533", "#/texts/534", "#/texts/535"], "page_nos": [], "uuid": "b57f40c3-f75a-4c8c-8bfa-761c3a1c5597"}
{"doc_id": "2025__A_comprehensive_review_on_novel_opportunities_for_Alzheimer_therapy_by_targeting__W4413033438", "source_path": "<redacted:source_path>", "chunk_id": 27, "source_chunk_idxs": [33], "num_tokens": 503, "text": "A comprehensive review on novel opportunities for Alzheimer therapy by targeting BIN1\nReferences\n63. Leroy O, Wang J, Maurage CA, Parent M, Cooper T, Buée L, Sergeant N, Andreadis A, Caillet-Boudin ML (2006) Brain-specific change in alternative splicing of Tau exon 6 in myotonic dystrophy type 1. Biochimica et Biophysica Acta (BBA)-Molecular Basis of Disease 1762(4):460-7\n64. Dhaenens CM, Tran H, Frandemiche ML, Carpentier C, Schraen- Maschke S et al (2011) Mis- splicing of Tau exon 10 in myotonic dystrophy type 1 is reproduced by over expression of CRLF2 but not by MBNL silencing. Biochim Biophys Acta 1812:732-742\nArticle\nCAS\nPubMed\nGoogle Scholar\n65. Lee VM, Goedert M, Trojanowski JQ (2001) Neurodegenerative tauopathies. Annu Rev Neurosci 24(1):1121-1159\nArticle\nCAS\nPubMed\nGoogle Scholar\n66. Maurage CA, Udd B, Ruchoux MM, Vermersch P, Kalimo H, Krahe R, Delacourte A, Sergeant N (2005) Similar brain tau pathology in DM2/PROMM and DM1/Steinert disease. Neurology 65(10):1636-1638\nArticle\nCAS\nPubMed\nGoogle Scholar\n67. Minnerop M, Weber B, Schoene-Bake JC, Roeske S, Mirbach S, Anspach C, Schneider-Gold C, Betz RC, Helmstaedter C, Tittgemeyer M, Klockgether T (2011) The brain in myotonic dystrophy 1 and 2: evidence for a predominant white matter disease. Brain 134(12):3530-3546\nArticle\nPubMed\nGoogle Scholar\n68. Lusis AJ, Rajavashisth TB, Klisak I, Heinzmann C, Mohandas T, Sparkes RS (1990) Mapping of the gene for CNBP, a finger protein, to human chromosome 3q13. 3-q24. Genomics 8(2):411-414\nArticle\nCAS\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/536", "#/texts/537", "#/texts/538", "#/texts/539", "#/texts/540", "#/texts/541"], "page_nos": [], "uuid": "7e13a8d2-300d-4581-954a-4ea51ac4d3d3"}
{"doc_id": "2025__A_comprehensive_review_on_novel_opportunities_for_Alzheimer_therapy_by_targeting__W4413033438", "source_path": "<redacted:source_path>", "chunk_id": 28, "source_chunk_idxs": [34], "num_tokens": 484, "text": "A comprehensive review on novel opportunities for Alzheimer therapy by targeting BIN1\nReferences\n69. Braak H, Del Tredici K (2011) The pathological process underlying Alzheimer's disease in individuals under thirty. Acta Neuropathol 121:171-181\nArticle\nPubMed\nGoogle Scholar\n70. Nakamura K, Greenwood A, Binder L, Bigio EH, Denial S, Nicholson L, Zhou XZ, Lu KP (2012) Proline isomer-specific antibodies reveal the early pathogenic tau conformation in Alzheimer's disease. Cell 149(1):232-244\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n71. Himmelstein DS, Ward SM, Lancia JK, Patterson KR, Binder LI (2012) Tau as a therapeutic target in neurodegenerative disease. Pharmacol Therapeutics 136(1):8-22\nArticle\nCAS\nGoogle Scholar\n72. Meunier B, Quaranta M, Daviet L, Hatzoglou A, Leprince C (2009) The membrane-tubulating potential of amphiphysin 2/BIN1 is dependent on the microtubule-binding cytoplasmic linker protein 170 (CLIP-170). Eur J Cell Biol 88(2):91-102\nArticle\nCAS\nPubMed\nGoogle Scholar\n73. Weingarten MD, Lockwood AH (1975) HWo SH,Kirschner MW: a protein factor essential for microtubule assembly. Proc Natl Acad Sci USA 72:1858-1862\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n74. Goedert M, Spillantini MG, Cairns NJ, Crowther RA (1992) Tau proteins of Alzheimer paired helical filaments: abnormal phosphorylation of all six brain isoforms. Neuron 8:159-168\nArticle\nCAS\nPubMed\nGoogle Scholar\n75. Brion JP, Octave JN, Couck AM (1994) Distribution of the phosphorylated microtubule - associated protein tau in developing cortical neurons. Neuroscience 63:895-909\nArticle\nCAS\nPubMed\nGoogle Scholar\n76. Binder LI, Frankfurter A, Rebhun I (1985) The distribution of tau in the mammalian central nervous system. J Cell Biol 101:1371-1378\nArticle\nCAS\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/542", "#/texts/543", "#/texts/544", "#/texts/545", "#/texts/546", "#/texts/547", "#/texts/548", "#/texts/549"], "page_nos": [], "uuid": "34624998-f29e-45ce-8883-848718171396"}
{"doc_id": "2025__A_comprehensive_review_on_novel_opportunities_for_Alzheimer_therapy_by_targeting__W4413033438", "source_path": "<redacted:source_path>", "chunk_id": 29, "source_chunk_idxs": [35], "num_tokens": 468, "text": "A comprehensive review on novel opportunities for Alzheimer therapy by targeting BIN1\nReferences\n77. Brion JP, Guilleminot J, Couchie D, Nunez J (1988) Both adult and juvenile tau microtubule -associated proteins are axon specific in the developing and adult rat cerebellum. Neuroscience 25:139-146\nArticle\nCAS\nPubMed\nGoogle Scholar\n78. Tashiro K, Hasegawa M, Ihara Y, Iwatsubo T (1997) Somatodendritic localization of phosphorylated tau in neonatal and adult rat cerebral cortex. NeuroReport 8:2797-2801\nArticle\nCAS\nPubMed\nGoogle Scholar\n79. Perez-Nievas BG, Stein TD, Tai HC, Dols-Icardo O, Scotton TC, Barroeta - Espar I, et al (2013) Dissecting phenotypic traits linked to human resilience to Alzheimer's pathology. Brain 136:2510-2526\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n80. Ittner L, Ke MYD, Delerue F, Bi M, Gladbach A, van Eersel J et al (2010) Dendritic function of tau mediates amyloid - beta toxicity in Alzheimer's disease mouse models. Cell 142:387-397\nArticle\nCAS\nPubMed\nGoogle Scholar\n81. Li C, Gotz JB (2017) Somatodendritic accumulation of tau in Alzheimer's disease is promoted by Fyn- mediated local protein translation. EMBO J 36:3120-3138\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n82. Zhou L, Mclness J, Wierda K, Holt M, Herrmann AG, Jackson RJ et al (2017) Tau association with synaptic vesicles causes presynaptic dysfunction. Nat Commun 8:15295\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n83. McInnes J, Wierda K, Snellinx A, Bounit L, Wang YC, Stancu IC et al (2018) Synaptogyrin - 3 mediates presynaptic dysfunction induced by tau. Neuron 97:823-35.e8\nArticle\nCAS\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/550", "#/texts/551", "#/texts/552", "#/texts/553", "#/texts/554", "#/texts/555", "#/texts/556"], "page_nos": [], "uuid": "75946e5c-b754-48d8-8658-bb8c773f2b26"}
{"doc_id": "2025__A_comprehensive_review_on_novel_opportunities_for_Alzheimer_therapy_by_targeting__W4413033438", "source_path": "<redacted:source_path>", "chunk_id": 30, "source_chunk_idxs": [36], "num_tokens": 510, "text": "A comprehensive review on novel opportunities for Alzheimer therapy by targeting BIN1\nReferences\n84. Lasore A, Malki I, Cantrelle FX, Merzougri H, Boll E, Lambert JC, Landrieul, L (2018) Structural basis of tau interaction with BIN1 and regulation by tau phosphorylation. Front Mol Neurosci 11:421\nArticle\nGoogle Scholar\n85. Guo T, Nobel E, Hanger DP (2017) Roles of tau protein in health and disease. Acta Neuropathol 133:665-704\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n86. Yamada K (2017) Extracellular tau and its potential role in the propagation of tau pathology. Front Neurosci 11:667\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n87. Gomez -Ramos Diaz- Hernandez RubioMiras - PortugalAvila AMAMTJ (2008) Extracellular tau promotes intracellular calcium increase through M1 and M3 muscarine receptors in neuronal cells. Mol Cell Neurosci 37:673-681\nArticle\nGoogle Scholar\n88. Croft CL, Wade MA, Kurbatskaya K, Mastrandreas O, Hughes MM, Philips EC et al (2017) Membrane association and release of wild- type and pathological tau from organotypic brain slice cultures. Cell Death Dis 8:e2671-e2671\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n89. Yu CJ, Zheng MF, Kuang CX, Huang WD, Yang Q (2010) Oren-gedoku-to and its constituents with therapeutic potential in Alzheimer's disease inhibit indoleamine 2, 3-dioxygenase activity in vitro. J Alzheimer's Dis 22(1):257-266\nArticle\nCAS\nGoogle Scholar\n90. Anekonda TS, Quinn JF (2011) Calcium channel blocking as a therapeutic strategy for Alzheimer's disease: the case for isradipine. Biochimica et Biophysica Acta (BBA) Molecular Basis of Disease 1812 (12) 1584-90\n91. Bali J, Gheinani AH, Zurbriggen S, Rajendran L (2012) Role of genes linked to sporadic Alzheimer's disease risk in the production of beta- amyloid peptides. Proc Natl Acad Sci USA 109:15307-15311\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/557", "#/texts/558", "#/texts/559", "#/texts/560", "#/texts/561", "#/texts/562", "#/texts/563", "#/texts/564"], "page_nos": [], "uuid": "50692a92-0806-4986-95f7-035740b272d2"}
{"doc_id": "2025__A_comprehensive_review_on_novel_opportunities_for_Alzheimer_therapy_by_targeting__W4413033438", "source_path": "<redacted:source_path>", "chunk_id": 31, "source_chunk_idxs": [37], "num_tokens": 476, "text": "A comprehensive review on novel opportunities for Alzheimer therapy by targeting BIN1\nReferences\n92. Muller AJ, Baker JF, DuHadaway JB, Ge K, Farmer G, Donover PD et al (2003) Targeted distruption of the murine BIN1/; Amphiphysin ll gene does not disable endocytosis but results in embryonic cardiopathy with aberrant myofibril formation. Mol Cell Biol 23:4295-4306\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n93. LoPresti P, Szuchet S, Papasozomenos SC, Zinkowski RP, Binder LI (1995) Functional implications for the microtubule - associated protein tau: localization in oligodendrocytes. Proc Natl Acad Sci U S A 92:10369-10373\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n94. Klein C, Kramer EM, Cardine AM, Schraven B, Brandt R, Trotter J (2002) Process outgrowth of oligodendrocytes is promoted by interaction of fyn kinase with the cytoskeletal protein tau. J Neurosci 22:698-707\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n95. Hughes TM, Lopez OL, Evans RW et al (2014) Markers of cholesterol transport are associated with amyloid deposition in the brain. NEUROBIOL AGING 35:802-807\nArticle\nCAS\nPubMed\nGoogle Scholar\n96. Wang HG, Wan Y, Hao XK et al (2016) Brinding Integrator 1 (BIN1) Genotypes Mediate Alzheimer's Disease Risk by Altering Neuronal Degeneration. J Alzheimer Dis 52:179-190\nArticle\nGoogle Scholar\n97. Biffi A, Anderson CD, Desikan RS et al (2010) Genetic variation and neuroimaging measures in Alzheimer disease. Arc Neurol 67:677-685\nArticle\nGoogle Scholar\n98. Raj T, Shulman JM, Keenan BT et al (2012) Alzheimer disease susceptibility loci:evidence for a protein network under natural selection. Am J Hum Genet 90:720-726\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\nDownload references", "doc_items_refs": ["#/texts/565", "#/texts/566", "#/texts/567", "#/texts/568", "#/texts/569", "#/texts/570", "#/texts/571", "#/texts/572"], "page_nos": [], "uuid": "9d0d96d1-6ee5-487f-8451-8ccf877650f1"}
{"doc_id": "2025__A_comprehensive_review_on_novel_opportunities_for_Alzheimer_therapy_by_targeting__W4413033438", "source_path": "<redacted:source_path>", "chunk_id": 32, "source_chunk_idxs": [38, 39, 40, 41, 42, 43, 44], "num_tokens": 274, "text": "A comprehensive review on novel opportunities for Alzheimer therapy by targeting BIN1\nAcknowledgements\nNot applicable.\n\nA comprehensive review on novel opportunities for Alzheimer therapy by targeting BIN1\nFunding\nNone.\n\nA comprehensive review on novel opportunities for Alzheimer therapy by targeting BIN1\nAuthor information\nAuthors and Affiliations\n1. Department of Pharmaceutical Chemistry, School of Pharmacy, Techno India University, West Bengal, Kolkata, 700091, India Trina Saha &amp; Dipanjan Karati\nAuthors\n1. Trina Saha\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n2. Dipanjan Karati\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n\nA comprehensive review on novel opportunities for Alzheimer therapy by targeting BIN1\nAuthor information\nContributions\nWe declare that this work was done by the authors named in this article: Dipanjan Karati designed the study. Trina Ssha wrote the paper. Dipanjan Karati drew figures. Dipanjan Karati drafted the manuscript. All authors have read and approved the final manuscript.\n\nA comprehensive review on novel opportunities for Alzheimer therapy by targeting BIN1\nAuthor information\nCorresponding author\nCorrespondence to\nDipanjan Karati\n.\n\nA comprehensive review on novel opportunities for Alzheimer therapy by targeting BIN1\nEthics declarations\nEthics approval and consent to participate\nNot applicable.\n\nA comprehensive review on novel opportunities for Alzheimer therapy by targeting BIN1\nEthics declarations\nConsent for publication\nNot applicable.", "doc_items_refs": ["#/texts/574", "#/texts/576", "#/texts/579", "#/texts/580", "#/texts/581", "#/texts/582", "#/texts/584", "#/texts/586", "#/texts/587", "#/texts/588", "#/texts/591", "#/texts/593"], "page_nos": [], "uuid": "0f95c09d-db94-4673-b500-2ad8011d2132"}
{"doc_id": "2025__A_comprehensive_review_on_novel_opportunities_for_Alzheimer_therapy_by_targeting__W4413033438", "source_path": "<redacted:source_path>", "chunk_id": 33, "source_chunk_idxs": [45, 46, 47, 48, 49], "num_tokens": 428, "text": "A comprehensive review on novel opportunities for Alzheimer therapy by targeting BIN1\nEthics declarations\nCompeting interests\nNot applicable.\n\nA comprehensive review on novel opportunities for Alzheimer therapy by targeting BIN1\nAdditional information\nPublisher's Note\nSpringer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations.\n\nA comprehensive review on novel opportunities for Alzheimer therapy by targeting BIN1\nRights and permissions\nOpen Access\nThis article is licensed under a Creative Commons Attribution 4.0 International License, which permits use, sharing, adaptation, distribution and reproduction in any medium or format, as long as you give appropriate credit to the original author(s) and the source, provide a link to the Creative Commons licence, and indicate if changes were made. The images or other third party material in this article are included in the article's Creative Commons licence, unless indicated otherwise in a credit line to the material. If material is not included in the article's Creative Commons licence and your intended use is not permitted by statutory regulation or exceeds the permitted use, you will need to obtain permission directly from the copyright holder. To view a copy of this licence, visit\nhttp://creativecommons.org/licenses/by/4.0/\n.\nReprints and permissions\n\nA comprehensive review on novel opportunities for Alzheimer therapy by targeting BIN1\nAbout this article\nCite this article\nSaha, T., Karati, D. A comprehensive review on novel opportunities for Alzheimer therapy by targeting BIN1.\nEgypt J Med Hum Genet\n26\n, 134 (2025). https://doi.org/10.1186/s43042-025-00759-8\nDownload citation\n- Received : 26 January 2025\n- Accepted : 24 July 2025\n- Published : 07 August 2025\n- DOI : https://doi.org/10.1186/s43042-025-00759-8\n\nA comprehensive review on novel opportunities for Alzheimer therapy by targeting BIN1\nAbout this article\nKeywords\n- Alzheimer disease\n- BIN1\n- LOAD\n- APOE\n- Neuronal isoform\n- Tau pathology\nDownload PDF\nAdvertisement", "doc_items_refs": ["#/texts/595", "#/texts/598", "#/texts/600", "#/texts/601", "#/texts/602", "#/texts/603", "#/texts/604", "#/texts/607", "#/texts/608", "#/texts/609", "#/texts/610", "#/texts/611", "#/texts/612", "#/texts/613", "#/texts/614", "#/texts/615", "#/texts/617", "#/texts/618", "#/texts/619", "#/texts/620", "#/texts/621", "#/texts/622", "#/texts/623", "#/texts/624"], "page_nos": [], "uuid": "7b7c61c8-f2bf-41a7-9519-2722ad497488"}
