{"doc_id": "2025__Emotional_intelligence_as_a_mediator_of_anxiety_and_role_ambiguity_among_nurses___W4412157161", "source_path": "<redacted:source_path>", "chunk_id": 0, "source_chunk_idxs": [0, 1, 2], "num_tokens": 323, "text": "Emotional intelligence as a mediator of anxiety and role ambiguity among nurses caring for critically ill geriatric patients | BMC Nursing | Full Text\nSkip to main content\nAdvertisement\nSearch\n- Explore journals\n- Get published\n- About BMC\n- My account\nSearch all BMC articles\nSearch\nBMC Nursing\n- Home\n- About\n- Articles\n- Submission Guidelines\n- Collections\n- Join the board\n- Submit manuscript\nEmotional intelligence as a mediator of anxiety and role ambiguity among nurses caring for critically ill geriatric patients\nDownload PDF\nDownload PDF\n- Research\n- Open access\n- Published: 08 July 2025\n\nEmotional intelligence as a mediator of anxiety and role ambiguity among nurses caring for critically ill geriatric patients\n- Asmaa Mahmoud Ali Ibrahim\n1\n,\n- Nadia Abdelnasser\n2\n,\n- Mohamoud Abdelwahab Khedr\nORCID: orcid.org/0000-0003-3437-3764\n3\n&amp;\n- ...\n- Eman Mahmoud Mohammed Shoukr\n1\n,\n4\nShow authors\nBMC Nursing\nvolume 24\n, Article number: 885 ( 2025 )\nCite this article\n- 880 Accesses\n- Metrics details\n\nEmotional intelligence as a mediator of anxiety and role ambiguity among nurses caring for critically ill geriatric patients\nAbstract\nBackground\nCritical care nurses caring for critically ill geriatric patients face pressures, including anxiety and role ambiguity, impairing their ability to do their jobs. In critical care settings, geriatric patients present special challenges due to their complex medical issues, frailty, cognitive impairments (such as dementia or delirium), and age-related elevated risks.", "doc_items_refs": ["#/texts/1", "#/texts/2", "#/texts/3", "#/texts/4", "#/texts/5", "#/texts/6", "#/texts/7", "#/texts/8", "#/texts/9", "#/texts/10", "#/texts/11", "#/texts/12", "#/texts/13", "#/texts/14", "#/texts/15", "#/texts/16", "#/texts/17", "#/texts/18", "#/texts/19", "#/texts/20", "#/texts/21", "#/texts/22", "#/texts/23", "#/texts/25", "#/texts/26", "#/texts/27", "#/texts/28", "#/texts/29", "#/texts/30", "#/texts/31", "#/texts/32", "#/texts/33", "#/texts/34", "#/texts/35", "#/texts/36", "#/texts/39"], "page_nos": [], "uuid": "05d06792-d056-4fd8-8e92-c3634f6bb78a"}
{"doc_id": "2025__Emotional_intelligence_as_a_mediator_of_anxiety_and_role_ambiguity_among_nurses___W4412157161", "source_path": "<redacted:source_path>", "chunk_id": 1, "source_chunk_idxs": [3, 4, 5, 6, 7], "num_tokens": 378, "text": "Emotional intelligence as a mediator of anxiety and role ambiguity among nurses caring for critically ill geriatric patients\nAbstract\nAim\nInvestigate the role of emotional intelligence as a mediator between anxiety and role ambiguity among nurses caring for critically ill geriatric patients.\n\nEmotional intelligence as a mediator of anxiety and role ambiguity among nurses caring for critically ill geriatric patients\nAbstract\nMethods\nA descriptive correlational analytical research design was followed. The study subjects were selected using the purposive sampling technique and involved 250 Intensive care units at South Valley University hospitals in Qena City, Egypt. Four tools were used for data collection: sociodemographic and occupational data of critical care nurses, the Wong and Law Emotional Intelligence Scale (WLEIS), the Generalized Anxiety Disorder 7-item (GAD-7), and Job Role ambiguity.\n\nEmotional intelligence as a mediator of anxiety and role ambiguity among nurses caring for critically ill geriatric patients\nAbstract\nResults\nThe study reported a significant negative relationship between ICU nurses' emotional intelligence and anxiety level (\nr\n=-0.366, and\nP\n= 0.000), and a positive relationship between emotional intelligence and role ambiguity (\nr\n=-0.630, and\nP\n= 0.000), while a negative relationship was observed between anxiety and role ambiguity (\nr\n=-0.327, and\nP\n= 0.000).\n\nEmotional intelligence as a mediator of anxiety and role ambiguity among nurses caring for critically ill geriatric patients\nAbstract\nConclusion\nThe study highlights the importance of emotional intelligence in managing anxiety and role ambiguity among nurses caring for critically ill geriatric patients. Fostering emotional intelligence can improve job satisfaction, job well-being, and patient care quality by clarifying role expectations.\n\nEmotional intelligence as a mediator of anxiety and role ambiguity among nurses caring for critically ill geriatric patients\nAbstract\nClinical trial number\nNot applicable.\nPeer Review reports", "doc_items_refs": ["#/texts/41", "#/texts/43", "#/texts/45", "#/texts/46", "#/texts/47", "#/texts/48", "#/texts/49", "#/texts/50", "#/texts/51", "#/texts/52", "#/texts/53", "#/texts/54", "#/texts/55", "#/texts/56", "#/texts/57", "#/texts/59", "#/texts/61", "#/texts/62"], "page_nos": [], "uuid": "035a9579-ed83-4c1f-9281-ee678896441b"}
{"doc_id": "2025__Emotional_intelligence_as_a_mediator_of_anxiety_and_role_ambiguity_among_nurses___W4412157161", "source_path": "<redacted:source_path>", "chunk_id": 2, "source_chunk_idxs": [8], "num_tokens": 470, "text": "Emotional intelligence as a mediator of anxiety and role ambiguity among nurses caring for critically ill geriatric patients\nIntroduction\nThe healthcare setting, particularly in intensive care units (ICUs), may be emotionally and psychologically stressful for nurses, especially when caring for geriatric patients who are in critical condition. Geriatric patients in critical care settings pose unique challenges because of their complicated medical problems, fragility, cognitive impairments (such as dementia or delirium), and the increased risks that come with age. In addition, end-of-life care, moral conundrums, and communicating with family members about the prognosis and care objectives sometimes provide emotional difficulties for nurses [\n1\n]. ICU nurses may experience severe stress due to these variables, which can negatively affect their well-being, job performance, and the standard of critically ill geriatric patient care by causing feelings of anxiety and role ambiguity [\n2\n,\n3\n].\nThe Job Demands-Resources (JD-R) paradigm, which contends that personal resources, such as emotional intelligence (EI), assist in counteracting the impacts of job demands, such as role ambiguity, on psychological strain, is used to support the theoretical underpinnings of this study. Emotional intelligence (EI) serves as a psychological tool that helps nurses recognize, comprehend, and successfully handle emotional difficulties in high-stress settings such as essential geriatric care, which in turn lessens anxiety associated with job ambiguity. Thus, by placing the JD-R model inside a well-established occupational stress framework, it strengthens the conceptual contribution of this research and validates the suggested mediating function of EI [\n4\n,\n5\n].\nGlobally, Anxiety disorders cost 2.08% of worldwide healthcare spending annually, making them a serious public health concern [\n6\n]. Nursing professionals, including ICU nurses, have anxiety disorders to differing degrees and in different nations [\n7\n]. According to a prospective longitudinal study, 50% of medical personnel, particularly critical care unit nurses, reported experiencing substantial levels of anxiety during the Italian COVID-19 pandemic [\n8\n]. In Oman, 34.8% of ICU nurses faced anxiety disorders, while in China [\n9\n], 22.3% of ICU nurses reported experiencing anxiety [\n10\n].", "doc_items_refs": ["#/texts/64", "#/texts/65", "#/texts/66", "#/texts/67", "#/texts/68", "#/texts/69", "#/texts/70", "#/texts/71", "#/texts/72", "#/texts/73", "#/texts/74", "#/texts/75", "#/texts/76", "#/texts/77", "#/texts/78", "#/texts/79", "#/texts/80", "#/texts/81", "#/texts/82", "#/texts/83", "#/texts/84", "#/texts/85", "#/texts/86"], "page_nos": [], "uuid": "a5be171b-59ad-4425-9e82-19060883c939"}
{"doc_id": "2025__Emotional_intelligence_as_a_mediator_of_anxiety_and_role_ambiguity_among_nurses___W4412157161", "source_path": "<redacted:source_path>", "chunk_id": 3, "source_chunk_idxs": [9], "num_tokens": 385, "text": "Emotional intelligence as a mediator of anxiety and role ambiguity among nurses caring for critically ill geriatric patients\nIntroduction\nAnxiety among healthcare professionals, including ICU nurses, can manifest as a response to multiple reasons, such as the ongoing stress of caring for critically ill geriatric patients, dealing with high death rates, and navigating the uncertainty surrounding patients' prognosis [\n11\n,\n12\n]. Anxiety can contribute to decreased job satisfaction and burnout by affecting communication, emotional resilience, and cognitive functioning. Uncontrolled anxiety has been found to have a detrimental impact on nurses' quality of life, ability to concentrate, and ability to make decisions [\n13\n,\n14\n,\n15\n]. The most prevalent and significant element influencing anxiety at work in nursing practice is role ambiguity [\n16\n]. Role ambiguity is characterized as a state in which nurses lack clarity regarding their job duties, expectations, and boundaries. This condition can cause confusion, stress, and reduced work effectiveness [\n17\n].\nRole ambiguity in the workplace may result from the growing and more complicated duties that nurses currently perform. Uncertainty over nurses' obligations has resulted from overlapping or contradictory tasks and responsibilities and inadequate communication within multidisciplinary healthcare teams [\n18\n,\n19\n]. However, additional factors that contribute to ambiguity in ICU nurses' roles include the absence of knowledge regarding managing critically ill geriatric patients' diseases, the unclear needs of supervisors, and the possible expectations of coworkers [\n20\n]. Additionally, role ambiguity is positively correlated with anxiety, stress, and burnout, according to several research studies [\n21\n,\n22\n]. Role ambiguity adversely affects nurses' mental health because it hinders the efficient execution of tasks, leading to unpleasant feelings, including irritation and worry. Although role ambiguity and anxiety have been investigated previously, the relationship between role ambiguity and anxiety among critical care unit nurses has not received significant attention [\n20\n,\n23\n].", "doc_items_refs": ["#/texts/87", "#/texts/88", "#/texts/89", "#/texts/90", "#/texts/91", "#/texts/92", "#/texts/93", "#/texts/94", "#/texts/95", "#/texts/96", "#/texts/97", "#/texts/98", "#/texts/99", "#/texts/100", "#/texts/101", "#/texts/102", "#/texts/103", "#/texts/104", "#/texts/105", "#/texts/106", "#/texts/107", "#/texts/108", "#/texts/109", "#/texts/110", "#/texts/111", "#/texts/112", "#/texts/113", "#/texts/114", "#/texts/115", "#/texts/116"], "page_nos": [], "uuid": "d51b8a56-9710-45cb-94a7-e944ed05434f"}
{"doc_id": "2025__Emotional_intelligence_as_a_mediator_of_anxiety_and_role_ambiguity_among_nurses___W4412157161", "source_path": "<redacted:source_path>", "chunk_id": 4, "source_chunk_idxs": [10], "num_tokens": 430, "text": "Emotional intelligence as a mediator of anxiety and role ambiguity among nurses caring for critically ill geriatric patients\nIntroduction\nEmotional Intelligence (EI), defined as the ability to identify, comprehend, control, and affect one's own emotions and those of others, has become a viable defense against the detrimental effects of role ambiguity and anxiety [\n24\n]. EI is essential for ICU nurses caring for critically ill geriatric patients because it helps them better control their emotions, build stronger connections with others, communicate more effectively, cope with stress, and handle job demands. High emotional intelligence ICU nurses are more capable of demonstrating empathy, managing psychological and emotional difficulties, and making wise choices in emergencies [\n25\n]. Numerous researchers have found a strong correlation between emotional intelligence, mental health, and subjective well-being [\n26\n,\n27\n]. According to a longitudinal study's findings, emotional intelligence may help healthcare professionals feel less anxious during stressful situations, such as the COVID-19 pandemic [\n28\n]. Furthermore, emotional intelligence can decrease the negative effects of role ambiguity. Research conducted in Indonesia revealed that emotional intelligence minimized the influence of role ambiguity on employee burnout [\n29\n].\nWhereas previous studies have addressed the impact of role ambiguity and anxiety among ICU nurses, the majority have focused on general nursing populations and ignored psychological mechanisms that may explain this relationship. In particular, the mediating role of EI has received limited attention, especially in the context of geriatric critical care, which presents unique emotional and ethical demands. This study fills this gap by examining Emotional Intelligence (EI) as a mediator between role ambiguity and anxiety among nurses caring for critically ill older adults, offering a novel contribution grounded in the Job Demands-Resources model [\n30\n,\n31\n]. Additionally, there are some studies on anxiety and role ambiguity [\n1\n,\n2\n]. Nevertheless, there is a dearth of studies on how role ambiguity and emotional intelligence affect anxiety in an intensive care unit. Thus, the current study aims to examine emotional intelligence as a mediator of anxiety and role ambiguity among nurses caring for critically ill geriatric patients.", "doc_items_refs": ["#/texts/117", "#/texts/118", "#/texts/119", "#/texts/120", "#/texts/121", "#/texts/122", "#/texts/123", "#/texts/124", "#/texts/125", "#/texts/126", "#/texts/127", "#/texts/128", "#/texts/129", "#/texts/130", "#/texts/131", "#/texts/132", "#/texts/133", "#/texts/134", "#/texts/135", "#/texts/136", "#/texts/137", "#/texts/138"], "page_nos": [], "uuid": "a2abb3b9-809b-4dd1-b09d-75f0757e25ed"}
{"doc_id": "2025__Emotional_intelligence_as_a_mediator_of_anxiety_and_role_ambiguity_among_nurses___W4412157161", "source_path": "<redacted:source_path>", "chunk_id": 5, "source_chunk_idxs": [11, 12], "num_tokens": 327, "text": "Emotional intelligence as a mediator of anxiety and role ambiguity among nurses caring for critically ill geriatric patients\nMethods\nParticipants\nA descriptive correlational analytical research design was used. The data was collected from Intensive Care Units at South Valley University (SVU) hospitals in Qena City, Egypt. Data collection began in early November and finished at the end of December 2024. South Valley University hospitals are the largest teaching hospitals in Qena city. They consist of three different buildings. The hospitals offer the following medical services: cardiology, neurology, urology, surgery, emergency, and trauma for Qena, Luxor, and Red Sea Governorate populations. These hospitals have the greatest daily attendance and total number of members in comparison to other hospitals in Qena City.\n\nEmotional intelligence as a mediator of anxiety and role ambiguity among nurses caring for critically ill geriatric patients\nMethods\nSample size\nWe estimated the required sample size for the study using G*Power Windows 3.1.9.7 software, applying parameters such as one group, two predictors, a significance level of 0.05 to control the probability of a Type I error, an effect size of 0.5, and a desired power of 0.95 to minimize the probability of a Type II error. The analysis determined a minimum sample size of 227 participants; however, we increased this to 250 during data collection to account for a 10% non-response rate. Nurses were selected based on specific inclusion criteria, which included being an intensive care unit nurse, working with older adults, having at least one year of professional experience, and being willing to participate in the study.", "doc_items_refs": ["#/texts/141", "#/texts/143"], "page_nos": [], "uuid": "9567ee39-9a5a-4e10-a767-f33b621d6498"}
{"doc_id": "2025__Emotional_intelligence_as_a_mediator_of_anxiety_and_role_ambiguity_among_nurses___W4412157161", "source_path": "<redacted:source_path>", "chunk_id": 6, "source_chunk_idxs": [13, 14, 15], "num_tokens": 246, "text": "Emotional intelligence as a mediator of anxiety and role ambiguity among nurses caring for critically ill geriatric patients\nMethods\nRecruitment process\nThe study invited approximately 277 ICU nurses to participate, but 10 were excluded due to having less than 1 year of professional experience. Additionally, nine nurses refused to participate, eight accepted but did not complete all the questionnaires and withdrew from the study\n(\nFig.\n1\n)\n. After the selection of nurses according to the inclusion criteria, the researcher formulated a questionnaire using the Google form and contacted participants using the WhatsApp application to send the questionnaire link. Google Forms responses are stored in a worksheet that can only be accessed through a Google account login.\nFig. 1\n\nEmotional intelligence as a mediator of anxiety and role ambiguity among nurses caring for critically ill geriatric patients\nMethods\nStudy tools\nTo gather the required data, four instruments were used as follows:\n\nEmotional intelligence as a mediator of anxiety and role ambiguity among nurses caring for critically ill geriatric patients\nMethods\nStudy tools\nSociodemographic and occupational data of critical care nurses\nThe researchers developed it and included the following data about critical care nurses: age, sex, marital status, level of education, profession, and ICU experience.", "doc_items_refs": ["#/texts/145", "#/texts/146", "#/texts/147", "#/texts/148", "#/texts/149", "#/texts/150", "#/texts/151", "#/texts/153", "#/texts/155"], "page_nos": [], "uuid": "ffcd910e-78df-4f29-8187-24a9b4f40588"}
{"doc_id": "2025__Emotional_intelligence_as_a_mediator_of_anxiety_and_role_ambiguity_among_nurses___W4412157161", "source_path": "<redacted:source_path>", "chunk_id": 7, "source_chunk_idxs": [16, 17], "num_tokens": 481, "text": "Emotional intelligence as a mediator of anxiety and role ambiguity among nurses caring for critically ill geriatric patients\nMethods\nStudy tools\nWong and law emotional intelligence scale (WLEIS)\nEmotional Intelligence was measured by Wong and Law's Emotional Intelligence Scale (WLEIS), a self-report measure developed by Law et al. 2004 [\n32\n]. It is a short 16-item measure of emotional intelligence. It consisted of four dimensions: [\n1\n] self-emotional appraisal (SEA) [\n2\n], others' emotional appraisal (OEA) [\n3\n], use of emotion (UOE), and [\n4\n] regulation of emotion (ROE). It is a seven-point Likert scale, and its score ranged from strongly disagree = 1, disagree = 2, slightly disagree = 3, neither agree nor disagree = 4, strongly agree 5, agree = 6, and slightly agree = 7. The score ranged from 16 to 112. For each dimension, a score from four to twelve is considered mild, a score from 13 to 20 is considered moderate, and a score from 21 to 28 is considered high. As regards the total level of emotional intelligence, 16 to 48 are considered mild, 49 to 80 are considered moderate, and 81 to 122 are considered high levels of emotional intelligence. This scale had a Cronbach's alpha coefficient of 0.862, indicating strong internal consistency.\n\nEmotional intelligence as a mediator of anxiety and role ambiguity among nurses caring for critically ill geriatric patients\nMethods\nStudy tools\nGeneralized anxiety disorder 7-item (GAD-7)\nThe GAD-7 was developed by Spitzer et al. (2006) [\n33\n], with an educational grant from Pfizer Inc. Scoring GAD-7 Anxiety Severity is calculated by assigning scores of 0, 1, 2, and 3 to the response categories, respectively, of \"not at all,\" \"several days,\" \"more than half the days,\" and \"nearly every day.\" GAD-7 total score for the seven items ranges from 0 to 21.\nMinimal anxiety ranges from zero to four, mild anxiety ranges from five to nine, moderate anxiety ranges from 10 to 14, and severe anxiety ranges from 15 to 21. With an alpha of 0.885, the Arabic version of the GAD-7 showed good dependability.", "doc_items_refs": ["#/texts/157", "#/texts/158", "#/texts/159", "#/texts/160", "#/texts/161", "#/texts/162", "#/texts/163", "#/texts/164", "#/texts/165", "#/texts/166", "#/texts/167", "#/texts/169", "#/texts/170", "#/texts/171", "#/texts/172"], "page_nos": [], "uuid": "5da6b972-3349-4b6c-82f0-7bc0a196ee2d"}
{"doc_id": "2025__Emotional_intelligence_as_a_mediator_of_anxiety_and_role_ambiguity_among_nurses___W4412157161", "source_path": "<redacted:source_path>", "chunk_id": 8, "source_chunk_idxs": [18], "num_tokens": 298, "text": "Emotional intelligence as a mediator of anxiety and role ambiguity among nurses caring for critically ill geriatric patients\nMethods\nStudy tools\nJob role ambiguity\nThis tool, known as Job Role Ambiguity, conceptualized by Breaugh and Colihan (1994), encompasses nine items that assess role ambiguity across three distinct domains: [\n1\n] work methods, characterized as the lack of clarity that employees experience regarding the appropriate techniques to employ for job execution; [\n2\n] work scheduling, characterized as the uncertainty surrounding the order in which tasks should be completed, the distribution of time allocated to those tasks, and the sequence for undertaking specific activities; and [\n3\n] performance evaluation, characterized as the ambiguity employees face relating to the criteria utilized for evaluating and determining the adequacy of job performance [\n34\n]. Data collection is facilitated through a 7-point Likert-type scale, wherein a score of 1 corresponds to strong disagreement and a score of 7 indicates strong agreement (lower scores are indicative of elevated levels of ambiguity). For each area, a score from three to nine is considered low, a score from 10 to 15 is considered moderate, and a score from 16 to 21 is considered high. Job Role ambiguity total score for the nine items ranges from nine to 63. Regarding the overall degree of job Role ambiguity, nine to 27 is low, 28 to 45 is moderate, and 46 to 63 is high [\n34\n]. The Job Role Ambiguity revealed excellent reliability with an alpha of 0.907.", "doc_items_refs": ["#/texts/174", "#/texts/175", "#/texts/176", "#/texts/177", "#/texts/178", "#/texts/179", "#/texts/180", "#/texts/181", "#/texts/182", "#/texts/183", "#/texts/184"], "page_nos": [], "uuid": "7b715d0c-f875-4449-bd46-6e9738b14387"}
{"doc_id": "2025__Emotional_intelligence_as_a_mediator_of_anxiety_and_role_ambiguity_among_nurses___W4412157161", "source_path": "<redacted:source_path>", "chunk_id": 9, "source_chunk_idxs": [19, 20], "num_tokens": 336, "text": "Emotional intelligence as a mediator of anxiety and role ambiguity among nurses caring for critically ill geriatric patients\nMethods\nEthical considerations\nThe study received ethical approval from South Valley University's Faculty of Nursing Research Ethics Committee (code: SVU-NUR-GER-21-5-11-2024). After that, the researchers submitted a request outlining the aim of the study to the SVU hospital authorities, who granted them approval. All participants involved in the study provided signed informed consent forms, confirming their willingness to participate. The researchers conveyed to the participants that their involvement was completely voluntary and that they had the right to withdraw at any moment without facing any consequences. The confidentiality of the data gathered was guaranteed. It strictly adhered to the ethical principles set forth in the Helsinki Declaration to maintain the integrity of the research.\n\nEmotional intelligence as a mediator of anxiety and role ambiguity among nurses caring for critically ill geriatric patients\nMethods\nValidity and reliability\nThe WLEIS, GAD-7, and Job Role Ambiguity scales were translated into Arabic. Each item in each tool was translated from English to Arabic, and after finishing the translation, the Arabic language Consultant revised and edited all tools to confirm Arabic language simplicity and clarity. The validity was evaluated by five experts in the fields of Gerontological, Psychiatric, and Mental Health Nursing. The content's Lawshe Content Validity Ratio, which was found to be more than 0.99, ensured the tools' correctness, clarity, relevance, and applicability. Additionally, a pilot study with 25 intensive care unit nurses assessed the practicality and clarity of the research measures, confirming that no changes were necessary.", "doc_items_refs": ["#/texts/186", "#/texts/188"], "page_nos": [], "uuid": "67f5fd14-ec52-49c6-b03f-3c25b937039e"}
{"doc_id": "2025__Emotional_intelligence_as_a_mediator_of_anxiety_and_role_ambiguity_among_nurses___W4412157161", "source_path": "<redacted:source_path>", "chunk_id": 10, "source_chunk_idxs": [21], "num_tokens": 242, "text": "Emotional intelligence as a mediator of anxiety and role ambiguity among nurses caring for critically ill geriatric patients\nMethods\nStatistical analysis\nThe statistical package for social sciences, IBM SPSS-26, was used to examine the quantitative data from this study. Descriptive statistics, which included counts, percentages, averages, standard deviations, and minimum and maximum values, gave an overview of the data. Cronbach's Alpha was used to assess the study tools' reliability.\nTo examine the correlations between two quantitative variables, the Pearson correlation coefficient was employed. Additionally, using the SPSS-AMOS software, standardized regression weights, standard error (SE), and critical ratio (CR) were calculated to evaluate the direct and indirect relationships between anxiety and role ambiguity, which were mediated by emotional intelligence. Several goodness-of-fit statistics, including chi-square, the comparative fit index (CFI), the incremental fit index (IFI), and the root mean square error of approximation (RMSEA), were used to assess the model fit [\n10\n]. In this study, p-values were considered statistically significant if they fell within the range of 0.05 and 0.01.", "doc_items_refs": ["#/texts/190", "#/texts/191", "#/texts/192", "#/texts/193"], "page_nos": [], "uuid": "2c4ab740-dc82-4e05-96df-f28bb89554ca"}
{"doc_id": "2025__Emotional_intelligence_as_a_mediator_of_anxiety_and_role_ambiguity_among_nurses___W4412157161", "source_path": "<redacted:source_path>", "chunk_id": 11, "source_chunk_idxs": [22], "num_tokens": 471, "text": "Emotional intelligence as a mediator of anxiety and role ambiguity among nurses caring for critically ill geriatric patients\nResults\nTable\n1\nreveals socio-demographic and occupational data of critical care nurses. This table shows that 58.0% of nurses aged from 20 to less than 30 years, while 37.2% of them aged from 30 to less than 40 years, with a mean of 29.34 ± 5.432 years. As for sex, this table reveals that females constituted 79.2% of the studied nurses. Regarding marital status, 65.2% of the studied nurses were married, and 30.4% were single. In terms of education, 60% of the nurses studied were nursing technicians, compared to 31.6% of those with bachelor's degrees. Regarding their shift, 53.2% of the studied nurses reported working alternatively between three shifts. Additionally, 95.2% and 70.0% of the studied nurses reported having less than 10 years of ICU and nursing profession experience, respectively.\nTable\n2\nillustrates the distribution of the studied ICU nurses according to their emotional intelligence, which is explained under four subscales. Self-emotion appraisal is the first subscale; this table shows that 64.4% of the studied nurses reported having high self-emotion appraisal with a mean of 21.42 (4.131). The second and the third subscales are emotion regulation and use of emotion; it is noticed from this table that the studied nurses had high emotion regulation with a mean of 21.94 (3.541) and a mean of 23.05 (3.67) use of emotion. On the other hand, the fourth emotional intelligence subscale is others' emotion appraisal, in which the studied nurses reported having a mean of 20.30 (3.967). Regarding emotional intelligence, this table reveals that 72.4% of the nurses studied had high emotional intelligence.\nTable\n3\nreveals the distribution of the studied ICU nurses according to their reported anxiety level. This table explains that 46.4% and 22.4% of the studied nurses reported having mild and minimal anxiety levels. On the other hand, moderate and severe anxiety levels were prevalent among 21.6% and 9.6% of the studied ICU nurses.", "doc_items_refs": ["#/texts/195", "#/texts/196", "#/texts/197", "#/texts/198", "#/texts/199", "#/texts/200", "#/texts/201", "#/texts/202", "#/texts/203"], "page_nos": [], "uuid": "e7a08ff8-bee0-44a1-8135-fafa9540ca76"}
{"doc_id": "2025__Emotional_intelligence_as_a_mediator_of_anxiety_and_role_ambiguity_among_nurses___W4412157161", "source_path": "<redacted:source_path>", "chunk_id": 12, "source_chunk_idxs": [23], "num_tokens": 456, "text": "Emotional intelligence as a mediator of anxiety and role ambiguity among nurses caring for critically ill geriatric patients\nResults\nTable\n4\ndescribes how the ICU nurses in the study were distributed based on their role ambiguity. According to this table, 80.4% of the studied nurses reported having mild work method ambiguity. On the other hand, 79.6% and 70.4% of the studied ICU nurses reported low scheduling and performance ambiguity. Regarding total role ambiguity, 78.8% of the studied ICU nurses reported having a low level, with a mean of 51.61 (7.101).\nTable\n5\npresents the correlation between the studied ICU nurses' emotional intelligence, anxiety, and role ambiguity. This table shows that there is a statistically significant negative relationship found between the studied ICU nurses' emotional intelligence and anxiety level (\nr\n=-0.366,\nP\n= 0.000). Furthermore, it is noticed from this table that a statistically significant negative relationship was found between the studied ICU nurses' anxiety level and role ambiguity (as a higher score in the role ambiguity scale reflects less job ambiguity) (\nr\n=-0.327, and\nP\n= 0.000). Moreover, a statistically significant positive relationship was found between the studied ICU nurses' emotional intelligence and role ambiguity (\nr\n=-0.630,\nP\n= 0.000).\nTable\n6\nillustrates a multiple linear regression between the nurses' emotional intelligence, anxiety, and role ambiguity. It is noticed from this table that the regression model yielded a value of 8.765 (\nP\n= 0.024), reflecting a statistically significant relationship. Furthermore, this table shows that both emotional intelligence and role ambiguity impact ICU nurses' anxiety levels, explaining 10.6% and 12.4% of the variance, respectively. Additionally, the ANOVA results confirm the model validity as (F = 17.633,\nP\n= 0.000). The model equation can help predict the ICU nurses' anxiety level, considering their emotional intelligence and role ambiguity. The initial nurses' anxiety level is 21.437, which decreases by 0.082 with each increase in emotional intelligence and by 0.126 with each rise in role ambiguity.", "doc_items_refs": ["#/texts/204", "#/texts/205", "#/texts/206", "#/texts/207", "#/texts/208", "#/texts/209", "#/texts/210", "#/texts/211", "#/texts/212", "#/texts/213", "#/texts/214", "#/texts/215", "#/texts/216", "#/texts/217", "#/texts/218", "#/texts/219", "#/texts/220", "#/texts/221", "#/texts/222", "#/texts/223", "#/texts/224", "#/texts/225", "#/texts/226", "#/texts/227", "#/texts/228"], "page_nos": [], "uuid": "d43db79f-2660-4cf5-a686-681485941b24"}
{"doc_id": "2025__Emotional_intelligence_as_a_mediator_of_anxiety_and_role_ambiguity_among_nurses___W4412157161", "source_path": "<redacted:source_path>", "chunk_id": 13, "source_chunk_idxs": [24], "num_tokens": 505, "text": "Emotional intelligence as a mediator of anxiety and role ambiguity among nurses caring for critically ill geriatric patients\nResults\nAs displayed in Table\n7\n; Fig.\n2\n, the direct and indirect effects of emotional intelligence on the anxiety level and work ambiguity of intensive care unit nurses were evaluated using Amos-SPSS: standard error, critical ratio, and standard regression weights. The parameters for the model fit were (X2/df = 0.030/1.00, CFI = 1.000; IFI = 1.00; RMSEA = 0.000). The research variables provide rigorous estimations of a good root and a perfect comparative fit index, indicating a square approximation error.\nFig. 2\nTable\n8\npresents the results of a bootstrapped regression weights mediation analysis in which role ambiguity influences anxiety through emotional intelligence. Role ambiguity and emotional intelligence are found to be strongly and statistically significantly correlated (Estimate = 0.966,\np\n= 0.004). Emotional intelligence, in turn, predicts anxiety considerably and negatively (Estimate = -0.115,\np\n= 0.004), indicating that nurses who have higher EI have lower anxiety levels. There was no statistically significant direct relationship between role ambiguity and anxiety (Estimate − 0.092,\np\n= 0.120), suggesting that role ambiguity predominantly has an indirect influence on anxiety that is mediated by emotional intelligence.\nTable\n9\nexplores the relationship between nurses' sociodemographic and occupational characteristics and their levels of emotional intelligence, anxiety, and role ambiguity. The results reveal that gender did not significantly influence EI, anxiety, or role ambiguity, as indicated by non-significant p-values (\np\n&gt; 0.05) across all measures. Age, however, showed a significant relationship with anxiety (\np\n= 0.017), where older nurses reported lower levels of anxiety. On the other hand, no significant age-related differences were found for EI or role ambiguity. Regarding marital status, this table shows that nurses' marital status has no significant impact on any of the variables, either EI, role ambiguity, or anxiety level. Additionally, educational level showed significant associations with both emotional intelligence (\np\n= 0.026) and anxiety (\np\n= 0.003), with nurses holding diplomas demonstrating the highest EI and lowest anxiety. However, role ambiguity did not significantly differ across educational levels. As for professional experience, anxiety levels significantly differed by years of experience (\np", "doc_items_refs": ["#/texts/229", "#/texts/230", "#/texts/231", "#/texts/232", "#/texts/233", "#/texts/234", "#/texts/235", "#/texts/236", "#/texts/237", "#/texts/238", "#/texts/239", "#/texts/240", "#/texts/241", "#/texts/242", "#/texts/243", "#/texts/244", "#/texts/245", "#/texts/246", "#/texts/247", "#/texts/248", "#/texts/249", "#/texts/250", "#/texts/251", "#/texts/252", "#/texts/253", "#/texts/254", "#/texts/255"], "page_nos": [], "uuid": "0309ae98-76e6-4911-8017-fa743bb6eaee"}
{"doc_id": "2025__Emotional_intelligence_as_a_mediator_of_anxiety_and_role_ambiguity_among_nurses___W4412157161", "source_path": "<redacted:source_path>", "chunk_id": 14, "source_chunk_idxs": [25], "num_tokens": 467, "text": "Emotional intelligence as a mediator of anxiety and role ambiguity among nurses caring for critically ill geriatric patients\nDiscussion\nEmotional intelligence (EI) plays a crucial role in the well-being of nurses caring for critically ill geriatric patients, particularly in mitigating anxiety and role ambiguity. In high-stress environments like intensive care units, nurses often face significant emotional and psychological challenges due to the complexities of patient care and the inherent uncertainties of their roles. The current study aimed to investigate the role of emotional intelligence as a mediator between anxiety and role ambiguity among nurses caring for critically ill geriatric patients.\nThe current study findings provide a comprehensive overview of nurses' emotional intelligence (EI) across four key dimensions: self-emotion appraisal, emotion regulation, use of emotion, and others' emotion appraisal. These dimensions align with established EI frameworks and offer valuable insights into the emotional competencies of nursing professionals. Self-emotion appraisal, which involves recognizing and understanding one's emotions, shows that most nurses score in the high range [\n35\n]. The non-significant direct path from role ambiguity to anxiety (highlights a complex relationship that may warrant further exploration. This finding contradicts prior literature, suggesting that emotional intelligence may play a more significant role in buffering the effects of role ambiguity than previously understood [\n36\n].\nThis ability is crucial for nurses, as it forms the foundation for effective emotional management in high-stress clinical environments. Research has shown that nurses with strong self-emotion appraisal are better equipped to handle the emotional demands of their profession, leading to improved job satisfaction and reduced burnout [\n37\n].\nEmotion regulation demonstrates even higher proficiency among nurses. This skill is vital in nursing, where maintaining professional composure in emotionally charged situations is essential. A previous study has indicated that nurses with superior emotion regulation skills are more resilient to stress and can better provide high-quality patient care [\n38\n]. Moreover, the emotion dimension, which involves harnessing emotions to facilitate performance, shows the highest percentage of nurses in the high category. This denotes that most nurses can use emotions to enhance their clinical abilities and decision-making processes. Supporting the current result, it was previously found that using emotions can lead to improved critical thinking and clinical performance among nurses [\n39\n].", "doc_items_refs": ["#/texts/258", "#/texts/259", "#/texts/260", "#/texts/261", "#/texts/262", "#/texts/263", "#/texts/264", "#/texts/265", "#/texts/266", "#/texts/267", "#/texts/268", "#/texts/269", "#/texts/270", "#/texts/271"], "page_nos": [], "uuid": "aa06fbbd-874a-4637-b113-a52a74c5e509"}
{"doc_id": "2025__Emotional_intelligence_as_a_mediator_of_anxiety_and_role_ambiguity_among_nurses___W4412157161", "source_path": "<redacted:source_path>", "chunk_id": 15, "source_chunk_idxs": [26], "num_tokens": 446, "text": "Emotional intelligence as a mediator of anxiety and role ambiguity among nurses caring for critically ill geriatric patients\nDiscussion\nFurthermore, others' emotion appraisal shows a more balanced distribution between moderate and high scores. This skill is fundamental for empathetic patient care and effective communication with patients, families, and colleagues. Studies have demonstrated that nurses with strong abilities in this area tend to have better therapeutic relationships with patients and improved teamwork with colleagues [\n17\n,\n40\n,\n41\n]. The overall emotional intelligence scores indicate that a significant majority of nurses demonstrate high total EI. This is encouraging, as high EI has been associated with numerous positive outcomes in nursing practice, including enhanced quality of care, improved patient satisfaction, and better stress management.\nThe data indicate a significant prevalence of anxiety among nurses, with varying degrees of severity ranging from minimal to severe anxiety. The findings reveal that a substantial portion of nurses experience mild anxiety, which is the most frequently reported level. This shows that many nurses are grappling with anxiety that, while not classified as severe, may still impact their overall well-being and job performance. Mild anxiety can lead to increased stress and may affect decision-making and interpersonal relationships within the healthcare team. Research has shown that anxiety among healthcare workers can lead to burnout and decreased job satisfaction, ultimately affecting patient care quality [\n42\n].\nThe presence of moderate and severe anxiety levels among a notable percentage of nurses is particularly concerning. Moderate anxiety can hinder a nurse's ability to perform effectively, while severe anxiety may lead to significant impairment in daily functioning. Studies have indicated that high levels of anxiety in healthcare professionals can result in increased absenteeism, reduced productivity, and a higher likelihood of making errors in patient care [\n43\n]. The mental health of nurses is critical not only for their well-being but also for the safety and quality of care provided to patients. This is especially important in high-stress settings when prompt decision-making and concentrated attention are critical, such as in emergency rooms or intensive care units. Various factors contribute to anxiety among nurses. These may include challenging work environments, lack of human resources, ongoing changes in patient care delivery, and the emotional demands of the profession [\n44\n].", "doc_items_refs": ["#/texts/272", "#/texts/273", "#/texts/274", "#/texts/275", "#/texts/276", "#/texts/277", "#/texts/278", "#/texts/279", "#/texts/280", "#/texts/281", "#/texts/282", "#/texts/283", "#/texts/284", "#/texts/285", "#/texts/286"], "page_nos": [], "uuid": "09d469fb-be91-472a-b581-ada50c4cf835"}
{"doc_id": "2025__Emotional_intelligence_as_a_mediator_of_anxiety_and_role_ambiguity_among_nurses___W4412157161", "source_path": "<redacted:source_path>", "chunk_id": 16, "source_chunk_idxs": [27], "num_tokens": 457, "text": "Emotional intelligence as a mediator of anxiety and role ambiguity among nurses caring for critically ill geriatric patients\nDiscussion\nMoreover, the findings indicate that role ambiguity is often rooted in systemic issues such as poor leadership and unclear policies. Addressing these structural factors is essential for mitigating role ambiguity and its associated anxiety. Strong leadership, clear communication channels, and well-defined policies are vital in creating an environment where nurses understand their roles and responsibilities [\n36\n]. This organizational support is crucial for fostering a work environment that clarifies expectations and reduces uncertainty.\nThe findings show that many nurses experience low work method ambiguity regarding role ambiguity. This indicates they clearly understand the procedures and methods required in their roles. Clarity in work methods is crucial as it allows nurses to perform their tasks efficiently and confidently, reducing the likelihood of errors and enhancing patient care quality. Research has demonstrated that role clarity is associated with lower stress levels and higher job satisfaction among healthcare professionals [\n45\n].\nSimilarly, the data on scheduling ambiguity reveals that most nurses report low levels of uncertainty regarding their work schedules. This clarity is vital for maintaining work-life balance and ensuring nurses can effectively manage their personal and professional responsibilities. It was previously reported that predictable work schedules contribute to job satisfaction and reduce burnout, which is particularly important in the demanding field of nursing [\n46\n]. While most nurses report low-performance ambiguity, there is still a notable percentage experiencing moderate to high levels of uncertainty regarding performance expectations. This aspect is critical, as unclear performance expectations can lead to anxiety and decreased job performance. A previous study indicates that role ambiguity can negatively impact job satisfaction and increase the likelihood of burnout among nurses [\n47\n].\nRegarding the relationship between the study variables, the findings illustrate the negative correlation between emotional intelligence and anxiety, indicating that higher levels of emotional intelligence are associated with lower anxiety levels among nurses. This finding aligns with existing research demonstrating how emotional intelligence equips individuals with the skills to effectively manage stress and emotional challenges [\n48\n]. Nurses with higher emotional intelligence are better able to navigate the emotional demands of their roles, leading to reduced feelings of anxiety [\n49\n]. Studies have shown that emotional intelligence facilitates adaptive coping strategies, significantly lowering anxiety levels in high-pressure environments, such as healthcare settings [\n49\n,\n50\n].", "doc_items_refs": ["#/texts/287", "#/texts/288", "#/texts/289", "#/texts/290", "#/texts/291", "#/texts/292", "#/texts/293", "#/texts/294", "#/texts/295", "#/texts/296", "#/texts/297", "#/texts/298", "#/texts/299", "#/texts/300", "#/texts/301", "#/texts/302", "#/texts/303", "#/texts/304", "#/texts/305", "#/texts/306"], "page_nos": [], "uuid": "003c5960-82ac-45ac-826c-cef1fd8d88a6"}
{"doc_id": "2025__Emotional_intelligence_as_a_mediator_of_anxiety_and_role_ambiguity_among_nurses___W4412157161", "source_path": "<redacted:source_path>", "chunk_id": 17, "source_chunk_idxs": [28], "num_tokens": 464, "text": "Emotional intelligence as a mediator of anxiety and role ambiguity among nurses caring for critically ill geriatric patients\nDiscussion\nThe positive correlation between emotional intelligence and role ambiguity (where higher scores indicate less ambiguity) indicates that higher emotional intelligence is associated with lower levels of role ambiguity. This relationship is critical, as it points out that emotionally intelligent nurses are more capable of understanding and clarifying their roles and responsibilities. By effectively managing their emotions and empathizing with colleagues, these nurses can foster better communication and teamwork, reducing uncertainty regarding job roles. Research supports the notion that emotional intelligence enhances role clarity, improving job satisfaction and performance among healthcare professionals [\n50\n].\nThe negative correlation between anxiety and role ambiguity further emphasizes the implications of these findings. As anxiety levels decrease, role ambiguity also diminishes, denoting that when nurses feel more confident and less anxious, they can better define and understand their roles. This relationship is particularly relevant in nursing, where role ambiguity can increase stress and job dissatisfaction. Studies have indicated that reducing role ambiguity through clear communication and defined expectations can alleviate anxiety, promoting a healthier work environment for nurses [\n1\n,\n47\n].\nThe linear regression analysis reveals that both emotional intelligence and role ambiguity are important predictors of anxiety levels among nurses, with emotional intelligence showing a notable impact. The regression analysis demonstrates that emotional intelligence has a significant negative relationship with anxiety. This shows that as emotional intelligence increases, anxiety levels decrease. The unstandardized coefficient for emotional intelligence indicates that anxiety decreases by a certain amount for each unit increase in emotional intelligence. This finding is consistent with existing literature, which posits that higher emotional intelligence enables nurses to manage stress and emotional challenges better, thereby reducing anxiety levels [\n51\n]. Emotional intelligence equips nurses with the skills to navigate the emotional demands of their roles, leading to improved mental health outcomes.\nIn addition to emotional intelligence, role ambiguity also significantly predicts anxiety levels. The regression results indicate that higher levels of role ambiguity are associated with increased anxiety among nurses. This relationship underscores the importance of clear role definitions and expectations in nursing. When nurses experience role ambiguity, they may feel uncertain about their responsibilities, leading to heightened anxiety. Research has shown that role clarity is essential for job satisfaction and can mitigate stress and anxiety in healthcare settings [\n52\n].", "doc_items_refs": ["#/texts/307", "#/texts/308", "#/texts/309", "#/texts/310", "#/texts/311", "#/texts/312", "#/texts/313", "#/texts/314", "#/texts/315", "#/texts/316", "#/texts/317", "#/texts/318", "#/texts/319", "#/texts/320"], "page_nos": [], "uuid": "d2329a04-da32-4e0a-969f-e8e73d3864c4"}
{"doc_id": "2025__Emotional_intelligence_as_a_mediator_of_anxiety_and_role_ambiguity_among_nurses___W4412157161", "source_path": "<redacted:source_path>", "chunk_id": 18, "source_chunk_idxs": [29, 30], "num_tokens": 502, "text": "Emotional intelligence as a mediator of anxiety and role ambiguity among nurses caring for critically ill geriatric patients\nDiscussion\nMoreover, the findings indicate that increased role ambiguity correlates with heightened anxiety levels among nurses, while emotional intelligence acts as a buffer, alleviating this anxiety. This observation supports existing research that underscores the vital role of emotional intelligence in managing stress and anxiety in demanding healthcare environments [\n51\n]. Studies have indicated that nurses possessing higher emotional intelligence are more capable of handling the emotional challenges of their roles, resulting in lower anxiety and greater job satisfaction [\n51\n,\n52\n]. In contrast, role ambiguity has been associated with heightened stress and burnout, as unclear job expectations can intensify feelings of inadequacy and anxiety among healthcare workers [\n47\n].\nFurthermore, the results highlight differences in emotional intelligence and anxiety levels across various demographic groups, suggesting that factors like age, education, and years of experience impact these variables. For instance, younger and less experienced nurses tend to report higher anxiety levels, aligning with findings that indicate novice nurses face greater difficulties adjusting to their roles [\n53\n]. Moreover, educational attainment seems to influence emotional intelligence and anxiety, with those holding diplomas displaying different profiles compared to their counterparts with advanced degrees.\n\nEmotional intelligence as a mediator of anxiety and role ambiguity among nurses caring for critically ill geriatric patients\nDiscussion\nLimitations\nThis study has certain limitations that should be acknowledged. Firstly, the research was conducted in a single hospital setting within South Valley University, which may limit the generalizability of the findings to other healthcare institutions or regions. While adequate for the statistical analyses, the sample size may not fully represent the diversity of the nursing workforce, particularly in terms of experience levels and specializations. Moreover, the study's cross-sectional design restricts the ability to draw causal inferences regarding the relationships between emotional intelligence, anxiety, and role ambiguity. Additionally, the regression model accounted for only 13.1% of the variance in anxiety, indicating that other influential factors may not have been captured. Future research should consider incorporating additional variables such as workload, organizational support, and other contextual or psychological factors to provide a more comprehensive understanding of anxiety in this setting. Lastly, self-reported measures, such as the Wong and Law Emotional Intelligence Scale (WLEIS), GAD-7, and Job Role Ambiguity assessment, may be subject to response biases, including social desirability bias, which could affect the accuracy of the data collected.", "doc_items_refs": ["#/texts/321", "#/texts/322", "#/texts/323", "#/texts/324", "#/texts/325", "#/texts/326", "#/texts/327", "#/texts/328", "#/texts/329", "#/texts/330", "#/texts/331", "#/texts/332", "#/texts/334"], "page_nos": [], "uuid": "e0940b2d-244a-4708-b123-50708ca2496d"}
{"doc_id": "2025__Emotional_intelligence_as_a_mediator_of_anxiety_and_role_ambiguity_among_nurses___W4412157161", "source_path": "<redacted:source_path>", "chunk_id": 19, "source_chunk_idxs": [31], "num_tokens": 161, "text": "Emotional intelligence as a mediator of anxiety and role ambiguity among nurses caring for critically ill geriatric patients\nDiscussion\nConclusion\nThe study underscores the significant role of emotional intelligence in mitigating anxiety and role ambiguity among nurses caring for critically ill geriatric patients. The findings indicate that nurses with higher emotional intelligence are better equipped to manage stress and emotional challenges, leading to reduced anxiety levels and more explicit role definitions. This relationship highlights the importance of fostering emotional intelligence within nursing, particularly in high-stress environments like intensive care units. The results also emphasize the need for healthcare organizations to address role ambiguity to enhance nurses' job satisfaction and overall well-being. By promoting emotional intelligence and clarifying role expectations, healthcare systems can contribute to improved mental health outcomes for nurses, which positively influence patient care quality.", "doc_items_refs": ["#/texts/336"], "page_nos": [], "uuid": "cefcfc2a-aafc-4041-b33a-bcdc496c82f1"}
{"doc_id": "2025__Emotional_intelligence_as_a_mediator_of_anxiety_and_role_ambiguity_among_nurses___W4412157161", "source_path": "<redacted:source_path>", "chunk_id": 20, "source_chunk_idxs": [32, 33], "num_tokens": 449, "text": "Emotional intelligence as a mediator of anxiety and role ambiguity among nurses caring for critically ill geriatric patients\nDiscussion\nRecommendations\nBased on the findings of this study, several recommendations can be made. Firstly, healthcare organizations should implement structured training programs to enhance emotional intelligence (EI) among nursing staff. These programs should span 4-6 weeks, with weekly sessions of 1-2 h each. The curriculum should focus on developing essential skills in self-emotion appraisal, emotion regulation, and empathetic communication. Additionally, incorporating evidence-based practices such as mindfulness techniques and effective communication workshops will further equip nurses to navigate the emotional demands of their roles more effectively.\nSecondly, it is crucial to address systemic issues contributing to role ambiguity within nursing teams. Organizations should establish clear job descriptions, expectations, and communication channels to reduce confusion and enhance role clarity. Regular team meetings and feedback sessions can facilitate better understanding and collaboration among staff, thereby minimizing uncertainty and improving job satisfaction. This approach acknowledges that role ambiguity is often rooted in poor leadership and unclear policies, which must be addressed to create a supportive work environment.\nAdditionally, organizations should consider providing comprehensive mental health support services, including counseling and tailored stress management workshops. These services will help nurses cope with anxiety and stress, particularly in high-pressure settings like intensive care units. Supporting nurses' mental health is essential for fostering a healthier work environment and ensuring that they can perform their duties effectively.\nFinally, future research should explore the long-term effects of emotional intelligence training on nurse well-being and patient care outcomes. Investigating the role of other potential mediators or moderators in the relationship between emotional intelligence, anxiety, and role ambiguity is also vital. This includes examining how structural factors influence these dynamics, which could lead to more effective interventions in the future. By promoting structured emotional intelligence training, addressing systemic issues related to role ambiguity, and providing robust mental health support, healthcare systems can significantly enhance the well-being of nurses, ultimately leading to improved quality of patient care.\n\nEmotional intelligence as a mediator of anxiety and role ambiguity among nurses caring for critically ill geriatric patients\nData availability\nThe datasets used or analyzed in this study are available from the corresponding author upon request.", "doc_items_refs": ["#/texts/338", "#/texts/339", "#/texts/340", "#/texts/341", "#/texts/343"], "page_nos": [], "uuid": "03f9d95a-c665-4a62-8bf4-a97335a20ead"}
{"doc_id": "2025__Emotional_intelligence_as_a_mediator_of_anxiety_and_role_ambiguity_among_nurses___W4412157161", "source_path": "<redacted:source_path>", "chunk_id": 21, "source_chunk_idxs": [34], "num_tokens": 468, "text": "Emotional intelligence as a mediator of anxiety and role ambiguity among nurses caring for critically ill geriatric patients\nReferences\n1. Zhang HL, Liu F, Lang HJ. The relationship between role ambiguity and anxiety in intensive care unit nurses: the mediating role of emotional intelligence. Intensive Crit Care Nurs. 2024;81:103597.\nhttps://doi.org/10.1016/j.iccn.2023.103597\n.\nArticle\nPubMed\nGoogle Scholar\n2. Brunker LB, Boncyk CS, Rengel KF, Hughes CG. Elderly patients and management in intensive care units (ICU): clinical challenges. Clin Interv Aging. 2023;18:93-112.\nhttps://doi.org/10.2147/cia.S365968\n.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n3. Halvachizadeh S, Gröbli L, Berk T, Jensen KO, Hierholzer C, Bischoff-Ferrari HA, et al. The effect of geriatric comanagement (GC) in geriatric trauma patients treated in a level 1 trauma setting: A comparison of data before and after the implementation of a certified geriatric trauma center. PLoS ONE. 2021;16(1):e0244554.\nhttps://doi.org/10.1371/journal.pone.0244554\n.\nArticle\nPubMed\nPubMed Central\nCAS\nGoogle Scholar\n4. Demerouti E, Bakker AB, Nachreiner F, Schaufeli WB. The job demands-resources model of burnout. J Appl Psychol. 2001;86(3):499.\nhttps://doi.org/10.1037/0021-9010.86.3.499\n.\nArticle\nPubMed\nCAS\nGoogle Scholar\n5. Mayer JD, Salovey P, Caruso DR. TARGET ARTICLES: emotional intelligence: theory, findings, and implications. Psychol Inq. 2004;15(3):197-215.\nhttps://doi.org/10.1207/s15327965pli1503\\_02\n.\nArticle\nGoogle Scholar", "doc_items_refs": ["#/texts/345", "#/texts/346", "#/texts/347", "#/texts/348", "#/texts/349"], "page_nos": [], "uuid": "7525a8dc-f083-4fd1-9be5-3ba036e8ddd5"}
{"doc_id": "2025__Emotional_intelligence_as_a_mediator_of_anxiety_and_role_ambiguity_among_nurses___W4412157161", "source_path": "<redacted:source_path>", "chunk_id": 22, "source_chunk_idxs": [35], "num_tokens": 434, "text": "Emotional intelligence as a mediator of anxiety and role ambiguity among nurses caring for critically ill geriatric patients\nReferences\n6. Wang M, Zhang H, Zhang X, Zhao Q, Chen J, Hu C, et al. Effects of an online brief modified mindfulness-based stress reduction therapy for anxiety among Chinese adults: A randomized clinical trial. J Psychiatr Res. 2023;161:27-33.\nhttps://doi.org/10.1016/j.jpsychires.2023.03.009\n.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n7. Dong Y, Yeo MC, Tham XC, Danuaji R, Nguyen TH, Sharma AK, et al. Investigating psychological differences between nurses and other health care workers from the Asia-Pacific region during the early phase of COVID-19: machine learning approach. JMIR Nurs. 2022;5(1):e32647.\nhttps://doi.org/10.2196/32647\n.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n8. Caramello V, Gariglio V, Di Salvo G, Maina G, Boccuzzi A. Longitudinal assessment of mental health consequences of the COVID-19 pandemic Long-Term exposure on health care workers from a North West Italian hospital. Disaster Med Public Health Prep. 2023;17:e378.\nhttps://doi.org/10.1017/dmp.2023.42\n.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n9. Alshekaili M, Hassan W, Al Said N, Al Sulaimani F, Jayapal SK, Al-Mawali A, et al. Factors associated with mental health outcomes across healthcare settings in Oman during COVID-19: frontline versus non-frontline healthcare workers. BMJ Open. 2020;10(10):e042030.\nhttps://doi.org/10.1136/bmjopen-2020-042030\n.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/350", "#/texts/351", "#/texts/352", "#/texts/353"], "page_nos": [], "uuid": "3400dd95-ec05-4b28-9f40-e4863574f3cf"}
{"doc_id": "2025__Emotional_intelligence_as_a_mediator_of_anxiety_and_role_ambiguity_among_nurses___W4412157161", "source_path": "<redacted:source_path>", "chunk_id": 23, "source_chunk_idxs": [36], "num_tokens": 449, "text": "Emotional intelligence as a mediator of anxiety and role ambiguity among nurses caring for critically ill geriatric patients\nReferences\n10. Qin N, Yao Z, Guo M. The role of bidirectional associations between depression, anxiety, and emotional exhaustion on turnover intention among nurses: a multicenter cross-sectional study in China. BMC Nurs. 2023;22(1):350.\nhttps://doi.org/10.1186/s12912-023-01516-1\n.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n11. Di Tella M, Benfante A, Castelli L, Romeo A. Anxiety, depression, and posttraumatic stress in nurses during the COVID-19 outbreak. Intensive Crit Care Nurs. 2021;64:103014.\nhttps://doi.org/10.1016/j.iccn.2021.103014\n.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n12. Sharifi A, Fallahi-Khoshknab M, Mohammadi S, Zeraati M, Jamshidi Z, Aghabeygi-Arani M, et al. Depression, anxiety, and stress among Iranian nurses in COVID-19 care wards. BMC Psychol. 2022;10(1):205.\nhttps://doi.org/10.1186/s40359-022-00911-8\n.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n13. Labrague LJ, de Los Santos JAA. Fear of COVID-19, psychological distress, work satisfaction, and turnover intention among frontline nurses. J Nurs Manag. 2021;29(3):395-403.\nhttps://doi.org/10.1111/jonm.13168\n.\nArticle\nPubMed\nGoogle Scholar\n14. Moon M, Seo K. Effect of anxiety and calling on professional quality of life in COVID-19-dedicated nurses in Korea. Healthc (Basel). 2022;10(9).\nhttps://doi.org/10.3390/healthcare10091797", "doc_items_refs": ["#/texts/354", "#/texts/355", "#/texts/356", "#/texts/357", "#/texts/358"], "page_nos": [], "uuid": "0e831a34-3da2-4296-b4b0-182519483b7e"}
{"doc_id": "2025__Emotional_intelligence_as_a_mediator_of_anxiety_and_role_ambiguity_among_nurses___W4412157161", "source_path": "<redacted:source_path>", "chunk_id": 24, "source_chunk_idxs": [37], "num_tokens": 512, "text": "Emotional intelligence as a mediator of anxiety and role ambiguity among nurses caring for critically ill geriatric patients\nReferences\n15. Si Y, Li P, Wang X, Yao G, Liu C, Liu Y, et al. Cueing effect of attention among nurses with different anxiety levels: an EEG study. Med Biol Eng Comput. 2023;61(9):2269-79.\nhttps://doi.org/10.1007/s11517-023-02829-8\n.\nArticle\nPubMed\nGoogle Scholar\n16. Gan YH, Deng YT, Yang L, Zhang W, Kuo K, Zhang YR, et al. Occupational characteristics and incident anxiety and depression: A prospective cohort study of 206,790 participants. J Affect Disord. 2023;329:149-56.\nhttps://doi.org/10.1016/j.jad.2023.02.043\n.\nArticle\nPubMed\nGoogle Scholar\n17. Orgambídez A, Almeida H. Exploring the link between structural empowerment and job satisfaction through the mediating effect of role stress: A cross-sectional questionnaire study. Int J Nurs Stud. 2020;109:103672.\nhttps://doi.org/10.1016/j.ijnurstu.2020.103672\n.\nArticle\nPubMed\nGoogle Scholar\n18. Manzano García G, Ayala Calvo JC. The threat of COVID-19 and its influence on nursing staff burnout. J Adv Nurs. 2021;77(2):832-44.\nhttps://doi.org/10.1186/s40359-023-01077-7\n.\nArticle\nPubMed\nGoogle Scholar\n19. Yamamoto K. Association between interdisciplinary collaboration and leadership ability in intensive care unit nurses: A Cross-Sectional study. J Nurs Res. 2022;30(2):e202.\nhttps://doi.org/10.1097/jnr.0000000000000483\n.\nArticle\nPubMed\nGoogle Scholar\n20. Cengiz A, Yoder LH, Danesh V. A concept analysis of role ambiguity experienced by hospital nurses providing bedside nursing care. Nurs Health Sci. 2021;23(4):807-17.\nhttps://doi.org/10.1111/nhs.12888\n.\nArticle\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/359", "#/texts/360", "#/texts/361", "#/texts/362", "#/texts/363", "#/texts/364"], "page_nos": [], "uuid": "a11b0a40-a12f-4ef5-a1f6-be3fc6ac4e61"}
{"doc_id": "2025__Emotional_intelligence_as_a_mediator_of_anxiety_and_role_ambiguity_among_nurses___W4412157161", "source_path": "<redacted:source_path>", "chunk_id": 25, "source_chunk_idxs": [38], "num_tokens": 438, "text": "Emotional intelligence as a mediator of anxiety and role ambiguity among nurses caring for critically ill geriatric patients\nReferences\n21. Panari C, Caricati L, Pelosi A, Rossi C. Emotional exhaustion among healthcare professionals: the effects of role ambiguity, work engagement and professional commitment. Acta Biomed. 2019;90(6-s):60-7.\nhttps://doi.org/10.23750/abm.v90i6-S.8481\n.\nArticle\nPubMed\nGoogle Scholar\n22. Shin Y, Hur WM, Park K, Hwang H. How managers' job crafting reduces turnover intention: the mediating roles of role ambiguity and emotional exhaustion. Int J Environ Res Public Health. 2020;17(11).\nhttps://doi.org/10.3390/ijerph17113972\n23. Blanco-Donoso LM, Moreno-Jiménez B, Pereira G, Garrosa E. Effects of coworker and supervisor support on nurses' energy and motivation through role ambiguity and psychological flexibility. Span J Psychol. 2019;22:E25.\nhttps://doi.org/10.1017/sjp.2019.10\n.\nArticle\nPubMed\nGoogle Scholar\n24. Tang W, Yan Z, Lu Y, Xu J. Prospective examination of adolescent emotional intelligence and posttraumatic growth during and after COVID-19 lockdown. J Affect Disord. 2022;309:368-74.\nhttps://doi.org/10.1016/j.jad.2022.04.129\n.\nArticle\nPubMed\nPubMed Central\nCAS\nGoogle Scholar\n25. Quintana-Orts C, Rey L, Mérida-López S, Extremera N. What bridges the gap between emotional intelligence and suicide risk in victims of bullying? A moderated mediation study. J Affect Disord. 2019;245:798-805.\nhttps://doi.org/10.1016/j.jad.2018.11.030\n.\nArticle\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/365", "#/texts/366", "#/texts/367", "#/texts/368", "#/texts/369"], "page_nos": [], "uuid": "91f6f86f-873b-401a-93c8-98b9471eefcd"}
{"doc_id": "2025__Emotional_intelligence_as_a_mediator_of_anxiety_and_role_ambiguity_among_nurses___W4412157161", "source_path": "<redacted:source_path>", "chunk_id": 26, "source_chunk_idxs": [39], "num_tokens": 461, "text": "Emotional intelligence as a mediator of anxiety and role ambiguity among nurses caring for critically ill geriatric patients\nReferences\n26. Husain W, Inam A, Wasif S. Emotional intelligence: emotional expression and emotional regulation for intrinsic and extrinsic emotional satisfaction. Psychol Res Behav Manag. 2022;15:3901-13.\nhttps://doi.org/10.2147/PRBM.S396469\n.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n27. Sfeir E, El Othman R, Barakat M, Hallit S, Obeid S. Personality traits and mental health among Lebanese medical students: the mediating role of emotional intelligence. Healthc (Basel). 2022;10(12).\nhttps://doi.org/10.3390/healthcare10122516\n.\n28. Mendoza Bernal I, Sánchez-Teruel D, Robles-Bello MA, Sarhani-Robles A, Sarhani-Robles M. Predictors of resilience in healthcare workers during the COVID-19 pandemic: a longitudinal study comparing the first and second waves. BMC Psychol. 2023;11(1):143.\nhttps://doi.org/10.1186/s40359-023-01077-7\n.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n29. Adha WM, Syarif D. The important role of emotional intelligence in supporting auditor performance. Atestasi: Jurnal Ilmiah Akuntansi. 2022;5(2):347-61.\nhttps://jurnal.feb-umi.id/index.php/ATESTASI/article/view/331\n.\nArticle\nGoogle Scholar\n30. Hall NC, Chipperfield JG, Heckhausen J, Perry RP. Control striving in older adults with serious health problems: A 9-year longitudinal study of survival, health, and well-being. Psychol Aging. 2010;25(2):432.\nhttps://doi.org/10.1037/a0019278\n.\nArticle\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/370", "#/texts/371", "#/texts/372", "#/texts/373", "#/texts/374"], "page_nos": [], "uuid": "1a676053-2f09-4696-83d4-4d4002debb36"}
{"doc_id": "2025__Emotional_intelligence_as_a_mediator_of_anxiety_and_role_ambiguity_among_nurses___W4412157161", "source_path": "<redacted:source_path>", "chunk_id": 27, "source_chunk_idxs": [40], "num_tokens": 445, "text": "Emotional intelligence as a mediator of anxiety and role ambiguity among nurses caring for critically ill geriatric patients\nReferences\n31. O'Connor DB, Thayer JF, Vedhara K. Stress and health: A review of Psychobiological processes. Ann Rev Psychol. 2021;72(1):663-88.\nhttps://doi.org/10.1146/annurev-psych-062520-122331\n.\nArticle\nGoogle Scholar\n32. Law KS, Wong C-S, Song LJ. The construct and criterion validity of emotional intelligence and its potential utility for management studies. J Appl Psychol. 2004;89(3):483.\nhttps://doi.org/10.1037/0021-9010.89.3.483\n.\nArticle\nPubMed\nGoogle Scholar\n33. Spitzer RL, Kroenke K, Williams JB, Löwe B. A brief measure for assessing generalized anxiety disorder: the GAD-7. Arch Intern Med. 2006;166(10):1092-7.\nhttps://doi.org/10.1001/archinte.166.10.1092\n.\nArticle\nPubMed\nGoogle Scholar\n34. Breaugh JA, Colihan JP. Measuring facets of job ambiguity: construct validity evidence. J Appl Psychol. 1994;79(2):191.\nArticle\nGoogle Scholar\n35. Almansour AM. The level of emotional intelligence among Saudi nursing students: A cross-sectional study. Belitung Nurs J. 2023;9(5):471.\nhttps://doi.org/10.33546/bnj.2794\n.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n36. Washburn NS, Simonton KL, Richards KAR, Lee YH. Examining role stress, emotional intelligence, emotional exhaustion, and affective commitment among secondary physical educators. J Teach Phys Educ. 2021;41(4):669-79.\nhttps://doi.org/10.1123/jtpe.2021-0102\n.\nArticle\nGoogle Scholar", "doc_items_refs": ["#/texts/375", "#/texts/376", "#/texts/377", "#/texts/378", "#/texts/379", "#/texts/380"], "page_nos": [], "uuid": "e9cea1d8-1159-437e-b964-7ed27dbe0a49"}
{"doc_id": "2025__Emotional_intelligence_as_a_mediator_of_anxiety_and_role_ambiguity_among_nurses___W4412157161", "source_path": "<redacted:source_path>", "chunk_id": 28, "source_chunk_idxs": [41], "num_tokens": 468, "text": "Emotional intelligence as a mediator of anxiety and role ambiguity among nurses caring for critically ill geriatric patients\nReferences\n37. Ali YY, Morad AD, Sabri PR. Emotional intelligence dimensions as predictors of coping reactions to stress in nursing practitioners. Fukushima J Med Sci. 2019;65(3):99-108.\nhttps://doi.org/10.5387/fms.2019-11\n.\nArticle\nGoogle Scholar\n38. Almeida M, Lobão C, Coelho A, Parola V. Emotional management strategies in prehospital nurses: a scoping review. Nurs Rep. 2023;13(4):1524-38.\nhttps://doi.org/10.3390/nursrep13040128\n.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n39. Fashafsheh IH, Eqtait FA, Hammad BM, Ayed AJ, Salameh BS. The impact of emotional intelligence on work performance among ICU nurses in palestine: a cross-sectional study. BMC Nurs. 2025;24(1):413.\nhttps://doi.org/10.1186/s12912-025-03068-y\n.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n40. Baek H, Han K, Cho H, Ju J. Nursing teamwork is essential in promoting patient-centered care: a cross-sectional study. BMC Nurs. 2023;22(1):433.\nhttps://doi.org/10.1186/s12912-023-01592-3\n.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n41. Meneses-La-Riva ME, Fernández-Bedoya VH, Suyo-Vega JA, Ocupa-Cabrera HG, Grijalva-Salazar RV, Ocupa-Meneses GD. Enhancing healthcare efficiency: the relationship between effective communication and teamwork among nurses in Peru. Nurs Rep. 2025;15(2):59.\nhttps://doi.org/10.3390/nursrep15020059\n.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/381", "#/texts/382", "#/texts/383", "#/texts/384", "#/texts/385"], "page_nos": [], "uuid": "905696aa-41f1-4b14-b7b4-e8c83efe0694"}
{"doc_id": "2025__Emotional_intelligence_as_a_mediator_of_anxiety_and_role_ambiguity_among_nurses___W4412157161", "source_path": "<redacted:source_path>", "chunk_id": 29, "source_chunk_idxs": [42], "num_tokens": 508, "text": "Emotional intelligence as a mediator of anxiety and role ambiguity among nurses caring for critically ill geriatric patients\nReferences\n42. Hu D, Kong Y, Li W, Han Q, Zhang X, Zhu LX, et al. Frontline nurses' burnout, anxiety, depression, and fear statuses and their associated factors during the COVID-19 outbreak in Wuhan, China: a large-scale cross-sectional study. EClinicalMedicine. 2020;24.\nhttps://doi.org/10.1016/j.eclinm.2020.100424\n43. Chen X, Arber A, Gao J, Zhang L, Ji M, Wang D, et al. The mental health status among nurses from low-risk areas under the normalized COVID-19 pandemic prevention and control in china: A cross-sectional study. Int J Ment Health Nurs. 2021;30(4):975-87.\nhttps://doi.org/10.1111/inm.12852\n.\nArticle\nPubMed\nPubMed Central\nCAS\nGoogle Scholar\n44. Misganaw A, Hailu M, Bayleyegn G, Aderaw M, Yigzaw ZA, Alemu T, et al. Exploring factors affecting nurse anxiety in Northwest ethiopia: a multicenter study. Front Psychiatry. 2024;15:1434701.\nhttps://doi.org/10.3389/fpsyt.2024.1434701\n.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n45. Alyahya SA, Al-Mansour KA, Alkohaiz MA, Almalki MA. Association between role conflict and ambiguity and stress among nurses in primary health care centers in Saudi Arabia during the coronavirus disease 2019 pandemic: a cross-sectional study. Medicine. 2021;100(37):e27294.\nhttps://doi.org/10.1097/MD.0000000000027294\n.\nArticle\nPubMed\nPubMed Central\nCAS\nGoogle Scholar\n46. Orgambídez A, Almeida H, Borrego Y. Social support and job satisfaction in nursing staff: Understanding the link through role ambiguity. J Nurs Adm Manag. 2022;30(7):2937-44.\nhttps://doi.org/10.1016/j.ijnurstu.2020.103672\n.\nArticle\nGoogle Scholar", "doc_items_refs": ["#/texts/386", "#/texts/387", "#/texts/388", "#/texts/389", "#/texts/390"], "page_nos": [], "uuid": "b9358d86-cbb5-4057-b9b2-88787f68b65a"}
{"doc_id": "2025__Emotional_intelligence_as_a_mediator_of_anxiety_and_role_ambiguity_among_nurses___W4412157161", "source_path": "<redacted:source_path>", "chunk_id": 30, "source_chunk_idxs": [43], "num_tokens": 477, "text": "Emotional intelligence as a mediator of anxiety and role ambiguity among nurses caring for critically ill geriatric patients\nReferences\n47. Zhang H-l, Wu C, Yan J-r, Liu J-h, Wang P, Hu M-y, et al. The relationship between role ambiguity, emotional exhaustion, and work alienation among Chinese nurses two years after the COVID-19 pandemic: a cross-sectional study. BMC Psychiatry. 2023;23(1):516.\nhttps://doi.org/10.1186/s12888-023-04923-5\n.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n48. Fteiha M, Awwad N. Emotional intelligence and its relationship with stress coping style. J Health Psychol Open. 2020;7(2):2055102920970416.\nArticle\nGoogle Scholar\n49. Kikanloo AAI, Jalali K, Asadi Z, Shokrpour N, Amiri M, Bazrafkan L. Emotional intelligence skills: are nurses' stress and professional competence related to their emotional intelligence training? A quasi-experimental study. J Adv Med Educ Professionalism. 2019;7(3):138.\nhttps://doi.org/10.30476/JAMP.2019.74922\n.\nArticle\nGoogle Scholar\n50. Abualruz H, Hayajneh F, Othman EH, Sabra MAA, Khalil MM, Khalifeh AH, et al. The relationship between emotional intelligence, resilience, and psychological distress among nurses in Jordan. Arch Psychiatr Nurs. 2024;51:108-13.\nhttps://doi.org/10.1016/j.apnu.2024.05.014\n.\nArticle\nPubMed\nGoogle Scholar\n51. Pérez-Fuentes MDC, Molero Jurado MdM, Gázquez Linares JJ, Oropesa Ruiz NF. The role of emotional intelligence in the engagement of nurses. Int J Environ Res Public Health. 2018;15(9):1915.\nhttps://doi.org/10.3390/ijerph15091915\n.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/391", "#/texts/392", "#/texts/393", "#/texts/394", "#/texts/395"], "page_nos": [], "uuid": "5ed9e2f1-1cfa-4391-971b-3580deec8a10"}
{"doc_id": "2025__Emotional_intelligence_as_a_mediator_of_anxiety_and_role_ambiguity_among_nurses___W4412157161", "source_path": "<redacted:source_path>", "chunk_id": 31, "source_chunk_idxs": [44, 45, 46], "num_tokens": 281, "text": "Emotional intelligence as a mediator of anxiety and role ambiguity among nurses caring for critically ill geriatric patients\nReferences\n52. Molero Jurado MM, Pérez-Fuentes MdC, Barragán Martín AB, Gázquez Linares JJ, Oropesa Ruiz NF, Simón Márquez MM, editors. Emotional intelligence components as predictors of engagement in nursing professionals by sex. Healthcare: MDPI; 2020.\nGoogle Scholar\n53. Najafi B, Nasiri A. Explaining novice nurses' experience of weak professional confidence: A qualitative study. SAGE Open Nurs. 2023;9:23779608231153457.\nhttps://doi.org/10.1177/23779608231153457\n.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\nDownload references\n\nEmotional intelligence as a mediator of anxiety and role ambiguity among nurses caring for critically ill geriatric patients\nAcknowledgements\nThe researchers are grateful to all participants in this study.\n\nEmotional intelligence as a mediator of anxiety and role ambiguity among nurses caring for critically ill geriatric patients\nFunding\nOpen access funding provided by The Science, Technology &amp; Innovation Funding Authority (STDF) in cooperation with The Egyptian Knowledge Bank (EKB). There is no specific grant from funding agencies in the public, commercial, or not-for-profit sectors for the current study.", "doc_items_refs": ["#/texts/396", "#/texts/397", "#/texts/398", "#/texts/400", "#/texts/402"], "page_nos": [], "uuid": "cab61bd4-b999-4d25-8666-2f949ef7c511"}
{"doc_id": "2025__Emotional_intelligence_as_a_mediator_of_anxiety_and_role_ambiguity_among_nurses___W4412157161", "source_path": "<redacted:source_path>", "chunk_id": 32, "source_chunk_idxs": [47, 48], "num_tokens": 322, "text": "Emotional intelligence as a mediator of anxiety and role ambiguity among nurses caring for critically ill geriatric patients\nAuthor information\nAuthors and Affiliations\n1. Gerontological Nursing Department, Faculty of Nursing, Alexandria University, Alexandria, Egypt Asmaa Mahmoud Ali Ibrahim &amp; Eman Mahmoud Mohammed Shoukr\n2. Gerontological Nursing Department, Faculty of Nursing, South Valley University, South Valley, Egypt Nadia Abdelnasser\n3. Psychiatric and Mental Health Nursing Department, Faculty of Nursing, Alexandria University, Alexandria, Egypt Mohamoud Abdelwahab Khedr\n4. Community Health Nursing Department, College of Nursing, Jouf University, Sakaka, Saudi Arabia Eman Mahmoud Mohammed Shoukr\nAuthors\n1. Asmaa Mahmoud Ali Ibrahim\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n2. Nadia Abdelnasser\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n3. Mohamoud Abdelwahab Khedr\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n4. Eman Mahmoud Mohammed Shoukr\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n\nEmotional intelligence as a mediator of anxiety and role ambiguity among nurses caring for critically ill geriatric patients\nAuthor information\nContributions\nAMAI and NA conceived and designed the study. AMAI and EMMS conducted data collection. NA and EMMS contributed to the data analysis. NA, and MAK prepared the first draft of the manuscript. AMAI, EMMS, and MAK critically reviewed the manuscript. All authors contributed to the subsequent drafts and approved the final version of the manuscript.", "doc_items_refs": ["#/texts/405", "#/texts/406", "#/texts/407", "#/texts/408", "#/texts/409", "#/texts/410", "#/texts/411", "#/texts/412", "#/texts/413", "#/texts/415"], "page_nos": [], "uuid": "7d104d5d-d0d5-45eb-85f3-4bc0865d0db3"}
{"doc_id": "2025__Emotional_intelligence_as_a_mediator_of_anxiety_and_role_ambiguity_among_nurses___W4412157161", "source_path": "<redacted:source_path>", "chunk_id": 33, "source_chunk_idxs": [49, 50, 51, 52], "num_tokens": 274, "text": "Emotional intelligence as a mediator of anxiety and role ambiguity among nurses caring for critically ill geriatric patients\nAuthor information\nCorresponding author\nCorrespondence to\nMohamoud Abdelwahab Khedr\n.\n\nEmotional intelligence as a mediator of anxiety and role ambiguity among nurses caring for critically ill geriatric patients\nEthics declarations\nEthics approval and consent to participate\nThe study received ethical approval from South Valley University's Faculty of Nursing Research Ethics Committee (code: SVU-NUR-GER-21-5-11-2024). After that, the researchers submitted a request outlining the aim of the study to the SVU hospital authorities, who granted them approval. All participants involved in the study provided signed informed consent forms, confirming their willingness to participate. The researchers conveyed to the participants that their involvement was completely voluntary and that they had the right to withdraw at any moment without facing any consequences. The confidentiality of the data gathered was guaranteed. It strictly adhered to the ethical principles set forth in the Helsinki Declaration to maintain the integrity of the research.\n\nEmotional intelligence as a mediator of anxiety and role ambiguity among nurses caring for critically ill geriatric patients\nEthics declarations\nConsent for publication\nNot applicable.\n\nEmotional intelligence as a mediator of anxiety and role ambiguity among nurses caring for critically ill geriatric patients\nEthics declarations\nCompeting interests\nThe authors declare no competing interests.", "doc_items_refs": ["#/texts/417", "#/texts/418", "#/texts/419", "#/texts/422", "#/texts/424", "#/texts/426"], "page_nos": [], "uuid": "4485cd4d-7f2d-4440-b193-b476b3ee0730"}
{"doc_id": "2025__Emotional_intelligence_as_a_mediator_of_anxiety_and_role_ambiguity_among_nurses___W4412157161", "source_path": "<redacted:source_path>", "chunk_id": 34, "source_chunk_idxs": [53, 54, 55], "num_tokens": 414, "text": "Emotional intelligence as a mediator of anxiety and role ambiguity among nurses caring for critically ill geriatric patients\nAdditional information\nPublisher's note\nSpringer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations.\n\nEmotional intelligence as a mediator of anxiety and role ambiguity among nurses caring for critically ill geriatric patients\nRights and permissions\nOpen Access\nThis article is licensed under a Creative Commons Attribution 4.0 International License, which permits use, sharing, adaptation, distribution and reproduction in any medium or format, as long as you give appropriate credit to the original author(s) and the source, provide a link to the Creative Commons licence, and indicate if changes were made. The images or other third party material in this article are included in the article's Creative Commons licence, unless indicated otherwise in a credit line to the material. If material is not included in the article's Creative Commons licence and your intended use is not permitted by statutory regulation or exceeds the permitted use, you will need to obtain permission directly from the copyright holder. To view a copy of this licence, visit\nhttp://creativecommons.org/licenses/by/4.0/\n.\nReprints and permissions\n\nEmotional intelligence as a mediator of anxiety and role ambiguity among nurses caring for critically ill geriatric patients\nAbout this article\nCite this article\nIbrahim, A.M.A., Abdelnasser, N., Khedr, M.A.\net al.\nEmotional intelligence as a mediator of anxiety and role ambiguity among nurses caring for critically ill geriatric patients.\nBMC Nurs\n24\n, 885 (2025). https://doi.org/10.1186/s12912-025-03437-7\nDownload citation\n- Received : 21 March 2025\n- Accepted : 17 June 2025\n- Published : 08 July 2025\n- DOI : https://doi.org/10.1186/s12912-025-03437-7", "doc_items_refs": ["#/texts/429", "#/texts/431", "#/texts/432", "#/texts/433", "#/texts/434", "#/texts/435", "#/texts/438", "#/texts/439", "#/texts/440", "#/texts/441", "#/texts/442", "#/texts/443", "#/texts/444", "#/texts/445", "#/texts/446", "#/texts/447", "#/texts/448"], "page_nos": [], "uuid": "4fd5a371-5256-409e-9e0f-2d8ddbfe39ba"}
{"doc_id": "2025__Emotional_intelligence_as_a_mediator_of_anxiety_and_role_ambiguity_among_nurses___W4412157161", "source_path": "<redacted:source_path>", "chunk_id": 35, "source_chunk_idxs": [56, 57, 58, 59, 60], "num_tokens": 180, "text": "Emotional intelligence as a mediator of anxiety and role ambiguity among nurses caring for critically ill geriatric patients\nAbout this article\nKeywords\n- Emotional intelligence\n- Anxiety\n- Role ambiguity\n- Critical care nurses\n- Path analysis\nDownload PDF\n\nEmotional intelligence as a mediator of anxiety and role ambiguity among nurses caring for critically ill geriatric patients\nAssociated content\nCollection\n\nEmotional intelligence as a mediator of anxiety and role ambiguity among nurses caring for critically ill geriatric patients\nAssociated content\nGerontological nursing\nAdvertisement\n\nEmotional intelligence as a mediator of anxiety and role ambiguity among nurses caring for critically ill geriatric patients\nAssociated content\nGerontological nursing\nBMC Nursing\nISSN: 1472-6955\n\nEmotional intelligence as a mediator of anxiety and role ambiguity among nurses caring for critically ill geriatric patients\nAssociated content\nGerontological nursing\nContact us\n- General enquiries:\njournalsubmissions@springernature.com", "doc_items_refs": ["#/texts/450", "#/texts/451", "#/texts/452", "#/texts/453", "#/texts/454", "#/texts/455", "#/texts/457", "#/texts/459", "#/texts/461", "#/texts/463"], "page_nos": [], "uuid": "c5f9a17d-5e3a-48ce-9ac8-76552ac7d6b8"}
