{"doc_id": "2025__The_role_of_cognitive_and_brain_reserve_in_the_clinical_presentation_and_progres__W4411490345", "source_path": "<redacted:source_path>", "chunk_id": 0, "source_chunk_idxs": [0, 1], "num_tokens": 338, "text": "The role of cognitive and brain reserve in the clinical presentation and progression of amyotrophic lateral sclerosis | Scientific Reports\nSkip to main content\nThank you for visiting nature.com. You are using a browser version with limited support for CSS. To obtain\nthe best experience, we recommend you use a more up to date browser (or turn off compatibility mode in\nInternet Explorer). In the meantime, to ensure continued support, we are displaying the site without styles\nand JavaScript.\nAdvertisement\n- View all journals\n- Search\n- Log in\n- Content Explore content\n- About the journal\n- Publish with us\n- Sign up for alerts\n- RSS feed\n1. nature\n2. scientific reports\n3. articles\n4. article\nThe role of cognitive and brain reserve in the clinical presentation and progression of amyotrophic lateral sclerosis\nDownload PDF\nDownload PDF\n- Article\n- Open access\n- Published: 20 June 2025\n\nThe role of cognitive and brain reserve in the clinical presentation and progression of amyotrophic lateral sclerosis\n- Anna G. M. Temp\n1\n,\n2\n,\n- Gaël Nils Tarakdjian\n1\n,\n- Elisabeth Kasper\n4\n,\n- Judith Machts\n5\n,\n6\n,\n7\n,\n- Jörn Kaufmann\n8\n,\n- Stefan Vielhaber\n7\n,\n8\n,\n- Johannes Prudlo\n2\n,\n4\n,\n- James H. Cole\n9\n,\n10\n,\n- Martin Dyrba\n2\n,\n- Stefan Teipel\n2\n,\n3\n,\n11\n&amp;\n- ...\n- Andreas Hermann\n1\n,\n2\n,\n3\nShow authors\nScientific Reports\nvolume 15\n, Article number: 20232 ( 2025 )\nCite this article\n- 1347 Accesses\n- 7 Altmetric\n- Metrics details", "doc_items_refs": ["#/texts/1", "#/texts/2", "#/texts/3", "#/texts/4", "#/texts/5", "#/texts/6", "#/texts/7", "#/texts/8", "#/texts/9", "#/texts/10", "#/texts/11", "#/texts/12", "#/texts/13", "#/texts/14", "#/texts/15", "#/texts/16", "#/texts/17", "#/texts/18", "#/texts/19", "#/texts/20", "#/texts/21", "#/texts/22", "#/texts/23", "#/texts/24", "#/texts/26", "#/texts/27", "#/texts/28", "#/texts/29", "#/texts/30", "#/texts/31", "#/texts/32", "#/texts/33", "#/texts/34", "#/texts/35", "#/texts/36", "#/texts/37", "#/texts/38", "#/texts/39", "#/texts/40", "#/texts/41", "#/texts/42", "#/texts/43", "#/texts/44", "#/texts/45"], "page_nos": [], "uuid": "ff88f689-25c0-4ca7-9626-20a6e3d3716c"}
{"doc_id": "2025__The_role_of_cognitive_and_brain_reserve_in_the_clinical_presentation_and_progres__W4411490345", "source_path": "<redacted:source_path>", "chunk_id": 1, "source_chunk_idxs": [2, 3, 4, 5, 6], "num_tokens": 368, "text": "The role of cognitive and brain reserve in the clinical presentation and progression of amyotrophic lateral sclerosis\nSubjects\n- Amyotrophic lateral sclerosis\n\nThe role of cognitive and brain reserve in the clinical presentation and progression of amyotrophic lateral sclerosis\nAbstract\nRecent research has shown that cognitive reserve is associated with better cognitive abilities in ALS/MND, and that a slow brain ageing speed is associated with intact cognition in ALS. This study compares the effects of cognitive reserve and the predicted brain age difference (PAD) on the risk of being diagnosed with ALS, the risk of having cognitive or behavioral impairment, or even fronto-temporal dementia, and on disease duration.\nOur results indicated that neither PAD nor cognitive reserve was associated with an increased risk of ALS, but that higher PAD was associated with an increased risk of cognitive impairments and FTD, as well as a shortened disease duration. Higher cognitive reserve on the other hand was associated with a lower risk of cognitive impairment and a longer disease duration.\nBrain age as a proxy of brain reserve influences disease progression and presentation more strongly than cognitive reserve.\n\nThe role of cognitive and brain reserve in the clinical presentation and progression of amyotrophic lateral sclerosis\nAbstract\nCognitive reserve is associated with education, social determinants, and cognitive outcomes among older American Indians in the Strong Heart Study\nArticle\nOpen access\n28 January 2025\n\nThe role of cognitive and brain reserve in the clinical presentation and progression of amyotrophic lateral sclerosis\nAbstract\nDeep learning-based brain age prediction in normal aging and dementia\nArticle\n09 May 2022\n\nThe role of cognitive and brain reserve in the clinical presentation and progression of amyotrophic lateral sclerosis\nAbstract\nNeuropsychological impairment in amyotrophic lateral sclerosis-frontotemporal spectrum disorder\nArticle\n12 October 2023", "doc_items_refs": ["#/texts/47", "#/texts/49", "#/texts/50", "#/texts/51", "#/texts/54", "#/texts/55", "#/texts/56", "#/texts/58", "#/texts/59", "#/texts/61", "#/texts/62"], "page_nos": [], "uuid": "b47756c8-4889-4fc3-a54f-8352ee1599f1"}
{"doc_id": "2025__The_role_of_cognitive_and_brain_reserve_in_the_clinical_presentation_and_progres__W4411490345", "source_path": "<redacted:source_path>", "chunk_id": 2, "source_chunk_idxs": [7], "num_tokens": 271, "text": "The role of cognitive and brain reserve in the clinical presentation and progression of amyotrophic lateral sclerosis\nIntroduction\nCognitive reserve (CR) describes the theory that premorbid cognitive ability, educational and occupational attainment facilitate better coping with brain pathology, leading to individual differences in task processing\n1\n. CR is an active model of reserve because it posits that i) the brain actively uses pre-existing cognitive processes and/or ii) enlists compensatory strategies (\n1\n. Concerning Alzheimer's disease (AD), high CR is associated with a relative risk reduction between 47-68%, depending on how CR is measured. Furthermore, evidence is mounting that bilingualism as a proxy of CR may delay symptom onset by several years\n2\n.\nThe concept of CR has recently been carried over from AD to diseases of the amyotrophic lateral sclerosis and fronto-temporal dementia spectrum (ALS-FTDSD)\n3\n,\n4\n,\n5\n,\n6\n,\n7\n. Work including structural and functional brain imaging techniques showed that persons with higher levels of education and premorbid cognitive ability were able to retain better cognitive functioning after the onset of ALS\n3\n,\n4\n,\n5\n. Over the course of a year, people living with ALS with higher cognitive reserve were able to retain better functioning, even against increasing brain atrophy\n3\n.", "doc_items_refs": ["#/texts/64", "#/texts/65", "#/texts/66", "#/texts/67", "#/texts/68", "#/texts/69", "#/texts/70", "#/texts/71", "#/texts/72", "#/texts/73", "#/texts/74", "#/texts/75", "#/texts/76", "#/texts/77", "#/texts/78", "#/texts/79", "#/texts/80", "#/texts/81", "#/texts/82", "#/texts/83", "#/texts/84", "#/texts/85", "#/texts/86", "#/texts/87", "#/texts/88", "#/texts/89"], "page_nos": [], "uuid": "67e74831-98fb-4d29-ae45-dce68c514c6a"}
{"doc_id": "2025__The_role_of_cognitive_and_brain_reserve_in_the_clinical_presentation_and_progres__W4411490345", "source_path": "<redacted:source_path>", "chunk_id": 3, "source_chunk_idxs": [8], "num_tokens": 410, "text": "The role of cognitive and brain reserve in the clinical presentation and progression of amyotrophic lateral sclerosis\nIntroduction\nAdditionally, our recent work has shown that people whose brains appeared younger than their chronological age were less likely to develop cognitive impairments alongside ALS-FTDSD\n8\n. Conversely, accelerated brain ageing was associated with FTD. The driving force behind the resilience against cognitive impairment appeared to be higher cerebellar volume. These findings are consistent with the brain reserve (BR) hypothesis: individual differences in people's brains facilitate better coping with neurodegenerative diseases\n1\n. Such differences include brain volume (i.e., size) and synaptic density but also life experiences which influence brain anatomy via neurogenesis, angiogenesis, apoptosis and neural plasticity. BR is conceived as a passive model of reserve in the sense that a fixed amount of volume and synaptic density is assumed, alongside a threshold of maximum damage any given individual brain can cope with. In this model, BR is considered depleted once the threshold of maximum damaged has been crossed, and the clinical and/or functional deficits occur. The concept of brain age provides a proxy of BR, i.e. the difference between brain age estimated from MRI scans and chronological age (predicted age difference, PAD). PAD does not have an empirically established threshold of maximum damage, but our previous work suggests that a difference of six years is an appropriate threshold for cognitive impairment in ALS (ALSci)\n8\n. Notably, as cognitive impairment in ALS-FTDSD is considered a spectrum, not a continuum, it is not expected that all patients with ALSci will inevitably progress to ALS-FTD.\nThis present work will bring together the CR and BR hypotheses to investigate whether their protective effects, which long have been established in AD, do exist in the ALS-FTD spectrum diseases, too. This is distinct from our prior work which either excluded CR\n8\nor excluded BR from its designs\n3\n,\n4\n.", "doc_items_refs": ["#/texts/90", "#/texts/91", "#/texts/92", "#/texts/93", "#/texts/94", "#/texts/95", "#/texts/96", "#/texts/97", "#/texts/98", "#/texts/99", "#/texts/100", "#/texts/101", "#/texts/102", "#/texts/103"], "page_nos": [], "uuid": "33f20531-5b6d-45ce-b60f-e37f418ce36c"}
{"doc_id": "2025__The_role_of_cognitive_and_brain_reserve_in_the_clinical_presentation_and_progres__W4411490345", "source_path": "<redacted:source_path>", "chunk_id": 4, "source_chunk_idxs": [9, 10], "num_tokens": 458, "text": "The role of cognitive and brain reserve in the clinical presentation and progression of amyotrophic lateral sclerosis\nIntroduction\nWithin the ALS-FTD spectrum, it has not yet been established whether cognitive and brain reserve have similar effects. The present study combines four potentially protective characteristics to form a measure of cognitive reserve: educational years, occupational level, presumed premorbid intelligence and PAD (analogue to Consonni et al.'s work,\n7\n). Using these, we addressed four research questions. Firstly, we will examine the probability of developing an ALS-FTD spectrum disease based on these potentially protective characteristics. Secondly, we will investigate the patients' probability of being classified as cognitively or behaviourally impaired based on these characteristics. Thirdly, we will examine the effect of the potentially protective characteristics on patients' survival time, controlling for Strong classification. The Strong criteria\n9\nfacilitate the classification of patients according to their non-motor impairments: cognitive impairment without dementia (ALSci), behavioural impairment without dementia (ALSbi), cognitive-behavioural impairment without dementia (ALScbi), and ALS with FTD (ALS-FTD) or primary progressive aphasia (ALS-PPA). Fourthly, we will compare their effects on age at disease onset.\n\nThe role of cognitive and brain reserve in the clinical presentation and progression of amyotrophic lateral sclerosis\nMethodology\nDesign\nWe further analysed the data from our recent study on brain age in ALS (\n8\n). In brief, we drew our data from the\nALS-FTD Intersite\nproject, conducted at German Center for Neurodegenerative Diseases (DZNE) sites Rostock and Magdeburg, respectively. This observational, cross-sectional study ran between April 2011 and August 2013. Local ethics committees at both study sites approved the study (Rostock: A 2011 56; Magdeburg: 75/11). All participants provided written informed consent; the study was conducted in accordance with the Declaration of Helsinki. Data collection procedures are described by Kasper et al.\n10\n, while brain age estimation procedures are described by Hermann et al.\n8\n. The cohorts between this work and Hermann et al. are identical, with distinct research questions and analyses.", "doc_items_refs": ["#/texts/104", "#/texts/105", "#/texts/106", "#/texts/107", "#/texts/108", "#/texts/111", "#/texts/112", "#/texts/113", "#/texts/114", "#/texts/115", "#/texts/116", "#/texts/117", "#/texts/118", "#/texts/119"], "page_nos": [], "uuid": "0c3ac6d5-3b44-4eec-a49c-1f9ce9b549ca"}
{"doc_id": "2025__The_role_of_cognitive_and_brain_reserve_in_the_clinical_presentation_and_progres__W4411490345", "source_path": "<redacted:source_path>", "chunk_id": 5, "source_chunk_idxs": [11], "num_tokens": 365, "text": "The role of cognitive and brain reserve in the clinical presentation and progression of amyotrophic lateral sclerosis\nMethodology\nParticipants\nIn total, 178 participants were recruited from out-patient clinics and through public advertisement in Rostock and Magdeburg, Germany. Based on our selection criteria, persons with a history of brain injury, epilepsy, psychiatric illness or non-native command of the German language were excluded from participation in both, control group and patient group. ALS patients were only included if they underwent neuropsychological assessment and if data on education and premorbid-IQ was available. Control participants were further screened for cognitive impairment using the Montreal Cognitive Assessment and excluded if they scored below 26/30. The control cohort (n = 32) was age- and sex-matched to the patient cohort (n = 86). Complete data were available for 118 participants, their demographic details can be found in Table\n1\n.\nALS patients were included if they showed progressive muscular weakness in ≥ body regions to also include ALS variants of upper and/or lower motor neuron predominance. ALS diagnoses were made using the revised El Escorial criteria\n11\n. Cognitive classification followed the Strong and Rascovsky criteria\n9\n,\n12\n, i.e., patients were classified into the following groups: ALS without cognitive-behavioural impairments (ALSni [not impaired]), ALS with cognitive impairment (ALSci), ALS with behavioural impairments (ALSbi), ALS with cognitive and behavioural impairments (ALScbi) and ALS with frontotemporal dementia (ALS-FTD).\nAge at onset in this cohort falls within the recently reported onset between 51 and 66 years of age, with German patients reportedly developing the disease around 61 years of age\n13\n.", "doc_items_refs": ["#/texts/121", "#/texts/122", "#/texts/123", "#/texts/124", "#/texts/125", "#/texts/126", "#/texts/127", "#/texts/128", "#/texts/129", "#/texts/130", "#/texts/131", "#/texts/132", "#/texts/133"], "page_nos": [], "uuid": "38070c78-8ce9-4b62-99d8-7a6be6b53199"}
{"doc_id": "2025__The_role_of_cognitive_and_brain_reserve_in_the_clinical_presentation_and_progres__W4411490345", "source_path": "<redacted:source_path>", "chunk_id": 6, "source_chunk_idxs": [12], "num_tokens": 153, "text": "The role of cognitive and brain reserve in the clinical presentation and progression of amyotrophic lateral sclerosis\nMethodology\nMRI Acquisition\nMRI scanning was performed with two 3T Siemens Magnetom VERIO scanners (Erlangen, Germany) using a 32-channel head coil; one single scanner at each site (Rostock and Magdeburg, Germany). High-resolution T\n1\n-weighted anatomical images were acquired using the magnetization-prepared rapid gradient echo (MPRAGE) sequence with the following parameters: 256 × 256 image matrix with 192 sagittal slices, FOV 250 × 250x192mm, voxel size 1 × 1x1mm\n3\n, echo time 4.82ms, repetition time 2500ms, and flip angle 7°.", "doc_items_refs": ["#/texts/135", "#/texts/136", "#/texts/137", "#/texts/138", "#/texts/139"], "page_nos": [], "uuid": "7cd56cf7-f63b-49a3-ae3f-05fb3c595336"}
{"doc_id": "2025__The_role_of_cognitive_and_brain_reserve_in_the_clinical_presentation_and_progres__W4411490345", "source_path": "<redacted:source_path>", "chunk_id": 7, "source_chunk_idxs": [13], "num_tokens": 459, "text": "The role of cognitive and brain reserve in the clinical presentation and progression of amyotrophic lateral sclerosis\nMethodology\nMeasures\nCognitive reserve (CR)\nThis numerical variable was constructed as a composite measure with three proxies: educational years, educational attainment, and verbal intelligence as a measure of general intelligence. Verbal intelligence was measured by passive vocabulary\n14\n; for details see our previous work\n3\n,\n4\n. In ALS, performance on this specific test has been shown to remain intact and indistinguishable from healthy controls\n15\n, and independent from physical disability. We assigned points for each educational year, and according to the international standard classification of education (ISCED) to reflect educational length and achievement. Crucially, the former - educational years - assigns points purely based on the length of time spent in formal education while the latter - ISCED levels - reflects educational achievement. For example, it is possible to obtain 13 years of education by primary and secondary education (\"Realschule\") followed by 3 years of vocational training (\"Berufsausbildung\"), resulting in ISCED level 4, or instead of \"Realschule\" by completing secondary education (\"Gymnasium\") without any further tertiary education or vocational training -resulting in ISCED level 3. Our CR measure was the mean of educational years, ISCED level and IQ points. Consequently, a numerically higher value indicates a higher level of cognitive reserve.\nChronological age.\nAge from birth to the time of data collection, rounded to full years.\nPredicted age difference (PAD).\nThe individual deviation between estimated brain age and chronological age, in years. Persons whose brains appear older than their chronological age will have positive values, for example if a 60-year-old's brain is estimated to be 65 years old, their PAD would be 5. Consequently, persons whose brain appear younger than their chronological age will have negative values, if a 60-year-old's brain is estimated to be 55 years old, then their PAD would be -5. PAD serves as our proxy of BR, with persons who have a numerically high PAD and therefore an older brain conceptualized as having \"low brain reserve\" and those who have a numerically lower value thought to have \"high brain reserve\".", "doc_items_refs": ["#/texts/142", "#/texts/143", "#/texts/144", "#/texts/145", "#/texts/146", "#/texts/147", "#/texts/148", "#/texts/149", "#/texts/150", "#/texts/151", "#/texts/152", "#/texts/153", "#/texts/154"], "page_nos": [], "uuid": "2e67be0e-cb77-4e33-bee1-3da530a26fb7"}
{"doc_id": "2025__The_role_of_cognitive_and_brain_reserve_in_the_clinical_presentation_and_progres__W4411490345", "source_path": "<redacted:source_path>", "chunk_id": 8, "source_chunk_idxs": [14], "num_tokens": 323, "text": "The role of cognitive and brain reserve in the clinical presentation and progression of amyotrophic lateral sclerosis\nMethodology\nMeasures\nCognitive reserve (CR)\nBrain age model and predicted brain age difference (PAD): We estimated brain age in R, using the package \"brainageR\" (version 2.1), available at\nhttps://github.com/james-cole/brainageR\n. This algorithm was trained on n = 3377 healthy adults and validated on 857 people. To predict brain age, we followed an automated pipeline starting with T1-weighted image segmentation and normalization using SPM12 with smoothing with a 4 mm Gaussian kernel and modulation to match with the training sample. Then, the spatially normalized grey and white matter and cerebrospinal fluid probability maps were loaded into R and vectorised. They were masked to exclude voxels with less than 30% probability for the corresponding brain tissue class. Subsequently, these maps underwent a principal component analysis transformation, based on the training data. The transformed data were then entered in the pretrained Gaussian process regression model to obtain the predicted brain age. Finally, chronological age was subtracted from the brain age to calculate PAD.\nStrong profile.\nParticipants underwent comprehensive neuropsychological assessment, as described previously\n16\n,\n17\n, and classified according to the Strong criteria\n18\n. Diagnoses of ALS-FTD were made based on the Rascovsky criteria\n12\n.\nALS vs HC.\nThis binary variable grouped all ALS patients together, regardless of non-motor impairment, to distinguish them from HC.", "doc_items_refs": ["#/texts/155", "#/texts/156", "#/texts/157", "#/texts/158", "#/texts/159", "#/texts/160", "#/texts/161", "#/texts/162", "#/texts/163", "#/texts/164", "#/texts/165", "#/texts/166", "#/texts/167", "#/texts/168", "#/texts/169"], "page_nos": [], "uuid": "de798201-2f59-47bd-b461-4ce9846d5d1d"}
{"doc_id": "2025__The_role_of_cognitive_and_brain_reserve_in_the_clinical_presentation_and_progres__W4411490345", "source_path": "<redacted:source_path>", "chunk_id": 9, "source_chunk_idxs": [15], "num_tokens": 414, "text": "The role of cognitive and brain reserve in the clinical presentation and progression of amyotrophic lateral sclerosis\nMethodology\nStatistical analysis\nAll statistical modelling took place using the\nbrms\npackage in R. Predictors included CR, PAD, age, sex and Strong profile. The outcome variables were group (ALS vs HC), Strong profile, total disease duration, and age at onset. Strong profile served as outcome for our second research question, and as a predictor in our third and fourth research question.\nThe focus of our work was parameter estimation, so individual predictors' significance is determined by their 95% credible intervals: credible intervals (CI) which contain zero indicate that zero is a plausible effect size for the predictor under consideration. Consequently, predictors with a plausible effect size of zero were not considered significant. In the case of odds ratios (OR), CI overlapping 1 were not considered significant. To determine significance, we used results based on standardized outcomes; the interpretation of these results however relied on unstandardized variables.\nTo examine the probability of being classified as having an ALS-FTD spectrum disease instead of as a healthy control person based on these potentially protective characteristics, we chose a logistic regression using the Bernoulli distribution with the predictors of age, sex, CR and PAD on the binary outcome variable \"HC vs ALS-FTDSD\". To examine the effect of PAD and CR on the probability of an ALS patient developing cognitive-behavioural impairments, we conducted a multinomial regression using the \"categorical\" family; the predictors were age, sex, CR and PAD while Strong criteria classification served as the outcome. The effects on patients' survival and age at onset were modelled with Gaussian distributions. We specified subjective priors reflecting our hypotheses and expectations as outlined in the introduction; these priors including their justification can be found in the online supplement, see Data Availability Statement. Multicollinearity was assessed using the\nperformance\npackage, with the function check\\_collinearity().", "doc_items_refs": ["#/texts/171", "#/texts/172", "#/texts/173", "#/texts/174", "#/texts/175", "#/texts/176", "#/texts/177"], "page_nos": [], "uuid": "8fd118b9-d34f-4208-8c78-a2696189d577"}
{"doc_id": "2025__The_role_of_cognitive_and_brain_reserve_in_the_clinical_presentation_and_progres__W4411490345", "source_path": "<redacted:source_path>", "chunk_id": 10, "source_chunk_idxs": [16], "num_tokens": 484, "text": "The role of cognitive and brain reserve in the clinical presentation and progression of amyotrophic lateral sclerosis\nResults\nWe explored four research questions. Firstly, we examined the odds ratios (OR) of developing an ALS-FTDSD based on CR and PAD (Model 1, Fig.\n1\nA). Secondly, we investigated the OR of being classified as cognitively or behaviourally impaired based on CR and PAD (Model 2, Table\n2\n, Fig.\n1\nB). Thirdly, we examined the effect of PAD and CR on patients' survival time, controlling for Strong classification (Model 3, Table\n2\n, Fig.\n1\nC). Fourthly, we explored any associations between CR, BR and age of disease onset (Model 4, Table\n2\n). The OR, standardised (β) and unstandardised (B) coefficients of the significant predictors can be obtained from Table\n2\nbelow. Details on non-significant coefficients can be found in our online supplement, see Data Availability Statement. Please note that Model 1 resulted in no significant effects at all; hence, it is excluded from Table\n2\nand Fig.\n1\n.\nFig. 1\nFigure\n1\nillustrates the standardized predictors and their CI.\nResearch question 1:\nHow do PAD and CR affect the probability of being diagnosed with ALS altogether?\nThis logistic regression used the Bernoulli distribution as a prior with the predictors of age, sex, CR and PAD on the binary outcome variable \"HC vs ALS-FTDSD\". There were no meaningful effects as all OR derived from standardized coefficients overlapped 1, indicating that there was great uncertainty in our data as to whether PAD (OR = 1.19, CI: 0.76-1.87), CR (OR = 0.68, CI: 0.45-1.05), chronological age (OR = 0.89, CI: 0.59-1.35) and sex (OR = 1.13, CI: 0.59-2.20) affect the probability of developing ALS. This was also true for OR derived from unstandardized coefficients. Consequently, these data do not provide any evidence for or against the effect of PAD and CR on the probability of developing ALS, see .\n1\nA.\nResearch question 2:\nOnce ALS is diagnosed, do PAD and CR affect the probability of being diagnosed with cognitive-behavioural impairments?", "doc_items_refs": ["#/texts/179", "#/texts/180", "#/texts/181", "#/texts/182", "#/texts/183", "#/texts/184", "#/texts/185", "#/texts/186", "#/texts/187", "#/texts/188", "#/texts/189", "#/texts/190", "#/texts/191", "#/texts/192", "#/texts/193", "#/texts/194", "#/texts/195", "#/texts/196", "#/texts/197", "#/texts/198", "#/texts/199", "#/texts/200", "#/texts/201", "#/texts/202", "#/texts/203", "#/texts/204", "#/texts/205", "#/texts/206", "#/texts/207", "#/texts/208"], "page_nos": [], "uuid": "aa63d039-2ecb-4cec-9d1e-b9c5a411caca"}
{"doc_id": "2025__The_role_of_cognitive_and_brain_reserve_in_the_clinical_presentation_and_progres__W4411490345", "source_path": "<redacted:source_path>", "chunk_id": 11, "source_chunk_idxs": [17], "num_tokens": 446, "text": "The role of cognitive and brain reserve in the clinical presentation and progression of amyotrophic lateral sclerosis\nResults\nThis multinomial regression used the \"categorical\" family, with the predictors age, sex, CR and PAD with Strong criteria classification as the outcome. Patients with higher PAD had a higher risk of being diagnosed as ALSci or ALS-FTD (Table\n2\n, .\n2\nA). For each additional year in PAD, the risk of being diagnosed as ALSci increased by 24%, and the risk of being diagnosed as ALS-FTD increased by 36% (see the OR in Table\n2\n).\nFig. 2\nConversely, patients with higher CR had a lower risk of being diagnosed with ALSci (Fig.\n2\nB). For each point in CR, the probability of being diagnosed as ALSci decreased by 18%. These standardized coefficients indicate that the detrimental effect of PAD is stronger than the beneficial effect of CR.\nThere were no unidirectional effects of ALS or CR on the risk of being diagnosed as ALSbi, and no effects of sex or chronological age on any Strong profile (Fig.\n1\nB, Table\n2\n).\nSince cognitive impairment is reported to be influenced also by onset type, we explored onset type as a covariate in this analysis. Onset type did not significantly predict outcomes, as the 95% credible intervals for its effects encompassed zero (ALSbi: b = -0.59, 95% CI: -2.29 to 1.06; ALSci: b = -0.47, 95% CI: -1.95 to 1.01; ALS-FTD: b = -2.32, 95% CI: -5.22 to 0.04). When onset type was included, only the effects of PAD remained robust, showing significant associations in ALSci (b = 1.20, 95% CI: 0.41 to 2.09) and ALS-FTD (b = 1.60, 95% CI: 0.42 to 2.88), while the effect of CR was no longer significant.\nResearch question 3:\nHow do Strong profile, PAD and CR affect total disease duration?", "doc_items_refs": ["#/texts/209", "#/texts/210", "#/texts/211", "#/texts/212", "#/texts/213", "#/texts/214", "#/texts/215", "#/texts/216", "#/texts/217", "#/texts/218", "#/texts/219", "#/texts/220", "#/texts/221", "#/texts/222", "#/texts/223", "#/texts/224", "#/texts/225", "#/texts/226", "#/texts/227"], "page_nos": [], "uuid": "b1a3463d-4c43-415a-93ea-8cd7fa890f08"}
{"doc_id": "2025__The_role_of_cognitive_and_brain_reserve_in_the_clinical_presentation_and_progres__W4411490345", "source_path": "<redacted:source_path>", "chunk_id": 12, "source_chunk_idxs": [18], "num_tokens": 428, "text": "The role of cognitive and brain reserve in the clinical presentation and progression of amyotrophic lateral sclerosis\nResults\nThis was a linear regression assuming a Gaussian distribution, with CR and BR as the predictors, age and sex as the covariates and months of total disease duration as outcome. Among all patients, those with higher CR lived longer: each 1-point increase in CR was associated with 0.67 additional months of lifetime (approximately 20 days, see the OR in Table\n2\n). Conversely, being diagnosed with ALS-FTD decreased patients' lifetime by two months (b = -2.01, Table\n2\n). A detrimental effect was also observed for chronological age at time of assessment, for each additional year of age at diagnosis, participants lived approximately 17 days shorter (b = -0.55). There were no effects of PAD, sex, ALSbi or ALSci on total disease duration (see Fig.\n1\nC). We re-ran this analysis excluding CR as a predictor to be able to better compare it to our previous work which relied on a simple Kendall's tau correlation\n8\n. This linear regression supported a negative effect of PAD on disease duration (b = -1.09, 95%CI -2.03 to -0.20). This intriguing observation prompted us to explore the association between PAD and CR in their effects on disease duration more thoroughly. As reported above, their VIF were well below 5 (VIF\nCR\n= 1.00, VIF\nPAD\n= 1.02), indicating that multicollinearity between them was low. We re-ran the linear regression with PAD and CR as predictors and added their interaction term. However, the interaction term yielded no meaningful effect (b = -0.20, 95% CI: -1.70 to 2.05), suggesting that CR does not systematically alter the influence of PAD on disease duration. This conclusion is supported by Fig.\n3\n, where we grouped patients into \"Older Brain\" (PAD &gt; 0) and \"Younger Brain\" (PAD\nFig. 3", "doc_items_refs": ["#/texts/228", "#/texts/229", "#/texts/230", "#/texts/231", "#/texts/232", "#/texts/233", "#/texts/234", "#/texts/235", "#/texts/236", "#/texts/237", "#/texts/238", "#/texts/239", "#/texts/240", "#/texts/241", "#/texts/242", "#/texts/243"], "page_nos": [], "uuid": "ebf4d078-872c-4394-892b-dfb1bde2feaa"}
{"doc_id": "2025__The_role_of_cognitive_and_brain_reserve_in_the_clinical_presentation_and_progres__W4411490345", "source_path": "<redacted:source_path>", "chunk_id": 13, "source_chunk_idxs": [19], "num_tokens": 340, "text": "The role of cognitive and brain reserve in the clinical presentation and progression of amyotrophic lateral sclerosis\nResults\nTo complement this analysis, we explored the fact that persons with a faster disease progression speed would also die sooner. We investigated the effects of PAD and CR on disease progression speed, calculated as the delta of ALSFRS-R between reported symptom onset and first study visit (see Table\n1\n). The predictors were PAD, CR, chronological age and sex. However, only chronological age turned out to be associated with disease progression speed (b = 0.18, 95% CI: 0.06 to 0.30), indicating that older patients showed a faster disease progression.\nResearch question 4:\nHow do PAD and CR affect age at disease onset?\nThis was a linear regression assuming a Gaussian distribution, with CR and BR as the predictors, age and sex as the covariates and age at onset in years as outcome. None of the standardized coefficients suggested a meaningful effect of PAD or CR which is why we excluded these results from Figs.\n1\nand\n2\n.\nFinally, we also explored the fit of non-linear modelling techniques by fitting generalized additive models (GAM) in\nbrms\nby adding smoothed terms for PAD and CR to each of the above models. We evaluated model fit using leave one out (LOO) cross-validation with the LOO information criterion. However, there was no significant difference in the fit of the GAM compared to the linear models outlined above, implying that there were no substantial non-linear or threshold effects present, and that the linear specifications adequately captured the relationships between PAD, CR, and the outcome variables.", "doc_items_refs": ["#/texts/244", "#/texts/245", "#/texts/246", "#/texts/247", "#/texts/248", "#/texts/249", "#/texts/250", "#/texts/251", "#/texts/252", "#/texts/253", "#/texts/254", "#/texts/255", "#/texts/256"], "page_nos": [], "uuid": "9974cbaf-65cc-42d0-87bd-c1600db65e65"}
{"doc_id": "2025__The_role_of_cognitive_and_brain_reserve_in_the_clinical_presentation_and_progres__W4411490345", "source_path": "<redacted:source_path>", "chunk_id": 14, "source_chunk_idxs": [20], "num_tokens": 386, "text": "The role of cognitive and brain reserve in the clinical presentation and progression of amyotrophic lateral sclerosis\nDiscussion\nWe investigated and compared the effects of PAD and CR on the probability of developing ALS altogether, the probability of being classified as ALSni instead of being classified as ALSci, ALSbi, ALScbi and ALS-FTD, total disease duration and age of onset. The aim was to compare the effects of cognitive reserve as well as PAD, the latter as a proxy of brain reserve. Neither measure mediated the risk of being diagnosed with ALS altogether. However, with each additional year that their brain was estimated to be older than their chronological age, patients' risk of being diagnosed with ALSci increased by 25%, and the risk of being diagnosed as ALS-FTD increased by 36%. Conversely, with each point in CR, their risk of being diagnosed as ALSci decreased by 20%. Similar protective effects by CR were observed on total disease duration: for each point in CR, patients' lifespan was extended by 20 days. This effect size sounds trivial but when we consider that the range of CR in our sample was 31-56 points, the possible life span extension associated with CR ranged between 620 to 1120 days (20 to 37 months). Most notably, this lifestyle effect exceeds the effect of Riluzole treatment, for which randomised clinical trials suggested a lifespan extension of approximately three months, and whose real-world evidence suggests an extension of up to 19 months' median time\n19\n. This highlights that CR supports patients' ability to cope with the increasing load of ALS-related neuropathology as the disease progresses. Conversely, being diagnosed with ALS-FTD reduced patients' disease duration by two months, i.e., these persons died two months sooner. Cognitive impairment being associated with a shorter lifespan is a well-documented effect in ALS-FTDSD\n20\n,\n21\n.", "doc_items_refs": ["#/texts/258", "#/texts/259", "#/texts/260", "#/texts/261", "#/texts/262", "#/texts/263", "#/texts/264"], "page_nos": [], "uuid": "63237464-3e4d-4f19-b9cf-2038daec8871"}
{"doc_id": "2025__The_role_of_cognitive_and_brain_reserve_in_the_clinical_presentation_and_progres__W4411490345", "source_path": "<redacted:source_path>", "chunk_id": 15, "source_chunk_idxs": [21], "num_tokens": 435, "text": "The role of cognitive and brain reserve in the clinical presentation and progression of amyotrophic lateral sclerosis\nDiscussion\nPAD not being associated with longer disease duration deviates from our own previous findings: we initially had observed a correlation whereby younger brain age correlated with longer disease duration. However, this previous finding was based on Kendall's tau correlations, which did not feature confounding variables. The present analysis is a regression analysis which considered CR, sex and age in addition to PAD as predictors of disease duration. This prompts the discussion of why PAD is associated with an increased risk of ALS-FTD - which in turn reduces disease duration - without affecting disease duration directly. PAD only constitutes a crude indicator of brain health while ALS-FTD as a disease affects the brain as well as the spinal cord, and in turn, body regions beyond, which perhaps better reflects the disease in total. One possible explanation for this discrepancy is that PAD is strongly driven by cerebellar volume\n8\n, which is not a primary determinant of disease duration in ALS. While cerebellar atrophy has been linked to neurodegeneration and motor dysfunction, ALS progression is characterized by widespread involvement of both upper and lower motor neurons, as well as cognitive decline in ALS-FTD. Thus, PAD may capture neuroanatomical changes that increase susceptibility to ALS-FTD but do not directly regulate the speed of disease progression.\nWhile work on CR and PAD and how they might affect disease outcomes in ALS is just at its beginning, this is well established in other neurodegenerative diseases, mainly in Alzheimer's disease (AD). The concept of CR refers to the capacity to retain adequate cognitive functioning in the presence of neurodegenerative changes, while of brain aging refers to the preservation overall age-related brain atrophy. In AD, PAD was found to be associated with cognitive decline\n22\nand molecular markers of pathology\n23\n. High CR may mitigate the accumulation rate of amyloid prior to cognitive impairment and support glucose metabolism during the dementia stage throughout the progression of AD pathology\n24\n.", "doc_items_refs": ["#/texts/265", "#/texts/266", "#/texts/267", "#/texts/268", "#/texts/269", "#/texts/270", "#/texts/271", "#/texts/272", "#/texts/273", "#/texts/274"], "page_nos": [], "uuid": "cfbab789-a375-4715-b5fa-e30de2b16328"}
{"doc_id": "2025__The_role_of_cognitive_and_brain_reserve_in_the_clinical_presentation_and_progres__W4411490345", "source_path": "<redacted:source_path>", "chunk_id": 16, "source_chunk_idxs": [22], "num_tokens": 427, "text": "The role of cognitive and brain reserve in the clinical presentation and progression of amyotrophic lateral sclerosis\nDiscussion\nCR not being associated with the risk of ALS, nor with a later disease onset distinguishes ALS from other neurodegenerative diseases such as AD, where its protective effects have long been documented\n2\n,\n24\n,\n25\n,\n26\n. Given that our analyses showed no effect of CR on disease progression speed, we do not think that ALS' relatively aggressive progression is the reason for the absence of CR's effect here. Rather, we hypothesise that the neuropathology underlying ALS predominantly accumulates outside of areas where CR typically exerts its protective influence, e.g. the motor cortex. It is also possible that CR influences early, pre-symptomatic stages of ALS that were not captured in this study. With our data also rejecting PAD as a protective factor, there is now evidence supporting the theory that CR and brain reserve affect patients' ability to cope with neurodegenerative diseases distinctively. CR and PAD both mediating the probability of cognitive impairment, with PAD also playing a role in ALS-FTD is consistent with our prior work which showed that increased brain age was associated with fronto-temporal atrophy\n8\n, and that CR protects ALS patients from functional decline even when atrophy is present and increasing\n3\n,\n4\n,\n5\n. Additionally, since a lower PAD is partly driven by cerebellar volume\n8\n, this further distinguishes its effects from CR, which is more strongly associated with cortical and functional resilience. This difference may explain why PAD contributes to ALS-FTD risk but does not significantly influence disease duration once CR is included in the model.\nA recent study investigated the interplay of CR and brain age and found that higher CR was associated with lower cognitive impairment independent of brain aging\n27\n, while lifestyle trajectories were associated with brain aging but independent of cognition\n28\n. This aligns closely with our findings that CR and PAD might predict different aspects of ALS disease outcome. Further work is needed to better understand this relationship, particularly in ALS.", "doc_items_refs": ["#/texts/275", "#/texts/276", "#/texts/277", "#/texts/278", "#/texts/279", "#/texts/280", "#/texts/281", "#/texts/282", "#/texts/283", "#/texts/284", "#/texts/285", "#/texts/286", "#/texts/287", "#/texts/288", "#/texts/289", "#/texts/290", "#/texts/291", "#/texts/292", "#/texts/293", "#/texts/294", "#/texts/295", "#/texts/296", "#/texts/297", "#/texts/298"], "page_nos": [], "uuid": "7fee43b9-c5cd-4c72-9499-61933b94d1c6"}
{"doc_id": "2025__The_role_of_cognitive_and_brain_reserve_in_the_clinical_presentation_and_progres__W4411490345", "source_path": "<redacted:source_path>", "chunk_id": 17, "source_chunk_idxs": [23, 24], "num_tokens": 409, "text": "The role of cognitive and brain reserve in the clinical presentation and progression of amyotrophic lateral sclerosis\nDiscussion\nLimitations of this study include the small sample sizes across the ALSbi and ALS-FTD subgroups, specifically, due to the relative rarity of the disease subtypes. Furthermore, there are some proxies of CR that were not available to us, such as level of regular exercise and multilingualism\n7\n. Furthermore, the brain-age analysis pipeline yields a single value and its ease of use might make it well suited in routine clinical care. However, it is conceptualized on the whole brain and distinct neuroanatomical information are not available. Consequently, it might not be sensitive enough for every disease entity depending on the spatial patterns of brain atrophy.\nAll in all, our findings provide some support for both, the cognitive reserve hypothesis and the brain reserve hypothesis. Given the effect sizes estimated here, it appears that CR had only moderately beneficial effects: namely, on the risk of developing cognitive impairment and longer disease duration. Contrastingly, the effect of accelerated brain ageing was more strongly detrimental, in the form of an increased risk of developing ALS-FTD. The finding that ALS-FTD is associated with a shorter disease duration independently from brain ageing speed supports the notion that not all factors underlying rapid disease progression are yet captured by brain age algorithms.\nIn conclusion, the present data indicate that the effect of low brain reserve is more detrimental than the positive effect of high cognitive reserve. However, both mechanisms appear to affect disease presentation and progression independently, and differently.\n\nThe role of cognitive and brain reserve in the clinical presentation and progression of amyotrophic lateral sclerosis\nData availability\nThe data in .csv file format, R code as an RMarkdown file and a full data report rendered into PDF are available from the Open Science Framework at:\nhttps://osf.io/td2xa/\n. The code supports all the analyses and figures produced for this manuscript.", "doc_items_refs": ["#/texts/299", "#/texts/300", "#/texts/301", "#/texts/302", "#/texts/303", "#/texts/305", "#/texts/306", "#/texts/307"], "page_nos": [], "uuid": "770db20c-46de-47b7-b86b-e61b4563dc69"}
{"doc_id": "2025__The_role_of_cognitive_and_brain_reserve_in_the_clinical_presentation_and_progres__W4411490345", "source_path": "<redacted:source_path>", "chunk_id": 18, "source_chunk_idxs": [25], "num_tokens": 489, "text": "The role of cognitive and brain reserve in the clinical presentation and progression of amyotrophic lateral sclerosis\nReferences\n1. Stern, Y. Cognitive reserve.\nNeuropsychologia\n47\n, 2015-2028 (2009).\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n2. Craik, F. I., Bialystok, E. &amp; Freedman, M. Delaying the onset of Alzheimer disease: bilingualism as a form of cognitive reserve.\nNeurology\n75\n, 1726-1729 (2010).\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n3. Temp, A. G. M. et al. Cognitive reserve protects ALS-typical cognitive domains: A longitudinal study.\nAnn. Clin. Transl. Neurol.\n9\n, 1212-1223 (2022).\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n4. Temp, A. G. M. et al. Cognitive reserve and regional brain volume in amyotrophic lateral sclerosis.\nCortex\n139\n, 240-248 (2021).\nArticle\nPubMed\nGoogle Scholar\n5. Canosa, A. et al. The interplay among education, brain metabolism, and cognitive impairment suggests a role of cognitive reserve in Amyotrophic Lateral Sclerosis.\nNeurobiol. Aging.\n98\n, 205-213 (2021).\nArticle\nCAS\nPubMed\nGoogle Scholar\n6. Costello, E. et al. Cognitive reserve in amyotrophic lateral sclerosis (ALS): a population-based longitudinal study.\nJ. Neurol. Neurosurg. Psychiatry.\n92\n, 460-465 (2021).\nArticle\nPubMed\nGoogle Scholar\n7. Consonni, M., Dalla Bella, E., Bersano, E., Telesca, A. &amp; Lauria, G. Cognitive reserve is associated with altered clinical expression in amyotrophic lateral sclerosis.\nAmyotroph Lateral Scler Frontotemporal Degener.\n22\n, 237-247 (2021).\nArticle\nPubMed\nGoogle Scholar\n8. Hermann A, Tarakdjian GN, Temp AGM, Kasper E, Machts J, Kaufmann J, et al. Cognitive and behavioural but not motor impairment increases brain age in amyotrophic lateral sclerosis. Brain Commun. (2022).", "doc_items_refs": ["#/texts/309", "#/texts/310", "#/texts/311", "#/texts/312", "#/texts/313", "#/texts/314", "#/texts/315", "#/texts/316"], "page_nos": [], "uuid": "6fdaa2e1-8d33-4b1c-95a0-1aca003106ac"}
{"doc_id": "2025__The_role_of_cognitive_and_brain_reserve_in_the_clinical_presentation_and_progres__W4411490345", "source_path": "<redacted:source_path>", "chunk_id": 19, "source_chunk_idxs": [26], "num_tokens": 476, "text": "The role of cognitive and brain reserve in the clinical presentation and progression of amyotrophic lateral sclerosis\nReferences\n9. Strong, M. J. et al. Amyotrophic lateral sclerosis - frontotemporal spectrum disorder (ALS-FTSD): Revised diagnostic criteria.\nAmyotr. Lateral Sclerosis Frontotempor. Degeneration.\n18\n, 153-174 (2017).\nArticle\nGoogle Scholar\n10. Schuster, C. et al. Cortical thinning and its relation to cognition in amyotrophic lateral sclerosis.\nNeurobiol. Aging.\n35\n, 240-246 (2014).\nArticle\nPubMed\nGoogle Scholar\n11. Brooks BR, Miller RG, Swash M, Munsat TL, World Federation of Neurology Research Group on Motor Neuron Diseases. El Escorial revisited: revised criteria for the diagnosis of amyotrophic lateral sclerosis. Amyotroph Lateral Scler Other Motor Neuron Disord. (2000).\n12. Rascovsky, K. et al. Sensitivity of revised diagnostic criteria for the behavioural variant of frontotemporal dementia.\nBrain\n134\n, 2456-2477 (2011).\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n13. Longinetti, E. &amp; Fang, F. Epidemiology of amyotrophic lateral sclerosis: an update of recent literature.\nCurr. Opin. Neurol.\n32\n, 771-776 (2019).\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n14. Schmidt K-H, Metzler P. Wortschatztest. Göttingen, Germany: Hogrefe testzentrale, (1992).\n15. Osmanovic A, Wieselmann G, Mix L, Siegler HA, Kumpe M, Ranxha G, et al. Cognitive Performance of Patients with Adult 5q-Spinal Muscular Atrophy and with Amyotrophic Lateral Sclerosis. Brain Sci. (2020).\n16. Kasper, E. et al. No Change in Executive Performance in ALS Patients: A Longitudinal Neuropsychological Study.\nNeurodegener. Dis.\n16\n, 184-191 (2016).\nArticle\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/317", "#/texts/318", "#/texts/319", "#/texts/320", "#/texts/321", "#/texts/322", "#/texts/323", "#/texts/324"], "page_nos": [], "uuid": "a62458da-7c5c-4ffc-b076-d15dced6e5d6"}
{"doc_id": "2025__The_role_of_cognitive_and_brain_reserve_in_the_clinical_presentation_and_progres__W4411490345", "source_path": "<redacted:source_path>", "chunk_id": 20, "source_chunk_idxs": [27], "num_tokens": 466, "text": "The role of cognitive and brain reserve in the clinical presentation and progression of amyotrophic lateral sclerosis\nReferences\n17. Kasper, E. et al. Dysexecutive functioning in ALS patients and its clinical implications.\nAmyotroph Lateral Scler. Frontotemporal Degener.\n16\n, 160-171 (2015).\nArticle\nCAS\nPubMed\nGoogle Scholar\n18. Strong, M. J. et al. Amyotrophic lateral sclerosis - frontotemporal spectrum disorder (ALS-FTSD): Revised diagnostic criteria.\nAmyotroph. Lateral Scler Frontotemporal Degener.\n18\n, 153-174 (2017).\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n19. Hinchcliffe, M. &amp; Smith, A. Riluzole: real-world evidence supports significant extension of median survival times in patients with amyotrophic lateral sclerosis.\nDegener Neurol. Neuromuscul. Dis.\n7\n, 61-70 (2017).\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n20. Elamin, M. et al. Executive dysfunction is a negative prognostic indicator in patients with ALS without dementia.\nNeurology\n76\n, 1263-1269 (2011).\nArticle\nCAS\nPubMed\nGoogle Scholar\n21. Van Laere, K. et al. Value of 18fluorodeoxyglucose-positron-emission tomography in amyotrophic lateral sclerosis: a prospective study.\nJAMA Neurol.\n71\n, 553-561 (2014).\nArticle\nPubMed\nGoogle Scholar\n22. Gaser C, Franke K, Kloppel S, Koutsouleris N, Sauer H, Alzheimer's Disease Neuroimaging I. BrainAGE in Mild Cognitive Impaired Patients: Predicting the Conversion to Alzheimer's Disease. PLoS One. (2013).\n23. Millar PR, Gordon BA, Luckett PH, Benzinger TLS, Cruchaga C, Fagan AM, et al. Multimodal brain age estimates relate to Alzheimer disease biomarkers and cognition in early stages: a cross-sectional observational study. Elife. (2023).", "doc_items_refs": ["#/texts/325", "#/texts/326", "#/texts/327", "#/texts/328", "#/texts/329", "#/texts/330", "#/texts/331"], "page_nos": [], "uuid": "315f759b-fbae-464f-bd30-d6e48d127a74"}
{"doc_id": "2025__The_role_of_cognitive_and_brain_reserve_in_the_clinical_presentation_and_progres__W4411490345", "source_path": "<redacted:source_path>", "chunk_id": 21, "source_chunk_idxs": [28, 29, 30], "num_tokens": 499, "text": "The role of cognitive and brain reserve in the clinical presentation and progression of amyotrophic lateral sclerosis\nReferences\n24. Lo, R. Y. &amp; Jagust, W. J. Effect of cognitive reserve markers on Alzheimer pathologic progression.\nAlzheimer Dis. Assoc. Disord.\n27\n, 343-350 (2013).\nArticle\nCAS\nPubMed\nGoogle Scholar\n25. Dodich, A. et al. Social and cognitive control skills in long-life occupation activities modulate the brain reserve in the behavioural variant of frontotemporal dementia.\nCortex\n99\n, 311-318 (2018).\nArticle\nPubMed\nGoogle Scholar\n26. McGurn, B., Deary, I. J. &amp; Starr, J. M. Childhood cognitive ability and risk of late-onset Alzheimer and vascular dementia.\nNeurology\n71\n, 1051-1056 (2008).\nArticle\nPubMed\nGoogle Scholar\n27. Dintica, C. S., Habes, M., Davatzikos, C., Sidney, S. &amp; Yaffe, K. The association between cognitive reserve, cognition and brain age in Midlife: The CARDIA Study.\nAlzheimers Dement.\nhttps://doi.org/10.1002/alz.064738\n(2022).\nArticle\nPubMed\nGoogle Scholar\n28. Anaturk, M. et al. Prediction of brain age and cognitive age: Quantifying brain and cognitive maintenance in aging.\nHum. Brain Mapp.\n42\n, 1626-1640 (2021).\nArticle\nPubMed\nGoogle Scholar\nDownload references\n\nThe role of cognitive and brain reserve in the clinical presentation and progression of amyotrophic lateral sclerosis\nAcknowledgements\nWe acknowledge all patients and healthy controls for their participation in the intersite project.\n\nThe role of cognitive and brain reserve in the clinical presentation and progression of amyotrophic lateral sclerosis\nFunding\nOpen Access funding enabled and organized by Projekt DEAL.\nThis work was supported in part by the Boris Canessa ALS foundation and the Hermann und Lilly Schilling-Stiftung für medizinische Forschung im Stifterverband. None of those had any role in the design and execution of this study, nor in the subsequent analyses and interpretation of the data, nor in the decision to publish the results. We were not paid to write this article by a pharmaceutical company or other agency.", "doc_items_refs": ["#/texts/332", "#/texts/333", "#/texts/334", "#/texts/335", "#/texts/336", "#/texts/337", "#/texts/339", "#/texts/341", "#/texts/342"], "page_nos": [], "uuid": "ed62917d-479d-4668-8b0b-34fc1ada342d"}
{"doc_id": "2025__The_role_of_cognitive_and_brain_reserve_in_the_clinical_presentation_and_progres__W4411490345", "source_path": "<redacted:source_path>", "chunk_id": 22, "source_chunk_idxs": [31], "num_tokens": 464, "text": "The role of cognitive and brain reserve in the clinical presentation and progression of amyotrophic lateral sclerosis\nAuthor information\nAuthors and Affiliations\n1. Department of Neurology, Translational Neurodegeneration Section \"Albrecht-Kossel\", University Medical Center Rostock, University of Rostock, Gehlsheimer Straße 20, 18147, Rostock, Germany Anna G. M. Temp, Gaël Nils Tarakdjian &amp; Andreas Hermann\n2. Deutsches Zentrum Für Neurodegenerative Erkrankungen (DZNE) Rostock/Greifswald, 18147, Rostock, Germany Anna G. M. Temp, Johannes Prudlo, Martin Dyrba, Stefan Teipel &amp; Andreas Hermann\n3. Center for Transdisciplinary Neurosciences Rostock (CTNR), University Medical Center Rostock, University of Rostock, 18147, Rostock, Germany Stefan Teipel &amp; Andreas Hermann\n4. Department of Neurology, University Medical Center Rostock, University of Rostock, 18147, Rostock, Germany Elisabeth Kasper &amp; Johannes Prudlo\n5. Institute for Cognitive Neurology and Dementia Research, Otto-Von-Guericke University Magdeburg, 39120, Magdeburg, Germany Judith Machts\n6. Center for Behavioral Brain Sciences CBBS, 39104, Magdeburg, Germany Judith Machts\n7. Deutsches Zentrum Für Neurodegenerative Erkrankungen (DZNE) Magdeburg, 39120, Magdeburg, Germany Judith Machts &amp; Stefan Vielhaber\n8. Department of Neurology, Otto-Von-Guericke University Magdeburg, 39120, Magdeburg, Germany Jörn Kaufmann &amp; Stefan Vielhaber\n9. Centre for Medical Image Computing, Department of Computer Science, UCL, London, UK James H. Cole\n10. Dementia Research Centre, Queen Square Institute of Neurology, UCL, London, UK James H. Cole\n11. Department of Psychosomatic Medicine, University Medical Center Rostock, University of Rostock, 18147, Rostock, Germany Stefan Teipel\nAuthors", "doc_items_refs": ["#/texts/345", "#/texts/346", "#/texts/347", "#/texts/348", "#/texts/349", "#/texts/350", "#/texts/351", "#/texts/352", "#/texts/353", "#/texts/354", "#/texts/355", "#/texts/356"], "page_nos": [], "uuid": "cdcb6bc2-4222-488a-9c9f-8070b5468c12"}
{"doc_id": "2025__The_role_of_cognitive_and_brain_reserve_in_the_clinical_presentation_and_progres__W4411490345", "source_path": "<redacted:source_path>", "chunk_id": 23, "source_chunk_idxs": [32, 33], "num_tokens": 421, "text": "The role of cognitive and brain reserve in the clinical presentation and progression of amyotrophic lateral sclerosis\nAuthor information\nAuthors and Affiliations\n1. Anna G. M. Temp\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n2. Gaël Nils Tarakdjian\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n3. Elisabeth Kasper\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n4. Judith Machts\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n5. Jörn Kaufmann\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n6. Stefan Vielhaber\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n7. Johannes Prudlo\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n8. James H. Cole\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n9. Martin Dyrba\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n10. Stefan Teipel\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n11. Andreas Hermann\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n\nThe role of cognitive and brain reserve in the clinical presentation and progression of amyotrophic lateral sclerosis\nAuthor information\nContributions\nAGMT conceptualized the analysis design, conducted the data analyses, interpreted their results and wrote the primary draft of the manuscript. GNT processed the MRI data and applied the algorithm and edited the manuscript. EK conceptualized the study design, collected the data and edited the manuscript. JM conceptualized the study design, collected the data and edited the manuscript. JK processed the MRI data and applied the algorithm and edited the manuscript. SV conceptualized the study design, collected the data and edited the manuscript. JP conceptualized the study design, collected the data and edited the manuscript. JHC developed the algorithm and edited the manuscript. MD processed the MRI data and applied the algorithm and edited the manuscript. ST conceptualized the study design, contributed to the figure and analysis design and edited the manuscript. AH conceptualized the study and analysis designs, contributed to the figure design, and edited the manuscripts.", "doc_items_refs": ["#/texts/357", "#/texts/358", "#/texts/359", "#/texts/360", "#/texts/361", "#/texts/362", "#/texts/363", "#/texts/364", "#/texts/365", "#/texts/366", "#/texts/367", "#/texts/369"], "page_nos": [], "uuid": "8b642ec3-4824-4286-8e14-ef9cec76a0f7"}
{"doc_id": "2025__The_role_of_cognitive_and_brain_reserve_in_the_clinical_presentation_and_progres__W4411490345", "source_path": "<redacted:source_path>", "chunk_id": 24, "source_chunk_idxs": [34, 35, 36, 37], "num_tokens": 313, "text": "The role of cognitive and brain reserve in the clinical presentation and progression of amyotrophic lateral sclerosis\nAuthor information\nCorresponding author\nCorrespondence to\nAndreas Hermann\n.\n\nThe role of cognitive and brain reserve in the clinical presentation and progression of amyotrophic lateral sclerosis\nEthics declarations\nCompeting interests\nThe authors report no competing interests.\n\nThe role of cognitive and brain reserve in the clinical presentation and progression of amyotrophic lateral sclerosis\nAdditional information\nPublisher's note\nSpringer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations.\n\nThe role of cognitive and brain reserve in the clinical presentation and progression of amyotrophic lateral sclerosis\nRights and permissions\nOpen Access\nThis article is licensed under a Creative Commons Attribution 4.0 International License, which permits use, sharing, adaptation, distribution and reproduction in any medium or format, as long as you give appropriate credit to the original author(s) and the source, provide a link to the Creative Commons licence, and indicate if changes were made. The images or other third party material in this article are included in the article's Creative Commons licence, unless indicated otherwise in a credit line to the material. If material is not included in the article's Creative Commons licence and your intended use is not permitted by statutory regulation or exceeds the permitted use, you will need to obtain permission directly from the copyright holder. To view a copy of this licence, visit\nhttp://creativecommons.org/licenses/by/4.0/\n.\nReprints and permissions", "doc_items_refs": ["#/texts/371", "#/texts/372", "#/texts/373", "#/texts/376", "#/texts/379", "#/texts/381", "#/texts/382", "#/texts/383", "#/texts/384", "#/texts/385"], "page_nos": [], "uuid": "48f7d310-5269-403a-bf58-41b6129c39c6"}
{"doc_id": "2025__The_role_of_cognitive_and_brain_reserve_in_the_clinical_presentation_and_progres__W4411490345", "source_path": "<redacted:source_path>", "chunk_id": 25, "source_chunk_idxs": [38, 39, 40, 41], "num_tokens": 285, "text": "The role of cognitive and brain reserve in the clinical presentation and progression of amyotrophic lateral sclerosis\nAbout this article\nCite this article\nTemp, A.G.M., Tarakdjian, G.N., Kasper, E.\net al.\nThe role of cognitive and brain reserve in the clinical presentation and progression of amyotrophic lateral sclerosis.\nSci Rep\n15\n, 20232 (2025). https://doi.org/10.1038/s41598-025-97509-y\nDownload citation\n- Received : 02 January 2025\n- Accepted : 04 April 2025\n- Published : 20 June 2025\n- DOI : https://doi.org/10.1038/s41598-025-97509-y\nDownload PDF\n\nThe role of cognitive and brain reserve in the clinical presentation and progression of amyotrophic lateral sclerosis\nAssociated content\nCollection\n\nThe role of cognitive and brain reserve in the clinical presentation and progression of amyotrophic lateral sclerosis\nAssociated content\nAmyotrophic Lateral Sclerosis\nAdvertisement\n\nThe role of cognitive and brain reserve in the clinical presentation and progression of amyotrophic lateral sclerosis\nExplore content\n- Research articles\n- News &amp; Comment\n- Collections\n- Subjects\n- Follow us on Facebook\n- Follow us on Twitter\n- Sign up for alerts\n- RSS feed", "doc_items_refs": ["#/texts/388", "#/texts/389", "#/texts/390", "#/texts/391", "#/texts/392", "#/texts/393", "#/texts/394", "#/texts/395", "#/texts/396", "#/texts/397", "#/texts/398", "#/texts/399", "#/texts/401", "#/texts/403", "#/texts/405", "#/texts/406", "#/texts/407", "#/texts/408", "#/texts/409", "#/texts/410", "#/texts/411", "#/texts/412"], "page_nos": [], "uuid": "dcd8c19a-7233-465d-b0a1-353f19868956"}
{"doc_id": "2025__The_role_of_cognitive_and_brain_reserve_in_the_clinical_presentation_and_progres__W4411490345", "source_path": "<redacted:source_path>", "chunk_id": 26, "source_chunk_idxs": [42, 43, 44, 45, 46, 47], "num_tokens": 282, "text": "The role of cognitive and brain reserve in the clinical presentation and progression of amyotrophic lateral sclerosis\nAbout the journal\n- About Scientific Reports\n- Contact\n- Journal policies\n- Guide to referees\n- Calls for Papers\n- Editor's Choice\n- Journal highlights\n- Open Access Fees and Funding\n\nThe role of cognitive and brain reserve in the clinical presentation and progression of amyotrophic lateral sclerosis\nPublish with us\n- For authors\n- Language editing services\n- Open access funding\n- Submit manuscript\n\nThe role of cognitive and brain reserve in the clinical presentation and progression of amyotrophic lateral sclerosis\nSearch\nSearch articles by subject, keyword or author\nShow results from\nAll journals\nThis journal\nSearch\nAdvanced search\n\nThe role of cognitive and brain reserve in the clinical presentation and progression of amyotrophic lateral sclerosis\nSearch\nQuick links\n- Explore articles by subject\n- Find a job\n- Guide to authors\n- Editorial policies\nScientific Reports (\nSci Rep\n)\nISSN 2045-2322 (online)\n\nThe role of cognitive and brain reserve in the clinical presentation and progression of amyotrophic lateral sclerosis\nnature.com sitemap\nAbout Nature Portfolio\n- About us\n- Press releases\n- Press office\n- Contact us\n\nThe role of cognitive and brain reserve in the clinical presentation and progression of amyotrophic lateral sclerosis\nnature.com sitemap\nDiscover content\n- Journals A-Z\n- Articles by subject\n- protocols.io\n- Nature Index", "doc_items_refs": ["#/texts/414", "#/texts/415", "#/texts/416", "#/texts/417", "#/texts/418", "#/texts/419", "#/texts/420", "#/texts/421", "#/texts/423", "#/texts/424", "#/texts/425", "#/texts/426", "#/texts/428", "#/texts/429", "#/texts/430", "#/texts/431", "#/texts/432", "#/texts/433", "#/texts/435", "#/texts/436", "#/texts/437", "#/texts/438", "#/texts/439", "#/texts/440", "#/texts/441", "#/texts/442", "#/texts/445", "#/texts/446", "#/texts/447", "#/texts/448", "#/texts/450", "#/texts/451", "#/texts/452", "#/texts/453"], "page_nos": [], "uuid": "57f83fcc-2430-40d0-ae74-935a63c92759"}
{"doc_id": "2025__The_role_of_cognitive_and_brain_reserve_in_the_clinical_presentation_and_progres__W4411490345", "source_path": "<redacted:source_path>", "chunk_id": 27, "source_chunk_idxs": [48, 49, 50, 51, 52, 53], "num_tokens": 386, "text": "The role of cognitive and brain reserve in the clinical presentation and progression of amyotrophic lateral sclerosis\nnature.com sitemap\nPublishing policies\n- Nature portfolio policies\n- Open access\n\nThe role of cognitive and brain reserve in the clinical presentation and progression of amyotrophic lateral sclerosis\nnature.com sitemap\nAuthor & Researcher services\n- Reprints &amp; permissions\n- Research data\n- Language editing\n- Scientific editing\n- Nature Masterclasses\n- Research Solutions\n\nThe role of cognitive and brain reserve in the clinical presentation and progression of amyotrophic lateral sclerosis\nnature.com sitemap\nLibraries & institutions\n- Librarian service &amp; tools\n- Librarian portal\n- Open research\n- Recommend to library\n\nThe role of cognitive and brain reserve in the clinical presentation and progression of amyotrophic lateral sclerosis\nnature.com sitemap\nAdvertising & partnerships\n- Advertising\n- Partnerships &amp; Services\n- Media kits\n- Branded content\n\nThe role of cognitive and brain reserve in the clinical presentation and progression of amyotrophic lateral sclerosis\nnature.com sitemap\nProfessional development\n- Nature Awards\n- Nature Careers\n- Nature Conferences\n\nThe role of cognitive and brain reserve in the clinical presentation and progression of amyotrophic lateral sclerosis\nnature.com sitemap\nRegional websites\n- Nature Africa\n- Nature China\n- Nature India\n- Nature Japan\n- Nature Middle East\n- Privacy Policy\n- Use of cookies\n- Your privacy choices/Manage cookies\n- Legal notice\n- Accessibility statement\n- Terms &amp; Conditions\n- Your US state privacy rights\nImage Hyperlink.\n© 2025 Springer Nature Limited\nClose banner\nClose\nNature Briefing\nSign up for the\nNature Briefing\nnewsletter - what matters in science, free to your inbox daily.\nEmail address\nSign up\nI agree my information will be processed in accordance with the\nNature\nand Springer Nature Limited\nPrivacy Policy\n.\nClose banner\nClose\nGet the most important science stories of the day, free in your inbox.\nSign up for Nature Briefing", "doc_items_refs": ["#/texts/455", "#/texts/456", "#/texts/458", "#/texts/459", "#/texts/460", "#/texts/461", "#/texts/462", "#/texts/463", "#/texts/465", "#/texts/466", "#/texts/467", "#/texts/468", "#/texts/470", "#/texts/471", "#/texts/472", "#/texts/473", "#/texts/475", "#/texts/476", "#/texts/477", "#/texts/479", "#/texts/480", "#/texts/481", "#/texts/482", "#/texts/483", "#/texts/484", "#/texts/485", "#/texts/486", "#/texts/487", "#/texts/488", "#/texts/489", "#/texts/490", "#/texts/491", "#/texts/492", "#/texts/493", "#/texts/494", "#/texts/495", "#/texts/496", "#/texts/497", "#/texts/498", "#/texts/499", "#/texts/500", "#/texts/501", "#/texts/502", "#/texts/503", "#/texts/504", "#/texts/505", "#/texts/506", "#/texts/507", "#/texts/508", "#/texts/509"], "page_nos": [], "uuid": "77d1c42d-72fe-4e52-b08b-aae7d29b1be3"}
