{"doc_id": "2025__Prevalence_of_mild_cognitive_impairment_among_former_elite_athletes_without_a_hi__W4412756335", "source_path": "<redacted:source_path>", "chunk_id": 0, "source_chunk_idxs": [0, 1], "num_tokens": 252, "text": "Prevalence of mild cognitive impairment among former elite athletes without a history of sport-related concussions compared to the general older population: a protocol for a cross-sectional study with exploratory subgroup analyses | BMJ Open\nSkip to main content\nIntended for healthcare professionals\nImage Hyperlink.\n- Log In\nMore\nLog in via Institution\nLog in via OpenAthens\nLog in using your username and password For personal accounts OR managers of institutional accounts Username * Password *\nForgot your log in details?\nRegister a new account?\nForgot\nyour user name or password?\n- Basket\n- Search\nMore\nSearch for this keyword\nAdvanced search\n- Latest content\n- Archive\n- For authors\n- About\n- Browse by collection\n\nPrevalence of mild cognitive impairment among former elite athletes without a history of sport-related concussions compared to the general older population: a protocol for a cross-sectional study with exploratory subgroup analyses | BMJ Open\n\nSearch for this keyword\nAdvanced search\n- Close\nMore\nMain menu\n- Log in\nMore\nLog in via Institution\nLog in via OpenAthens\nLog in using your username and password For personal accounts OR managers of institutional accounts Username * Password *\nForgot your log in details?\nRegister a new account?\nForgot\nyour user name or password?\n- BMJ Journals", "doc_items_refs": ["#/texts/1", "#/texts/2", "#/texts/3", "#/texts/4", "#/texts/5", "#/texts/6", "#/texts/7", "#/texts/8", "#/texts/9", "#/texts/10", "#/texts/11", "#/texts/13", "#/texts/14", "#/texts/16", "#/texts/17", "#/texts/18"], "page_nos": [], "uuid": "17f160ad-a7a3-4aaf-848a-378d057fe1ad"}
{"doc_id": "2025__Prevalence_of_mild_cognitive_impairment_among_former_elite_athletes_without_a_hi__W4412756335", "source_path": "<redacted:source_path>", "chunk_id": 1, "source_chunk_idxs": [2], "num_tokens": 307, "text": "Prevalence of mild cognitive impairment among former elite athletes without a history of sport-related concussions compared to the general older population: a protocol for a cross-sectional study with exploratory subgroup analyses | BMJ Open\nYou are here\n- Home\n- Archive\n- Volume 15, Issue 7\n- Prevalence of mild cognitive impairment among former elite athletes without a history of sport-related concussions compared to the general older population: a protocol for a cross-sectional study with exploratory subgroup analyses\nEmail alerts\nArticle Text\nArticle menu\n- Article Text\n- Article info\n- Citation Tools\n- Share\n- Rapid Responses\n- Article metrics\n- Alerts\nPDF\nImage Hyperlink.\nEpidemiology\nProtocol\nPrevalence of mild cognitive impairment among former elite athletes without a history of sport-related concussions compared to the general older population: a protocol for a cross-sectional study with exploratory subgroup analyses\n1. http://orcid.org/0000-0002-3126-0871\nShuo Luan\n1\n,\n2. Haojie Li\n2\n,\n3. Qing Zhao\n1\n,\n4. Jiahui Cong\n1\n,\n5. Hanzhi He\n1\n,\n6. Jiaying Xu\n1\n,\n7. Jingjing Ren\n1\n,\n8. Jinghua Qian\n1\n1. 1\nSchool of Sports Medicine and Rehabilitation , Beijing Sport University , Beijing , China\n2. 2\nSchool of Sport Engineering , Beijing Sport University , Beijing , China\n1. Correspondence to Jinghua Qian; jh5727{at}163.com", "doc_items_refs": ["#/texts/20", "#/texts/21", "#/texts/22", "#/texts/23", "#/texts/24", "#/texts/25", "#/texts/26", "#/texts/27", "#/texts/28", "#/texts/29", "#/texts/30", "#/texts/31", "#/texts/32", "#/texts/33", "#/texts/34", "#/texts/35", "#/texts/36", "#/texts/37", "#/texts/38", "#/texts/39", "#/texts/40", "#/texts/41", "#/texts/42", "#/texts/43", "#/texts/44", "#/texts/45", "#/texts/46", "#/texts/47", "#/texts/48", "#/texts/49"], "page_nos": [], "uuid": "aa8814c3-ee22-4460-84cb-78602e35425a"}
{"doc_id": "2025__Prevalence_of_mild_cognitive_impairment_among_former_elite_athletes_without_a_hi__W4412756335", "source_path": "<redacted:source_path>", "chunk_id": 2, "source_chunk_idxs": [3], "num_tokens": 485, "text": "Prevalence of mild cognitive impairment among former elite athletes without a history of sport-related concussions compared to the general older population: a protocol for a cross-sectional study with exploratory subgroup analyses | BMJ Open\nAbstract\nIntroduction\nEpidemiological evidence regarding the impact of elite athletic careers on cognitive trajectories remains contentious. Although consistent physical activity has been associated with long-term brain health, former elite athletes appear to represent a unique population. While past research has established a connection between sport-related concussions (SRCs) and later cognitive decline, less attention has been given to the cognitive function of former athletes who have not experienced SRCs. Therefore, well-structured cross-sectional studies accounting for established dementia risk factors are needed to compare mild cognitive impairment (MCI) prevalence between former elite athletes and the general population.\nMethods and analysis\nThis cross-sectional study will be conducted at Beijing Sport University (BSU) in Beijing, China. It is designed as a comparative study, aiming to recruit a sample of around 360 participants aged 65 and above. This sample will comprise 180 former elite athletes without a history of SRCs recruited via the BSU Retirement Welfare Office (the former athlete group), and 180 age-matched individuals from the communities in three districts in Beijing (the comparison group). Participants will complete a comprehensive questionnaire covering sociodemographic information, dementia-related risk factors, current physical activity levels and, for the former athlete group specifically, details of their athletic careers. MCI and instrumental activities of daily living will be assessed using the Montreal Cognitive Assessment, Memtrax continuous recognition test and Lawton Instrumental Activities of Daily Living (IADL) scale. The primary objective is to determine whether former elite athletes without a history of SRCs have a lower MCI prevalence than the general population. The secondary objective is to assess if these former elite athletes have a reduced prevalence of amnestic MCI and impairment in IADL compared with the general population. Additionally, the study aims to explore whether specific career-related characteristics of former athletes, such as the type of sport and contact exposure, are correlated with their cognitive function and IADL abilities in later life as a secondary exploratory component. The study will calculate the crude prevalence ratios (PRs) and adjusted prevalence ratios (aPRs) with 95% CIs using the modified Poisson regression model with robust error variance.", "doc_items_refs": ["#/texts/51", "#/texts/52", "#/texts/53", "#/texts/54"], "page_nos": [], "uuid": "af15a38c-4a3e-4e91-a22b-87f730d32115"}
{"doc_id": "2025__Prevalence_of_mild_cognitive_impairment_among_former_elite_athletes_without_a_hi__W4412756335", "source_path": "<redacted:source_path>", "chunk_id": 3, "source_chunk_idxs": [4], "num_tokens": 296, "text": "Prevalence of mild cognitive impairment among former elite athletes without a history of sport-related concussions compared to the general older population: a protocol for a cross-sectional study with exploratory subgroup analyses | BMJ Open\nAbstract\nEthics and dissemination\nEthical approval was obtained from the Ethics Committee/Internal Review Board of BSU (approval number: 2024042H). All procedures will adhere to the Helsinki Declaration. The study's findings will be provided to participants as deemed appropriate. The outcomes will be communicated through abstract presentations at national or international conferences/academic seminars, as well as through publication in a peer-reviewed journal.\nTrial registration number\nChiCTR2400085800.\n- Cognition\n- Health\n- Aged\n- Exercise\nhttp://creativecommons.org/licenses/by-nc/4.0/\nThis is an open access article distributed in accordance with the Creative Commons Attribution Non Commercial (CC BY-NC 4.0) license, which permits others to distribute, remix, adapt, build upon this work non-commercially, and license their derivative works on different terms, provided the original work is properly cited, appropriate credit is given, any changes made indicated, and the use is non-commercial. See:\nhttp://creativecommons.org/licenses/by-nc/4.0/\n.\nhttps://doi.org/10.1136/bmjopen-2025-104901", "doc_items_refs": ["#/texts/55", "#/texts/56", "#/texts/57", "#/texts/58", "#/texts/59", "#/texts/60", "#/texts/61", "#/texts/62", "#/texts/63", "#/texts/64", "#/texts/65", "#/texts/66", "#/texts/67"], "page_nos": [], "uuid": "9ee79298-d7fc-45aa-912d-59009602e81f"}
{"doc_id": "2025__Prevalence_of_mild_cognitive_impairment_among_former_elite_athletes_without_a_hi__W4412756335", "source_path": "<redacted:source_path>", "chunk_id": 4, "source_chunk_idxs": [5, 6, 7], "num_tokens": 372, "text": "Prevalence of mild cognitive impairment among former elite athletes without a history of sport-related concussions compared to the general older population: a protocol for a cross-sectional study with exploratory subgroup analyses | BMJ Open\nRequest Permissions\nIf you wish to reuse any or all of this article please use the link below which will take you to the Copyright Clearance Center's RightsLink service. You will be able to get a quick price and instant permission to reuse the content in many different ways.\n\nPrevalence of mild cognitive impairment among former elite athletes without a history of sport-related concussions compared to the general older population: a protocol for a cross-sectional study with exploratory subgroup analyses | BMJ Open\n\n- Cognition\n- Health\n- Aged\n- Exercise\n\nPrevalence of mild cognitive impairment among former elite athletes without a history of sport-related concussions compared to the general older population: a protocol for a cross-sectional study with exploratory subgroup analyses | BMJ Open\n\nStrengths and limitations of this study\n- This study is the pioneering cross-sectional study comparing the risk of mild cognitive impairment (MCI) in former elite athletes without a history of sport-related concussions (SRCs) and the general population.\n- Another strength of this study is the utilisation of Memtrax, a quantitative evaluation tool, to supplement the questionnaire-based MCI assessment.\n- Additionally, the study's robustness is enhanced by including multiple confounders using the modified Poisson regression model with robust error variance.\n- The cross-sectional design may preclude establishing a causal relationship between former elite athletes without a history of SRCs and a reduced incidence of MCI in later life.\n- Another limitation is the reliance on self-reported recall for variables like a history of SRC and parental history of dementia.", "doc_items_refs": ["#/texts/70", "#/texts/72", "#/texts/73", "#/texts/74", "#/texts/75", "#/texts/77", "#/texts/78", "#/texts/79", "#/texts/80", "#/texts/81"], "page_nos": [], "uuid": "f25e98c4-4d10-4db9-a60a-e7d0a2eaa18c"}
{"doc_id": "2025__Prevalence_of_mild_cognitive_impairment_among_former_elite_athletes_without_a_hi__W4412756335", "source_path": "<redacted:source_path>", "chunk_id": 5, "source_chunk_idxs": [8], "num_tokens": 508, "text": "Prevalence of mild cognitive impairment among former elite athletes without a history of sport-related concussions compared to the general older population: a protocol for a cross-sectional study with exploratory subgroup analyses | BMJ Open\nIntroduction\nMaintaining cognitive function plays a vital role in enhancing the quality of life for older adults.\n1\nMild cognitive impairment (MCI) is considered a precursor to dementia in later life, imposing a heavy economic and medical burden on the healthcare system worldwide.\n2 3\nIndividuals with MCI may complain of a decline in memory, language or judgement and may have detectable limitations in instrumental activities of daily living (IADL).\n4\nIn China's ageing population, MCI prevalence is estimated at 15.5%, affecting 38.77 million individuals. Currently known modifiable risk factors for MCI include rural residence, fewer years of education, living alone, smoking and chronic diseases (such as hypertension, hyperlipidaemia, diabetes and cerebrovascular disease).\n5\nPhysical activity (PA) is well-established to improve health.\n6-8\nElite athletes, particularly those involved in endurance and mixed sports, may demonstrate exceptional longevity. A recent systematic review has challenged the traditional theory that high-intensity training or competition results in a 'J-shaped' health outcome and has further demonstrated that former athletes generally have longer lifespans and face lower risks of cardiovascular disease and cancer compared with the general population.\n9\nThe outstanding skills demonstrated by elite-level athletes often involve perceptual, cognitive or motor control.\n10 11\nIt is reasonable to assume that engaging in active physical activities or training during youth may contribute to better cognitive health in older individuals compared with those who do not.\n6 12-14\nUnfortunately, robust evidence is lacking regarding the impact of decades-long vigorous PA during athletic careers on late-life cognitive status. Conversely, it is important to note that athletes are more likely to be exposed to the risk of hits and concussions in competition, and the detrimental effects of sport-related concussions (SRCs) on cognitive function can persist for up to several years post-injury.\n15 16\nPrevious studies have predominantly focused on the long-term brain health of former football and rugby players with a history of SRCs. For instance, Baker et al. reported higher depression scores in former professional contact sport athletes than in non-contact athlete controls.\n17\nRussell\net al\nreported a higher incidence of neurodegenerative diseases among rugby players over a 32-year median follow-up.\n18", "doc_items_refs": ["#/texts/83", "#/texts/84", "#/texts/85", "#/texts/86", "#/texts/87", "#/texts/88", "#/texts/89", "#/texts/90", "#/texts/91", "#/texts/92", "#/texts/93", "#/texts/94", "#/texts/95", "#/texts/96", "#/texts/97", "#/texts/98", "#/texts/99", "#/texts/100", "#/texts/101", "#/texts/102", "#/texts/103", "#/texts/104", "#/texts/105", "#/texts/106"], "page_nos": [], "uuid": "523ff8c3-a161-4c42-bff2-c545daccbc2a"}
{"doc_id": "2025__Prevalence_of_mild_cognitive_impairment_among_former_elite_athletes_without_a_hi__W4412756335", "source_path": "<redacted:source_path>", "chunk_id": 6, "source_chunk_idxs": [9], "num_tokens": 349, "text": "Prevalence of mild cognitive impairment among former elite athletes without a history of sport-related concussions compared to the general older population: a protocol for a cross-sectional study with exploratory subgroup analyses | BMJ Open\nIntroduction\nIn conclusion, there is a lack of discussion on the conditions of long-term brain health outcomes in former elite athletes who did not experience SRCs. The existing research findings are inconclusive, warranting separate investigations on the effects of maintaining high PA levels as a protective measure and SRCs as a risk factor. It is also imperative to explore the cognitive function trajectories of former elite athletes further, taking into consideration the details of their athletic careers, such as sport type and contact exposure level.\nTo the best of our knowledge, this is the first study to examine the cognitive performance of former athletes without a history of SRCs. We hypothesised that former elite athletes without a history of SRCs would exhibit a lower prevalence of MCI in later life and better IADL outcomes compared with their age-matched community-dwelling controls, since their former athletic background could serve as a protective factor. The primary objective is to determine the prevalence of MCI and risk factors in a sample of former elite athletes without a history of SRCs and in an age-matched sample of the general older population in communities with adjustments for known risk factors. The secondary objective is twofold: (1) to compare the prevalence of memory domain impairment and IADL impairment in former elite athletes and the general population and (2) to assess whether the type of sport and contact exposure level in sports may influence the long-term cognitive prognosis of former elite athletes without a history of SRCs as an exploratory investigation.", "doc_items_refs": ["#/texts/107", "#/texts/108"], "page_nos": [], "uuid": "e3489ce2-ca3a-4b9e-9e2c-e474cbb323d3"}
{"doc_id": "2025__Prevalence_of_mild_cognitive_impairment_among_former_elite_athletes_without_a_hi__W4412756335", "source_path": "<redacted:source_path>", "chunk_id": 7, "source_chunk_idxs": [10, 11], "num_tokens": 400, "text": "Prevalence of mild cognitive impairment among former elite athletes without a history of sport-related concussions compared to the general older population: a protocol for a cross-sectional study with exploratory subgroup analyses | BMJ Open\nMethods/design\nStudy settings and participants\nAs the capital of the People's Republic of China, Beijing boasts a sizeable, demographically diverse population representative of the broader Chinese demographic. Moreover, Beijing Sport University possesses privileged access to former elite athletes, given the specialised nature of this population.\nThe study will enrol participants aged 65 and above, including former elite athletes recruited via the Beijing Sport University Retirement Welfare Office (former athlete group) and age-matched participants from three Beijing districts (Haidian, Fengtai, Changping) (comparison group). The study period is from 25 June 2024 to 25 June 2025. The researchers will collaborate with the welfare office and community boards to disseminate information about the study to eligible retired individuals through text messages, emails and advertisements placed in locations commonly visited by older adults in the communities.\n\nPrevalence of mild cognitive impairment among former elite athletes without a history of sport-related concussions compared to the general older population: a protocol for a cross-sectional study with exploratory subgroup analyses | BMJ Open\nMethods/design\nSurvey population\nInclusion criteria\nParticipants aged 65 years or older who provide written informed consent will be recruited for the study. For the former elite athlete group, the additional inclusion criteria are (1) an individual or team member who has competed at an international, highest national or professional level\n19\nand (2) having no history of SRCs. SRCs are defined in accordance with the latest updated conceptual and operational definition. To facilitate comprehension, we will pose the following question before the procedure: 'Have you ever experienced or removed yourself from sports due to symptoms resulting from a direct blow to the head, neck or body resulting in an impulsive force being transmitted to the brain during your athletic career?'.\n20 21", "doc_items_refs": ["#/texts/111", "#/texts/112", "#/texts/115", "#/texts/116", "#/texts/117", "#/texts/118"], "page_nos": [], "uuid": "ac2e4c3b-840b-4000-88e6-e8cf41b4f49f"}
{"doc_id": "2025__Prevalence_of_mild_cognitive_impairment_among_former_elite_athletes_without_a_hi__W4412756335", "source_path": "<redacted:source_path>", "chunk_id": 8, "source_chunk_idxs": [12, 13], "num_tokens": 395, "text": "Prevalence of mild cognitive impairment among former elite athletes without a history of sport-related concussions compared to the general older population: a protocol for a cross-sectional study with exploratory subgroup analyses | BMJ Open\nMethods/design\nSurvey population\nExclusion criteria\n1. Significant uncorrected visual and hearing impairments or disorders, or difficulties in communicating or understanding instructions that would interfere with the assessment.\n2. Conditions that could interfere with smooth hand movements.\n3. Alzheimer's disease, other types of dementia, cerebrovascular disease and other conditions (such as central nervous system infections, Parkinson's disease, neurological disorders like traumatic brain injury, poisoning and metabolic disorders) that directly affect cognitive function.\n4. Schizophrenia, depression or anxiety.\n5. Use of medications (such as cholinesterase inhibitors) that may affect cognitive function within the last 6 months.\n\nPrevalence of mild cognitive impairment among former elite athletes without a history of sport-related concussions compared to the general older population: a protocol for a cross-sectional study with exploratory subgroup analyses | BMJ Open\nMethods/design\nSample size\nThe primary analysis will use modified Poisson regression with robust error variance to estimate prevalence ratios (PRs) and adjusted PRs (aPRs) for the association between former elite athlete status and MCI prevalence in the general population. The absence of published data on MCI prevalence among former elite athletes without a history of SRCs precludes standard sample size calculations based on effect size estimation. As this represents the first investigation of MCI in retired elite athletes without a history of SRCs, no prior data exist to reliably estimate the expected effect magnitude. Consequently, the target sample size of 360 participants (180 per group) was determined by feasibility considerations. Given the stringent selection criteria and inherent scarcity of the athlete group, recruiting 180 athletes alongside 180 age-matched controls represents the maximum achievable sample within available resources.", "doc_items_refs": ["#/texts/120", "#/texts/121", "#/texts/122", "#/texts/123", "#/texts/124", "#/texts/126"], "page_nos": [], "uuid": "060eaf62-1372-4932-a12d-ec83adedccbd"}
{"doc_id": "2025__Prevalence_of_mild_cognitive_impairment_among_former_elite_athletes_without_a_hi__W4412756335", "source_path": "<redacted:source_path>", "chunk_id": 9, "source_chunk_idxs": [14, 15], "num_tokens": 213, "text": "Prevalence of mild cognitive impairment among former elite athletes without a history of sport-related concussions compared to the general older population: a protocol for a cross-sectional study with exploratory subgroup analyses | BMJ Open\nMethods/design\nPatient and public involvement\nNone.\n\nPrevalence of mild cognitive impairment among former elite athletes without a history of sport-related concussions compared to the general older population: a protocol for a cross-sectional study with exploratory subgroup analyses | BMJ Open\nMethods/design\nData collection and management\nResearchers will receive standardised training to ensure consistency in interview and assessment skills. The data collection involves two main components, including a questionnaire survey and cognitive and neuropsychological tests. In order to ensure feasibility and accuracy, all assessments will be conducted face-to-face. The demographic and sociological characteristics of both groups will be de-identified to safeguard privacy. Random telephone-based verification will be performed for &gt;20% of participants to detect protocol deviations, such as inadequate probing or falsification of responses.", "doc_items_refs": ["#/texts/128", "#/texts/130"], "page_nos": [], "uuid": "08cf074a-c859-4d72-a2c0-f565dea0c042"}
{"doc_id": "2025__Prevalence_of_mild_cognitive_impairment_among_former_elite_athletes_without_a_hi__W4412756335", "source_path": "<redacted:source_path>", "chunk_id": 10, "source_chunk_idxs": [16], "num_tokens": 368, "text": "Prevalence of mild cognitive impairment among former elite athletes without a history of sport-related concussions compared to the general older population: a protocol for a cross-sectional study with exploratory subgroup analyses | BMJ Open\nMethods/design\nProcedure\nQuestionnaire survey\nFor both groups, participants will be asked to complete a comprehensive and standardised paper questionnaire in order to collect their sociodemographic profile and individual risk factors, including both the identified risk factors (part 1), their current level of PA (part 2) and other putative risk factors (part 3). Additionally, a survey on athlete career-related information will be conducted for the former athlete group only (part 4). It is expected that participants will require 20-30 min to complete the questionnaire.\nThe 'identified risk factors' in the current questionnaire derive from a recent extensive epidemiological study involving 46 011 Chinese adults aged 60 years or above. Unmodifiable risk factors include increasing age, female sex and a parental family history, while modifiable factors encompass fewer years of education, living alone, smoking, hypertension, hyperlipidaemia, diabetes, as well as heart and cerebrovascular disease.\n5\nSince the former elite athletes will be recruited from Beijing Sport University, along with a control group from urban communities in Beijing, the factor of 'residence location' will not be included in the study design. Given the ethnic and environmental variations in risk factors for MCI, we have incorporated additional putative risk factors identified in the Chinese population through the China Health and Retirement Longitudinal Study (CHARLS) and Chinese Longitudinal Healthy Longevity Survey (see\ntable 1\n).\nView this table:\n- View inline\n- View popup\nTable 1\nSociodemographic and risk factors (covariates) in current study design", "doc_items_refs": ["#/texts/133", "#/texts/134", "#/texts/135", "#/texts/136", "#/texts/137", "#/texts/138", "#/texts/139", "#/texts/140", "#/texts/141", "#/texts/142", "#/texts/143"], "page_nos": [], "uuid": "e689d167-bf68-4c76-a28a-74a3a5a78117"}
{"doc_id": "2025__Prevalence_of_mild_cognitive_impairment_among_former_elite_athletes_without_a_hi__W4412756335", "source_path": "<redacted:source_path>", "chunk_id": 11, "source_chunk_idxs": [17], "num_tokens": 189, "text": "Prevalence of mild cognitive impairment among former elite athletes without a history of sport-related concussions compared to the general older population: a protocol for a cross-sectional study with exploratory subgroup analyses | BMJ Open\nMethods/design\nProcedure\nPart 1. Sociodemographic and risk factors (identified risk factor)\nThe validated questions and definitions adopted in the questionnaire are derived from previous literature.\n5 22-27\nParental history of dementia will be assessed with a validated question: 'Does your biological father and/or mother have or had any type of dementia?'.\n22\nCurrent smoker status will be identified by the valid question 'Do you smoke cigarettes at all nowadays?'.\n23\nComorbid conditions associated with the 'identified risk factors' will be identified based on the daily health records of local community hospitals, based on the formal diagnosis of the clinician or whether the subject is taking the relevant medication.\n24-28", "doc_items_refs": ["#/texts/145", "#/texts/146", "#/texts/147", "#/texts/148", "#/texts/149", "#/texts/150", "#/texts/151", "#/texts/152"], "page_nos": [], "uuid": "a85df5cf-e250-4f48-be32-04b022635bbd"}
{"doc_id": "2025__Prevalence_of_mild_cognitive_impairment_among_former_elite_athletes_without_a_hi__W4412756335", "source_path": "<redacted:source_path>", "chunk_id": 12, "source_chunk_idxs": [18], "num_tokens": 431, "text": "Prevalence of mild cognitive impairment among former elite athletes without a history of sport-related concussions compared to the general older population: a protocol for a cross-sectional study with exploratory subgroup analyses | BMJ Open\nMethods/design\nProcedure\nPart 2. Physical activity (PA)\nThe current PA levels represent an important confounder between the two groups, as exercise behaviours in the general elderly population may independently benefit cognition. In line with the CHARLS study codebook, PA levels will be assessed to ensure consistency with the exercise behaviours commonly practised in Chinese daily routines. The current PA level will be quantified by combining vigorous-intensity PA (VPA), moderate-intensity PA (MPA) and low-intensity PA (LPA) using metabolic equivalent (MET) minutes/week. Various PA levels will be quantified in metabolic equivalent of task (MET) value minutes per week, with VPA, MPA and LPA corresponding to eight METs, four METs and 3.3 METs, respectively. The different levels of PA will be briefly described to facilitate participants' understanding. VPA involves activities that lead to shortness of breath, such as lifting heavy objects, farming, aerobic exercise and fast cycling with cargo. MPA includes activities that increase the breathing rate, like brisk walking, cycling at a normal speed, mopping and tai χ. LPA encompasses activities such as walking at work or home, as well as recreational and leisure walking. In terms of frequency, the range of responses spans from 0 to 7 days per week, with PA frequency segmented into categories of 0 (never), 1-2, 3-5 and 6-7 days per week. Regarding duration, the duration of each PA session will be divided into five levels based on the time spent per day for different PA levels (\n29-31\nConsequently, MET-minutes/week will be categorised into seven groups: 0-599, 600-1199, 1200-1799, 1800-2999, 3000-5999, 6000-8999 and ≥9000 (see\ntable 1\n).", "doc_items_refs": ["#/texts/154", "#/texts/155", "#/texts/156", "#/texts/157", "#/texts/158"], "page_nos": [], "uuid": "97814800-3c99-499b-a974-82a3c05964c9"}
{"doc_id": "2025__Prevalence_of_mild_cognitive_impairment_among_former_elite_athletes_without_a_hi__W4412756335", "source_path": "<redacted:source_path>", "chunk_id": 13, "source_chunk_idxs": [19, 20], "num_tokens": 385, "text": "Prevalence of mild cognitive impairment among former elite athletes without a history of sport-related concussions compared to the general older population: a protocol for a cross-sectional study with exploratory subgroup analyses | BMJ Open\nMethods/design\nProcedure\nPart 3. Other putative risk factors\nAlcohol consumption\nIn this study, the alcohol consumption variable will be categorised as follows using two validated questions: 1) How often did you drink alcohol during the past 12 months? 2) For those who have not drunk alcohol at least weekly in the past 12 months, 'Was there a period of at least a year before that when they ever drank alcohol at least once a week?\". As proposed by Pek\net al\n, the categories are: non-drinkers (have never drunk alcohol in the past year and have not drunk in most weeks in the past); ex-drinkers (have not drunk alcohol in most weeks in the past year but have done so in the past); occasional drinkers (have drunk alcohol but less than weekly in the past year and have not drunk alcohol in most weeks in the past); and current drinkers (have drunk alcohol on a weekly basis/regularly in the past year).\n32 33\n\nPrevalence of mild cognitive impairment among former elite athletes without a history of sport-related concussions compared to the general older population: a protocol for a cross-sectional study with exploratory subgroup analyses | BMJ Open\nMethods/design\nProcedure\nPart 3. Other putative risk factors\nBody mass index (BMI)\nThe impact of body mass index (BMI) on cognitive impairment remains a topic of debate. While some studies have linked obesity and its related conditions to MCI, research on the Chinese population has suggested that underweight is also associated with MCI. Therefore, BMI will be treated as a multi-categorical variable for further analysis.\n34-36", "doc_items_refs": ["#/texts/161", "#/texts/162", "#/texts/163", "#/texts/164", "#/texts/166", "#/texts/167"], "page_nos": [], "uuid": "1f38f9c6-98f5-4770-8ba3-b296c1bc8477"}
{"doc_id": "2025__Prevalence_of_mild_cognitive_impairment_among_former_elite_athletes_without_a_hi__W4412756335", "source_path": "<redacted:source_path>", "chunk_id": 14, "source_chunk_idxs": [21, 22, 23], "num_tokens": 453, "text": "Prevalence of mild cognitive impairment among former elite athletes without a history of sport-related concussions compared to the general older population: a protocol for a cross-sectional study with exploratory subgroup analyses | BMJ Open\nMethods/design\nProcedure\nPart 3. Other putative risk factors\nSleep duration\nSleep duration will be quantified with a validated question: 'How long do you normally sleep?'. Participants will be classified into three groups based on their sleep duration: short (≤ 6 hours), moderate (6-9 hours) and long (≥ 9 hours). Current research indicates that obtaining a moderate amount of sleep, ranging from 6 to 9 hours, may protect against MCI. Similarly, sleep duration will be treated as a multicategorical variable.\n37\n\nPrevalence of mild cognitive impairment among former elite athletes without a history of sport-related concussions compared to the general older population: a protocol for a cross-sectional study with exploratory subgroup analyses | BMJ Open\nMethods/design\nProcedure\nPart 3. Other putative risk factors\nIncome\nLow income is associated with decreased social engagement, nutritional imbalances, limited access to medical support and potential mental health issues.\n38\n\nPrevalence of mild cognitive impairment among former elite athletes without a history of sport-related concussions compared to the general older population: a protocol for a cross-sectional study with exploratory subgroup analyses | BMJ Open\nMethods/design\nProcedure\nPart 4. Former athletic career characteristics\nTo investigate the specific athletic attributes that relate to long-term cognitive health, we will classify the athletic careers based on existing literature as an exploratory study. Within a meta-analysis comprising 165 000 former elite athletes analysing the long-term health consequences, three groups were differentiated by their primary sport category: endurance, mixed/team or power subgroup.\n9\nComparable classifications are identified in other studies that examine athlete health outcomes.\n39 40\nAdditionally, we will categorise sports by their level of contact exposure (contact, limited-contact, non-contact) to assess their cognitive impact (\ntable 2\n).\n41\nView this table:\n- View inline\n- View popup\nTable 2\nExploratory subgroup analyses based on former athletic career characteristics (for athlete group only)", "doc_items_refs": ["#/texts/169", "#/texts/170", "#/texts/172", "#/texts/173", "#/texts/175", "#/texts/176", "#/texts/177", "#/texts/178", "#/texts/179", "#/texts/180", "#/texts/181", "#/texts/182", "#/texts/183", "#/texts/184", "#/texts/185", "#/texts/186", "#/texts/187"], "page_nos": [], "uuid": "49eae30b-9628-4a3e-b1b8-404152fc37d0"}
{"doc_id": "2025__Prevalence_of_mild_cognitive_impairment_among_former_elite_athletes_without_a_hi__W4412756335", "source_path": "<redacted:source_path>", "chunk_id": 15, "source_chunk_idxs": [24, 25], "num_tokens": 310, "text": "Prevalence of mild cognitive impairment among former elite athletes without a history of sport-related concussions compared to the general older population: a protocol for a cross-sectional study with exploratory subgroup analyses | BMJ Open\nMethods/design\nCognitive and neuropsychological tests\nSubsequently, the participants will undergo neuropsychological tests in a relatively quiet room administered by well-trained interviewers. The Montreal Cognitive Assessment (MoCA) and Memtrax continuous recognition test will be performed to assess cognitive impairment. The IADL scale will be employed to evaluate an individual's capacity for executing intricate tasks in their daily lives.\n\nPrevalence of mild cognitive impairment among former elite athletes without a history of sport-related concussions compared to the general older population: a protocol for a cross-sectional study with exploratory subgroup analyses | BMJ Open\nMethods/design\nCognitive and neuropsychological tests\nMontreal cognitive assessment (MoCA)\nThe MoCA is a widely utilised tool in population-based epidemiological studies for detecting MCI, with an administration time of 10-15 min. It evaluates multiple cognitive domains including visuospatial skills, attention, calculation, language, abstract reasoning, memory, delayed recall, executive function and orientation. The MoCA comprises 30 items, with a total score ranging from 0 to 30; a higher score indicates better cognitive function. A commonly recommended cut-off score is\nAssessors trained in the Beijing MoCA version ensure accurate test execution and cognitive capability assessment.\n42 43", "doc_items_refs": ["#/texts/189", "#/texts/191", "#/texts/192", "#/texts/193"], "page_nos": [], "uuid": "a6f92c7e-0ef8-4bf8-b290-84a32c203dcf"}
{"doc_id": "2025__Prevalence_of_mild_cognitive_impairment_among_former_elite_athletes_without_a_hi__W4412756335", "source_path": "<redacted:source_path>", "chunk_id": 16, "source_chunk_idxs": [26, 27], "num_tokens": 453, "text": "Prevalence of mild cognitive impairment among former elite athletes without a history of sport-related concussions compared to the general older population: a protocol for a cross-sectional study with exploratory subgroup analyses | BMJ Open\nMethods/design\nCognitive and neuropsychological tests\nThe Memtrax continuous recognition test\nThe complex diagnostic criteria for amnestic cognitive impairment make direct diagnosis impractical.\n44\nMemTrax is a rapid and dynamic screening tool that uses a computerised continuous-recognition task to measure episodic memory by assessing repetitive picture recognition.\n45 46\nIt plays a crucial role in identifying individuals with amnestic MCI (aMCI). In this study design, trained professionals are responsible for entering participant information. In brief, MemTrax consists of a sequence of 50 images, consisting of 25 new pictures and 25 repetitions, with one image from each of the five categories repeated twice. Participants are instructed to react quickly by touching the screen when a repeated image appears. The completion of the MemTrax test by participants typically takes 2-3 min, with the collection of data on the percentage of correct responses (MTX-%C) and mean response time (MTX-RT). According to a previous study, for differentiating MCI-AD from controls, an optimised MTX-%C cut-off is 81%.\n47\n\nPrevalence of mild cognitive impairment among former elite athletes without a history of sport-related concussions compared to the general older population: a protocol for a cross-sectional study with exploratory subgroup analyses | BMJ Open\nMethods/design\nCognitive and neuropsychological tests\nLawton instrumental activities of daily living (IADL) scale\nThe evaluation of individuals' functional abilities across eight domains, such as telephone use, laundry and financial management, will be conducted using the IADL.\n48\nThis assessment can be swiftly administered in approximately 10 min. It yields a summary score ranging from 0 (reflecting low function and dependence) to 8 (reflecting high function and independence) for women. For men, the range is from 0 to 5 to mitigate potential gender biases. We will adopt the Hong Kong Chinese version of the IADL in this study.\n49", "doc_items_refs": ["#/texts/195", "#/texts/196", "#/texts/197", "#/texts/198", "#/texts/199", "#/texts/200", "#/texts/202", "#/texts/203", "#/texts/204", "#/texts/205"], "page_nos": [], "uuid": "cce8d189-34b2-4567-af90-cf0abaa5c5d6"}
{"doc_id": "2025__Prevalence_of_mild_cognitive_impairment_among_former_elite_athletes_without_a_hi__W4412756335", "source_path": "<redacted:source_path>", "chunk_id": 17, "source_chunk_idxs": [28], "num_tokens": 406, "text": "Prevalence of mild cognitive impairment among former elite athletes without a history of sport-related concussions compared to the general older population: a protocol for a cross-sectional study with exploratory subgroup analyses | BMJ Open\nMethods/design\nData analysis and statistics\nContinuous variables will be presented as the mean and SD or median and IQR. Categorical variables will be shown as frequencies and percentages. Statistical comparisons between the former athlete group and the comparison group, encompassing sociodemographic characteristics, Memtrax outcome measures and IADL scores, will be analysed using t-tests for normally distributed continuous variables, Mann-Whitney U tests for non-normally distributed continuous variables, and χ2 tests for categorical variables. Statistical significance will be defined at p\nThe prevalence of MCI will be calculated for the total population and age-stratified subgroups. The (PRs and 95% CIs for MCI risk among former elite athletes compared with the general population will be determined. Given the high prevalence of MCI (&gt;15%), a modified Poisson regression with robust error variance will replace logistic regression for primary analyses. This method provides relatively unbiased estimates of aPRs for binary outcomes in cross-sectional studies with common outcomes. The primary objective is to assess whether a prior elite athletic career, without a history of SRCs, acts as a protective factor against MCI, independent of other potential risk factors. Thus, three follow-up analyses are planned. First, the crude PR for former elite athletes will be calculated without any adjustments. Second, the PR adjusted for the 'identified risk factor' for MCI (model 1) will be estimated. Third, current PA levels will be included in the model to explore if a former athletic background, without a history of SRCs, serves as a protective factor for MCI among older individuals (model 2). Finally, all confounders in the present study design will be included in the analysis (model 3).", "doc_items_refs": ["#/texts/207", "#/texts/208"], "page_nos": [], "uuid": "aaaa9cfd-6f7f-4606-834a-8d3215f34776"}
{"doc_id": "2025__Prevalence_of_mild_cognitive_impairment_among_former_elite_athletes_without_a_hi__W4412756335", "source_path": "<redacted:source_path>", "chunk_id": 18, "source_chunk_idxs": [29, 30], "num_tokens": 381, "text": "Prevalence of mild cognitive impairment among former elite athletes without a history of sport-related concussions compared to the general older population: a protocol for a cross-sectional study with exploratory subgroup analyses | BMJ Open\nMethods/design\nData analysis and statistics\nExploratory subgroup analyses will focus exclusively on former athletes, categorising them by sport type (endurance, mixed/team or power) and contact exposure level (contact, limited-contact or non-contact). MCI prevalence across different subgroups will be reported, with within-group comparisons of MoCA, Memtrax and IADL scores conducted using one-way analysis of variance for normally distributed continuous variables and Kruskal-Wallis tests for non-normally distributed continuous variables. All data analysis will be conducted using Statistical Package for the Social Sciences V.21 (IBM Corp., Armonk, NY, USA) or R software V.4.0.5.\n\nPrevalence of mild cognitive impairment among former elite athletes without a history of sport-related concussions compared to the general older population: a protocol for a cross-sectional study with exploratory subgroup analyses | BMJ Open\nMethods/design\nStudy status\nThe study is being conducted from 25 June 2024 to 25 June 2025. At the time of this protocol submission, the study is currently in its intermediate phase. Despite extensive efforts to recruit former elite athletes, enrolment of eligible athletes remains insufficient within the planned timeframe, while the general population comparison group has achieved full enrolment. This shortfall was exacerbated by constraints in research team capacity, including the absence of a key team member due to pregnancy and maternity leave, and funding limitations for extended recruitment. In accordance with clinical trial transparency guidelines, the Ethics Committee will terminate the study as scheduled to maintain statistical power for addressing primary objectives and ensure responsible resource allocation.", "doc_items_refs": ["#/texts/209", "#/texts/211"], "page_nos": [], "uuid": "ba4b660a-94e9-415e-91a4-e83ac2353238"}
{"doc_id": "2025__Prevalence_of_mild_cognitive_impairment_among_former_elite_athletes_without_a_hi__W4412756335", "source_path": "<redacted:source_path>", "chunk_id": 19, "source_chunk_idxs": [31, 32], "num_tokens": 264, "text": "Prevalence of mild cognitive impairment among former elite athletes without a history of sport-related concussions compared to the general older population: a protocol for a cross-sectional study with exploratory subgroup analyses | BMJ Open\nMethods/design\nData monitoring\nThe study will adhere to the FAIR guiding principles (Findability, Accessibility, Interoperability and Reusability) of data management and sharing. The REDCap software, which features built-in date and time stamps and provides support for study coordinators in monitoring data collection and feedback, will be employed.\n\nPrevalence of mild cognitive impairment among former elite athletes without a history of sport-related concussions compared to the general older population: a protocol for a cross-sectional study with exploratory subgroup analyses | BMJ Open\nMethods/design\nEthics and dissemination\nEthics approval was obtained from the Ethics Committee/Internal Review Board of Beijing Sport University (approval number: 2024042H). This study has been registered with the Chinese Clinical Trial Registry (approval number: ChiCTR 2400085800). All procedures will adhere to the Helsinki Declaration. The study's findings will be shared with participants as appropriate. Completed results will be communicated through abstract presentations at national or international conferences/academic seminars, as well as through publication in a peer-reviewed journal.", "doc_items_refs": ["#/texts/213", "#/texts/215"], "page_nos": [], "uuid": "2f441e60-ff9b-4d9a-8669-fd94dfa840b7"}
{"doc_id": "2025__Prevalence_of_mild_cognitive_impairment_among_former_elite_athletes_without_a_hi__W4412756335", "source_path": "<redacted:source_path>", "chunk_id": 20, "source_chunk_idxs": [33], "num_tokens": 349, "text": "Prevalence of mild cognitive impairment among former elite athletes without a history of sport-related concussions compared to the general older population: a protocol for a cross-sectional study with exploratory subgroup analyses | BMJ Open\nDiscussion\nCognitive impairment poses a significant public health concern in China, underscoring the need to identify potential protective factors, including specific occupations and their long-term influence. This study is valuable since it is the first cross-sectional study protocol comparing the risk of MCI in former elite athletes without a history of SRCs and the general population, with the ultimate goal of determining whether former elite athletic careers have a lifespan brain health advantage. Our hypothesis posits that, after adjusting for identified risk factors and current levels of PA, former elite athletes without SRCs would exhibit superior cognitive function compared with the general population. This implies that VPA and specialised training during their adolescence and youth may have a significant impact on the athletes' cognitive trajectory.\nAnother strength of this study is the use of Memtrax, a quantitative evaluation tool, to supplement the questionnaire-based MCI assessment. A recent study conducted in 2021 demonstrated that MemTrax could effectively and accurately detect clinically diagnosed MCI better than MoCA in a Chinese cohort. Neurodegenerative conditions, including AD, have been observed in elite athletes who have engaged in contact sports and sustained SRCs. However, the prevalence of aMCI in elite athletes without a history of SRCs has received little attention. Our study will present preliminary findings to describe memory-related cognition and IADL changes in this population. Given the limitations of the current study design in assessing aMCI and intrinsic capacity, future research is essential to address this gap in knowledge.", "doc_items_refs": ["#/texts/217", "#/texts/218"], "page_nos": [], "uuid": "1df835d2-0928-4abb-8485-289e49336d1c"}
{"doc_id": "2025__Prevalence_of_mild_cognitive_impairment_among_former_elite_athletes_without_a_hi__W4412756335", "source_path": "<redacted:source_path>", "chunk_id": 21, "source_chunk_idxs": [34], "num_tokens": 311, "text": "Prevalence of mild cognitive impairment among former elite athletes without a history of sport-related concussions compared to the general older population: a protocol for a cross-sectional study with exploratory subgroup analyses | BMJ Open\nDiscussion\nPrior research has connected the extended lifespan of elite athletes to theories surrounding participation and performance, which are linked to the essential prerequisites for achieving success in sports.\n50\nExisting research has indicated that retiring from sports can lead to changes in dietary patterns and PA levels comparable to those of the general population.\n51\nTherefore, it is crucial to investigate the impact of athletes' careers in adolescence and young adulthood on cognitive trajectory and further consider the potential impact of sport-related factors. Even though the participants did not have a history of SRCs, the physical strains of contact sports activities, such as sprinting, kicking and shovelling, may result in repeated bodily impacts. Thus, it is crucial to assess the impact of contact and non-contact sports, as well as different sport types, on the cognitive abilities of former elite athletes separately. In this study, the term 'exploratory' strictly applies to the sport-specific subgroup analyses (eg, endurance vs power sports; contact exposure levels). These analyses are exploratory due to the insufficient statistical power from stratified sample sizes. The practical importance of this study lies in its potential for enhancing empirical evidence in the field of sports for health. Implementing preventive and adaptive measures can contribute to raising health awareness among athletes and reducing the occurrence of SRCs.", "doc_items_refs": ["#/texts/219", "#/texts/220", "#/texts/221", "#/texts/222", "#/texts/223"], "page_nos": [], "uuid": "47f932fd-5e72-425d-8f48-7b078fb68049"}
{"doc_id": "2025__Prevalence_of_mild_cognitive_impairment_among_former_elite_athletes_without_a_hi__W4412756335", "source_path": "<redacted:source_path>", "chunk_id": 22, "source_chunk_idxs": [35, 36], "num_tokens": 505, "text": "Prevalence of mild cognitive impairment among former elite athletes without a history of sport-related concussions compared to the general older population: a protocol for a cross-sectional study with exploratory subgroup analyses | BMJ Open\nDiscussion\nThis study faces potential limitations and challenges. First, the cross-sectional nature of the study precludes establishing a causal relationship between an athletic career and a reduced incidence of MCI in later life. Second, the relatively modest sample size-dictated by the scarcity of former elite athletes and lack of published data on MCI prevalence among former elite athletes without sports-related concussions-precluded standard sample size calculations based on effect size estimation. Consequently, while the modified Poisson regression provides robust PR estimates, the precision of effect measures (particularly subgroup analyses) requires cautious interpretation. Third, the information collection included self-reported recall regarding factors such as a history of SRCs and a parental history of dementia. This approach may introduce bias due to inaccuracies in recalled information or subjectivity in responses. Moreover, potential undiagnosed health conditions that could influence MCI among participants could not be captured. Finally, previous research has identified cognitive decline in former athletes from sports such as rugby, soccer and football. However, given the actual prevalence of these sports in China, where basketball, table tennis and badminton are more popular, it hinders comprehensive understanding of MCI in former elite athletes worldwide. Thus, regional and selection biases should be anticipated due to variations in the prevalence of MCI among former elite athletes without SRCs across countries. These variations may be influenced by differences in sport popularity, post-career trajectories and access to social benefits such as medical risk screenings.\nIn summary, this cross-sectional study design prevents the establishment of definitive conclusions regarding whether former athletic careers are better protected against cognitive decline in terms of cognitive trajectory. Future research should include cohort studies and randomised controlled trials to address this gap. Given the intricate interplay among genetic, environmental and developmental factors in relation to athletic careers, as well as the subsequent cognitive trajectories post-retirement, research could be enhanced through more extensive databases. Prospective research endeavours should also be pursued.\n\nPrevalence of mild cognitive impairment among former elite athletes without a history of sport-related concussions compared to the general older population: a protocol for a cross-sectional study with exploratory subgroup analyses | BMJ Open\nEthics statements\nPatient consent for publication\nConsent obtained directly from patient(s).", "doc_items_refs": ["#/texts/224", "#/texts/225", "#/texts/228"], "page_nos": [], "uuid": "7824dd85-41ff-413b-9d50-0d8ba55736f2"}
{"doc_id": "2025__Prevalence_of_mild_cognitive_impairment_among_former_elite_athletes_without_a_hi__W4412756335", "source_path": "<redacted:source_path>", "chunk_id": 23, "source_chunk_idxs": [37], "num_tokens": 508, "text": "Prevalence of mild cognitive impairment among former elite athletes without a history of sport-related concussions compared to the general older population: a protocol for a cross-sectional study with exploratory subgroup analyses | BMJ Open\nReferences\n1. ↵\n. Brain health: Key to health, productivity, and well-being . Alzheimers Dement 2022 ; 18 : 1396 - 407 .\ndoi:10.1002/alz.12478\nOpenUrl\nCrossRef\nPubMed\n2. ↵\n. Diagnosis and Treatment for Mild Cognitive Impairment: A Systematic Review of Clinical Practice Guidelines and Consensus Statements . Front Neurol 2021 ; 12 : 719849 .\ndoi:10.3389/fneur.2021.719849\n3. ↵\n. Mild cognitive impairment: prevalence, prognosis, aetiology, and treatment . Lancet Neurol 2003 ; 2 : 15 - 21 .\ndoi:10.1016/s1474-4422(03)00262-x\nOpenUrl\nCrossRef\nPubMed\nWeb of Science\n4. ↵\n. Mild cognitive impairment and deficits in instrumental activities of daily living: a systematic review . Alzheimers Res Ther 2015 ; 7 : 17 .\ndoi:10.1186/s13195-015-0099-0\n5. ↵\n. Prevalence, risk factors, and management of dementia and mild cognitive impairment in adults aged 60 years or older in China: a cross-sectional study . Lancet Public Health 2020 ; 5 : e661 - 71 .\ndoi:10.1016/S2468-2667(20)30185-7\nOpenUrl\n6. ↵\n. Physical Activity, Cognition, and Brain Outcomes: A Review of the 2018 Physical Activity Guidelines . Med Sci Sports Exerc 2019 ; 51 : 1242 - 51 .\ndoi:10.1249/MSS.0000000000001936\nOpenUrl\nCrossRef\n7. ↵\n. Physical Activity Interventions in Preventing Cognitive Decline and Alzheimer-Type Dementia: A Systematic Review . Ann Intern Med 2018 ; 168 : 30 - 8 .\ndoi:10.7326/M17-1528\nOpenUrl\nCrossRef\nPubMed\n8. ↵\n. World Health Organization 2020 guidelines on physical activity and sedentary behaviour . Br J Sports Med 2020 ; 54 : 1451 - 62 .\ndoi:10.1136/bjsports-2020-102955\nOpenUrl\nAbstract / FREE Full Text", "doc_items_refs": ["#/texts/230", "#/texts/231", "#/texts/232", "#/texts/233", "#/texts/234", "#/texts/235", "#/texts/236", "#/texts/237"], "page_nos": [], "uuid": "7caa7ff1-e18f-4094-a030-c3b4593fc273"}
{"doc_id": "2025__Prevalence_of_mild_cognitive_impairment_among_former_elite_athletes_without_a_hi__W4412756335", "source_path": "<redacted:source_path>", "chunk_id": 24, "source_chunk_idxs": [38], "num_tokens": 462, "text": "Prevalence of mild cognitive impairment among former elite athletes without a history of sport-related concussions compared to the general older population: a protocol for a cross-sectional study with exploratory subgroup analyses | BMJ Open\nReferences\n9. ↵\n. Health Consequences of an Elite Sporting Career: Long-Term Detriment or Long-Term Gain? A Meta-Analysis of 165,000 Former Athletes . Sports Med 2021 ; 51 : 289 - 301 .\ndoi:10.1007/s40279-020-01379-5\nOpenUrl\nCrossRef\nPubMed\n10. ↵\n. The (cognitive) future of motor control and learning . Front Sports Act Living 2023 ; 5 : 1181808 .\ndoi:10.3389/fspor.2023.1181808\n11. ↵\n. Professional athletes have extraordinary skills for rapidly learning complex and neutral dynamic visual scenes . Sci Rep 2013 ; 3 : 1154 .\ndoi:10.1038/srep01154\n12. ↵\n. Lifestyle Modulators of Neuroplasticity: How Physical Activity, Mental Engagement, and Diet Promote Cognitive Health during Aging . Neural Plast 2017 ; 2017 : 3589271 .\ndoi:10.1155/2017/3589271\n13. ↵\n. Relationships between physical activity, sleep and cognitive function: A narrative review . Neurosci Biobehav Rev 2021 ; 130 : 369 - 78 .\ndoi:10.1016/j.neubiorev.2021.09.003\nOpenUrl\nCrossRef\nPubMed\n14. ↵\n. Physical activity during early life and the risk of all-cause mortality in midlife: findings from a birth cohort study . Eur J Public Health 2023 ; 33 : 872 - 7 .\ndoi:10.1093/eurpub/ckad084\nOpenUrl\n15. ↵\n. Mental Health and Wellbeing of Retired Elite and Amateur Rugby Players and Non-contact Athletes and Associations with Sports-Related Concussion: The UK Rugby Health Project . Sports Med 2022 ; 52 : 1419 - 31 .\ndoi:10.1007/s40279-021-01594-8\nOpenUrl\nPubMed", "doc_items_refs": ["#/texts/238", "#/texts/239", "#/texts/240", "#/texts/241", "#/texts/242", "#/texts/243", "#/texts/244"], "page_nos": [], "uuid": "3d5cb776-bd7d-4829-811f-335cb2d694bf"}
{"doc_id": "2025__Prevalence_of_mild_cognitive_impairment_among_former_elite_athletes_without_a_hi__W4412756335", "source_path": "<redacted:source_path>", "chunk_id": 25, "source_chunk_idxs": [39], "num_tokens": 491, "text": "Prevalence of mild cognitive impairment among former elite athletes without a history of sport-related concussions compared to the general older population: a protocol for a cross-sectional study with exploratory subgroup analyses | BMJ Open\nReferences\n16. ↵\n. Sport-Related Concussion and Mental Health Outcomes in Elite Athletes: A Systematic Review . Sports Med 2018 ; 48 : 447 - 65 .\ndoi:10.1007/s40279-017-0810-3\nOpenUrl\nCrossRef\nPubMed\n17. ↵\n. An Exploratory Study of Mild Cognitive Impairment of Retired Professional Contact Sport Athletes . J Head Trauma Rehabil 2018 ; 33 : E16 - 23 .\ndoi:10.1097/HTR.0000000000000420\nOpenUrl\n18. ↵\n. Neurodegenerative disease risk among former international rugby union players . J Neurol Neurosurg Psychiatry 2022 ; 93 : 1262 - 8 .\ndoi:10.1136/jnnp-2022-329675\nOpenUrl\nAbstract / FREE Full Text\n19. ↵\n. Prevalence of osteoarthritis in former elite athletes: a systematic overview of the recent literature . Rheumatol Int 2015 ; 35 : 405 - 18 .\ndoi:10.1007/s00296-014-3093-0\nOpenUrl\nCrossRef\nPubMed\n20. ↵\n. Consensus statement on concussion in sport: the 6th International Conference on Concussion in Sport-Amsterdam, October 2022 . Br J Sports Med 2023 ; 57 : 695 - 711 .\ndoi:10.1136/bjsports-2023-106898\nOpenUrl\nAbstract / FREE Full Text\n21. ↵\n. Association between Sensation-Seeking Behaviors and Concussion-Related Knowledge, Attitudes, Perceived Norms, and Care-Seeking Behaviors among Collegiate Student-Athletes . J Sports Sci Med 2022 ; 21 : 33 - 42 .\ndoi:10.52082/jssm.2022.33\nOpenUrl\n22. ↵\n. Association between dementia parental family history and mid-life modifiable risk factors for dementia: a cross-sectional study using propensity score matching within the Lifelines cohort . BMJ Open 2021 ; 11 : e049918 .\ndoi:10.1136/bmjopen-2021-049918", "doc_items_refs": ["#/texts/245", "#/texts/246", "#/texts/247", "#/texts/248", "#/texts/249", "#/texts/250", "#/texts/251"], "page_nos": [], "uuid": "2088efc3-9fc9-462c-8e9a-91bb48b09012"}
{"doc_id": "2025__Prevalence_of_mild_cognitive_impairment_among_former_elite_athletes_without_a_hi__W4412756335", "source_path": "<redacted:source_path>", "chunk_id": 26, "source_chunk_idxs": [40], "num_tokens": 500, "text": "Prevalence of mild cognitive impairment among former elite athletes without a history of sport-related concussions compared to the general older population: a protocol for a cross-sectional study with exploratory subgroup analyses | BMJ Open\nReferences\n23. ↵\n. Smoking and quitting behaviours by mental health conditions in Great Britain (1993-2014) . Addict Behav 2019 ; 90 : 14 - 9 .\ndoi:10.1016/j.addbeh.2018.10.011\nOpenUrl\nCrossRef\nPubMed\n24. ↵\n. Chinese Guidelines for Prevention and Treatment of Hypertension-A report of the Revision Committee of Chinese Guidelines for Prevention and Treatment of Hypertension . J Geriatr Cardiol 2019 ; 16 : 182 - 241 .\ndoi:10.11909/j.issn.1671-5411.2019.03.014\nOpenUrl\nCrossRef\nPubMed\n25. ↵\n. Chinese guidelines for the management of dyslipidemia in adults . J Geriatr Cardiol 2018 ; 15 : 1 - 29 .\ndoi:10.11909/j.issn.1671-5411.2018.01.011\nOpenUrl\nCrossRef\nPubMed\n26. ↵\n. Standards of medical care for type 2 diabetes in China 2019 . Diabetes Metab Res Rev 2019 ; 35 : e3158 .\ndoi:10.1002/dmrr.3158\n27. ↵\n. [Clinical guidelines for prevention and treatment of type 2 diabetes mellitus in the elderly in China (2022 edition)] . Zhonghua Nei Ke Za Zhi 2022 ; 61 : 12 - 50 .\ndoi:10.3760/cma.j.cn112138-20211027-00751\nOpenUrl\n28. ↵\n. [Chinese guidelines for lipid management (2023)] . Zhonghua Xin Xue Guan Bing Za Zhi 2023 ; 51 : 221 - 55 .\ndoi:10.3760/cma.j.cn112148-20230119-00038\nOpenUrl\nPubMed\n29. ↵\n. The Dose-Response Relationships of Different Dimensions of Physical Activity with Daily Physical Function and Cognitive Function in Chinese Adults with Hypertension: A Cross-Sectional Study . Int J Environ Res Public Health 2021 ; 18 : 12698 .\ndoi:10.3390/ijerph182312698", "doc_items_refs": ["#/texts/252", "#/texts/253", "#/texts/254", "#/texts/255", "#/texts/256", "#/texts/257", "#/texts/258"], "page_nos": [], "uuid": "cd0b3e88-260b-470e-971c-7e6b46f1018d"}
{"doc_id": "2025__Prevalence_of_mild_cognitive_impairment_among_former_elite_athletes_without_a_hi__W4412756335", "source_path": "<redacted:source_path>", "chunk_id": 27, "source_chunk_idxs": [41], "num_tokens": 505, "text": "Prevalence of mild cognitive impairment among former elite athletes without a history of sport-related concussions compared to the general older population: a protocol for a cross-sectional study with exploratory subgroup analyses | BMJ Open\nReferences\n30. ↵\n. The role of physical activity on healthcare utilization in China . BMC Public Health 2023 ; 23 : 2378 .\ndoi:10.1186/s12889-023-16625-4\n31. ↵\n. Effects of Physical Activity on Daily Physical Function in Chinese Middle-Aged and Older Adults: A Longitudinal Study from CHARLS . J Clin Med 2022 ; 11 : 6514 .\ndoi:10.3390/jcm11216514\n32. ↵\n. Alcohol Consumption and Mild Cognitive Impairment: A Mendelian Randomization Study from Rural China . Nutrients 2022 ; 14 : 3596 .\ndoi:10.3390/nu14173596\n33. ↵\n. Alcohol consumption and risks of more than 200 diseases in Chinese men . Nat Med 2023 ; 29 : 1476 - 86 .\ndoi:10.1038/s41591-023-02383-8\nOpenUrl\nCrossRef\nPubMed\n34. ↵\n. Epidemiology and determinants of obesity in China . Lancet Diabetes Endocrinol 2021 ; 9 : 373 - 92 .\ndoi:10.1016/S2213-8587(21)00045-0\nOpenUrl\nPubMed\n35. ↵\n. Association between body mass index, its change and cognitive impairment among Chinese older adults: a community-based, 9-year prospective cohort study . Eur J Epidemiol 2021 ; 36 : 1043 - 54 .\ndoi:10.1007/s10654-021-00792-y\nOpenUrl\n36. ↵\n. Associations of body mass index, waist circumference and waist-to-height ratio with cognitive impairment among Chinese older adults: Based on the CLHLS . J Affect Disord 2021 ; 295 : 463 - 70 .\ndoi:10.1016/j.jad.2021.08.093\nOpenUrl\nCrossRef\nPubMed\n37. ↵\n. Changes in sleep duration and 3-year risk of mild cognitive impairment in Chinese older adults . Aging (Albany NY) 2020 ; 12 : 309 - 17 .\ndoi:10.18632/aging.102616\nOpenUrl", "doc_items_refs": ["#/texts/259", "#/texts/260", "#/texts/261", "#/texts/262", "#/texts/263", "#/texts/264", "#/texts/265", "#/texts/266"], "page_nos": [], "uuid": "457ee396-c46b-43fe-a9fc-250188b4e189"}
{"doc_id": "2025__Prevalence_of_mild_cognitive_impairment_among_former_elite_athletes_without_a_hi__W4412756335", "source_path": "<redacted:source_path>", "chunk_id": 28, "source_chunk_idxs": [42], "num_tokens": 509, "text": "Prevalence of mild cognitive impairment among former elite athletes without a history of sport-related concussions compared to the general older population: a protocol for a cross-sectional study with exploratory subgroup analyses | BMJ Open\nReferences\n38. ↵\n. Association of Unhealthy Lifestyle and Genetic Risk Factors With Mild Cognitive Impairment in Chinese Older Adults . JAMA Netw Open 2023 ; 6 : e2324031 .\ndoi:10.1001/jamanetworkopen.2023.24031\n39. ↵\n. Physiological comparison between non-athletes, endurance, power and team athletes . Eur J Appl Physiol 2019 ; 119 : 1377 - 86 .\ndoi:10.1007/s00421-019-04128-3\nOpenUrl\n40. ↵\n. All-cause and disease-specific mortality among male, former elite athletes: an average 50-year follow-up . Br J Sports Med 2015 ; 49 : 893 - 7 .\ndoi:10.1136/bjsports-2013-093347\nOpenUrl\nAbstract / FREE Full Text\n41. ↵\n. Medical Conditions Affecting Sports Participation . Pediatrics 2008 ; 121 : 841 - 8 .\ndoi:10.1542/peds.2008-0080\nOpenUrl\nCrossRef\nPubMed\nWeb of Science\n42. ↵\n. Comparative study of two Chinese versions of Montreal Cognitive Assessment for Screening of Mild Cognitive Impairment . Appl Neuropsychol Adult 2021 ; 28 : 88 - 93 .\ndoi:10.1080/23279095.2019.1602530\nOpenUrl\n43. ↵\n. Cross-cultural difference and validation of the Chinese version of Montreal Cognitive Assessment in older adults residing in Eastern China: preliminary findings . Arch Gerontol Geriatr 2013 ; 56 : 38 - 43 .\ndoi:10.1016/j.archger.2012.05.008\nOpenUrl\nCrossRef\nPubMed\n44. ↵\n. Neuropsychological and neuroimaging characteristics of amnestic mild cognitive impairment subtypes: a selective overview . CNS Neurosci Ther 2015 ; 21 : 776 - 83 .\ndoi:10.1111/cns.12391\nOpenUrl\n45. ↵\n. A Computerized Continuous-Recognition Task for Measurement of Episodic Memory . JAD 2019 ; 69 : 385 - 99 .\ndoi:10.3233/JAD-190167\nOpenUrl", "doc_items_refs": ["#/texts/267", "#/texts/268", "#/texts/269", "#/texts/270", "#/texts/271", "#/texts/272", "#/texts/273", "#/texts/274"], "page_nos": [], "uuid": "939b29fc-7784-4e7c-967a-ddedaa400749"}
{"doc_id": "2025__Prevalence_of_mild_cognitive_impairment_among_former_elite_athletes_without_a_hi__W4412756335", "source_path": "<redacted:source_path>", "chunk_id": 29, "source_chunk_idxs": [43], "num_tokens": 397, "text": "Prevalence of mild cognitive impairment among former elite athletes without a history of sport-related concussions compared to the general older population: a protocol for a cross-sectional study with exploratory subgroup analyses | BMJ Open\nReferences\n46. ↵\n. Toward digitally screening and profiling AD: A GAMLSS approach of MemTrax in China . Alzheimers Dement 2024 ; 20 : 399 - 409 .\ndoi:10.1002/alz.13430\nOpenUrl\nPubMed\n47. ↵\n. Validity of the MemTrax Memory Test Compared to the Montreal Cognitive Assessment in the Detection of Mild Cognitive Impairment and Dementia due to Alzheimer's Disease in a Chinese Cohort . Journal of Alzheimer's Disease 2021 ; 80 : 1257 - 67 .\ndoi:10.3233/JAD-200936\nOpenUrl\n48. ↵\n. The Lawton instrumental activities of daily living scale . Am J Nurs 2008 ; 108 : 52 - 62 ; .\ndoi:10.1097/01.NAJ.0000314810.46029.74\nOpenUrl\nPubMed\nWeb of Science\n49. ↵\n. The Validation of the Hong Kong Chinese Version of the Lawton Instrumental Activities of Daily Living Scale for Institutionalized Elderly Persons . OTJR: Occupational Therapy Journal of Research 2002 ; 22 : 132 - 42 .\ndoi:10.1177/153944920202200402\nOpenUrl\n50. ↵\n. Do Elite Athletes Live Longer? A Systematic Review of Mortality and Longevity in Elite Athletes . Sports Med Open 2015 ; 1 : 16 .\ndoi:10.1186/s40798-015-0024-x\n51. ↵\n. Former athletes' lifestyle and self-definition changes after retirement from sports . J Sport Health Sci 2020 ; 9 : 376 - 83 .\ndoi:10.1016/j.jshs.2018.08.006\nOpenUrl", "doc_items_refs": ["#/texts/275", "#/texts/276", "#/texts/277", "#/texts/278", "#/texts/279", "#/texts/280"], "page_nos": [], "uuid": "f0bc0c37-b577-4e8b-bde6-ae3ddc5c71f4"}
{"doc_id": "2025__Prevalence_of_mild_cognitive_impairment_among_former_elite_athletes_without_a_hi__W4412756335", "source_path": "<redacted:source_path>", "chunk_id": 30, "source_chunk_idxs": [44, 45], "num_tokens": 287, "text": "Prevalence of mild cognitive impairment among former elite athletes without a history of sport-related concussions compared to the general older population: a protocol for a cross-sectional study with exploratory subgroup analyses | BMJ Open\nFootnotes\n- SL and HL contributed equally.\n- Contributors The study was conceived by JQ and SL, and SL is the guarantor of this study. The protocol was drafted and revised by HL, QZ, JC and HH, and they will supervise recruitment, follow-up and further data analysis. JX and JR helped with the design of the questionnaires. All authors have reviewed and endorsed the final manuscript.\n- Funding This work was supported by the Fundamental Research Funds for the Central Universities (Exercise Rehabilitation Science Laboratory), 2023KFZX005 and 2025KYPT12.\n- Competing interests None declared.\n- Patient and public involvement Patients and/or the public were not involved in the design, conduct, reporting or dissemination plans of this research.\n- Provenance and peer review Not commissioned; externally peer-reviewed.\n\nPrevalence of mild cognitive impairment among former elite athletes without a history of sport-related concussions compared to the general older population: a protocol for a cross-sectional study with exploratory subgroup analyses | BMJ Open\nRead the full text or download the PDF:\nSubscribe\nLog in\nLog in via Institution\nLog in via OpenAthens", "doc_items_refs": ["#/texts/282", "#/texts/283", "#/texts/284", "#/texts/285", "#/texts/286", "#/texts/287", "#/texts/289", "#/texts/290", "#/texts/291", "#/texts/292"], "page_nos": [], "uuid": "5f0c4788-c9d4-4849-8b69-af76da21cb7c"}
{"doc_id": "2025__Prevalence_of_mild_cognitive_impairment_among_former_elite_athletes_without_a_hi__W4412756335", "source_path": "<redacted:source_path>", "chunk_id": 31, "source_chunk_idxs": [46], "num_tokens": 251, "text": "Prevalence of mild cognitive impairment among former elite athletes without a history of sport-related concussions compared to the general older population: a protocol for a cross-sectional study with exploratory subgroup analyses | BMJ Open\nRead the full text or download the PDF:\nLog in using your username and password\nFor personal accounts OR managers of institutional accounts\nUsername *\nPassword *\nForgot your log in details?\nRegister a new account?\nForgot\nyour user name or password?\n- Content\n- Latest content\n- Archive\n- Browse by collection\n- Most read articles\n- Top Cited articles\n- Responses\n- About\n- Editorial board\n- Sign up for email alerts\n- Thank you to our reviewers\n- Instructions for authors\n- Submit an article\n- Editorial policies\n- Open Access at BMJ\n- Instructions for reviewers\n- BMJ Author Hub\n- Contact us\n- Reprints\n- Permissions\n- Advertising\n- Feedback form\n- RSS\n- Twitter\n- Facebook\n- Blog\n- Website Terms &amp; Conditions\n- Privacy &amp; Cookies\n- Contact BMJ\nCookie Settings\nOnline ISSN: 2044-6055 Print ISSN: 2044-6055 Copyright © 2025 BMJ Publishing Group Ltd. All rights, including for text and data mining, AI training, and similar technologies, are reserved.", "doc_items_refs": ["#/texts/294", "#/texts/295", "#/texts/296", "#/texts/297", "#/texts/298", "#/texts/299", "#/texts/300", "#/texts/301", "#/texts/302", "#/texts/303", "#/texts/304", "#/texts/305", "#/texts/306", "#/texts/307", "#/texts/308", "#/texts/309", "#/texts/310", "#/texts/311", "#/texts/312", "#/texts/313", "#/texts/314", "#/texts/315", "#/texts/316", "#/texts/317", "#/texts/318", "#/texts/319", "#/texts/320", "#/texts/321", "#/texts/322", "#/texts/323", "#/texts/324", "#/texts/325", "#/texts/326", "#/texts/327", "#/texts/328", "#/texts/329", "#/texts/330", "#/texts/331"], "page_nos": [], "uuid": "9ac09f28-153f-4435-a960-3f4627debb2e"}
