{"doc_id": "2025__Emerging_Role_of_Oligodendrocytes_Malfunction_in_the_Progression_of_Alzheimers_D__W4413865689", "source_path": "<redacted:source_path>", "chunk_id": 0, "source_chunk_idxs": [0, 1], "num_tokens": 201, "text": "Emerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease | Journal of Neuroimmune Pharmacology\nSkip to main content\nAdvertisement\nLog in\nMenu\nFind a journal\nPublish with us\nTrack your research\nSearch\nCart\n1. Home\n2. Journal of Neuroimmune Pharmacology\n3. Article\n\nEmerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\n- REVIEW\n- Open access\n- Published: 01 September 2025\n- Volume 20 , article number 79 , ( 2025 )\n- Cite this article\nDownload PDF\nYou have full access to this\nopen access\narticle\nJournal of Neuroimmune Pharmacology\nAims and scope\nSubmit manuscript\nEmerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nDownload PDF\n- Kinga Tylek\n1\n&amp;\n- Agnieszka Basta-Kaim\n1\n- 1898 Accesses\n- 7 Altmetric\n- 1 Mention\n- Explore all metrics", "doc_items_refs": ["#/texts/1", "#/texts/2", "#/texts/3", "#/texts/4", "#/texts/5", "#/texts/6", "#/texts/7", "#/texts/8", "#/texts/9", "#/texts/10", "#/texts/11", "#/texts/12", "#/texts/14", "#/texts/15", "#/texts/16", "#/texts/17", "#/texts/18", "#/texts/19", "#/texts/20", "#/texts/21", "#/texts/22", "#/texts/23", "#/texts/24", "#/texts/25", "#/texts/26", "#/texts/27", "#/texts/28", "#/texts/29", "#/texts/30", "#/texts/31", "#/texts/32", "#/texts/33"], "page_nos": [], "uuid": "bd8d48ca-f9cf-435f-9ea8-946812d62244"}
{"doc_id": "2025__Emerging_Role_of_Oligodendrocytes_Malfunction_in_the_Progression_of_Alzheimers_D__W4413865689", "source_path": "<redacted:source_path>", "chunk_id": 1, "source_chunk_idxs": [2], "num_tokens": 427, "text": "Emerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nAbstract\nAlzheimer's disease (AD), the most prevalent form of dementia, is characterized by hallmark pathologies such as amyloid-beta (Aβ) plaque accumulation, tau hyperphosphorylation, and progressive neuronal dysfunction. While much attention has focused on neurons and microglia, recent studies underscore the significant yet understudied roles of oligodendrocytes (OL) and oligodendrocyte precursor cells (OPC) in AD pathology. OL, responsible for myelin production and maintenance, are impaired early in AD, contributing to demyelination, synaptic dysfunction, and cognitive decline. Emerging evidence reveals that Aβ and tau pathology disrupt OPC differentiation and induce senescence, exacerbating neuroinflammation and reducing remyelination potential. Demyelination precedes overt AD symptoms, positioning it as a potential early biomarker. Furthermore, animal models reveal that OPC density and function deteriorate with age, particularly in the presence of Aβ plaques, highlighting their vulnerability in the AD environment. Transcriptomic studies also link cholesterol biosynthesis and lipid metabolism dysregulation in OPC to AD progression, emphasizing the intricate relationship between OL, metabolic processes, and amyloid toxicity. Additionally, the identification of disease-associated oligodendrocytes (DAO), characterized by altered gene expression and proximity to Aβ plaques, highlights their involvement in neuroinflammation and APP processing. This review synthesizes recent insights into OL and OPC dysfunction in AD, focusing on their roles in neuroinflammation, Aβ clearance, and myelin integrity. It discusses the potential of targeting OL and OPC pathways, such as enhancing remyelination and mitigating senescence, as novel therapeutic strategies. By addressing gaps in our understanding of OL dynamics, this work sheds light on their critical contributions to AD pathology and sets the stage for future research and intervention.", "doc_items_refs": ["#/texts/35"], "page_nos": [], "uuid": "51542fd4-5a86-49ca-9d49-79cc700465b2"}
{"doc_id": "2025__Emerging_Role_of_Oligodendrocytes_Malfunction_in_the_Progression_of_Alzheimers_D__W4413865689", "source_path": "<redacted:source_path>", "chunk_id": 2, "source_chunk_idxs": [3, 4, 5, 6, 7], "num_tokens": 470, "text": "Emerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nAbstract\nSenolytic therapy alleviates Aβ-associated oligodendrocyte progenitor cell senescence and cognitive deficits in an Alzheimer's disease model\nArticle\n01 April 2019\n\nEmerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nAbstract\nMyelin dysfunction drives amyloid-β deposition in models of Alzheimer's disease\nArticle\nOpen access\n31 May 2023\n\nEmerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nAbstract\nOligodendrocyte progenitor cells in Alzheimer's disease: from physiology to pathology\nArticle\nOpen access\n14 November 2023\n\nEmerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nAbstract\nExplore related subjects\nDiscover the latest articles, books and news in related subjects, suggested using machine learning.\n- Alzheimer's disease\n- Astrocyte\n- Glial Progenitors\n- Myelin biology and repair\n- Oligodendrocyte\n- White matter disease\nUse our pre-submission checklist\nAvoid common mistakes on your manuscript.\n\nEmerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nIntroduction\nAlzheimer's disease (AD) has emerged as the most prevalent form of dementia worldwide, posing a substantial risk of cognitive decline, particularly in individuals over the age of 65 (Knopman et al.\n2021\n). According to a 2022 report by the World Health Organization (WHO), over 55 million people are currently affected by dementia (World Health Organization\n2022\n). Epidemiological projections estimate that the number of cases will rise to 113 million by 2050, positioning AD as a growing public health and economic challenge (Wu et al.\n2017a\n). The distinctive pathological features of Alzheimer's disease, include the accumulation of insoluble amyloid-beta (Aβ) peptides and the hyperphosphorylation of tau protein which, as AD progresses, lead to the formation of senile plaques (SP) and neurofibrillary tangles (NFT), respectively, and progressively disrupt neuronal function and connectivity (Zhang et al.\n2024a\n; Abdelnour et al.\n2022\n).", "doc_items_refs": ["#/texts/39", "#/texts/40", "#/texts/42", "#/texts/43", "#/texts/44", "#/texts/46", "#/texts/47", "#/texts/48", "#/texts/50", "#/texts/51", "#/texts/52", "#/texts/53", "#/texts/54", "#/texts/55", "#/texts/56", "#/texts/57", "#/texts/58", "#/texts/60", "#/texts/61", "#/texts/62", "#/texts/63", "#/texts/64", "#/texts/65", "#/texts/66", "#/texts/67", "#/texts/68", "#/texts/69", "#/texts/70"], "page_nos": [], "uuid": "4444804e-8dea-43b9-a111-351bae488be7"}
{"doc_id": "2025__Emerging_Role_of_Oligodendrocytes_Malfunction_in_the_Progression_of_Alzheimers_D__W4413865689", "source_path": "<redacted:source_path>", "chunk_id": 3, "source_chunk_idxs": [8], "num_tokens": 344, "text": "Emerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nIntroduction\nAD has a complex and insufficiently understood etiology involving a dynamic interplay between genetic predisposition, environmental influences, epigenetic modifications, and dysregulated molecular pathways (Talwar et al.\n2016\n). Generally, AD is categorized into genetic (familial) and sporadic forms, with the latter being the predominant type observed in clinical populations. Genetic AD is a rarely occurring subtype resulting from mutations in APP, PSEN1, or PSEN2, which drive early-onset AD (EOAD) neurodegeneration typically manifesting before the age of 65 (Maurer et al.\n1997\n). In contrast, sporadic AD, which comprises over 95% of cases, lacks a clear inheritance pattern and is primarily influenced by the\nAPOE4\nallele along with various environmental and epigenetic factor. EOAD, often associated with genetic mutations, exhibits a more aggressive disease course driven by increased Aβ production, whereas late-onset AD (LOAD), is largely multifactorial, characterized by impaired Aβ clearance, neuroinflammation, and oxidative stress (Strobel\nn.d.\n). Despite advances in understanding pathology onset, and progression, the multifactorial nature of Alzheimer's disease has hindered the development of a unified theory. Several hypotheses, including the cholinergic, amyloid cascade, neuroinflammatory, and oxidative stress have been proposed, each shedding light on distinct aspects of the disease's complexity (Liu et al.\n2019\n).", "doc_items_refs": ["#/texts/71", "#/texts/72", "#/texts/73", "#/texts/74", "#/texts/75", "#/texts/76", "#/texts/77", "#/texts/78", "#/texts/79", "#/texts/80", "#/texts/81"], "page_nos": [], "uuid": "938af149-8653-41c3-b729-8089aaab2ab3"}
{"doc_id": "2025__Emerging_Role_of_Oligodendrocytes_Malfunction_in_the_Progression_of_Alzheimers_D__W4413865689", "source_path": "<redacted:source_path>", "chunk_id": 4, "source_chunk_idxs": [9], "num_tokens": 352, "text": "Emerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nIntroduction\nThe primary hallmark of AD-related neurodegeneration - cognitive impairment - stems from progressive neuronal cell loss and synaptic dysfunction. However, the role of glial cells in this pathology is insufficiently understood. Microglia, the main immune cells of the central nervous system (CNS), are perceived as a major contributor to neuroinflammation and oxidative stress in AD. While microglial activation initially serves to clear Aβ aggregates through phagocytosis, prolonged activation leads to chronic neuroinflammation, further exacerbating neuronal damage (Singh\n2022\n; Heneka et al.\n2013\n). This is largely attributed to their harmful activation through the interaction with Aβ and reactive oxygen species (ROS), which triggers proinflammatory cytokine (e.g., IL-1β, TNF-α, IL-6) and chemokine cascades (Bai et al.\n2022\n; Leng\n2021\n). This persistent inflammatory response disrupts synaptic plasticity, contributes to neuronal loss, and impairs cognitive functions. Additionally, microglial dysfunction in AD is associated with genetic risk factors such as mutations in the TREM2 gene, which encodes a receptor crucial for microglial phagocytic activity (Guerreiro et al.\n2013\n). Loss-of-function mutations in\nTREM2\nimpair microglial clearance of Aβ, leading to increased plaque burden and worsening disease pathology (Hou et al.\n2022\n; Zheng et al.\n2018\n).", "doc_items_refs": ["#/texts/82", "#/texts/83", "#/texts/84", "#/texts/85", "#/texts/86", "#/texts/87", "#/texts/88", "#/texts/89", "#/texts/90", "#/texts/91", "#/texts/92", "#/texts/93", "#/texts/94", "#/texts/95", "#/texts/96", "#/texts/97", "#/texts/98"], "page_nos": [], "uuid": "99e98999-b94f-40d1-8cda-9be4b0d4177a"}
{"doc_id": "2025__Emerging_Role_of_Oligodendrocytes_Malfunction_in_the_Progression_of_Alzheimers_D__W4413865689", "source_path": "<redacted:source_path>", "chunk_id": 5, "source_chunk_idxs": [10], "num_tokens": 245, "text": "Emerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nIntroduction\nSimilar to microglia, astrocytes become reactive in response to Alzheimer's disease pathology, a process known as astrogliosis. Reactive astrocytes undergo morphological changes, including hypertrophy and upregulation of glial fibrillary acidic protein (GFAP) (Kato et al.\n1998\n). While these astrocytes can form a protective glial scar around Aβ plaques to limit neurotoxicity, they may also contribute to neuroinflammation by releasing proinflammatory cytokines and ROS (Monterey et al.\n2021\n). The interaction between microglia, astrocytes, and neurons is essential for maintaining CNS homeostasis. However, in AD, dysfunctional crosstalk with microglia leads to sustained neuroinflammation and oxidative stress (Hansen et al.\n2018\n). Conversely, astrocytes can also interface with neurons to promote synaptic repair, regulate synaptic transmission, and preserve the structural and functional integrity of the blood-brain barrier (BBB) (Zhang et al.\n2024b\n).", "doc_items_refs": ["#/texts/99", "#/texts/100", "#/texts/101", "#/texts/102", "#/texts/103", "#/texts/104", "#/texts/105", "#/texts/106", "#/texts/107"], "page_nos": [], "uuid": "02cfe3be-0b7b-4a3c-9104-76d1f9159998"}
{"doc_id": "2025__Emerging_Role_of_Oligodendrocytes_Malfunction_in_the_Progression_of_Alzheimers_D__W4413865689", "source_path": "<redacted:source_path>", "chunk_id": 6, "source_chunk_idxs": [11], "num_tokens": 449, "text": "Emerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nIntroduction\nDespite the undeniable role of glial cells in Alzheimer's disease, the involvement of oligodendrocytes (OL) has remained relatively in a grey area. Like other glial cells, OL contribute to immunomodulation and the restoration of homeostasis during neuroinflammation (Theophanous et al.\n2024\n). However, their most essential function lies in the production and maintenance of the myelin sheath, which insulates axons to enable rapid and efficient electrical signal transduction (Neely et al.\n2022\n; Chen et al.\n2022\n). The process of myelination continues throughout life and facilitated not only by mature oligodendrocytes but also by oligodendrocyte precursor cells (OPC), which proliferate and differentiate into functional oligodendrocytes (Maitre et al.\n2023\n). Emerging evidence has confirmed that myelin breakdown and disruptions at various stages of oligodendrogenesis are significant contributors to the development and progression of AD. Patterns of impaired myelin formation correlate with the expansion of Aβ and NFT during neurodegeneration (Braak and Braak\n1996\n). Furthermore, demyelination appears to precede the onset of Alzheimer's disease symptoms, positioning this process as a potential early marker of neurodegeneration (Desai et al.\n2010\n,\n2009\n; Stokin et al.\n1979\n; Couttas et al.\n2016\n).\nThis review presents the latest insights into amyloid-β and tau protein-induced disturbances in oligodendrocyte precursor cells, oligodendrocytes, and myelin. It emphasizes the critical role of proper oligodendrogenesis and the profound implications of myelin breakdown in the context of Alzheimer's disease. Additionally, it sheds light on the involvement of oligodendrocytes in neuroinflammation and the role of recently distinguished disease-associated oligodendrocytes (DAO), underscoring their significance in the pathophysiology of AD.", "doc_items_refs": ["#/texts/108", "#/texts/109", "#/texts/110", "#/texts/111", "#/texts/112", "#/texts/113", "#/texts/114", "#/texts/115", "#/texts/116", "#/texts/117", "#/texts/118", "#/texts/119", "#/texts/120", "#/texts/121", "#/texts/122", "#/texts/123", "#/texts/124", "#/texts/125", "#/texts/126", "#/texts/127"], "page_nos": [], "uuid": "1686b589-e248-462c-8795-6db293bd954d"}
{"doc_id": "2025__Emerging_Role_of_Oligodendrocytes_Malfunction_in_the_Progression_of_Alzheimers_D__W4413865689", "source_path": "<redacted:source_path>", "chunk_id": 7, "source_chunk_idxs": [12], "num_tokens": 388, "text": "Emerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nOligodendrocyte Progenitor Cells (OPC) in Alzheimer's Disease\nOligodendrocytes represent 45-75% of all glial cells, making them one of the most abundant glial cell type in the central nervous system (Han et al.\n2022\n; Bartheld et al.\n2016\n), originate from oligodendrocyte progenitor cells in oligodendrogenesis. This process occurs during both early postnatal development and adulthood. The production rate of oligodendrocytes declines with age, yet OPC remain abundant throughout adulthood, retaining the capacity for active proliferation and differentiation into mature oligodendrocytes within the CNS. In response to environmental or physiological demands, OPC, also referred to as N2 glia (NG2) or O2A cells (Nishiyama et al.\n2009\n; Galichet et al.\n2021\n; Duncan et al.\n2018\n), differentiate into OL. This process is intricately regulated by a network of molecular factors, signaling pathways (Tiane et al.\n2019\n; Sock and Wegner\n2019\n), and complex transcriptional and epigenetic mechanisms (Tiane et al.\n2019\n). These processes are essential not only for proper myelination but also for the dynamic remyelination necessary to maintain CNS function and repair (Akay et al.\n2021\n). OPC play a pivotal role in a multitude of physiological processes, including autophagy, phagocytosis, and signal transduction via interactions with various cell types within the CNS. Their contribution to the maintenance and repair of the BBB highlights their multifaceted involvement in homeostasis and neuroprotection (Akay et al.\n2021\n; Zou et al.\n2023\n; Skaper\n2019\n).", "doc_items_refs": ["#/texts/129", "#/texts/130", "#/texts/131", "#/texts/132", "#/texts/133", "#/texts/134", "#/texts/135", "#/texts/136", "#/texts/137", "#/texts/138", "#/texts/139", "#/texts/140", "#/texts/141", "#/texts/142", "#/texts/143", "#/texts/144", "#/texts/145", "#/texts/146", "#/texts/147", "#/texts/148", "#/texts/149", "#/texts/150", "#/texts/151", "#/texts/152", "#/texts/153"], "page_nos": [], "uuid": "43af3fb7-62d1-4e12-82da-11ee6ea0c0ee"}
{"doc_id": "2025__Emerging_Role_of_Oligodendrocytes_Malfunction_in_the_Progression_of_Alzheimers_D__W4413865689", "source_path": "<redacted:source_path>", "chunk_id": 8, "source_chunk_idxs": [13], "num_tokens": 442, "text": "Emerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nOligodendrocyte Progenitor Cells (OPC) in Alzheimer's Disease\nWhile OPC are primarily involved in maintaining the oligodendrocyte pool, a growing body of evidence indicates their involvement in the age-related changes and pathophysiology of Alzheimer's disease. In the Aβ plaques environment, the production and accumulation of aggregates induces senescence in oligodendrocyte progenitor cells. This senescence shifts OPC towards proinflammatory phenotype, impairing their ability to differentiate and mature, thereby further exacerbating neurodegenerative processes (Zhang et al.\n2019\n). Transcriptomic research on adult OPC has revealed age-dependent alterations associated with remyelination failure, including a reduced expression of proteins critical for maintaining stem cell functions (e.g.,\nSOX2, SOX9, CDK1, CDK2 CHD7\nand\nARID1\n) and an upregulation of markers indicative of terminal differentiation states (e.g.,\nPLP, MBP, MOBP, MOG, CLDN11, SNCA, APOE\n, and\nPADI2\n). Disruptions in cholesterol homeostasis have also been observed, with a decline in the expression of genes related to biosynthesis and phagocytosis. This results in a diminished capacity of adult OPC to clear and recycle cholesterol, ultimately contributing to decreased cholesterol availability in the brain (Fuente et al.\n2020\n). Disturbed cholesterol biosynthesis and lipid metabolism are well-known AD hallmarks, and transcriptomic changes in adult OPC and the human hippocampus from AD patients overlap. Moreover, studies confirmed reduced gene expression of essential factors in cholesterol biosynthesis (e.g.,\nDHCR24, HMGCR, HMGCS, ACAT2, IDI1,\nand\nMVD\n) (Fuente et al.\n2020\n; Varma et al.\n2021\n).", "doc_items_refs": ["#/texts/154", "#/texts/155", "#/texts/156", "#/texts/157", "#/texts/158", "#/texts/159", "#/texts/160", "#/texts/161", "#/texts/162", "#/texts/163", "#/texts/164", "#/texts/165", "#/texts/166", "#/texts/167", "#/texts/168", "#/texts/169", "#/texts/170", "#/texts/171", "#/texts/172", "#/texts/173", "#/texts/174"], "page_nos": [], "uuid": "f4376f18-d1d4-4913-9ae1-c2a8f9b91eb6"}
{"doc_id": "2025__Emerging_Role_of_Oligodendrocytes_Malfunction_in_the_Progression_of_Alzheimers_D__W4413865689", "source_path": "<redacted:source_path>", "chunk_id": 9, "source_chunk_idxs": [14], "num_tokens": 365, "text": "Emerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nOligodendrocyte Progenitor Cells (OPC) in Alzheimer's Disease\nThe animal models of AD have provided evidence of oligodendrocyte progenitor cell decline in density, and the following myelin integrity impairment in the hippocampus associated with age (Table\n1\n). Progressive changes in 3xTg AD mice were primarily observed in 6-month-old animals as morphological atrophy, which intensified over time, leading to OPC hypertrophy surrounded by Aβ plaques (Vanzulli et al.\n2020\n). Comparable disturbances in OPC have been documented in the APP/PS1 mouse model, with the earliest decline in progenitor cells number detected in 9-month-old animals. As the pathology advances, 14-month-old mice OPC exhibit pronounced morphological alterations, including cellular shrinkage, increased branching, and signs of dystrophy (Chacon-De-La-Rocha et al.\n2020\n). These findings demonstrate that while OPC degeneration and morphological disruption are characteristic markers of aging, AD appears to significantly accelerate the onset and progression of these pathological processes.\nOPC have emerged as pivotal players in the clearance of Aβ, with their dysfunction has been linked to disruptions caused by Aβ accumulation. NG2 glial cells have been identified as novel contributors to Aβ clearance through mechanisms such as autophagy and endocytosis. While the role of OPC in Aβ clearance is often considered less significant compared to microglial activity, research underscores that impairments in autophagic processes within these progenitor cells substantially contribute to the progression of AD (Li et al.\n2013\n).", "doc_items_refs": ["#/texts/175", "#/texts/176", "#/texts/177", "#/texts/178", "#/texts/179", "#/texts/180", "#/texts/181", "#/texts/182", "#/texts/183", "#/texts/184"], "page_nos": [], "uuid": "191bf63f-26de-419f-96d0-46f7dd945486"}
{"doc_id": "2025__Emerging_Role_of_Oligodendrocytes_Malfunction_in_the_Progression_of_Alzheimers_D__W4413865689", "source_path": "<redacted:source_path>", "chunk_id": 10, "source_chunk_idxs": [15], "num_tokens": 368, "text": "Emerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nOligodendrocyte Progenitor Cells (OPC) in Alzheimer's Disease\nAt the same time, a correlation between OPC presence and Aβ levels in cerebrospinal fluid (CSF) from AD patients has been proposed as a critical factor in disease pathogenesis, highlighting the nuanced and multifaceted role of OPC in neurodegenerative processes (Nielsen et al.\n2013\n). The clearance of Aβ and cellular debris by oligodendrocyte precursor cells leads to an upregulation of clusterin production (Beiter et al.\n2024\n), which could contribute to the worsening of AD pathology due to its role in mediating regulation of Aβ-induced neurotoxicity (Foster et al.\n2019\n). OPC from adult brain have also been identified as a cell type secreting Aβ\n1-42\n, which is likely released in vivo in association with defective oligodendrocyte differentiation. According to recent data, this pathology may play a crucial role in the initiation and progression of sporadic AD (Nihonmatsu-Kikuchi et al.\n2021\n). The restoration of the myelinating oligodendrocyte pool is also linked to morphological changes in OPC that occur in the presence of Aβ plaques. In this context, OPC transition into senescent, proinflammatory cells that are unable to differentiate into mature oligodendrocytes. This conversion is regarded as a pivotal determinant of AD progression, as the ablation of senescent OPC in the APP/PS1 mouse model has been shown to significantly improve memory impairment (Zhang et al.\n2019\n).", "doc_items_refs": ["#/texts/185", "#/texts/186", "#/texts/187", "#/texts/188", "#/texts/189", "#/texts/190", "#/texts/191", "#/texts/192", "#/texts/193", "#/texts/194", "#/texts/195", "#/texts/196", "#/texts/197"], "page_nos": [], "uuid": "e4e05561-275c-4387-9e67-c12ba2d01bba"}
{"doc_id": "2025__Emerging_Role_of_Oligodendrocytes_Malfunction_in_the_Progression_of_Alzheimers_D__W4413865689", "source_path": "<redacted:source_path>", "chunk_id": 11, "source_chunk_idxs": [16], "num_tokens": 288, "text": "Emerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nOligodendrocyte Progenitor Cells (OPC) in Alzheimer's Disease\nIt is essential that future studies involving OPC and oligodendrocytes in Alzheimer's disease explicitly consider sex as a biological variable, given the pronounced differences in transcriptional profiles, functional responses, morphology, and physiology between male and female cells. Single-cell RNA sequencing of\npost-mortem\nprefrontal cortex from AD patients has revealed that female-derived OL and OPC exhibit a dampened gene expression response to pathology, which may underlie their greater vulnerability to white matter damage and cognitive decline (Kato\n2025\n). In contrast, male OL show transcriptional activation correlated with pathological burden. Additionally, AD-associated oligodendroglial subpopulations are more abundant in females, while non-pathological populations are predominantly male. Beyond molecular differences, growing morphological evidence suggests that OL represent a heterogeneous population with distinct functional roles, such as varying preferences for axonal targets or differential sensitivity to myelination signals (Kamen et al.\n2022\n; Osanai et al.\n2022\n; Bechler et al.\n2015\n). Recognizing the sex-specific diversity of these cells is essential to effectively target precision therapies for neurodegenerative diseases based on the sex of AD patients.", "doc_items_refs": ["#/texts/198", "#/texts/199", "#/texts/200", "#/texts/201", "#/texts/202", "#/texts/203", "#/texts/204", "#/texts/205", "#/texts/206", "#/texts/207", "#/texts/208"], "page_nos": [], "uuid": "772f334b-3d01-4a4a-9149-f0dd310a0d6c"}
{"doc_id": "2025__Emerging_Role_of_Oligodendrocytes_Malfunction_in_the_Progression_of_Alzheimers_D__W4413865689", "source_path": "<redacted:source_path>", "chunk_id": 12, "source_chunk_idxs": [17], "num_tokens": 392, "text": "Emerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nThe Interplay Between Amyloid β and Oligodendrocytes\nGenerally, the majority of evidence emphasizes neurons as the primary contributors to Aβ production and distribution, thereby providing a central role in plaque formation associated with AD (Hampel et al.\n2021\n; Murphy and LeVine\n2010\n; Sadigh-Eteghad et al.\n2015\n). However, recent research has slightly shifted its focus towards understanding the role of oligodendrocytes in this pathological process. The role of oligodendrocytes is currently considered complementary in Aβ plaque formation, even though the expression levels of amyloidogenic β-secretase 1 (\nBACE1\n) and amyloid precursor protein (\nAPP\n) genes is comparable to those in neurons. Specific deletion of the\nBace1\ngene in mice reduced oligodendrocyte-derived harmful plaque formation by 30%. Thus, oligodendrocytes have the capacity to generate sufficient Aβ to contribute to plaque accumulation (Sasmita et al.\n2023\n,\n2024\n). A similar observation has been identified in AD mice lacking the oligodendrocyte-specific\nBace1\ngene. These animals have shown a significantly diminished level of amyloid plaques in the hippocampus and cortex, with a reduction of insoluble Aβ\n1-40\nand Aβ\n1-42\npeptides (Ishii et al.\n2024\n). Selectively suppressing oligodendrocyte-derived Aβ production in AD animals prevents the worsening of neuroinflammation and cellular signaling disruptions that lead to neuronal hyperactivity, suggesting that the role of OL-derived Aβ in Alzheimer's disease pathology is more likely focused on promoting neuronal pathological processes rather than generating Aβ plaques (Rajani et al.\n2024\n).", "doc_items_refs": ["#/texts/210", "#/texts/211", "#/texts/212", "#/texts/213", "#/texts/214", "#/texts/215", "#/texts/216", "#/texts/217", "#/texts/218", "#/texts/219", "#/texts/220", "#/texts/221", "#/texts/222", "#/texts/223", "#/texts/224", "#/texts/225", "#/texts/226", "#/texts/227", "#/texts/228", "#/texts/229", "#/texts/230", "#/texts/231", "#/texts/232", "#/texts/233", "#/texts/234", "#/texts/235", "#/texts/236"], "page_nos": [], "uuid": "37c14f67-f2df-4328-8773-eaff94ae18a8"}
{"doc_id": "2025__Emerging_Role_of_Oligodendrocytes_Malfunction_in_the_Progression_of_Alzheimers_D__W4413865689", "source_path": "<redacted:source_path>", "chunk_id": 13, "source_chunk_idxs": [18], "num_tokens": 183, "text": "Emerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nThe Interplay Between Amyloid β and Oligodendrocytes\nOn the other hand, BACE1, the only known β-secretase capable of initiating the production of Aβ peptides, is crucial for the proper development of oligodendrocytes. Neuronal\nBace1\ndeletion impairs the maturation of oligodendrocyte progenitor cells into myelinating oligodendrocytes, contributing to deficits in oligodendrocyte abundance and their capacity for axonal myelination (Hu et al.\n2008\n; Benoit et al.\n2023\n). These findings underline the need for caution in establishing therapeutic approaches for Alzheimer's disease mitigation due to the importance of BACE1 in oligodendrocyte development and function.", "doc_items_refs": ["#/texts/237", "#/texts/238", "#/texts/239", "#/texts/240", "#/texts/241", "#/texts/242", "#/texts/243"], "page_nos": [], "uuid": "a94c4579-ab28-46be-97fa-f35728809554"}
{"doc_id": "2025__Emerging_Role_of_Oligodendrocytes_Malfunction_in_the_Progression_of_Alzheimers_D__W4413865689", "source_path": "<redacted:source_path>", "chunk_id": 14, "source_chunk_idxs": [19], "num_tokens": 419, "text": "Emerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nThe Interplay Between Amyloid β and Oligodendrocytes\nThe ambivalence of oligodendrocytes and proteins related to myelination has been confirmed by numerous studies concerned with the interactions of Aβ and leucine-rich repeat and immunoglobulin-like domain-containing protein 1 (LINGO-1) (Fig.\n1\n). This transmembrane protein, highly expressed in neurons and oligodendrocyte progenitor cells, plays a prominent role in the inhibition of oligodendrocyte differentiation and myelination in the CNS (Mi et al.\n2005\n; Shao et al.\n2017\n). As part of a receptor complex that signals to inhibit myelination, axonal regeneration, and synaptic plasticity, LINGO-1 binds to Nogo receptor (NgR) and p75 neurotrophin factor (p75\nNTR\n) (Mi et al.\n2004\n,\n2008\n; Zhou et al.\n2012\n). Immunohistochemical and biochemical analyses performed using two AD mice models confirmed that administration of anti-LINGO-1 antibodies decreased Aβ plaque deposition, enhanced OL maturation in the hippocampus, and improved myelin integrity in memory-associated brain regions, perceived in behavioral studies as partial restoration of spatial memory (Wu et al.\n2018\n; Yang et al.\n2022\n). LINGO-1 appears to facilitate Aβ generation by enhancing β-secretase cleavage of APP.(Fernandez-Enright and Andrews\n2016\n) Diminished LINGO-1 expression had a positive impact on remyelination, the ultrastructure of myelinated axons, and elevated levels of myelin basic protein (MBP) (Wu et al.\n2018\n), which is established as an inhibitor of Aβ\n1-42\nfibril formation by preventing the adoption of β-sheet structures (Hoos et al.\n2009\n).\nFig. 1", "doc_items_refs": ["#/texts/244", "#/texts/245", "#/texts/246", "#/texts/247", "#/texts/248", "#/texts/249", "#/texts/250", "#/texts/251", "#/texts/252", "#/texts/253", "#/texts/254", "#/texts/255", "#/texts/256", "#/texts/257", "#/texts/258", "#/texts/259", "#/texts/260", "#/texts/261", "#/texts/262", "#/texts/263", "#/texts/264", "#/texts/265", "#/texts/266", "#/texts/267", "#/texts/268", "#/texts/269", "#/texts/270", "#/texts/271"], "page_nos": [], "uuid": "3e93c6e4-c4a9-4c15-9096-84b4586375cc"}
{"doc_id": "2025__Emerging_Role_of_Oligodendrocytes_Malfunction_in_the_Progression_of_Alzheimers_D__W4413865689", "source_path": "<redacted:source_path>", "chunk_id": 15, "source_chunk_idxs": [20], "num_tokens": 209, "text": "Emerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nThe Interplay Between Amyloid β and Oligodendrocytes\nOn the contrary, LINGO-1 promotes, in a dose-dependent manner, the lysosomal degradation of APP, diverting it from the pathway that produces Aβ (Fernandez-Enright and Andrews\n2016\n; Laat et al.\n2015\n). Nevertheless, NgR also emphasizes its negative influence as part of the receptor complex on Aβ clearance. In APP/PS1 models, the overexpression of Nogo-A and NgR was observed to be age-dependent, contributing to synaptic dysfunction and neurodegeneration through the activation of the RhoA/ROCK signaling pathway (Guo et al.\n2020\n). Elevated levels of NgR have been shown to impair the adhesion, migration, and phagocytic activity of microglial cells, thereby reducing their efficiency in clearing Aβ (Wang et al.\n2021\n).", "doc_items_refs": ["#/texts/272", "#/texts/273", "#/texts/274", "#/texts/275", "#/texts/276", "#/texts/277", "#/texts/278", "#/texts/279", "#/texts/280"], "page_nos": [], "uuid": "c35ee95b-6c48-4935-a6b7-b8f77aa5473c"}
{"doc_id": "2025__Emerging_Role_of_Oligodendrocytes_Malfunction_in_the_Progression_of_Alzheimers_D__W4413865689", "source_path": "<redacted:source_path>", "chunk_id": 16, "source_chunk_idxs": [21], "num_tokens": 345, "text": "Emerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nMyelin Impairment in Alzheimer's Disease\nThe myelin sheath is a multi-layered, lipid-rich structure formed by the plasma membrane of mature oligodendrocytes. Wrapping the axons of nerve cells, the myelin sheath facilitates the rapid conduction of saltatory nerve impulses, thereby enhancing both the speed and efficiency of information transfer within the nervous system. Furthermore, proper development and maintenance of the myelin sheath is fundamental for axons protection, as they prevent ion leakage that could possibly disrupt the electrical potential essential for neuronal communication (Kondiles and Horner\n2018\n; Stadelmann et al.\n2019\n; Simons et al.\n2024\n).\nAlzheimer's disease is commonly associated with grey matter disruption, however, a growing body of evidence from both animal models and AD patients reveals that white matter (WM) damage and consequently, a reduction in the myelin sheath are also correlated with neurodegeneration and cognitive dysfunctions (Filley\n2021\n; Nasrabady et al.\n2018\n). A clinically feasible modality to monitor demyelination and remyelination, called q-space myelin map MRI imaging, has shown that AD patients suffer reduced myelin density in, inter alia, the hippocampus, insula, and precuneus (Li et al.\n2024\n). Patients with AD and dementia, with elevated levels of Aβ\n1-42\nin the CSF, exhibit an increase in white matter hyperintensity volume, which contributes to the deterioration of cognitive function (Li et al.\n2024\n).", "doc_items_refs": ["#/texts/282", "#/texts/283", "#/texts/284", "#/texts/285", "#/texts/286", "#/texts/287", "#/texts/288", "#/texts/289", "#/texts/290", "#/texts/291", "#/texts/292", "#/texts/293", "#/texts/294", "#/texts/295", "#/texts/296", "#/texts/297", "#/texts/298", "#/texts/299"], "page_nos": [], "uuid": "0ccdd8e5-cfbf-46a1-8571-ac7f72176d3a"}
{"doc_id": "2025__Emerging_Role_of_Oligodendrocytes_Malfunction_in_the_Progression_of_Alzheimers_D__W4413865689", "source_path": "<redacted:source_path>", "chunk_id": 17, "source_chunk_idxs": [22], "num_tokens": 431, "text": "Emerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nMyelin Impairment in Alzheimer's Disease\nDesai\net al\n.\nhave conducted extensive research using 3xTg AD mice, showing various pathologies in the myelin sheath and oligodendrocytes (Table\n1\n). Abnormalities in 2-month-old 3xTg AD mice's myelin sheath mostly manifested as disruptions in integrity, such as splitting of the major dense line and the accumulation of dense bodies in the Schaffer collateral pathway of the hippocampus (Desai et al.\n2009\n). Importantly, the reduction in the CA1 hippocampus region and entorhinal cortex, as well as the decline in the function of oligodendrocytes, which were more prone to apoptosis, occurred prior to Aβ plaques, even though OL degeneration was driven by soluble Aβ oligomers (Desai et al.\n2010\n,\n2011\n). By 2 months of age, APP/PS1 mice exhibited a thicker myelin sheath and a shorter internodal distance compared to wild-type mice (Wu et al.\n2017b\n). By 12 months, they also displayed a regionally restricted decline in oligodendrocyte density, specifically in the CA3 and CA4 regions of the hippocampus (DeFlitch et al.\n2022\n). Myelin abnormalities were evident even at earlier stages in 5xTg AD mice. At 1 month of age, transgenic mice exhibited a thinner myelin sheath, accompanied by splitting of the myelin layers and occasional ballooning, where the sheath became swollen (Gu et al.\n2018\n). Moreover, an increase in abnormally myelinated axons was observed (Wu et al.\n2017b\n). During the course of aging, myelin breakdown and OPC decline became apparent, with progressive deterioration in the hippocampus, particularly the dentate gyrus. By 12 months of age, this deterioration expanded to encompass all regions of the hippocampus (Zota et al.\n2024\n).", "doc_items_refs": ["#/texts/300", "#/texts/301", "#/texts/302", "#/texts/303", "#/texts/304", "#/texts/305", "#/texts/306", "#/texts/307", "#/texts/308", "#/texts/309", "#/texts/310", "#/texts/311", "#/texts/312", "#/texts/313", "#/texts/314", "#/texts/315", "#/texts/316", "#/texts/317", "#/texts/318", "#/texts/319", "#/texts/320", "#/texts/321"], "page_nos": [], "uuid": "be2aab77-36c0-4b4d-8f62-937d2c6df9d1"}
{"doc_id": "2025__Emerging_Role_of_Oligodendrocytes_Malfunction_in_the_Progression_of_Alzheimers_D__W4413865689", "source_path": "<redacted:source_path>", "chunk_id": 18, "source_chunk_idxs": [23], "num_tokens": 429, "text": "Emerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nMyelin Impairment in Alzheimer's Disease\nProminent alterations observed in animal models of Alzheimer's disease extend beyond myelin sheath pathology, encompassing dysregulation of proteins critical for the development and maintenance of myelin integrity. Myelin basic protein, the second most abundant protein in the CNS (Huang et al.\n2024\n; Müller et al.\n2013\n; Bauer et al.\n2012\n), plays a crucial role in myelin sheath formation and maintenance, as it drives the assembly of myelin membranes through phase transitions mediated by hydrophobic interactions. MBP also establishes a barrier within the myelin sheath, expelling most soluble and membrane proteins to maintain the membrane's structural integrity (Aggarwal et al.\n2013\n). Furthermore, MBP has been identified as a potential inhibitor of Aβ fibrils since it strongly binds fibrillogenic Aβ forms (Hoos et al.\n2009\n,\n2007\n). A study by\nTiwari\net al\n.\nrevealed interactions between myelin-like membranes and Aβ\n1-40\n(Tiwari et al.\n2023\n). Amyloid peptide binds to the membrane, destabilizes its structure promoting Aβ aggregation. Among various lipid compositions tested, L-α-phosphatidylinositol-4,5-bisphosphate (PIP2) was found to strongly facilitate Aβ fibrillation during the early phase of aggregation (Tiwari et al.\n2023\n). Importantly, PIP2 is a critical factor for MBP attachment to the plasma membrane in oligodendrocytes. However, elevated levels of PIP2 can induce excessive Ca\n2+\nrelease, which destabilizes interactions with MBP and promotes demyelination (Nawaz et al.\n2009\n; Kumashiro et al.\n2021\n). Given this information, it can be presumed that MBP's capacity to inhibit Aβ fibrillation depends on maintaining an equilibrium between PIP2 and MBP to preserve the structural integrity of the myelin membrane.", "doc_items_refs": ["#/texts/322", "#/texts/323", "#/texts/324", "#/texts/325", "#/texts/326", "#/texts/327", "#/texts/328", "#/texts/329", "#/texts/330", "#/texts/331", "#/texts/332", "#/texts/333", "#/texts/334", "#/texts/335", "#/texts/336", "#/texts/337", "#/texts/338", "#/texts/339", "#/texts/340", "#/texts/341", "#/texts/342", "#/texts/343", "#/texts/344", "#/texts/345", "#/texts/346", "#/texts/347", "#/texts/348", "#/texts/349", "#/texts/350"], "page_nos": [], "uuid": "a1b7f16e-a9ba-47e8-bc4f-5e33962ebdac"}
{"doc_id": "2025__Emerging_Role_of_Oligodendrocytes_Malfunction_in_the_Progression_of_Alzheimers_D__W4413865689", "source_path": "<redacted:source_path>", "chunk_id": 19, "source_chunk_idxs": [24], "num_tokens": 425, "text": "Emerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nMyelin Impairment in Alzheimer's Disease\nOn the contrary, a study with 5xFAD MBP\n−/−\nmice has shown reduced insoluble Aβ and amyloid plaque deposition despite the lack of MBP (Ou-Yang and Nostrand\n2013\n). Nevertheless, the study demonstrated that the absence of MBP led to increased expression of matrix metalloproteinase-9 (MMP-9), capable of degrading both soluble and fibrillar Aβ. This triggered glial activation and increased Aβ-degrading enzymes, reducing plaque deposition but potentially accelerating neurodegeneration through neuroinflammation (Ou-Yang and Nostrand\n2013\n). Significant alterations in the levels and function of myelin basic protein have also been observed in other animal models of Alzheimer's disease. In the 5xFAD AD model, the first signs of MBP decline were found in 1-month-old animals (Wu et al.\n2017b\n). These results were confirmed in the APP/PS1 model, where by the age of 3 months, animals began to manifest pathologies in the mRNA expression level of the\nMbp\ngene (Dong et al.\n2018\n). The worsening of this process was found in MBP hippocampus density in 9- and 14-month-old mice (Chacon-De-La-Rocha et al.\n2020\n).\nAlthough animal models of Alzheimer's disease consistently demonstrate disturbances in the myelin sheath, the observed specific changes vary between models. Nevertheless, the presented abnormalities began to occur at an early stage of life, prior to cognitive impairment or even the classical hallmarks of AD. The loss of myelin due to oligodendrocyte death is significant, particularly as the myelin sheath generated during remyelination tends to be thinner and shorter compared to the myelin produced during development (Shiryaev et al.\n2009\n; Franklin and Ffrench-Constant\n2008\n).", "doc_items_refs": ["#/texts/351", "#/texts/352", "#/texts/353", "#/texts/354", "#/texts/355", "#/texts/356", "#/texts/357", "#/texts/358", "#/texts/359", "#/texts/360", "#/texts/361", "#/texts/362", "#/texts/363", "#/texts/364", "#/texts/365", "#/texts/366", "#/texts/367", "#/texts/368", "#/texts/369", "#/texts/370"], "page_nos": [], "uuid": "3396badf-3171-4155-ada1-125621850614"}
{"doc_id": "2025__Emerging_Role_of_Oligodendrocytes_Malfunction_in_the_Progression_of_Alzheimers_D__W4413865689", "source_path": "<redacted:source_path>", "chunk_id": 20, "source_chunk_idxs": [25], "num_tokens": 264, "text": "Emerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nMyelin Impairment in Alzheimer's Disease\nSince preventing myelin loss remains unfeasible at present, improving the process of myelination is proposed as a potentially more advantageous strategy to improve cognitive outcomes (Wang et al.\n2018\n). Genetically and pharmacologically enhancing myelin renewal could potentially improve performance in memory-related tasks. For instance, conditional deletion of the muscarinic M1 receptor (M1R) in OPC changed the density of newly formed myelin sheaths and enlarged the potential for repair. Improved myelin repair in these mice displayed significant improvement in the Morris water maze and novel object recognition (NOR) tasks (Chen et al.\n2021\n). However, myelin renewal within the surroundings of Aβ deposits seems to decline compared to areas lacking deposits, possibly due to inhibitory cues from senescent OPC induced by Aβ deposits (Zhang et al.\n2019\n).\nThis unforeseen issue alters the perspective on future research, suggesting the necessity to investigate not only myelin sheath changes in Alzheimer's disease but also the underlying correlation between the hallmarks of AD, oligodendrocyte precursor cells, and mature oligodendrocytes.", "doc_items_refs": ["#/texts/371", "#/texts/372", "#/texts/373", "#/texts/374", "#/texts/375", "#/texts/376", "#/texts/377", "#/texts/378"], "page_nos": [], "uuid": "c463663f-fbc4-4830-a1b0-ac01ef06e8c4"}
{"doc_id": "2025__Emerging_Role_of_Oligodendrocytes_Malfunction_in_the_Progression_of_Alzheimers_D__W4413865689", "source_path": "<redacted:source_path>", "chunk_id": 21, "source_chunk_idxs": [26], "num_tokens": 349, "text": "Emerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nAPOE4 and Cholesterol Disturbances\nAPOE4\n, known as the second strongest risk factor for late-onset Alzheimer's disease (LOAD) after old age, is one of the three variants of the apolipoprotein E gene. Generally, ApoE protein functions as a major lipid and cholesterol transporter. However, the presence of the\nApoE4\nallele alters and impairs this function.\nAPOE4\nis associated with reduced lipid-carrying capacity, leading to poorer cholesterol metabolism and, consequently, cholesterol accumulation in the brain (Feringa and Kant\n2021\n). It has long been known that disturbances in cholesterol metabolism affect microglia and astrocytes.\nHowever, recent findings show that these disturbances also significantly impair oligodendrocyte function, leading to poor myelin maintenance and repair, which further contributes to neurodegeneration and cognitive decline in AD (Sharp et al.\n2023\n). The impairment of the ApoE protein impacts oligodendrocyte and myelin function on multiple levels. In 5xFAD mice, the accumulation of apolipoprotein E within amyloid plaques coincided with the depletion of sulfatides in both white and grey matter (Kaya et al.\n2020\n). Sulfatides, which are predominantly expressed in oligodendrocytes, are key lipids of the myelin sheath (Hirahara et al.\n2017\n), where their abundance has been shown to correlate with the amount of myelin present in the rat brain (Norton and Poduslo\n1973\n).", "doc_items_refs": ["#/texts/380", "#/texts/381", "#/texts/382", "#/texts/383", "#/texts/384", "#/texts/385", "#/texts/386", "#/texts/387", "#/texts/388", "#/texts/389", "#/texts/390", "#/texts/391", "#/texts/392", "#/texts/393", "#/texts/394", "#/texts/395", "#/texts/396"], "page_nos": [], "uuid": "2ae79c83-7825-414c-b892-672453a71347"}
{"doc_id": "2025__Emerging_Role_of_Oligodendrocytes_Malfunction_in_the_Progression_of_Alzheimers_D__W4413865689", "source_path": "<redacted:source_path>", "chunk_id": 22, "source_chunk_idxs": [27], "num_tokens": 298, "text": "Emerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nAPOE4 and Cholesterol Disturbances\nAPOE4\ncarriers appear to have even more dysregulated cholesterol homeostasis.\nBlanchard et. al\nhave revealed that these abnormalities occur in biosynthesis, transport, and storage. Furthermore,\nAPOE4\npresence results in intracellular cholesterol accumulation in lipid droplets while decreasing cholesterol availability for myelin production. Also, in\npost-mortem\nhuman brains, reduced expression of myelin-associated genes and decreased myelinated axons was observed (Blanchard et al.\n2022\n).\nAPOE4\nimpacts not only cholesterol metabolism but also directly influences the myelination process by altering oligodendrocytes (Kingwell\n2023\n; Ahmed et al.\n2024\n). The\nApoE4\nknock-in mouse model has demonstrated a decline in oligodendrocyte density despite no significant changes in myelin protein expression, indicating that oligodendrocyte loss precedes detectable myelin degeneration (Cheng et al.\n2022\n). The detrimental effect on the density and number of myelinating oligodendrocytes is a multifaceted problem, as\nApoE4\ncarriers exhibit an accumulation of oligodendrocyte progenitor cells, indicating an underlying issue with the oligodendrogenesis (Mok et al.\n2023\n).", "doc_items_refs": ["#/texts/397", "#/texts/398", "#/texts/399", "#/texts/400", "#/texts/401", "#/texts/402", "#/texts/403", "#/texts/404", "#/texts/405", "#/texts/406", "#/texts/407", "#/texts/408", "#/texts/409", "#/texts/410", "#/texts/411", "#/texts/412", "#/texts/413", "#/texts/414", "#/texts/415", "#/texts/416", "#/texts/417", "#/texts/418", "#/texts/419", "#/texts/420"], "page_nos": [], "uuid": "7ab72629-fff7-4b70-9e21-2d2ffe5b5378"}
{"doc_id": "2025__Emerging_Role_of_Oligodendrocytes_Malfunction_in_the_Progression_of_Alzheimers_D__W4413865689", "source_path": "<redacted:source_path>", "chunk_id": 23, "source_chunk_idxs": [28], "num_tokens": 291, "text": "Emerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nAPOE4 and Cholesterol Disturbances\nImportantly, alterations in oligodendrocyte morphology and function are closely linked to their interactions with astrocytes, which represent the primary source of APOE.\nMok\net al\n.\nnot only demonstrated that the\nApoE4\nisoform disrupts oligodendrocyte function, but also elucidated that such impairments are directly associated with compromised lipid and cholesterol transport from astrocytes to oligodendrocytes (Mok et al.\n2023\n). APOE plays a crucial role in maintaining neuronal homeostasis, primarily through astrocyte-derived cholesterol, and is also essential for preserving the resting phenotype of microglia and supporting their neuroprotective functions. Conversely,\nApoE4\nundermines astrocytic support for neurons, manifesting in mitochondrial dysfunction and impaired lipid metabolism in neurons, as well as the upregulation of proinflammatory genes in microglia (Preman et al.\n2024\n; Li et al.\n2021\n; Qi et al.\n2021\n). Therefore, a comprehensive understanding of\nApoE4\n's pathological impact on oligodendrocytes necessitates further investigation into the dynamic interplay between oligodendrocytes and astrocytes under both physiological and pathological conditions.", "doc_items_refs": ["#/texts/421", "#/texts/422", "#/texts/423", "#/texts/424", "#/texts/425", "#/texts/426", "#/texts/427", "#/texts/428", "#/texts/429", "#/texts/430", "#/texts/431", "#/texts/432", "#/texts/433", "#/texts/434", "#/texts/435", "#/texts/436", "#/texts/437", "#/texts/438", "#/texts/439"], "page_nos": [], "uuid": "970628f8-5037-416c-a4d5-8bfff45e58c3"}
{"doc_id": "2025__Emerging_Role_of_Oligodendrocytes_Malfunction_in_the_Progression_of_Alzheimers_D__W4413865689", "source_path": "<redacted:source_path>", "chunk_id": 24, "source_chunk_idxs": [29], "num_tokens": 511, "text": "Emerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nAPOE4 and Cholesterol Disturbances\nIn neurodegenerative disorders including Alzheimer's disease, the exacerbation of tau-related pathology is driven by the presence of\nApoE4\nisoform, facilitating its hyperphosphorylation and aggregation. The tauopathy mouse model P301S carrying the\nApoE4\nisoform exhibits various pathological hallmarks, namely: a larger area covered by hyperphosphorylated tau in the hippocampus, brain atrophy, thinner granule cell layers in the dentate gyrus (DG), and thinner layers of pyramidal cells in the CA1 region of the hippocampus. Importantly, the presence of this features was attenuated in animals with\nApoE\nknockout, suggesting the significance of\nApoE4\nisoform worsening tau-related pathologies (Shi et al.\n2017\n). While tau has been extensively studied in neurons, its role in other cell types is still very limited. Nevertheless, it has been proven that extracellular tau is internalized by microglia both in vitro and in vivo, and this process may contribute to cellular dysfunction, supporting the concept that tau secretion serves as a protective mechanism to limit intracellular toxicity associated with its pathological accumulation (Bolós et al.\n2016\n). Moreover, in astrocytes tau accumulation, known as aging-related tau astrogliopathy (ARTAG), characterized by thorn-shaped astrocytes, may represent an early response to neuronal injury, barrier disruption, or mechanical stress, and in some cases may precede neuronal tau pathology in neurodegenerative diseases (Kovacs et al.\n2016\n; Kovacs\n2018\n). Recent study by\nTorii\net al\n.\nconfirmed the presence of tau expression in mature, myelinating oligodendrocytes, which appears even later than classical myelination markers, making tau a potential new hallmark of cell maturity (Torii et al.\n2023\n). Hence, tau role in initial myelin formation seems unlikely, however the fact that tau seeding was found in white matter points out alternative functions of tau in oligodendrocytes. It is speculated that tau in OL is involved in instrumental role in microtubule assembly, long-term maintenance and adaptive myelination (Torii et al.\n2023\n; Majumder and Dutta\n2024\n). Importantly,\nApoE4", "doc_items_refs": ["#/texts/440", "#/texts/441", "#/texts/442", "#/texts/443", "#/texts/444", "#/texts/445", "#/texts/446", "#/texts/447", "#/texts/448", "#/texts/449", "#/texts/450", "#/texts/451", "#/texts/452", "#/texts/453", "#/texts/454", "#/texts/455", "#/texts/456", "#/texts/457", "#/texts/458", "#/texts/459", "#/texts/460", "#/texts/461", "#/texts/462", "#/texts/463", "#/texts/464", "#/texts/465", "#/texts/466", "#/texts/467"], "page_nos": [], "uuid": "d5b650e8-7ea2-4acc-9416-f366acd106b4"}
{"doc_id": "2025__Emerging_Role_of_Oligodendrocytes_Malfunction_in_the_Progression_of_Alzheimers_D__W4413865689", "source_path": "<redacted:source_path>", "chunk_id": 25, "source_chunk_idxs": [30], "num_tokens": 222, "text": "Emerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nAPOE4 and Cholesterol Disturbances\nseems to at least partially influence faster tau accumulation and pathology mediated by myelin loss.\nApoE4\ncarriers in tauopathy mice model manifested impaired lipid metabolism in all glial cells, including oligodendrocytes. The presence of\nApoE4\nisoform influenced cholesterol metabolism and promoted lipid accumulation in these cells (Litvinchuk et al.\n2024\n). Reduced myelin fiber tracts were particularly vulnerable to tau accumulation, suggesting that areas with diminished myelin sheath density may be more susceptible to Alzheimer's disease (Rubinski et al.\n2024\n). Single-nucleus RNA sequencing revealed that removing\nApoE4\nreduced phospho-tau coverage area and tau propagation. The absence of\nApoE4\npositively impacted not only tauopathy but also OPC activity and oligodendrocyte density. However, the direct correlation between these two hallmarks requires further investigation (Koutsodendris et al.\n2023\n).", "doc_items_refs": ["#/texts/468", "#/texts/469", "#/texts/470", "#/texts/471", "#/texts/472", "#/texts/473", "#/texts/474", "#/texts/475", "#/texts/476", "#/texts/477", "#/texts/478", "#/texts/479", "#/texts/480", "#/texts/481", "#/texts/482"], "page_nos": [], "uuid": "72ca19d1-d00f-4cff-b912-4cee17ac2db3"}
{"doc_id": "2025__Emerging_Role_of_Oligodendrocytes_Malfunction_in_the_Progression_of_Alzheimers_D__W4413865689", "source_path": "<redacted:source_path>", "chunk_id": 26, "source_chunk_idxs": [31], "num_tokens": 474, "text": "Emerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nRole of Oligodendrocytes in Neuroinflammation\nMicroglia-Oligodendrocytes Interactions\nEmerging evidence highlights the expanding role of oligodendrocytes, as active participants in the immune dynamics of the CNS. Their reciprocal interactions with microglia, the resident brain immune cells, significantly influence neuroinflammatory processes. Such interactions exacerbate neuronal and myelin damage, thereby contributing to the progression of AD pathology (Rossi and Bovenkamp\n2024\n; Graham et al.\n2025\n).\nThe understanding of microglia-oligodendrocyte interactions remains limited; however, existing evidence underscores the critical role of microglia in promoting remyelination (Fig.\n2\n). Microglia actively facilitate the recruitment and differentiation of OPC into mature oligodendrocytes through the secretion of key factors such as transforming growth factor beta 1 (TGF-β1) and insulin-like growth factor 1 (IGF-1), which enhance the efficiency of remyelination (Baaklini et al.\n2023\n). Both factors are significant in OL's maturation, although at different stages of development. TGF-β1 is an important cell cycle regulator, and its signaling is crucial for oligodendrogenesis and postnatal myelination (Yu et al.\n2000\n; Palazuelos et al.\n2014\n). IGF-1, a neurotrophic factor responsible for Aβ clearance and mitigation of AD pathologies, is indispensable for early myelin development (Arjunan et al.\n2023\n). The lack of microglia-derived IGF-1 results in hypomyelination at the beginning of life and a thinner myelin sheath with ultrastructural deficits in adult life (Rusin et al.\n2024\n). Notably, microglial support is pivotal for myelination specifically during adulthood, playing a crucial role in post-developmental myelin growth. At this stage, microglia prevent hypomyelination and influence myelin integrity through the TGFβ1-TGFβR1 signaling axis (McNamara et al.\n2023\n).\nFig. 2", "doc_items_refs": ["#/texts/485", "#/texts/486", "#/texts/487", "#/texts/488", "#/texts/489", "#/texts/490", "#/texts/491", "#/texts/492", "#/texts/493", "#/texts/494", "#/texts/495", "#/texts/496", "#/texts/497", "#/texts/498", "#/texts/499", "#/texts/500", "#/texts/501", "#/texts/502", "#/texts/503", "#/texts/504", "#/texts/505"], "page_nos": [], "uuid": "14792ff5-40dd-47ad-8dfc-8e9a4aa301a4"}
{"doc_id": "2025__Emerging_Role_of_Oligodendrocytes_Malfunction_in_the_Progression_of_Alzheimers_D__W4413865689", "source_path": "<redacted:source_path>", "chunk_id": 27, "source_chunk_idxs": [32], "num_tokens": 451, "text": "Emerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nRole of Oligodendrocytes in Neuroinflammation\nMicroglia-Oligodendrocytes Interactions\nDuring the demyelination process, microglia contribute significantly to clearing myelin debris, which supports tissue remodeling and promotes conditions favorable for remyelination (Traiffort et al.\n2020\n). This process, a defining feature of multiple sclerosis (MS), also observed in Alzheimer's disease, leads to the accumulation of significant amounts of myelin debris in the central nervous system, predominantly composed of myelin-associated glycoproteins (MAG), well-known inhibitors of remyelination (Chen et al.\n2023\n; McKerracher et al.\n1994\n). During the initial stages of the clearance process, microglia remove myelin debris through TREM2-mediated phagocytosis, thereby attempting to restore homeostasis (Traiffort et al.\n2020\n; Cignarella et al.\n2020\n). However, as demyelination progresses, peripheral immune cells infiltrate the CNS by crossing the BBB and attack the myelin sheath. This infiltration exacerbates inflammation, activating both microglia and astrocytes, and accelerates the accumulation of myelin debris (Gao et al.\n2024\n).\nThe accumulation of myelin debris directly impedes the proliferation and maturation of oligodendrocyte precursor cells into myelinating oligodendrocytes, leading to a failure in the remyelination process. This cascade of events perpetuates the cycle of neuroinflammation, demyelination, and impaired repair, further exacerbating CNS dysfunction (Prineas and Parratt\n2021\n). In this proinflammatory environment, activated microglia become increasingly focused on clearing myelin debris, a process that diminishes their protective response to Aβ plaques. This diversion of microglial activity compromises their ability to effectively corral and clear plaques, contributing to the pathogenesis of neurodegenerative diseases (Depp et al.\n2021\n).", "doc_items_refs": ["#/texts/506", "#/texts/507", "#/texts/508", "#/texts/509", "#/texts/510", "#/texts/511", "#/texts/512", "#/texts/513", "#/texts/514", "#/texts/515", "#/texts/516", "#/texts/517", "#/texts/518", "#/texts/519", "#/texts/520", "#/texts/521", "#/texts/522", "#/texts/523"], "page_nos": [], "uuid": "941ced5a-eaa8-4d0f-96a3-483472af8a9e"}
{"doc_id": "2025__Emerging_Role_of_Oligodendrocytes_Malfunction_in_the_Progression_of_Alzheimers_D__W4413865689", "source_path": "<redacted:source_path>", "chunk_id": 28, "source_chunk_idxs": [33], "num_tokens": 417, "text": "Emerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nRole of Oligodendrocytes in Neuroinflammation\nAstrocytes-Oligodendrocytes Interactions\nAstrocytes are significant contributors to brain homeostasis as parenchymal cells, performing essential functions such as maintaining ion homeostasis, supporting BBB integrity, promoting neurogenesis and synaptogenesis, and interacting with oligodendrocytes to influence myelin regeneration. They also contribute to OPC proliferation, the development of mature oligodendrocytes and the modulation of neuroinflammation (Hu et al.\n2023\n; Verkhratsky et al.\n2023\n). The complexity of these interactions significantly impacts the development and progression of Alzheimer's disease.\nAlthough astrocytes and oligodendrocytes originate from the same progenitor cells, they perform distinct functions once matured (Zuchero and Barres\n2013\n). Nevertheless, astrocytes undeniably influence OPC proliferation, survival, and differentiation into myelinating cells (Fig.\n2\n). Astrocytes release a range of trophic factors, including platelet-derived growth factor (PDGF), fibroblast growth factor 2 (FGF-2), IGF-1, and TGF-β, which are involved in the survival and development of OPCs into mature oligodendrocytes that are critical for efficient neuronal signal transmission (Rawji et al.\n2020\n). Furthermore, astrocytes provide lactate-derived from glucose via monocarboxylate transporters (MCT), essential for axonal integrity and sustaining the high metabolic demands associated with myelin synthesis. However, astrocytes can also adopt inhibitory roles in remyelination. Reactive astrocytes can form glial scars that impede OPC migration and differentiation. These scars are characterized by the deposition of extracellular matrix components, which act as physical and biochemical barriers to successful remyelination (Lau et al.\n2013\n).", "doc_items_refs": ["#/texts/525", "#/texts/526", "#/texts/527", "#/texts/528", "#/texts/529", "#/texts/530", "#/texts/531", "#/texts/532", "#/texts/533", "#/texts/534", "#/texts/535", "#/texts/536", "#/texts/537", "#/texts/538"], "page_nos": [], "uuid": "f576aa1a-7d33-4654-9a94-9a8553df683e"}
{"doc_id": "2025__Emerging_Role_of_Oligodendrocytes_Malfunction_in_the_Progression_of_Alzheimers_D__W4413865689", "source_path": "<redacted:source_path>", "chunk_id": 29, "source_chunk_idxs": [34], "num_tokens": 488, "text": "Emerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nRole of Oligodendrocytes in Neuroinflammation\nAstrocytes-Oligodendrocytes Interactions\nOne of the most prominent functions of astrocytes is maintaining BBB through tight junction stabilization, maintaining pH and ion homeostasis and preventing vascular permeability (Hu et al.\n2023\n; Abbott et al.\n2006\n). Oligodendrocyte precursor cells also contribute to vascular integrity by interacting with endothelial cells and pericytes. OPC secrete TGF-β, which enhances BBB function under physiological conditions. However, in pathological conditions, OPC dysfunction can exacerbate vascular permeability (Niu et al.\n2019\n; Seo et al.\n2014\n). Also, in response to injury, including AD, astrocytes contribute to glial scar formation, which is critical in restoring BBB integrity (Sousa\n2022\n). However, in demyelinating conditions, the glial scar also acts as a physical barrier that prevents OPC from accessing the demyelinated area and interacting with denuded neurons, thereby hindering remyelination (Wang et al.\n2011\n; Nair et al.\n2008\n; Silver and Miller\n2004\n; Fawcett and Asher\n1999\n).\nAlthough astrocytes and oligodendrocytes impact neuroinflammatory processes, their functions seem to differ. Astrocytes and OPC produce proinflammatory cytokines during neuroinflammation, including TNF-α and IL-1β, which can have dual effects on the BBB integrity - either supporting or impairing it (Bennett et al.\n2010\n). These cytokines can also either protect or inhibit remyelination (Rawji et al.\n2020\n). It should be emphasized that inflammatory action is initiated by microglia, which contribute to the activation of other glial cells (Singh\n2022\n). While these cytokines can initially support OPC activation, chronic inflammation can suppress oligodendrocyte maturation and myelin repair (Liddelow and Barres\n2017\n). Notably, excessive secretion of MMP-9 by OPC contributes to BBB breakdown, facilitating immune cell infiltration and worsening neurodegeneration (Seo et al.\n2014\n).", "doc_items_refs": ["#/texts/539", "#/texts/540", "#/texts/541", "#/texts/542", "#/texts/543", "#/texts/544", "#/texts/545", "#/texts/546", "#/texts/547", "#/texts/548", "#/texts/549", "#/texts/550", "#/texts/551", "#/texts/552", "#/texts/553", "#/texts/554", "#/texts/555", "#/texts/556", "#/texts/557", "#/texts/558", "#/texts/559", "#/texts/560", "#/texts/561", "#/texts/562", "#/texts/563", "#/texts/564", "#/texts/565", "#/texts/566", "#/texts/567", "#/texts/568"], "page_nos": [], "uuid": "6217f8dc-ad3d-4878-88fa-62586020e574"}
{"doc_id": "2025__Emerging_Role_of_Oligodendrocytes_Malfunction_in_the_Progression_of_Alzheimers_D__W4413865689", "source_path": "<redacted:source_path>", "chunk_id": 30, "source_chunk_idxs": [35], "num_tokens": 347, "text": "Emerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nRole of Oligodendrocytes in Neuroinflammation\nAstrocytes-Oligodendrocytes Interactions\nA study by\nSadick\net al. shows shared transcriptional changes between astrocytes and oligodendrocytes in Alzheimer's Disease. The authors highlight overlapping responses of these cells in AD-related neuroinflammation, especially regarding NF-κB signaling, interleukin-related inflammatory responses, oxidative stress pathways, and the downregulation of synaptic maintenance genes and genes involved in structural integrity, potentially contributing to widespread neurodegeneration (Sadick et al.\n2022\n). Furthermore, pathological astrocytic activity seems to impair oligodendrocyte functions, especially remyelination during aging. Aging exacerbates the inhibitory effects of astrocytes on remyelination. Astrocytes exhibit increased reactivity in older individuals and secrete higher levels of chondroitin sulfate proteoglycans and other extracellular matrix components, further hindering OPC differentiation and remyelination. Additionally, aging astrocytes display a shift in their secretome, reducing the availability of neurotrophic factors necessary for OPC survival and function (Boisvert et al.\n2018\n; Rawji et al.\n2016\n). The interplay between astrocytes and oligodendrocytes is crucial for CNS homeostasis, myelination, and response to injury. While astrocytes provide essential trophic and metabolic support to oligodendrocytes, they can also contribute to remyelination failure through scar formation and chronic inflammation.", "doc_items_refs": ["#/texts/569", "#/texts/570", "#/texts/571", "#/texts/572", "#/texts/573", "#/texts/574", "#/texts/575", "#/texts/576", "#/texts/577"], "page_nos": [], "uuid": "e57944c0-b40c-4ce4-a100-85293361f003"}
{"doc_id": "2025__Emerging_Role_of_Oligodendrocytes_Malfunction_in_the_Progression_of_Alzheimers_D__W4413865689", "source_path": "<redacted:source_path>", "chunk_id": 31, "source_chunk_idxs": [36], "num_tokens": 477, "text": "Emerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nRole of Oligodendrocytes in Neuroinflammation\nDisease-Associated Oligodendrocytes (DAO) in AD\nThe role of oligodendrocytes in neuroinflammatory processes extends beyond mere interactions with other glial cells, suggesting a more intricate and multifaceted involvement. Recent investigations utilizing single-cell RNA sequencing (scRNA-seq) have drawn increasing attention to oligodendrocytes, consistently identifying a distinct population of disease-associated oligodendrocytes (DAO). These cells differ both functionally and morphologically from myelinating oligodendrocytes and actively participate in the neuroinflammatory processes characteristic of Alzheimer's disease.\nTranscriptomic alterations observed in 5xFAD mice underscore the influence of DAO on immune and metabolic dysregulation, as well as stress responses. Disease-associated cells demonstrated upregulation of\nSerpina3N\n,\nC4b\n, and\nMhc-I\ngenes, implicating them in neuroinflammatory processes (Table\n2\n) (Kenigsbuch et al.\n2022\n). Interestingly, age-dependent overexpression of Serpina3N has been observed in\nApoE4\nmice within Aβ plaques (Zattoni et al.\n2022\n; Zhao et al.\n2020\n; Licastro et al.\n1999\n). Nevertheless, it is worth noting that this Serpina3N overexpression appears to have predictive value for Alzheimer's disease only in males, as the difference in expression between non-demented controls and AD males reached statistical significance exclusively in this group (Sanfilippo et al.\n2025\n). Hence, such a sex-specific difference may indicate a substantially greater contribution of neuroinflammation to the development and progression of AD in males compared to females. In contrast, C4b is significantly associated with the protective effects of the\nApoE2\ngenotype in Alzheimer's disease (Panitch et al.\n2021\n) due to its proven ability to bind not only Aβ\n1-42\npeptides but also apoptotic and necrotic cells (Trouw et al.\n2008\n).", "doc_items_refs": ["#/texts/579", "#/texts/580", "#/texts/581", "#/texts/582", "#/texts/583", "#/texts/584", "#/texts/585", "#/texts/586", "#/texts/587", "#/texts/588", "#/texts/589", "#/texts/590", "#/texts/591", "#/texts/592", "#/texts/593", "#/texts/594", "#/texts/595", "#/texts/596", "#/texts/597", "#/texts/598", "#/texts/599", "#/texts/600", "#/texts/601", "#/texts/602", "#/texts/603", "#/texts/604", "#/texts/605", "#/texts/606", "#/texts/607", "#/texts/608"], "page_nos": [], "uuid": "1c834baa-6c32-401e-8e4a-adfc016a5e62"}
{"doc_id": "2025__Emerging_Role_of_Oligodendrocytes_Malfunction_in_the_Progression_of_Alzheimers_D__W4413865689", "source_path": "<redacted:source_path>", "chunk_id": 32, "source_chunk_idxs": [37], "num_tokens": 337, "text": "Emerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nRole of Oligodendrocytes in Neuroinflammation\nDisease-Associated Oligodendrocytes (DAO) in AD\nUsing scRNA-seq\nPandey\net al\n.\nconfirmed the presence of DAO and classified them into three distinct subtypes namely DA1, DA2 and IFN (Pandey et al.\n2022\n). Generally, the DA1 cluster was localized at the periphery of lesion sites during demyelination and contained genes overlapping with those identified in 5xFAD mice, and it was found to be associated with immune and inflammatory response pathways. However, as the brain progresses into repair phases, such as remyelination, these cells migrate toward lesion cores, indicating their dynamic involvement in both injury response and recovery. Notably, DA1 cells persist beyond the acute phase of inflammation, suggesting a potential role in chronic disease progression (Pandey et al.\n2022\n). The presence of DAO-enriched regions found in demyelinated areas and disrupted axons in both multiple sclerosis and AD model mice implies that this cluster may reflect a broader response to CNS damage, rather than being specific to amyloidosis or tauopathy (Sadick et al.\n2022\n). Interestingly, the DA2 cluster has the potential to provide a cytoprotective effect by countering the cellular stress induced by neurodegeneration, due to its association with cellular survival pathways, including PI3K/AKT and mTOR (Pandey et al.\n2022\n).", "doc_items_refs": ["#/texts/609", "#/texts/610", "#/texts/611", "#/texts/612", "#/texts/613", "#/texts/614", "#/texts/615", "#/texts/616", "#/texts/617", "#/texts/618", "#/texts/619", "#/texts/620", "#/texts/621"], "page_nos": [], "uuid": "8de72adf-18b0-4998-989e-460322aacc06"}
{"doc_id": "2025__Emerging_Role_of_Oligodendrocytes_Malfunction_in_the_Progression_of_Alzheimers_D__W4413865689", "source_path": "<redacted:source_path>", "chunk_id": 33, "source_chunk_idxs": [38], "num_tokens": 364, "text": "Emerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nRole of Oligodendrocytes in Neuroinflammation\nDisease-Associated Oligodendrocytes (DAO) in AD\nIn a study,\nPark\net al\n.\nconducted exceptional research utilizing 5xFAD and\nApp\nknock-in models to uncover a distinct gene expression profile for DAO, differentiating them from conventional myelin-associated oligodendrocytes. This DAO population, which exhibits an age-dependent increase, was characterized by the co-expression of\nMbp\nand\nCd74\n(Table\n2\n). Notably, the upregulation of\nCd74\nwas particularly striking, as this gene is not prominently expressed in homeostatic oligodendrocytes (Park et al.\n2023\n). CD74 demonstrates a remarkable ability to bind the APP protein, thereby inhibiting the production of Aβ peptides (Matsuda et al.\n2009\n; Xu et al.\n2024\n). Furthermore, the emergence of these disease-associated cells was consistently observed in close proximity to Aβ plaques, where they displayed elevated expression of AD risk-related genes, including\nC4b\nand\nApoE\n(Park et al.\n2023\n), which the overexpression identified as DAO play a distinct role in the pathology of Alzheimer's disease, especially in the processing of APP. While alterations in gene expression are evident in both sexes, it is crucial to underscore the presence of pronounced sex-specific differences. Analyses of AD-associated genes in App\nNL−G−F\ntransgenic model demonstrated that\nCd74\nand\nC4b\nexhibit significantly higher expression levels in the cortical regions of female mice compared to their male counterparts (Castillo et al.\n2017\n).", "doc_items_refs": ["#/texts/622", "#/texts/623", "#/texts/624", "#/texts/625", "#/texts/626", "#/texts/627", "#/texts/628", "#/texts/629", "#/texts/630", "#/texts/631", "#/texts/632", "#/texts/633", "#/texts/634", "#/texts/635", "#/texts/636", "#/texts/637", "#/texts/638", "#/texts/639", "#/texts/640", "#/texts/641", "#/texts/642", "#/texts/643", "#/texts/644", "#/texts/645", "#/texts/646", "#/texts/647", "#/texts/648", "#/texts/649", "#/texts/650", "#/texts/651", "#/texts/652", "#/texts/653", "#/texts/654", "#/texts/655", "#/texts/656"], "page_nos": [], "uuid": "0b27a202-4c6c-4a77-8dff-3012da48c216"}
{"doc_id": "2025__Emerging_Role_of_Oligodendrocytes_Malfunction_in_the_Progression_of_Alzheimers_D__W4413865689", "source_path": "<redacted:source_path>", "chunk_id": 34, "source_chunk_idxs": [39], "num_tokens": 411, "text": "Emerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nRole of Oligodendrocytes in Neuroinflammation\nDisease-Associated Oligodendrocytes (DAO) in AD\nDue to limited research in the present field, the translational potential of DAO as a therapeutic target requires further investigation. SERPINA3N has been identified in the brains of\npost-mortem\nAD patients, and DAO has been observed in regions surrounding Aβ plaques, suggesting potential avenues for therapeutic intervention aimed at mitigating DAO-mediated damage in AD (Kenigsbuch et al.\n2022\n). However, transcriptional responses involving DAO in AD differ significantly between mice and humans (Pandey et al.\n2022\n). Additionally, the transcriptomic signature of DAO overlaps with that of disease-associated astrocytes (DAA) and microglia (DAM), including the upregulation of a similar set of genes (e.g.,\nC4b, Serpina3n, B2m\n) in response to amyloid and tau pathology. Despite these shared molecular features, glial cell types exhibit distinct functional profiles. For instance, astrocytes predominantly display interferon-related responses, whereas oligodendrocytes show changes associated with demyelination and apoptosis (Lee et al.\n2021\n). Moreover, while DAM activation is heavily dependent on TREM2, DAO activation appears to occur independently from TREM2 signaling. This distinction underscores the possibility that oligodendrocytes may respond directly to amyloid or tau pathology without requiring microglial signaling pathways (Zhou et al.\n2020\n). Understanding these shared yet distinct molecular pathways could inform the development of broader therapeutic strategies targeting glial cell dysfunction in neurodegenerative diseases. Nevertheless, the observed divergence between species-specific and cell-specific responses highlights the critical need to address the limitations of translating findings from animal models directly to human conditions.", "doc_items_refs": ["#/texts/657", "#/texts/658", "#/texts/659", "#/texts/660", "#/texts/661", "#/texts/662", "#/texts/663", "#/texts/664", "#/texts/665", "#/texts/666", "#/texts/667", "#/texts/668", "#/texts/669"], "page_nos": [], "uuid": "210bb3fe-ef67-471f-b0bd-76f53e7a4cc2"}
{"doc_id": "2025__Emerging_Role_of_Oligodendrocytes_Malfunction_in_the_Progression_of_Alzheimers_D__W4413865689", "source_path": "<redacted:source_path>", "chunk_id": 35, "source_chunk_idxs": [40, 41], "num_tokens": 369, "text": "Emerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nConclusions\nThe present review elaborates on the role of oligodendrocytes in developing AD-related pathologies. Presented evidence underscores the crucial yet insufficiently understood role of oligodendrocytes and oligodendrocyte precursor cells in AD pathology. While traditionally considered a neuronal disorder, AD also involves substantial glial dysfunction, with OL and OPC contributing to disease progression through impaired myelination, disrupted lipid metabolism, and neuroinflammatory responses. Myelin breakdown precedes cognitive decline, suggesting that OL dysfunction may be an early neurodegeneration biomarker.\nAβ and tau pathology interfere with OPC differentiation and promote cellular senescence, exacerbating neuroinflammation and reducing remyelination potential. Animal models confirm age-dependent OPC decline, particularly in regions affected by Aβ plaques, further supporting their vulnerability in AD. Transcriptomic studies link OL dysfunction to cholesterol metabolism disturbances, reinforcing the critical interplay between myelin integrity and amyloid toxicity. Additionally, identifying disease-associated oligodendrocytes underscores their active role in inflammatory pathways and APP processing.\nGiven the growing understanding of OL involvement in AD, targeting OL and OPC pathways presents a promising therapeutic avenue. Enhancing remyelination and mitigating OPC senescence may offer novel approaches to slow disease progression and improve cognitive outcomes. Further research is needed to elucidate the molecular mechanisms underlying OL dysfunction and develop targeted interventions to preserve myelin integrity in AD.\n\nEmerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nData Availability\nNo datasets were generated or analysed during the current study.", "doc_items_refs": ["#/texts/671", "#/texts/672", "#/texts/673", "#/texts/675"], "page_nos": [], "uuid": "54a9a881-f947-48a6-8b99-376cfdf47267"}
{"doc_id": "2025__Emerging_Role_of_Oligodendrocytes_Malfunction_in_the_Progression_of_Alzheimers_D__W4413865689", "source_path": "<redacted:source_path>", "chunk_id": 36, "source_chunk_idxs": [42], "num_tokens": 445, "text": "Emerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nAbbreviations\nAD:\nAlzheimer's disease\nAKT:\nProtein kinase B\nAPOE:\nApolipoprotein E\nAPP:\nAmyloid precursor protein\nARTAG:\nAging-related tau astrogliopathy\nAβ:\nAmyloid beta\nBACE1:\nBeta secretase 1\nBBB:\nBlood-brain barrier\nCD74:\nCluster of differentiation 74\nCNS:\nCentral nervous system\nCSF:\nCerebrospinal fluid\nDAO:\nDisease-associated oligodendrocytes\nEOAD:\nEarly-onset Alzheimer's Disease\nFGF-2:\nFibroblast growth factor 2\nGFAP:\nGlial fibrillary acidic protein\nIGF-1:\nInsulin-like growth factor 1\nLINGO-1:\nLeucine rich repeat and immunoglobulin like domain-containing protein\nLOAD:\nLate-onset Alzheimer's Disease\nM1R:\nM1 muscarinic receptor\nMAG:\nMyelin associated glycoproteins\nMBP:\nMyelin basic protein\nMCT:\nMonocarboxylate transporters\nMHC-I:\nMajor histocompatibility complex class I\nMMP-9:\nMetalloproteinase 9\nMS:\nMultiple sclerosis\nmTOR:\nMammalian target of rapamycin\nNF-κB:\nNuclear factor kappa-light-chain-enhancer of activated B cells\nNFT:\nNeurofibrillary tangles\nNgR:\nNogo receptor\nNOR:\nNovel object recognition\nOL:\nOligodendrocytes\nOPC:\nOligodendrocytes progenitor cells\np75\nNRT\n:\nP75 neurotrophin factor\nPDGF:\nPlatelet-derived growth factor\nPI3K:\nPhosphoinositide 3-kinase\nPIP2:\nL-α-phosphatidylinositol-4,5-bisphosphate\nRhoA:\nRas homolog family member A\nROCK:\nRho-associated protein kinase\nROS:\nReactive oxygen species\nSP :\nSenile plaques\nTGF-β1:\nTransforming grow factor beta 1\nTREM2:\nTriggering receptor expressed on myeloid cells 2\nWM:\nWhite matter", "doc_items_refs": ["#/texts/677", "#/texts/678", "#/texts/679", "#/texts/680", "#/texts/681", "#/texts/682", "#/texts/683", "#/texts/684", "#/texts/685", "#/texts/686", "#/texts/687", "#/texts/688", "#/texts/689", "#/texts/690", "#/texts/691", "#/texts/692", "#/texts/693", "#/texts/694", "#/texts/695", "#/texts/696", "#/texts/697", "#/texts/698", "#/texts/699", "#/texts/700", "#/texts/701", "#/texts/702", "#/texts/703", "#/texts/704", "#/texts/705", "#/texts/706", "#/texts/707", "#/texts/708", "#/texts/709", "#/texts/710", "#/texts/711", "#/texts/712", "#/texts/713", "#/texts/714", "#/texts/715", "#/texts/716", "#/texts/717", "#/texts/718", "#/texts/719", "#/texts/720", "#/texts/721", "#/texts/722", "#/texts/723", "#/texts/724", "#/texts/725", "#/texts/726", "#/texts/727", "#/texts/728", "#/texts/729", "#/texts/730", "#/texts/731", "#/texts/732", "#/texts/733", "#/texts/734", "#/texts/735", "#/texts/736", "#/texts/737", "#/texts/738", "#/texts/739", "#/texts/740", "#/texts/741", "#/texts/742", "#/texts/743", "#/texts/744", "#/texts/745", "#/texts/746", "#/texts/747", "#/texts/748", "#/texts/749", "#/texts/750", "#/texts/751", "#/texts/752", "#/texts/753", "#/texts/754", "#/texts/755", "#/texts/756", "#/texts/757", "#/texts/758", "#/texts/759", "#/texts/760", "#/texts/761", "#/texts/762", "#/texts/763", "#/texts/764"], "page_nos": [], "uuid": "b48aae0c-eb9a-4e0d-b64b-909c94619ffa"}
{"doc_id": "2025__Emerging_Role_of_Oligodendrocytes_Malfunction_in_the_Progression_of_Alzheimers_D__W4413865689", "source_path": "<redacted:source_path>", "chunk_id": 37, "source_chunk_idxs": [43], "num_tokens": 510, "text": "Emerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nReferences\n- Abbott NJ, Rönnbäck L, Hansson E (2006) Astrocyte-endothelial interactions at the blood-brain barrier. Nat Rev Neurosci.\nhttps://doi.org/10.1038/nrn1824\nArticle\nPubMed\nGoogle Scholar\n- Abdelnour C, Agosta F, Bozzali M, Fougère B, Iwata A, Nilforooshan R et al (2022) Perspectives and challenges in patient stratification in Alzheimer's disease. Alzheimers Res Ther. BioMed Central Ltd\n- Aggarwal S, Snaidero N, Pähler G, Frey S, Sánchez P, Zweckstetter M et al (2013) Myelin membrane assembly is driven by a phase transition of myelin basic proteins into a cohesive protein meshwork. PLoS Biol.\nhttps://doi.org/10.1371/journal.pbio.1001577\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n- Ahmed H, Wang Y, Griffiths WJ, Levey AI, Pikuleva I, Liang SH et al (2024) Brain cholesterol and Alzheimer's disease: challenges and opportunities in probe and drug development. Brain 147:1622-1635\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n- Akay LA, Effenberger AH, Tsai L-H (2021) Cell of all trades: oligodendrocyte precursor cells in synaptic, vascular, and immune function. Available from:\nhttp://www.genesdev.org/cgi/doi/10.1101/gad.344218\n- Arjunan A, Sah DK, Woo M, Song J (2023) Identification of the molecular mechanism of insulin-like growth factor-1 (IGF-1): a promising therapeutic target for neurodegenerative diseases associated with metabolic syndrome. Cell Biosci. BioMed Central Ltd\n- Baaklini CS, Ho MFS, Lange T, Hammond BP, Panda SP, Zirngibl M et al (2023) Microglia promote remyelination independent of their role in clearing myelin debris. Cell Rep.\nhttps://doi.org/10.1016/j.celrep.2023.113574\nArticle\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/766", "#/texts/767", "#/texts/768", "#/texts/769", "#/texts/770", "#/texts/771", "#/texts/772"], "page_nos": [], "uuid": "737b6fbf-824e-4535-a4d1-c0aa72e2275e"}
{"doc_id": "2025__Emerging_Role_of_Oligodendrocytes_Malfunction_in_the_Progression_of_Alzheimers_D__W4413865689", "source_path": "<redacted:source_path>", "chunk_id": 38, "source_chunk_idxs": [44], "num_tokens": 504, "text": "Emerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nReferences\n- Bai R, Guo J, Ye X-Y, Xie Y, Xie T (2022) Oxidative stress: the core pathogenesis and mechanism of Alzheimer's disease. Ageing Res Rev 77:101619\nArticle\nPubMed\nCAS\nGoogle Scholar\n- Bauer NM, Moos C, van Horssen J, Witte M, van der Valk P, Altenhein B et al (2012) Myelin basic protein synthesis is regulated by small non-coding RNA 715. EMBO Rep 13:827-834\nArticle\nPubMed\nPubMed Central\nCAS\nGoogle Scholar\n- Bechler ME, Byrne L, ffrench-Constant C (2015) CNS myelin sheath lengths are an intrinsic property of oligodendrocytes. Curr Biol 25:2411-2416\nArticle\nPubMed\nPubMed Central\nCAS\nGoogle Scholar\n- Beiter RM, Raghavan TP, Suchocki O, Ennerfelt HE, Rivet-Noor CR, Merchak AR et al (2024) Oligomeric amyloid beta prevents myelination in a clusterin-dependent manner [Internet]. Available from:\nhttps://www.researchsquare.com/article/rs-4415143/v1\n- Bennett J, Basivireddy J, Kollar A, Biron KE, Reickmann P, Jefferies WA et al (2010) Blood-brain barrier disruption and enhanced vascular permeability in the multiple sclerosis model EAE. J Neuroimmunol 229:180-191\nArticle\nPubMed\nCAS\nGoogle Scholar\n- Benoit MR, Darboe M, Das B, Ge Y, Zhou J, Yao A et al (2023) Postnatal neuronal Bace1 deletion impairs neuroblast and oligodendrocyte maturation. Hum Mol Genet 32(7):1193-1207\nArticle\nPubMed\nCAS\nGoogle Scholar\n- Blanchard JW, Akay LA, Davila-Velderrain J, von Maydell D, Mathys H, Davidson SM et al (2022) APOE4 impairs myelination via cholesterol dysregulation in oligodendrocytes. Nature 611:769-779\nArticle\nPubMed\nPubMed Central\nCAS\nGoogle Scholar", "doc_items_refs": ["#/texts/773", "#/texts/774", "#/texts/775", "#/texts/776", "#/texts/777", "#/texts/778", "#/texts/779"], "page_nos": [], "uuid": "75f7ec58-efe0-447c-bae9-1f192e16e872"}
{"doc_id": "2025__Emerging_Role_of_Oligodendrocytes_Malfunction_in_the_Progression_of_Alzheimers_D__W4413865689", "source_path": "<redacted:source_path>", "chunk_id": 39, "source_chunk_idxs": [45], "num_tokens": 468, "text": "Emerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nReferences\n- Boisvert MM, Erikson GA, Shokhirev MN, Allen NJ (2018) The aging astrocyte transcriptome from multiple regions of the mouse brain. Cell Rep 22:269-285\nArticle\nPubMed\nPubMed Central\nCAS\nGoogle Scholar\n- Bolós M, Llorens-Martín M, Jurado-Arjona J, Hernández F, Rábano A, Avila J (2016) Direct evidence of internalization of tau by microglia in vitro and in vivo. J Alzheimers Dis 50:77-87\nArticle\nPubMed\nGoogle Scholar\n- Braak H, Braak E (1996) Development of Alzheimer-related neurofibrillary changes in the neocortex inversely recapitulates cortical myelogenesis. Acta Neuropathol 92:197-201\nArticle\nPubMed\nCAS\nGoogle Scholar\n- Castillo E, Leon J, Mazzei G, Abolhassani N, Haruyama N, Saito T et al (2017) Comparative profiling of cortical gene expression in Alzheimer's disease patients and mouse models demonstrates a link between amyloidosis and neuroinflammation. Sci Rep.\nhttps://doi.org/10.1038/s41598-017-17999-3\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n- Chacon-De-La-Rocha I, Fryatt G, Rivera AD, Verkhratsky A, Raineteau O, Gomez-Nicola D et al (2020) Accelerated dystrophy and decay of oligodendrocyte precursor cells in the APP/PS1 model of Alzheimer's-like pathology. Front Cell Neurosci.\nhttps://doi.org/10.3389/fncel.2020.575082\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n- Chen JF, Liu K, Hu B, Li RR, Xin W, Chen H et al (2021) Enhancing myelin renewal reverses cognitive dysfunction in a murine model of Alzheimer's disease. Neuron 109:2292-2307.e5\nArticle\nPubMed\nPubMed Central\nCAS\nGoogle Scholar", "doc_items_refs": ["#/texts/780", "#/texts/781", "#/texts/782", "#/texts/783", "#/texts/784", "#/texts/785"], "page_nos": [], "uuid": "b779798a-9cb2-4632-baa5-37f11eacaf2d"}
{"doc_id": "2025__Emerging_Role_of_Oligodendrocytes_Malfunction_in_the_Progression_of_Alzheimers_D__W4413865689", "source_path": "<redacted:source_path>", "chunk_id": 40, "source_chunk_idxs": [46], "num_tokens": 508, "text": "Emerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nReferences\n- Chen J, Wang F, Huang N, Xiao L, Mei F (2022) Oligodendrocytes and myelin: Active players in neurodegenerative brains? Dev Neurobiol 82:160-174\nArticle\nPubMed\nGoogle Scholar\n- Chen P, Guo ZL, Zhou B (2023) Disease-Associated Oligodendrocyte: New Player in Alzheimer's Disease and CNS Pathologies. J Integr Neurosci. IMR Press Limited\n- Cheng GWY, Mok KKS, Yeung SHS, Kofler J, Herrup K, Tse KH (2022) Apolipoprotein E ε4 mediates myelin breakdown by targeting oligodendrocytes in sporadic Alzheimer disease. J Neuropathol Exp Neurol 81:717-730\nArticle\nPubMed\nPubMed Central\nCAS\nGoogle Scholar\n- Cignarella F, Filipello F, Bollman B, Cantoni C, Locca A, Mikesell R et al (2020) TREM2 activation on microglia promotes myelin debris clearance and remyelination in a model of multiple sclerosis. Acta Neuropathol 140:513-534\nArticle\nPubMed\nPubMed Central\nCAS\nGoogle Scholar\n- Couttas TA, Kain N, Suchowerska AK, Quek L-E, Turner N, Fath T et al (2016) Loss of ceramide synthase 2 activity, necessary for myelin biosynthesis, precedes tau pathology in the cortical pathogenesis of Alzheimer's disease. Neurobiol Aging 43:89-100\nArticle\nPubMed\nCAS\nGoogle Scholar\n- de la Fuente AG, Queiroz RML, Ghosh T, McMurran CE, Cubillos JF, Bergles DE et al (2020) Changes in the oligodendrocyte progenitor cell proteome with ageing. Mol Cell Proteomics 19:1281-1302\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n- de Laat R, Meabon JS, Wiley JC, Hudson MP, Montine TJ, Bothwell M (2015) LINGO-1 promotes lysosomal degradation of amyloid-β protein precursor. Pathobiol Aging Age-Related Diseases 5:25796\nArticle\nGoogle Scholar", "doc_items_refs": ["#/texts/786", "#/texts/787", "#/texts/788", "#/texts/789", "#/texts/790", "#/texts/791", "#/texts/792"], "page_nos": [], "uuid": "e4984429-8669-4424-b03b-e4ff5a158dd5"}
{"doc_id": "2025__Emerging_Role_of_Oligodendrocytes_Malfunction_in_the_Progression_of_Alzheimers_D__W4413865689", "source_path": "<redacted:source_path>", "chunk_id": 41, "source_chunk_idxs": [47], "num_tokens": 448, "text": "Emerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nReferences\n- DeFlitch L, Gonzalez-Fernandez E, Crawley I, Kang SH (2022) Age and Alzheimer's disease-related oligodendrocyte changes in hippocampal subregions. Front Cell Neurosci.\nhttps://doi.org/10.3389/fncel.2022.847097\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n- Depp C, Sun T, Sasmita AO, Spieth L, Berghoff SA, Steixner-Kumar AA et al (2021) Ageing-associated myelin dysfunction drives amyloid deposition in mouse models of Alzheimer's disease [Internet]. Available from:\nhttp://biorxiv.org/lookup/doi/10.1101/2021.07.31.454562\n- Desai MK, Sudol KL, Janelsins MC, Mastrangelo MA, Frazer ME, Bowers WJ (2009) Triple-transgenic Alzheimer's disease mice exhibit region-specific abnormalities in brain myelination patterns prior to appearance of amyloid and tau pathology. Glia 57:54-65\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n- Desai MK, Mastrangelo MA, Ryan DA, Sudol KL, Narrow WC, Bowers WJ (2010) Early oligodendrocyte/myelin pathology in Alzheimer's disease mice constitutes a novel therapeutic target. Am J Pathol 177:1422-1435\nArticle\nPubMed\nPubMed Central\nCAS\nGoogle Scholar\n- Desai MK, Guercio BJ, Narrow WC, Bowers WJ (2011) An Alzheimer's disease-relevant presenilin-1 mutation augments amyloid-beta-induced oligodendrocyte dysfunction. Glia 59:627-640\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n- De Sousa RAL (2022) Reactive gliosis in Alzheimer's disease: a crucial role for cognitive impairment and memory loss. Metab Brain Dis. Springer p 851-7", "doc_items_refs": ["#/texts/793", "#/texts/794", "#/texts/795", "#/texts/796", "#/texts/797", "#/texts/798"], "page_nos": [], "uuid": "c7df2666-bc4b-4a88-a9ed-2e7817e8138f"}
{"doc_id": "2025__Emerging_Role_of_Oligodendrocytes_Malfunction_in_the_Progression_of_Alzheimers_D__W4413865689", "source_path": "<redacted:source_path>", "chunk_id": 42, "source_chunk_idxs": [48], "num_tokens": 505, "text": "Emerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nReferences\n- Dong YX, Zhang HY, Li HY, Liu PH, Sui Y, Sun XH (2018) Association between Alzheimer's disease pathogenesis and early demyelination and oligodendrocyte dysfunction. Neural Regen Res 13:908-914\nArticle\nPubMed\nPubMed Central\nCAS\nGoogle Scholar\n- Duncan ID, Radcliff AB, Heidari M, Kidd G, August BK, Wierenga LA (2018) The adult oligodendrocyte can participate in remyelination. Proceedings of the National Academy of Sciences. 115\n- Fawcett JW, Asher RA (1999) The glial scar and central nervous system repair. Brain Res ull 49:377-391\nArticle\nCAS\nGoogle Scholar\n- Feringa FM, van der Kant R (2021) Cholesterol and Alzheimer's Disease; from risk genes to pathological effects. Front Aging Neurosci Frontiers Media S.A\n- Fernandez-Enright F, Andrews JL (2016) Lingo-1: a novel target in therapy for Alzheimer's disease? Neural Regen Res 11:88-89\nArticle\nPubMed\nPubMed Central\nCAS\nGoogle Scholar\n- Filley CM (2021) Cognitive dysfunction in white matter disorders: new perspectives in treatment and recovery. J Neuropsychiatry Clin Neurosci 33:349-355\nArticle\nPubMed\nGoogle Scholar\n- Foster EM, Dangla-Valls A, Lovestone S, Ribe EM, Buckley NJ (2019) Clusterin in Alzheimer's disease: Mechanisms, genetics, and lessons from other pathologies. Front Neurosci. Frontiers Media S.A.\n- Franklin RJM, Ffrench-Constant C (2008) Remyelination in the CNS: From biology to therapy. Nat Rev Neurosci 839-55\n- Galichet C, Clayton RW, Lovell-Badge R (2021) Novel tools and investigative approaches for the study of oligodendrocyte precursor cells (NG2-Glia) in CNS development and disease. Front Cell Neurosci 15\n- Gao R, Song SJ, Tian MY, Wang L Bin, Zhang Y, Li X (2024) Myelin debris phagocytosis in demyelinating disease. Glia. John Wiley and Sons Inc", "doc_items_refs": ["#/texts/799", "#/texts/800", "#/texts/801", "#/texts/802", "#/texts/803", "#/texts/804", "#/texts/805", "#/texts/806", "#/texts/807", "#/texts/808"], "page_nos": [], "uuid": "e4f1a26a-9b86-49d4-959d-0118207f6f88"}
{"doc_id": "2025__Emerging_Role_of_Oligodendrocytes_Malfunction_in_the_Progression_of_Alzheimers_D__W4413865689", "source_path": "<redacted:source_path>", "chunk_id": 43, "source_chunk_idxs": [49], "num_tokens": 486, "text": "Emerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nReferences\n- Graham AC, Bellou E, Harwood JC, Yaman U, Celikag M, Magusali N et al (2025) Human longevity and Alzheimer's disease variants act via microglia and oligodendrocyte gene networks. Brain.\nhttps://doi.org/10.1093/brain/awae339\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n- Gu L, Wu D, Tang X, Qi X, Li X, Bai F et al (2018) Myelin changes at the early stage of 5XFAD mice. Brain Res Bull 137:285-293\nArticle\nPubMed\nCAS\nGoogle Scholar\n- Guerreiro R, Wojtas A, Bras J, Carrasquillo M, Rogaeva E, Majounie E et al (2013)\nTREM2\nvariants in Alzheimer's disease. N Engl J Med 368:117-127\nArticle\nPubMed\nCAS\nGoogle Scholar\n- Guo MF, Zhang HY, Zhang PJ, Liu XQ, Song LJ, Wei WY et al (2020) Fasudil reduces β-amyloid levels and neuronal apoptosis in APP/PS1 transgenic mice via inhibition of the Nogo-A/NgR/RhoA signaling axis. J Integr Neurosci 19:651-662\nArticle\nPubMed\nGoogle Scholar\n- Hampel H, Hardy J, Blennow K, Chen C, Perry G, Kim SH et al (2021) The amyloid-β pathway in Alzheimer's disease. Mol Psychiatry 26:5481-5503\nArticle\nPubMed\nPubMed Central\nCAS\nGoogle Scholar\n- Han S, Gim Y, Jang EH, Hur EM, Frontiers Media S.A. (2022) Functions and dysfunctions of oligodendrocytes in neurodegenerative diseases. Front Cell Neurosci.\nhttps://doi.org/10.3389/fncel.2022.1083159\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n- Hansen DV, Hanson JE, Sheng M (2018) Microglia in Alzheimer's disease. J Cell Biol 217:459-472\nArticle\nPubMed\nPubMed Central\nCAS\nGoogle Scholar", "doc_items_refs": ["#/texts/809", "#/texts/810", "#/texts/811", "#/texts/812", "#/texts/813", "#/texts/814", "#/texts/815"], "page_nos": [], "uuid": "9b6292af-17ad-4b92-8562-eb39c8d72627"}
{"doc_id": "2025__Emerging_Role_of_Oligodendrocytes_Malfunction_in_the_Progression_of_Alzheimers_D__W4413865689", "source_path": "<redacted:source_path>", "chunk_id": 44, "source_chunk_idxs": [50], "num_tokens": 477, "text": "Emerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nReferences\n- Harrington EP, Catenacci RB, Smith MD, Heo D, Miller CE, Meyers KR et al (2023) MHC class I and MHC class II reporter mice enable analysis of immune oligodendroglia in mouse models of multiple sclerosis. Elife 12\n- Heneka MT, Kummer MP, Stutz A, Delekate A, Schwartz S, Vieira-Saecker A et al (2013) NLRP3 is activated in Alzheimer's disease and contributes to pathology in APP/PS1 mice. Nature [Internet]. 493:674-8. Available from:\nhttps://www.nature.com/articles/nature11729\n- Hirahara Y, Wakabayashi T, Mori T, Koike T, Yao I, Tsuda M et al (2017) Sulfatide species with various fatty acid chains in oligodendrocytes at different developmental stages determined by imaging mass spectrometry. J Neurochem 140:435-450\nArticle\nPubMed\nCAS\nGoogle Scholar\n- Hoos MD, Ahmed M, Smith SO, Van Nostrand WE (2007) Inhibition of familial cerebral amyloid angiopathy mutant amyloid β-protein fibril assembly by myelin basic protein. J Biol Chem 282:9952-9961\nArticle\nPubMed\nCAS\nGoogle Scholar\n- Hoos MD, Ahmed M, Smith SO, Van Nostrand WE (2009) Myelin basic protein binds to and inhibits the fibrillar assembly of Aβ42 in vitro. Biochemistry 48:4720-4727\nArticle\nPubMed\nCAS\nGoogle Scholar\n- Hou J, Chen Y, Grajales-Reyes G, Colonna M (2022) TREM2 dependent and independent functions of microglia in Alzheimer's disease. Mol Neurodegener. BioMed Central Ltd\n- Hu X, He W, Diaconu C, Tang X, Kidd GJ, Macklin WB et al (2008) Genetic deletion of BACE1 in mice affects remyelination of sciatic nerves. FASEB J 22:2970-2980\nArticle\nPubMed\nPubMed Central\nCAS\nGoogle Scholar", "doc_items_refs": ["#/texts/816", "#/texts/817", "#/texts/818", "#/texts/819", "#/texts/820", "#/texts/821", "#/texts/822"], "page_nos": [], "uuid": "de3a7714-401d-4b3f-b1bd-796cd2884c90"}
{"doc_id": "2025__Emerging_Role_of_Oligodendrocytes_Malfunction_in_the_Progression_of_Alzheimers_D__W4413865689", "source_path": "<redacted:source_path>", "chunk_id": 45, "source_chunk_idxs": [51], "num_tokens": 487, "text": "Emerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nReferences\n- Hu X, Yu G, Liao X, Xiao L (2023) Interactions between astrocytes and oligodendroglia in myelin development and related brain diseases. Neurosci Bull. Springer p 541-52\n- Huang Z, Jordan JD, Zhang Q (2024) Myelin pathology in Alzheimer's disease: potential therapeutic opportunities. Aging Dis Int Soc Aging and Disease p 698-713\n- Ishii A, Pathoulas JA, MoustafaFathy Omar O, Ge Y, Yao AY, Pantalena T et al (2024) Contribution of amyloid deposition from oligodendrocytes in a mouse model of Alzheimer's disease. Mol Neurodegener.\nhttps://doi.org/10.1186/s13024-024-00759-z\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n- Kamen Y, Pivonkova H, Evans KA, Káradóttir RT (2022) A matter of state: diversity in oligodendrocyte lineage cells. Neuroscientist 28:144-162\nArticle\nPubMed\nCAS\nGoogle Scholar\n- Kato D (2025) Impact of sex differences in oligodendrocytes and their progenitor cells on the pathophysiology of neuropsychiatric disorders. J Nippon Med Sch.\nhttps://doi.org/10.1272/jnms.JNMS.2025\\_92-306\nArticle\nPubMed\nGoogle Scholar\n- Kato S, Gondo T, Hoshii Y, Takahashi M, Yamada M, Ishihara T (1998) Confocal observation of senile plaques in Alzheimer's disease: senile plaque morphology and relationship between senile plaques and astrocytes. Pathol Int 48:332-340\nArticle\nPubMed\nCAS\nGoogle Scholar\n- Kaya I, Jennische E, Lange S, Tarik Baykal A, Malmberg P, Fletcher JS (2020) Brain region-specific amyloid plaque-associated myelin lipid loss, APOE deposition and disruption of the myelin sheath in familial Alzheimer's disease mice. J Neurochem 154:84-98\nArticle\nPubMed\nCAS\nGoogle Scholar", "doc_items_refs": ["#/texts/823", "#/texts/824", "#/texts/825", "#/texts/826", "#/texts/827", "#/texts/828", "#/texts/829"], "page_nos": [], "uuid": "4f5c1df0-c0db-4e65-812f-6dd3b399cbd2"}
{"doc_id": "2025__Emerging_Role_of_Oligodendrocytes_Malfunction_in_the_Progression_of_Alzheimers_D__W4413865689", "source_path": "<redacted:source_path>", "chunk_id": 46, "source_chunk_idxs": [52], "num_tokens": 512, "text": "Emerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nReferences\n- Kenigsbuch M, Bost P, Halevi S, Chang Y, Chen S, Ma Q et al (2022) A shared disease-associated oligodendrocyte signature among multiple CNS pathologies. Nat Neurosci 25:876-886\nArticle\nPubMed\nPubMed Central\nCAS\nGoogle Scholar\n- Kingwell K (2023) Oligodendrocytes take centre stage in APOE4-linked Alzheimer disease. Nat Rev Drug Discov 22:15-15\nArticle\nPubMed\nCAS\nGoogle Scholar\n- Knopman DS, Amieva H, Petersen RC, Chételat G, Holtzman DM, Hyman BT et al (2021) Alzheimer disease. Nat Rev Dis Primers.\nhttps://doi.org/10.1038/s41572-021-00269-y\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n- Kondiles BR, Horner PJ (2018) Myelin plasticity, neural activity, and traumatic neural injury. Dev Neurobiol 78:108-122\nArticle\nPubMed\nGoogle Scholar\n- Koutsodendris N, Blumenfeld J, Agrawal A, Traglia M, Grone B, Zilberter M et al (2023) Neuronal APOE4 removal protects against tau-mediated gliosis, neurodegeneration and myelin deficits. Nat Aging 3:275-296\nArticle\nPubMed\nPubMed Central\nCAS\nGoogle Scholar\n- Kovacs GG, Ferrer I, Grinberg LT, Alafuzoff I, Attems J, Budka H et al (2016) Aging-related tau astrogliopathy (ARTAG): harmonized evaluation strategy. Acta Neuropathol 131:87-102\nArticle\nPubMed\nCAS\nGoogle Scholar\n- Kovacs GG (2018) Understanding the relevance of aging-related tau astrogliopathy (ARTAG). Neuroglia. Multidisciplinary Digital Publishing Institute (MDPI); p 339-50\n- Kumashiro M, Izumi Y, Matsuo K (2021) Conformation of myelin basic protein bound to phosphatidylinositol membrane characterized by vacuum-ultraviolet circular-dichroism spectroscopy and molecular-dynamics simulations. Proteins: Struct, Function Bioinforma 89:1251-61\nArticle\nCAS\nGoogle Scholar", "doc_items_refs": ["#/texts/830", "#/texts/831", "#/texts/832", "#/texts/833", "#/texts/834", "#/texts/835", "#/texts/836", "#/texts/837"], "page_nos": [], "uuid": "1d1b597a-5955-4973-8a19-5192e1c02ec2"}
{"doc_id": "2025__Emerging_Role_of_Oligodendrocytes_Malfunction_in_the_Progression_of_Alzheimers_D__W4413865689", "source_path": "<redacted:source_path>", "chunk_id": 47, "source_chunk_idxs": [53], "num_tokens": 492, "text": "Emerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nReferences\n- Lau LW, Cua R, Keough MB, Haylock-Jacobs S, Yong VW (2013) Pathophysiology of the brain extracellular matrix: a new target for remyelination. Nat Rev Neurosci 14:722-729\nArticle\nPubMed\nCAS\nGoogle Scholar\n- Lee SH, Rezzonico MG, Friedman BA, Huntley MH, Meilandt WJ, Pandey S et al (2021) TREM2-independent oligodendrocyte, astrocyte, and T cell responses to tau and amyloid pathology in mouse models of Alzheimer disease. Cell Rep.\nhttps://doi.org/10.1016/j.celrep.2021.110158\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n- Leng F, Edison P (2021) Neuroinflammation and microglial activation in Alzheimer disease: where do we go from here? Nat Rev Neurol [Internet]. 17:157-72. Available from:\nhttps://www.nature.com/articles/s41582-020-00435-y\n- Li W, Tang Y, Fan Z, Meng Y, Yang G, Luo J et al (2013) Autophagy is involved in oligodendroglial precursor-mediated clearance of amyloid peptide. Mol Neurodegener.\nhttps://doi.org/10.1186/1750-1326-8-27\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n- Li X, Zhang J, Li D, He C, He K, Xue T et al (2021) Astrocytic ApoE reprograms neuronal cholesterol metabolism and histone-acetylation-mediated memory. Neuron 109:957-970.e8\nArticle\nPubMed\nCAS\nGoogle Scholar\n- Li TR, Li BL, Xu XR, Zhong J, Wang TS, Liu FQ (2024) Association of white matter hyperintensities with cognitive decline and neurodegeneration. Front Aging Neurosci.\nhttps://doi.org/10.3389/fnagi.2024.1412735\nArticle\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/838", "#/texts/839", "#/texts/840", "#/texts/841", "#/texts/842", "#/texts/843"], "page_nos": [], "uuid": "c419eb34-e27f-46c3-817b-add473305a30"}
{"doc_id": "2025__Emerging_Role_of_Oligodendrocytes_Malfunction_in_the_Progression_of_Alzheimers_D__W4413865689", "source_path": "<redacted:source_path>", "chunk_id": 48, "source_chunk_idxs": [54], "num_tokens": 495, "text": "Emerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nReferences\n- Li Z, Martens YA, Ren Y, Jin Y, Sekiya H, Doss SV et al (2025) APOE genotype determines cell-type-specific pathological landscape of Alzheimer's disease. Neuron 113:1380-1397.e7\nArticle\nPubMed\nCAS\nGoogle Scholar\n- Licastro F, Campbell IL, Kincaid C, Veinbergs I, Van Uden E, Rockenstein E et al (1999) A role for apoE in regulating the levels of α-1-antichymotrypsin in the aging mouse brain and in Alzheimer's disease. Am J Pathol 155:869-875\nArticle\nPubMed\nPubMed Central\nCAS\nGoogle Scholar\n- Liddelow SA, Barres BA (2017) Reactive astrocytes: production, function, and therapeutic potential. Immunity 46:957-967\nArticle\nPubMed\nCAS\nGoogle Scholar\n- Litvinchuk A, Suh JH, Guo JL, Lin K, Davis SS, Bien-Ly N et al (2024) Amelioration of tau and ApoE4-linked glial lipid accumulation and neurodegeneration with an LXR agonist. Neuron 112:384-403.e8\nArticle\nPubMed\nCAS\nGoogle Scholar\n- Liu PP, Xie Y, Meng XY, Kang JS (2019) History and progress of hypotheses and clinical trials for alzheimer's disease. Signal Transduct Target Ther. Springer Nature\n- Maitre M, Jeltsch-David H, Okechukwu NG, Klein C, Patte-Mensah C, Mensah-Nyagan AG (2023) Myelin in Alzheimer's disease: culprit or bystander? Acta Neuropathol Commun. BioMed Central Ltd\n- Majumder M, Dutta D (2024) Oligodendrocyte Dysfunction in Tauopathy: A Less Explored Area in Tau-Mediated Neurodegeneration. Multidisciplinary Digital Publishing Institute (MDPI), Cells\nGoogle Scholar\n- Matsuda S, Matsuda Y, D'Adamio L (2009) CD74 interacts with APP and suppresses the production of A. Mol Neurodegener. 4", "doc_items_refs": ["#/texts/844", "#/texts/845", "#/texts/846", "#/texts/847", "#/texts/848", "#/texts/849", "#/texts/850", "#/texts/851"], "page_nos": [], "uuid": "c9492f58-7d43-4a4b-855b-f5c5a31a7ac6"}
{"doc_id": "2025__Emerging_Role_of_Oligodendrocytes_Malfunction_in_the_Progression_of_Alzheimers_D__W4413865689", "source_path": "<redacted:source_path>", "chunk_id": 49, "source_chunk_idxs": [55], "num_tokens": 470, "text": "Emerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nReferences\n- Maurer K, Volk S, Gerbaldo H (1997) Auguste D and Alzheimer's disease. The Lancet 349:1546-1549\nArticle\nCAS\nGoogle Scholar\n- McKerracher L, David S, Jackson DL, Kottis V, Dunn RJ, Braun PE (1994) Identification of myelin-associated glycoprotein as a major myelin-derived inhibitor of neurite growth. Neuron 13:805-811\nArticle\nPubMed\nCAS\nGoogle Scholar\n- McNamara NB, Munro DAD, Bestard-Cuche N, Uyeda A, Bogie JFJ, Hoffmann A et al (2023) Microglia regulate central nervous system myelin growth and integrity. Nature 613:120-129\nArticle\nPubMed\nCAS\nGoogle Scholar\n- Mi S, Lee X, Shao Z, Thill G, Ji B, Relton J et al (2004) LINGO-1 is a component of the Nogo-66 receptor/p75 signaling complex. Nat Neurosci 7:221-228\nArticle\nPubMed\nCAS\nGoogle Scholar\n- Mi S, Miller RH, Lee X, Scott ML, Shulag-Morskaya S, Shao Z et al (2005) Lingo-1 negatively regulates myelination by oligodendrocytes. Nat Neurosci 8:745-751\nArticle\nPubMed\nCAS\nGoogle Scholar\n- Mi S, Sandrock A, Miller RH (2008) LINGO-1 and its role in CNS repair. Int J Biochem Cell Biol 40:1971-1978\nArticle\nPubMed\nCAS\nGoogle Scholar\n- Mok KKS, Yeung SHS, Cheng GWY, Ma IWT, Lee RHS, Herrup K et al (2023) Apolipoprotein E ε4 disrupts oligodendrocyte differentiation by interfering with astrocyte-derived lipid transport. J Neurochem 165:55-75\nArticle\nPubMed\nCAS\nGoogle Scholar\n- Monterey MD, Wei H, Wu X, Wu JQ (2021) The many faces of astrocytes in Alzheimer's Disease. Front Neurol Frontiers Media S.A", "doc_items_refs": ["#/texts/852", "#/texts/853", "#/texts/854", "#/texts/855", "#/texts/856", "#/texts/857", "#/texts/858", "#/texts/859"], "page_nos": [], "uuid": "d816fd76-7983-49c9-bb75-9ea5828cbb05"}
{"doc_id": "2025__Emerging_Role_of_Oligodendrocytes_Malfunction_in_the_Progression_of_Alzheimers_D__W4413865689", "source_path": "<redacted:source_path>", "chunk_id": 50, "source_chunk_idxs": [56], "num_tokens": 494, "text": "Emerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nReferences\n- Müller C, Bauer NM, Schäfer I, White R (2013) Making myelin basic protein -from mRNA transport to localized translation. Front Cell Neurosci.\nhttps://doi.org/10.3389/fncel.2013.00169\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n- Murphy MP, LeVine H (2010) Alzheimer's disease and the amyloid-β peptide. J Alzheimers Dis 19:311-323\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n- Nair A, Frederick TJ, Miller SD (2008) Astrocytes in multiple sclerosis: a product of their environment. Cell Mol Life Sci 65:2702\nArticle\nPubMed\nPubMed Central\nCAS\nGoogle Scholar\n- Nasrabady SE, Rizvi B, Goldman JE, Brickman AM (2018) White matter changes in Alzheimer's disease: a focus on myelin and oligodendrocytes. Acta Neuropathol Commun.\nhttps://doi.org/10.1186/s40478-018-0515-3\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n- Nawaz S, Kippert A, Saab AS, Werner HB, Lang T, Nave KA et al (2009) Phosphatidylinositol 4,5-bisphosphate-dependent interaction of myelin basic protein with the plasma membrane in oligodendroglial cells and its rapid perturbation by elevated calcium. J Neurosci 29:4794-4807\nArticle\nPubMed\nPubMed Central\nCAS\nGoogle Scholar\n- Neely SA, Williamson JM, Klingseisen A, Zoupi L, Early JJ, Williams A et al (2022) New oligodendrocytes exhibit more abundant and accurate myelin regeneration than those that survive demyelination. Nat Neurosci 25:415-420\nArticle\nPubMed\nPubMed Central\nCAS\nGoogle Scholar\n- Nielsen HM, Ek D, Avdic U, Orbjörn C, Hansson O, Netherlands T et al (2013) NG2 cells, a new trail for Alzheimer's disease mechanisms? [Internet]. Available from:\nhttp://www.actaneurocomms.org/content/1/1/7", "doc_items_refs": ["#/texts/860", "#/texts/861", "#/texts/862", "#/texts/863", "#/texts/864", "#/texts/865", "#/texts/866"], "page_nos": [], "uuid": "0db9daeb-9340-4433-ae25-d6d7abfbc575"}
{"doc_id": "2025__Emerging_Role_of_Oligodendrocytes_Malfunction_in_the_Progression_of_Alzheimers_D__W4413865689", "source_path": "<redacted:source_path>", "chunk_id": 51, "source_chunk_idxs": [57], "num_tokens": 452, "text": "Emerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nReferences\n- Nihonmatsu-Kikuchi N, Yu XJ, Matsuda Y, Ozawa N, Ito T, Satou K et al (2021) Essential roles of plexin-B3+ oligodendrocyte precursor cells in the pathogenesis of Alzheimer's disease. Commun Biol.\nhttps://doi.org/10.1038/s42003-021-02404-7\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n- Nishiyama A, Komitova M, Suzuki R, Zhu X (2009) Polydendrocytes (NG2 cells): multifunctional cells with lineage plasticity. Nat Rev Neurosci 10:9-22\nArticle\nPubMed\nCAS\nGoogle Scholar\n- Niu J, Tsai H-H, Hoi KK, Huang N, Yu G, Kim K et al (2019) Aberrant oligodendroglial-vascular interactions disrupt the blood-brain barrier, triggering CNS inflammation. Nat Neurosci 22:709-718\nArticle\nPubMed\nPubMed Central\nCAS\nGoogle Scholar\n- Norton WT, Poduslo SE (1973) Myelination in rat brain: changes in myelin composition during brain maturation\n1\n. J Neurochem 21:759-773\nArticle\nPubMed\nCAS\nGoogle Scholar\n- Osanai Y, Yamazaki R, Shinohara Y, Ohno N (2022) Heterogeneity and regulation of oligodendrocyte morphology. Front Cell Dev Biol.\nhttps://doi.org/10.3389/fcell.2022.1030486\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n- Ou-Yang M-H, Van Nostrand WE (2013) The absence of myelin basic protein promotes neuroinflammation and reduces amyloid β-protein accumulation in Tg-5xFAD mice [Internet]. Available from:\nhttp://www.jneuroinflammation.com/content/10/1/134", "doc_items_refs": ["#/texts/867", "#/texts/868", "#/texts/869", "#/texts/870", "#/texts/871", "#/texts/872"], "page_nos": [], "uuid": "ceab4606-8d14-4894-b0cd-c5a08d9e90af"}
{"doc_id": "2025__Emerging_Role_of_Oligodendrocytes_Malfunction_in_the_Progression_of_Alzheimers_D__W4413865689", "source_path": "<redacted:source_path>", "chunk_id": 52, "source_chunk_idxs": [58], "num_tokens": 492, "text": "Emerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nReferences\n- Palazuelos J, Klingener M, Aguirre A (2014) TGFβ signaling regulates the timing of CNS myelination by modulating oligodendrocyte progenitor cell cycle exit through SMAD3/4/FoxO1/Sp1. J Neurosci 34:7917-7930\nArticle\nPubMed\nPubMed Central\nCAS\nGoogle Scholar\n- Pandey S, Shen K, Lee SH, Shen YAA, Wang Y, Otero-García M et al (2022) Disease-associated oligodendrocyte responses across neurodegenerative diseases. Cell Rep.\nhttps://doi.org/10.1016/j.celrep.2022.111189\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n- Panitch R, Hu J, Chung J, Zhu C, Meng G, Xia W et al (2021) Integrative brain transcriptome analysis links complement component 4 and HSPA2 to the APOE ε2 protective effect in Alzheimer disease. Mol Psychiatry 26:6054-6064\nArticle\nPubMed\nPubMed Central\nCAS\nGoogle Scholar\n- Park H, Cho B, Kim H, Saito T, Saido TC, Won KJ et al (2023) Single-cell RNA-sequencing identifies disease-associated oligodendrocytes in male APP NL-G-F and 5XFAD mice. Nat Commun.\nhttps://doi.org/10.1038/s41467-023-36519-8\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n- Preman P, Moechars D, Fertan E, Wolfs L, Serneels L, Shah D et al (2024)\nAPOE\nfrom astrocytes restores Alzheimer's Aβ-pathology and DAM-like responses in\nAPOE\ndeficient microglia. EMBO Mol Med 16:3113-3141\nArticle\nPubMed\nPubMed Central\nCAS\nGoogle Scholar\n- Prineas JW, Parratt JDE (2021) Multiple sclerosis: microglia, monocytes, and macrophage-mediated demyelination. J Neuropathol Exp Neurol 80:975-996\nArticle\nPubMed\nPubMed Central\nCAS\nGoogle Scholar", "doc_items_refs": ["#/texts/873", "#/texts/874", "#/texts/875", "#/texts/876", "#/texts/877", "#/texts/878"], "page_nos": [], "uuid": "244ef55d-2ec1-4f8c-b2ff-9f8b5f904491"}
{"doc_id": "2025__Emerging_Role_of_Oligodendrocytes_Malfunction_in_the_Progression_of_Alzheimers_D__W4413865689", "source_path": "<redacted:source_path>", "chunk_id": 53, "source_chunk_idxs": [59], "num_tokens": 502, "text": "Emerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nReferences\n- Qi G, Mi Y, Shi X, Gu H, Brinton RD, Yin F (2021) ApoE4 impairs neuron-astrocyte coupling of fatty acid metabolism. Cell Rep.\nhttps://doi.org/10.1016/j.celrep.2020.108572\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n- Rajani RM, Ellingford R, Hellmuth M, Harris SS, Taso OS, Graykowski D, et al (2024) Selective suppression of oligodendrocyte-derived amyloid beta rescues neuronal dysfunction in Alzheimer's Disease [Internet]. Available from:\nhttp://biorxiv.org/lookup/doi/10.1101/2024.06.21.600003\n- Rawji KS, Mishra MK, Michaels NJ, Rivest S, Stys PK, Yong VW (2016) Immunosenescence of microglia and macrophages: impact on the ageing central nervous system. Brain 139:653-661\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n- Rawji KS, Gonzalez Martinez GA, Sharma A, Franklin RJM (2020) The Role of Astrocytes in Remyelination. Trends Neurosci. Elsevier Ltd p 596-607\n- Rossi SL, Bovenkamp DE (2024) Are oligodendrocytes the missing link in Alzheimer's disease and related dementia research? Mol Neurodegener 19:84\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n- Rubinski A, Dewenter A, Zheng L, Franzmeier N, Stephenson H, Deming Y et al (2024) Florbetapir PET-assessed demyelination is associated with faster tau accumulation in an APOE ε4-dependent manner. Eur J Nucl Med Mol Imaging 51:1035-1049\nArticle\nPubMed\nCAS\nGoogle Scholar\n- Rubio S, Somers V, Fraussen J (2024) The macrophage migration inhibitory factor/CD74 axis in traumatic spinal cord injury: lessons learned from animal and human studies. Eur J Immunol.\nhttps://doi.org/10.1002/eji.202451333\nArticle\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/879", "#/texts/880", "#/texts/881", "#/texts/882", "#/texts/883", "#/texts/884", "#/texts/885"], "page_nos": [], "uuid": "a76f2989-a938-4406-8257-4010021672a9"}
{"doc_id": "2025__Emerging_Role_of_Oligodendrocytes_Malfunction_in_the_Progression_of_Alzheimers_D__W4413865689", "source_path": "<redacted:source_path>", "chunk_id": 54, "source_chunk_idxs": [60], "num_tokens": 428, "text": "Emerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nReferences\n- Rusin D, Vahl Becirovic L, Lyszczarz G, Krueger M, Benmamar-Badel A, Vad Mathiesen C et al (2024) Microglia-derived insulin-like growth factor 1 is critical for neurodevelopment. Cells.\nhttps://doi.org/10.3390/cells13020184\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n- Sadick JS, O'Dea MR, Hasel P, Dykstra T, Faustin A, Liddelow SA (2022) Astrocytes and oligodendrocytes undergo subtype-specific transcriptional changes in Alzheimer's disease. Neuron 110:1788-1805.e10\nArticle\nPubMed\nPubMed Central\nCAS\nGoogle Scholar\n- Sadigh-Eteghad S, Sabermarouf B, Majdi A, Talebi M, Farhoudi M, Mahmoudi J (2015) Amyloid-beta: a crucial factor in Alzheimer's disease. Med Princ Pract 24:1-10\nArticle\nPubMed\nGoogle Scholar\n- Sanfilippo C, Castrogiovanni P, Imbesi R, Vecchio M, Sortino M, Musumeci G et al (2025) Exploring SERPINA3 as a neuroinflammatory modulator in Alzheimer's disease with sex and regional brain variations. Metab Brain Dis.\nhttps://doi.org/10.1007/s11011-024-01523-4\nArticle\nPubMed\nGoogle Scholar\n- Sasmita AO, Depp C, Nazarenko T, Sun T, Siems SB, Ong EC et al (2024) Oligodendrocytes produce amyloid-β and contribute to plaque formation alongside neurons in Alzheimer's disease model mice. Nat Neurosci 27:1668-1674\nArticle\nPubMed\nPubMed Central\nCAS\nGoogle Scholar", "doc_items_refs": ["#/texts/886", "#/texts/887", "#/texts/888", "#/texts/889", "#/texts/890"], "page_nos": [], "uuid": "57075e8f-edde-4098-abe5-4fc0342a1d60"}
{"doc_id": "2025__Emerging_Role_of_Oligodendrocytes_Malfunction_in_the_Progression_of_Alzheimers_D__W4413865689", "source_path": "<redacted:source_path>", "chunk_id": 55, "source_chunk_idxs": [61], "num_tokens": 441, "text": "Emerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nReferences\n- Sasmita AO, Depp C, Nazarenko T, Sun T, Siems SB, Yu X et al (2023) Oligodendrocytes and neurons contribute to amyloid-β deposition in Alzheimer's disease [Internet]. Available from:\nhttp://biorxiv.org/lookup/doi/10.1101/2023.12.11.570514\n- Seo JH, Maki T, Maeda M, Miyamoto N, Liang AC, Hayakawa K et al (2014) Oligodendrocyte precursor cells support blood-brain barrier integrity via TGF-β signaling. PLoS ONE 9:e103174\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n- Serrano-Pozo A, Das S, Hyman BT (2021) APOE and Alzheimer's disease: advances in genetics, pathophysiology, and therapeutic approaches. Lancet Neurol. Lancet Publishing Group p 68-80\n- Shao Z, Lee X, Huang G, Sheng G, Henderson CE, Louvard D et al (2017) LINGO-1 regulates oligodendrocyte differentiation through the cytoplasmic gelsolin signaling pathway. J Neurosci 37:3127-3137\nArticle\nPubMed\nPubMed Central\nCAS\nGoogle Scholar\n- Sharp FR, DeCarli CS, Jin LW, Zhan X (2023) White matter injury, cholesterol dysmetabolism, and APP/Abeta dysmetabolism interact to produce Alzheimer's disease (AD) neuropathology: a hypothesis and review. Front Aging Neurosci 15\n- Shi Y, Yamada K, Liddelow SA, Smith ST, Zhao L, Luo W et al (2017) ApoE4 markedly exacerbates tau-mediated neurodegeneration in a mouse model of tauopathy. Nature 549:523-527\nArticle\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/891", "#/texts/892", "#/texts/893", "#/texts/894", "#/texts/895", "#/texts/896"], "page_nos": [], "uuid": "d7f5c44d-d42c-4410-b223-fcaa638e6928"}
{"doc_id": "2025__Emerging_Role_of_Oligodendrocytes_Malfunction_in_the_Progression_of_Alzheimers_D__W4413865689", "source_path": "<redacted:source_path>", "chunk_id": 56, "source_chunk_idxs": [62], "num_tokens": 508, "text": "Emerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nReferences\n- Shiryaev SA, Savinov AY, Cieplak P, Ratnikov BI, Motamedchaboki K, Smith JW et al (2009) Matrix metalloproteinase proteolysis of the myelin basic protein isoforms is a source of immunogenic peptides in autoimmune multiple sclerosis. PLoS ONE 4:e4952\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n- Silver J, Miller JH (2004) Regeneration beyond the glial scar. Nat Rev Neurosci 5:146-156\nArticle\nPubMed\nCAS\nGoogle Scholar\n- Simons M, Gibson EM, Nave K-A (2024) Oligodendrocytes: myelination, plasticity, and axonal support. Cold Spring Harb Perspect Biol 16:a041359\nArticle\nPubMed\nCAS\nGoogle Scholar\n- Singh D (2022) Astrocytic and microglial cells as the modulators of neuroinflammation in Alzheimer's disease. J Neuroinflammation [Internet]. 19:206. Available from:\nhttps://jneuroinflammation.biomedcentral.com/articles/10.1186/s12974-022-02565-0\n- Skaper SD (2019) Oligodendrocyte precursor cells as a therapeutic target for demyelinating diseases. p 119-44\n- Sock E, Wegner M (2019) Transcriptional control of myelination and remyelination. Glia 67:2153-2165\nArticle\nPubMed\nGoogle Scholar\n- Strobel Gabrielle. Early Onset Familial AD. What Is Early Onset Familial Alzheimer Disease (eFAD)?\n- Stadelmann C, Timmler S, Barrantes-Freer A, Simons M (2019) Myelin in the central nervous system: structure, function, and pathology. Physiol Rev 99:1381-1431\nArticle\nPubMed\nCAS\nGoogle Scholar\n- Stokin GB, Lillo C, Falzone TL, Brusch RG, Rockenstein E, Mount SL et al (1979) Axonopathy and transport deficits early in the pathogenesis of Alzheimer's disease. Science 2005(307):1282-1288\nGoogle Scholar", "doc_items_refs": ["#/texts/897", "#/texts/898", "#/texts/899", "#/texts/900", "#/texts/901", "#/texts/902", "#/texts/903", "#/texts/904", "#/texts/905"], "page_nos": [], "uuid": "91642f0b-9738-474a-bea8-a52f5c43afa2"}
{"doc_id": "2025__Emerging_Role_of_Oligodendrocytes_Malfunction_in_the_Progression_of_Alzheimers_D__W4413865689", "source_path": "<redacted:source_path>", "chunk_id": 57, "source_chunk_idxs": [63], "num_tokens": 487, "text": "Emerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nReferences\n- Talwar P, Sinha J, Grover S, Rawat C, Kushwaha S, Agarwal R et al (2016) Dissecting complex and multifactorial nature of Alzheimer's Disease pathogenesis: a clinical, genomic, and systems biology perspective. Mol Neurobiol. Humana Press Inc p 4833-64\n- Theophanous S, Sargiannidou I, Kleopa KA (2024) Glial cells as key regulators in neuroinflammatory mechanisms associated with multiple sclerosis. Int J Mol Sci. Multidisciplinary Digital Publishing Institute (MDPI)\n- Tiane A, Schepers M, Rombaut B, Hupperts R, Prickaerts J, Hellings N et al (2019) From OPC to oligodendrocyte: an epigenetic journey. Cells. MDPI\n- Tiwari A, Pradhan S, Sannigrahi A, Mahakud AK, Jha S, Chattopadhyay K et al (2023) Interplay of lipid head group and packing defects in driving amyloid-beta-mediated myelin-like model membrane deformation. J Biol Chem.\nhttps://doi.org/10.1016/j.jbc.2023.104653\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n- Torii T, Miyamoto Y, Nakata R, Higashi Y, Shinmyo Y, Kawasaki H et al (2023) Identification of Tau protein as a novel marker for maturation and pathological changes of oligodendrocytes. Glia 71:1002-1017\nArticle\nPubMed\nCAS\nGoogle Scholar\n- Traiffort E, Kassoussi A, Zahaf A, Laouarem Y (2020) Astrocytes and microglia as major players of myelin production in normal and pathological conditions. Front Cell Neurosci. Frontiers Media S.A.\n- Trouw LA, Blom AM, Gasque P (2008) Role of complement and complement regulators in the removal of apoptotic cells. Mol Immunol 45:1199-1207\nArticle\nPubMed\nCAS\nGoogle Scholar", "doc_items_refs": ["#/texts/906", "#/texts/907", "#/texts/908", "#/texts/909", "#/texts/910", "#/texts/911", "#/texts/912"], "page_nos": [], "uuid": "d14477b6-2420-4cc9-890b-13b7768f78f2"}
{"doc_id": "2025__Emerging_Role_of_Oligodendrocytes_Malfunction_in_the_Progression_of_Alzheimers_D__W4413865689", "source_path": "<redacted:source_path>", "chunk_id": 58, "source_chunk_idxs": [64], "num_tokens": 490, "text": "Emerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nReferences\n- Valihrach L, Matusova Z, Zucha D, Klassen R, Benesova S, Abaffy P et al (2022) Recent advances in deciphering oligodendrocyte heterogeneity with single-cell transcriptomics. Front Cell Neurosci.\nhttps://doi.org/10.3389/fncel.2022.1025012\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n- Vanzulli I, Papanikolaou M, De-La-Rocha IC, Pieropan F, Rivera AD, Gomez-Nicola D et al (2020) Disruption of oligodendrocyte progenitor cells is an early sign of pathology in the triple transgenic mouse model of Alzheimer's disease. Neurobiol Aging 94:130-139\nArticle\nPubMed\nPubMed Central\nCAS\nGoogle Scholar\n- Varma VR, Büşra Lüleci H, Oommen AM, Varma S, Blackshear CT, Griswold ME et al (2021) Abnormal brain cholesterol homeostasis in Alzheimer's disease-a targeted metabolomic and transcriptomic study. NPJ Aging Mech Dis 7\n- Verkhratsky A, Butt A, Li B, Illes P, Zorec R, Semyanov A et al (2023) Astrocytes in human central nervous system diseases: a frontier for new therapies. Signal Transduct Target Ther 8:396\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n- von Bartheld CS, Bahney J, Herculano-Houzel S (2016) The search for true numbers of neurons and glial cells in the human brain: a review of 150 years of cell counting. J Comp Neurol 524:3865-3895\nArticle\nGoogle Scholar\n- Wang Y, Cheng X, He Q, Zheng Y, Kim DH, Whittemore SR et al (2011) Astrocytes from the contused spinal cord inhibit oligodendrocyte differentiation of adult oligodendrocyte precursor cells by increasing the expression of bone morphogenetic proteins. J Neurosci 31:6053-6058\nArticle\nPubMed\nPubMed Central\nCAS\nGoogle Scholar", "doc_items_refs": ["#/texts/913", "#/texts/914", "#/texts/915", "#/texts/916", "#/texts/917", "#/texts/918"], "page_nos": [], "uuid": "be8a5f2b-fd03-4bc5-9cbe-3a8e28feac71"}
{"doc_id": "2025__Emerging_Role_of_Oligodendrocytes_Malfunction_in_the_Progression_of_Alzheimers_D__W4413865689", "source_path": "<redacted:source_path>", "chunk_id": 59, "source_chunk_idxs": [65], "num_tokens": 446, "text": "Emerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nReferences\n- Wang J, Qin X, Sun H, He M, Lv Q, Gao C et al (2021) Nogo receptor impairs the clearance of fibril amyloid-β by microglia and accelerates Alzheimer's-like disease progression. Aging Cell.\nhttps://doi.org/10.1111/acel.13515\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n- Wang SS, Zhang Z, Zhu TB, Chu SF, He W Bin, Chen NH (2018) Myelin injury in the central nervous system and Alzheimer's disease. Brain Res Bull. Elsevier Inc. p 162-8\n- World Health Organization (2022) A blueprint for dementia research. World Health Organization, Geneva\nGoogle Scholar\n- Wu Y-T, Beiser AS, Breteler MMB, Fratiglioni L, Helmer C, Hendrie HC et al (2017a) The changing prevalence and incidence of dementia over time - current evidence. Nat Rev Neurol 13:327-339\nArticle\nPubMed\nGoogle Scholar\n- Wu Y, Ma Y, Liu Z, Geng Q, Chen Z, Zhang Y (2017b) Alterations of myelin morphology and oligodendrocyte development in early stage of Alzheimer's disease mouse model. Neurosci Lett 642:102-106\nArticle\nPubMed\nCAS\nGoogle Scholar\n- Wu D, Tang X, Gu LH, Li XL, Qi XY, Bai F et al (2018) LINGO-1 antibody ameliorates myelin impairment and spatial memory deficits in the early stage of 5XFAD mice. CNS Neurosci Ther 24:381-393\nArticle\nPubMed\nPubMed Central\nCAS\nGoogle Scholar\n- Wu C, Zou P, Zhu L, Feng S, Deng Q, Liu TC-Y et al (2025) Treadmill exercise mitigates alzheimer's pathology by modulating glial polarization and reducing oligodendrocyte precursor cell perivascular clustering. Med Sci Sports Exerc", "doc_items_refs": ["#/texts/919", "#/texts/920", "#/texts/921", "#/texts/922", "#/texts/923", "#/texts/924", "#/texts/925"], "page_nos": [], "uuid": "73994d33-6989-404f-9518-026c1fb496c3"}
{"doc_id": "2025__Emerging_Role_of_Oligodendrocytes_Malfunction_in_the_Progression_of_Alzheimers_D__W4413865689", "source_path": "<redacted:source_path>", "chunk_id": 60, "source_chunk_idxs": [66], "num_tokens": 500, "text": "Emerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nReferences\n- Xu X, Zhang C, Tang G, Wang N, Feng Y (2024) Single-cell transcriptome profiling highlights the role of APP in blood vessels in assessing the risk of patients with proliferative diabetic retinopathy developing Alzheimer's disease. Front Cell Dev Biol.\nhttps://doi.org/10.3389/fcell.2023.1328979\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n- Yang H, Jiang L, Zhang Y, Liang X, Tang J, He Q et al (2022) Anti-LINGO-1 antibody treatment alleviates cognitive deficits and promotes maturation of oligodendrocytes in the hippocampus of APP/PS1 mice. J Comp Neurol 530:1606-1621\nArticle\nPubMed\nCAS\nGoogle Scholar\n- Yu C, Takeda M, Soliven B (2000) Regulation of cell cycle proteins by TNF-a and TGF-b in cells of oligodendroglial lineage [Internet]. J Neuroimmunol. Available from:\nwww.elsevier.com/locate/jneuroin\n- Zattoni M, Mearelli M, Vanni S, Colini Baldeschi A, Tran TH, Ferracin C et al (2022) Serpin signatures in prion and Alzheimer's diseases. Mol Neurobiol 59:3778-3799\nArticle\nPubMed\nPubMed Central\nCAS\nGoogle Scholar\n- Zhan X, Jickling GC, Ander BP, Stamova B, Liu D, Kao PF et al (2015) Myelin basic protein associates with AβPP, Aβ1-42, and amyloid plaques in cortex of Alzheimer's disease brain. J Alzheimers Dis 44:1213-1229\nArticle\nPubMed\nPubMed Central\nCAS\nGoogle Scholar\n- Zhang P, Kishimoto Y, Grammatikakis I, Gottimukkala K, Cutler RG, Zhang S et al (2019) Senolytic therapy alleviates Aβ-associated oligodendrocyte progenitor cell senescence and cognitive deficits in an Alzheimer's disease model. Nat Neurosci 22:719-728\nArticle\nPubMed\nPubMed Central\nCAS\nGoogle Scholar", "doc_items_refs": ["#/texts/926", "#/texts/927", "#/texts/928", "#/texts/929", "#/texts/930", "#/texts/931"], "page_nos": [], "uuid": "8bd23992-5595-4f56-a83b-53acf6f9ff96"}
{"doc_id": "2025__Emerging_Role_of_Oligodendrocytes_Malfunction_in_the_Progression_of_Alzheimers_D__W4413865689", "source_path": "<redacted:source_path>", "chunk_id": 61, "source_chunk_idxs": [67], "num_tokens": 503, "text": "Emerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nReferences\n- Zhang X, Wang R, Hu D, Sun X, Fujioka H, Lundberg K et al (2020) Oligodendroglial glycolytic stress triggers inflammasome activation and neuropathology in Alzheimer's disease [Internet]. Sci Adv. Available from:\nhttps://www.science.org\n- Zhang J, Zhang Y, Wang J, Xia Y, Zhang J, Chen L (2024) Recent advances in Alzheimer's disease: mechanisms, clinical trials and new drug development strategies. Signal Transduct Target Ther. Springer Nature\n- Zhang Y, Wang Z, Xu F, Liu Z, Zhao Y, Yang LZ et al (2024) Progress of Astrocyte-Neuron Crosstalk in Central Nervous System Diseases. Neurochem Res. Springer\n- Zhao N, Ren Y, Yamazaki Y, Qiao W, Li F, Felton LM et al (2020) Alzheimer's risk factors age, APOE genotype, and sex drive distinct molecular pathways. Neuron 106:727-742.e6\nArticle\nPubMed\nPubMed Central\nCAS\nGoogle Scholar\n- Zheng H, Cheng B, Li Y, Li X, Chen X, Zhang YW (2018) TREM2 in Alzheimer's Disease: Microglial Survival and Energy Metabolism. Front Aging Neurosci. Frontiers Media S.A\n- Zhou Y, Song WM, Andhey PS, Swain A, Levy T, Miller KR et al (2020) Human and mouse single-nucleus transcriptomics reveal TREM2-dependent and TREM2-independent cellular responses in Alzheimer's disease. Nat Med 26:131-142\nArticle\nPubMed\nPubMed Central\nCAS\nGoogle Scholar\n- Zhou Z-D, Sathiyamoorthy S, Tan E-K (2012) Review LINGO-1 and neurodegeneration: pathophysiologic clues for essential tremor? [Internet]. Available from:\nhttp://tremorjournal.org/article/view/51\n- Zota I, Chanoumidou K, Gravanis A, Charalampopoulos I (2024) Stimulating myelin restoration with BDNF: a promising therapeutic approach for Alzheimer's disease. Front Cell Neurosci. Frontiers Media SA", "doc_items_refs": ["#/texts/932", "#/texts/933", "#/texts/934", "#/texts/935", "#/texts/936", "#/texts/937", "#/texts/938", "#/texts/939"], "page_nos": [], "uuid": "912f77a2-6c41-4d32-9c8d-7688dd834270"}
{"doc_id": "2025__Emerging_Role_of_Oligodendrocytes_Malfunction_in_the_Progression_of_Alzheimers_D__W4413865689", "source_path": "<redacted:source_path>", "chunk_id": 62, "source_chunk_idxs": [68, 69, 70, 71], "num_tokens": 324, "text": "Emerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nReferences\n- Zou P, Wu C, Liu TCY, Duan R, Yang L (2023) Oligodendrocyte progenitor cells in Alzheimer's disease: from physiology to pathology. Transl Neurodegener. BioMed Central Ltd\n- Zuchero JB, Barres BA (2013) Intrinsic and extrinsic control of oligodendrocyte development. Curr Opin Neurobiol 23:914-920\nArticle\nPubMed\nPubMed Central\nCAS\nGoogle Scholar\nDownload references\n\nEmerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nAcknowledgements\nDeclared none.\n\nEmerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nFunding\nThis work was supported by statutory funds of the Department of Experimental Neuroendocrinology PAS.\n\nEmerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nAuthor information\nAuthors and Affiliations\n1. Immunoenocrinology Laboratory, Department of Experimental Neuroendocrinology, Maj Institute of Pharmacology, Polish Academy of Sciences, 12 Smętna St. 31-343, Kraków, Poland Kinga Tylek &amp; Agnieszka Basta-Kaim\nAuthors\n1. Kinga Tylek\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n2. Agnieszka Basta-Kaim\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/940", "#/texts/941", "#/texts/942", "#/texts/944", "#/texts/946", "#/texts/949", "#/texts/950", "#/texts/951", "#/texts/952"], "page_nos": [], "uuid": "3135df0f-aa48-4fd3-b960-2edaca636815"}
{"doc_id": "2025__Emerging_Role_of_Oligodendrocytes_Malfunction_in_the_Progression_of_Alzheimers_D__W4413865689", "source_path": "<redacted:source_path>", "chunk_id": 63, "source_chunk_idxs": [72, 73, 74], "num_tokens": 326, "text": "Emerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nAuthor information\nContributions\nConceptualization: Agnieszka Basta-Kaim; Literature search and analysis: Kinga Tylek and Agnieszka Basta-Kaim; Manuscript writing - original draft preparation: Kinga Tylek; Manuscript writing - review and editing: Agnieszka Basta-Kaim; Visualization (figures, tables, graphical abstract): Kinga Tylek; Supervision: Agnieszka Basta Kaim. All authors reviewed the manuscript.\n\nEmerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nAuthor information\nCorresponding author\nCorrespondence to\nAgnieszka Basta-Kaim\n.\n\nEmerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nEthics declarations\nConsent for Publication\nThe graphical illustrations included in this publication were created by Kinga Tylek using BioRender. The author holds a BioRender license (License No. BG27ZVNPKX and PO27ZVNSG0), which permits the publication of presented figures.The graphical abstract was created using Servier Medical Art ([\nhttps://smart.servier.com/\n](\nhttps://smart.servier.com/\n)), licensed under CC BY 4.0 ([\nhttps://creativecommons.org/licenses/by/4.0/\n](\nhttps://creativecommons.org/licenses/by/4.0/\n)).", "doc_items_refs": ["#/texts/954", "#/texts/956", "#/texts/957", "#/texts/958", "#/texts/961", "#/texts/962", "#/texts/963", "#/texts/964", "#/texts/965", "#/texts/966", "#/texts/967", "#/texts/968", "#/texts/969"], "page_nos": [], "uuid": "0452609f-3a7a-4286-9efb-d29aebea3de5"}
{"doc_id": "2025__Emerging_Role_of_Oligodendrocytes_Malfunction_in_the_Progression_of_Alzheimers_D__W4413865689", "source_path": "<redacted:source_path>", "chunk_id": 64, "source_chunk_idxs": [75, 76, 77], "num_tokens": 314, "text": "Emerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nEthics declarations\nConflict of interest\nThe authors declare no competing interests.\n\nEmerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nAdditional information\nPublisher's Note\nSpringer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations.\n\nEmerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nRights and permissions\nOpen Access\nThis article is licensed under a Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International License, which permits any non-commercial use, sharing, distribution and reproduction in any medium or format, as long as you give appropriate credit to the original author(s) and the source, provide a link to the Creative Commons licence, and indicate if you modified the licensed material. You do not have permission under this licence to share adapted material derived from this article or parts of it. The images or other third party material in this article are included in the article's Creative Commons licence, unless indicated otherwise in a credit line to the material. If material is not included in the article's Creative Commons licence and your intended use is not permitted by statutory regulation or exceeds the permitted use, you will need to obtain permission directly from the copyright holder. To view a copy of this licence, visit\nhttp://creativecommons.org/licenses/by-nc-nd/4.0/\n.\nReprints and permissions", "doc_items_refs": ["#/texts/971", "#/texts/974", "#/texts/976", "#/texts/977", "#/texts/978", "#/texts/979", "#/texts/980"], "page_nos": [], "uuid": "86fc8ae9-846a-48dd-a7e4-b1a010963446"}
{"doc_id": "2025__Emerging_Role_of_Oligodendrocytes_Malfunction_in_the_Progression_of_Alzheimers_D__W4413865689", "source_path": "<redacted:source_path>", "chunk_id": 65, "source_chunk_idxs": [78, 79, 80, 81, 82, 83, 84, 85], "num_tokens": 501, "text": "Emerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nAbout this article\nCite this article\nTylek, K., Basta-Kaim, A. Emerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease.\nJ Neuroimmune Pharmacol\n20\n, 79 (2025). https://doi.org/10.1007/s11481-025-10236-z\nDownload citation\n- Received : 07 March 2025\n- Accepted : 10 August 2025\n- Published : 01 September 2025\n- DOI : https://doi.org/10.1007/s11481-025-10236-z\n\nEmerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nAbout this article\nKeywords\n- Alzheimer's Disease (AD)\n- Oligodendrocytes (OL)\n- Myelin\n- Oligodendrocytes progenitor cells (OPC)\n- Amyloid-beta (Aβ)\n- Neuroinflammation\nUse our pre-submission checklist\nAvoid common mistakes on your manuscript.\nAdvertisement\n\nEmerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nSearch\nSearch by keyword or author\nSearch\n\nEmerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nNavigation\n- Find a journal\n- Publish with us\n- Track your research\n\nEmerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nNavigation\nDiscover content\n- Journals A-Z\n- Books A-Z\n\nEmerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nNavigation\nPublish with us\n- Journal finder\n- Publish your research\n- Language editing\n- Open access publishing\n\nEmerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nNavigation\nProducts and services\n- Our products\n- Librarians\n- Societies\n- Partners and advertisers\n\nEmerging Role of Oligodendrocytes Malfunction in the Progression of Alzheimer's Disease\nNavigation\nOur brands\n- Springer\n- Nature Portfolio\n- BMC\n- Palgrave Macmillan\n- Apress\n- Discover\n- Your privacy choices/Manage cookies\n- Your US state privacy rights\n- Accessibility statement\n- Terms and conditions\n- Privacy policy\n- Help and support\n- Legal notice\n- Cancel contracts here\n173.68.96.214\nNot affiliated\nImage Hyperlink.\n© 2025 Springer Nature", "doc_items_refs": ["#/texts/983", "#/texts/984", "#/texts/985", "#/texts/986", "#/texts/987", "#/texts/988", "#/texts/989", "#/texts/990", "#/texts/991", "#/texts/993", "#/texts/994", "#/texts/995", "#/texts/996", "#/texts/997", "#/texts/998", "#/texts/999", "#/texts/1000", "#/texts/1001", "#/texts/1003", "#/texts/1004", "#/texts/1006", "#/texts/1007", "#/texts/1008", "#/texts/1010", "#/texts/1011", "#/texts/1013", "#/texts/1014", "#/texts/1015", "#/texts/1016", "#/texts/1018", "#/texts/1019", "#/texts/1020", "#/texts/1021", "#/texts/1023", "#/texts/1024", "#/texts/1025", "#/texts/1026", "#/texts/1027", "#/texts/1028", "#/texts/1029", "#/texts/1030", "#/texts/1031", "#/texts/1032", "#/texts/1033", "#/texts/1034", "#/texts/1035", "#/texts/1036", "#/texts/1037", "#/texts/1038", "#/texts/1039", "#/texts/1040"], "page_nos": [], "uuid": "af16d9af-ec8d-4355-857e-fe7b9415ced1"}
