{"doc_id": "2025__Are_long-lasting_nonspecific_symptoms_related_to_vitamin_D_deficiency_among_olde__W4411573635", "source_path": "<redacted:source_path>", "chunk_id": 0, "source_chunk_idxs": [0, 1, 2], "num_tokens": 392, "text": "Are long-lasting nonspecific symptoms related to vitamin D deficiency among older adults living in nursing homes? | BMC Geriatrics | Full Text\nSkip to main content\nAdvertisement\nSearch\n- Explore journals\n- Get published\n- About BMC\n- My account\nSearch all BMC articles\nSearch\nBMC Geriatrics\n- Home\n- About\n- Articles\n- Collections\n- Submission Guidelines\n- Join the Editorial Board\n- Submit manuscript\nAre long-lasting nonspecific symptoms related to vitamin D deficiency among older adults living in nursing homes?\nDownload PDF\nDownload PDF\n- Research\n- Open access\n- Published: 24 June 2025\n\nAre long-lasting nonspecific symptoms related to vitamin D deficiency among older adults living in nursing homes?\n- Rebeka Arnljots\n1\n,\n2\n,\n3\n,\n4\n,\n- Egill Snaebjörnsson Arnljots\n1\n,\n2\n,\n3\n,\n4\n,\n- Jörgen Thorn\n2\n,\n5\n,\n- Marie Elm\n6\n,\n- Michael Moore\n7\n&amp;\n- ...\n- Pär-Daniel Sundvall\n1\n,\n2\n,\n8\nShow authors\nBMC Geriatrics\nvolume 25\n, Article number: 428 ( 2025 )\nCite this article\n- 793 Accesses\n- 5 Altmetric\n- Metrics details\n\nAre long-lasting nonspecific symptoms related to vitamin D deficiency among older adults living in nursing homes?\nAbstract\nBackground\nConfusion, restlessness, and fatigue are common among older adults living in nursing homes. These nonspecific symptoms are often treated with antibiotics since they are frequently misinterpreted as urinary tract infections. Therefore, it is crucial to investigate other potential causes of these nonspecific symptoms. Impaired cognitive function in older adults may be associated with vitamin D deficiency and could lead to nonspecific symptoms. Currently, it is unknown whether there is a correlation between nonspecific symptoms, often misinterpreted as acute cystitis, and vitamin D deficiency.", "doc_items_refs": ["#/texts/1", "#/texts/2", "#/texts/3", "#/texts/4", "#/texts/5", "#/texts/6", "#/texts/7", "#/texts/8", "#/texts/9", "#/texts/10", "#/texts/11", "#/texts/12", "#/texts/13", "#/texts/14", "#/texts/15", "#/texts/16", "#/texts/17", "#/texts/18", "#/texts/19", "#/texts/20", "#/texts/21", "#/texts/22", "#/texts/23", "#/texts/25", "#/texts/26", "#/texts/27", "#/texts/28", "#/texts/29", "#/texts/30", "#/texts/31", "#/texts/32", "#/texts/33", "#/texts/34", "#/texts/35", "#/texts/36", "#/texts/37", "#/texts/38", "#/texts/39", "#/texts/42"], "page_nos": [], "uuid": "8b03b05e-1a6a-4332-973d-db619f56148e"}
{"doc_id": "2025__Are_long-lasting_nonspecific_symptoms_related_to_vitamin_D_deficiency_among_olde__W4411573635", "source_path": "<redacted:source_path>", "chunk_id": 1, "source_chunk_idxs": [3, 4], "num_tokens": 368, "text": "Are long-lasting nonspecific symptoms related to vitamin D deficiency among older adults living in nursing homes?\nAbstract\nMethods\nA cross-sectional study in which blood samples were collected from residents of 22 Swedish nursing homes for 25OHD (25-hydroxyvitamin D) analysis. Demographics and presence of nonspecific symptoms, such as: fatigue, restlessness, confusion, aggressiveness, reduced appetite, tendency to fall or a sense of not being oneself as well as symptom duration, were registered. Exclusion criteria: incontinence, dementia too severe to cooperate when taking a blood test, terminally ill or refusing participation. Logistic regressions were performed to determine if nonspecific symptoms persisting ≥ 3 months were associated with vitamin D deficiency.\n\nAre long-lasting nonspecific symptoms related to vitamin D deficiency among older adults living in nursing homes?\nAbstract\nResults\nOut of 901 residents in 22 nursing homes blood samples were taken from 545 participants, of whom 370 (68%) were women. The mean age was 86 years (SD 6.9), and 55% (299/545) had dementia. The prevalence of symptoms persisting ≥ 3 months was: fatigue 49% (268/545), restlessness 50% (270/545), confusion 53% (287/545), agitation/anger 47% (258/545), reduced appetite 45% (247/545), tendency to fall 48% (260/545), and a sense of not being oneself 35% (191/545). The 25OHD concentrations did not differ between various nonspecific symptoms. When adjusting for age, gender and dementia there was no association between any of the nonspecific symptoms and 25OHD.", "doc_items_refs": ["#/texts/44", "#/texts/46"], "page_nos": [], "uuid": "15524a9c-570a-4349-a512-8e353c94ea2c"}
{"doc_id": "2025__Are_long-lasting_nonspecific_symptoms_related_to_vitamin_D_deficiency_among_olde__W4411573635", "source_path": "<redacted:source_path>", "chunk_id": 2, "source_chunk_idxs": [5, 6], "num_tokens": 291, "text": "Are long-lasting nonspecific symptoms related to vitamin D deficiency among older adults living in nursing homes?\nAbstract\nConclusions\nNonspecific symptoms persisting ≥ 3 months and vitamin D deficiency were common among older adults living in nursing homes. However, there was no association between these long-lasting nonspecific symptoms and the concentration of vitamin D. In further research it is important to study other potential causes of nonspecific symptoms in older adults.\nPeer Review reports\n\nAre long-lasting nonspecific symptoms related to vitamin D deficiency among older adults living in nursing homes?\nBackground\nAs the population ages, the healthcare needs of older adults have become an increasingly important focus. Older individuals often present with atypical or nonspecific symptoms when experiencing common health issues, which can complicate diagnosis and treatment [\n1\n,\n2\n]. This is particularly true in older adults living in nursing homes, where frailty, comorbidities, and cognitive decline are prevalent. Nonspecific symptoms, such as confusion or fatigue, may obscure the underlying cause of illness, leading to potential misdiagnosis [\n3\n,\n4\n].\nFurthermore, the rising prevalence of antibiotic resistance has prompted a critical review of how antibiotics are used, particularly in the care of older adults in nursing homes [\n5\n]. As such, there is a growing need to understand and explore other potential explanations for these nonspecific symptoms in this vulnerable population.", "doc_items_refs": ["#/texts/48", "#/texts/49", "#/texts/51", "#/texts/52", "#/texts/53", "#/texts/54", "#/texts/55", "#/texts/56", "#/texts/57", "#/texts/58", "#/texts/59", "#/texts/60", "#/texts/61", "#/texts/62"], "page_nos": [], "uuid": "ecedfe32-13ac-4b7c-a605-66c80294e548"}
{"doc_id": "2025__Are_long-lasting_nonspecific_symptoms_related_to_vitamin_D_deficiency_among_olde__W4411573635", "source_path": "<redacted:source_path>", "chunk_id": 3, "source_chunk_idxs": [7], "num_tokens": 405, "text": "Are long-lasting nonspecific symptoms related to vitamin D deficiency among older adults living in nursing homes?\nBackground\nConfusion, restlessness, and fatigue are common nonspecific symptoms among older adults living in nursing homes [\n1\n,\n2\n] and, in the absence of new symptoms from the urinary tract, often misinterpreted as urinary tract infections (UTIs), leading to unnecessary antibiotic treatment [\n3\n,\n4\n]. This practice increases the risk of selecting antibiotic-resistant bacteria. UTIs are more prevalent among women in nursing homes [\n3\n]. According to international consensus, even in older residents in nursing homes, symptoms from the lower urinary tract should be present to diagnose acute cystitis [\n6\n,\n7\n,\n8\n]. Despite this, few patients treated for suspected UTIs in nursing homes actually exhibit lower urinary tract symptoms [\n9\n,\n10\n]. The diagnosis is instead based on nonspecific symptoms, which are not specific to the urinary tract, such as confusion, restlessness, fatigue, agitation, reduced appetite, tendency to fall, or a sense of not being oneself [\n11\n,\n12\n,\n13\n]. Given the growing problem of antibiotic-resistant bacteria it is important to avoid unnecessary antibiotic use [\n5\n]. Therefore, it is important to investigate alternative explanations for these nonspecific symptoms. Vitamin D deficiency is common among older adults living in nursing homes [\n14\n,\n15\n,\n16\n] and is associated with risk of falls [\n17\n]. It has also been linked to impaired cognitive functions and dementia [\n18\n,\n19\n,\n20\n,\n21\n,\n22\n]. Impaired cognitive function can manifest as nonspecific symptoms, highlighting the importance of investigating whether there is an association between these symptoms, often misinterpreted as UTIs, and vitamin D deficiency.\nThe aim of this study was to determine if nonspecific symptoms among older adults living in nursing homes are associated with vitamin D deficiency.", "doc_items_refs": ["#/texts/63", "#/texts/64", "#/texts/65", "#/texts/66", "#/texts/67", "#/texts/68", "#/texts/69", "#/texts/70", "#/texts/71", "#/texts/72", "#/texts/73", "#/texts/74", "#/texts/75", "#/texts/76", "#/texts/77", "#/texts/78", "#/texts/79", "#/texts/80", "#/texts/81", "#/texts/82", "#/texts/83", "#/texts/84", "#/texts/85", "#/texts/86", "#/texts/87", "#/texts/88", "#/texts/89", "#/texts/90", "#/texts/91", "#/texts/92", "#/texts/93", "#/texts/94", "#/texts/95", "#/texts/96", "#/texts/97", "#/texts/98", "#/texts/99", "#/texts/100", "#/texts/101", "#/texts/102", "#/texts/103", "#/texts/104", "#/texts/105", "#/texts/106", "#/texts/107", "#/texts/108", "#/texts/109", "#/texts/110"], "page_nos": [], "uuid": "a22cd2fa-3264-4e2f-a6db-fa7b5c8acde1"}
{"doc_id": "2025__Are_long-lasting_nonspecific_symptoms_related_to_vitamin_D_deficiency_among_olde__W4411573635", "source_path": "<redacted:source_path>", "chunk_id": 4, "source_chunk_idxs": [8, 9], "num_tokens": 307, "text": "Are long-lasting nonspecific symptoms related to vitamin D deficiency among older adults living in nursing homes?\nMethods\nThis study was part of a larger project, with joint data collection, studying vitamin D deficiency, interleukin-6 concentrations in urine, and antimicrobial resistance in urinary pathogens among residents in Swedish nursing homes [\n1\n,\n21\n,\n23\n]. Throughout the initial three months of 2012, a case report form was filled out, and blood samples were obtained from all eligible residents in 22 nursing homes. These nursing homes were located in two municipalities, both rural and urban, in Region Västra Götaland, southwest Sweden, where almost all the nursing homes participated. The attending nurses were given comprehensive verbal and written instructions regarding the study procedures. The Regional Ethical Review Board of Gothenburg University approved the study (Reference number: 578 − 11).\n\nAre long-lasting nonspecific symptoms related to vitamin D deficiency among older adults living in nursing homes?\nMethods\nInclusion and exclusion criteria\nAll residents permanently residing in the nursing homes for older adults, irrespective of gender or length of stay, were given the opportunity to participate. Inclusion criteria for those who accepted participation were:\n- presence at a nursing home for the older adult during the study\n- residents with dementia if they or their relatives did not object to participation\n- residents with dementia who were able to cooperate during sampling\nThe criteria for exclusion were:\n- residents with severe dementia that hindered collaboration during sampling\n- residents in end-of-life care", "doc_items_refs": ["#/texts/112", "#/texts/113", "#/texts/114", "#/texts/115", "#/texts/116", "#/texts/117", "#/texts/118", "#/texts/120", "#/texts/121", "#/texts/122", "#/texts/123", "#/texts/124", "#/texts/125", "#/texts/126"], "page_nos": [], "uuid": "cc8095c4-fb48-4dc6-80e3-cfb7078eb0b3"}
{"doc_id": "2025__Are_long-lasting_nonspecific_symptoms_related_to_vitamin_D_deficiency_among_olde__W4411573635", "source_path": "<redacted:source_path>", "chunk_id": 5, "source_chunk_idxs": [10, 11], "num_tokens": 305, "text": "Are long-lasting nonspecific symptoms related to vitamin D deficiency among older adults living in nursing homes?\nMethods\nStatement of consent\nAll residents were briefed on the study through both verbal and written communication. For those able to make decisions and opting study participation, informed consent was obtained. However, a significant portion of participants included were individuals with varying degrees of dementia. If a resident lacked the capacity to comprehend the information and, as a result, had diminished decision-making capability, their participation was contingent upon two conditions: no objection to study participation, nor objection from appointed representatives or family members, after being informed about the study. This procedure received approval from the Regional Ethical Review Board of Gothenburg University.\n\nAre long-lasting nonspecific symptoms related to vitamin D deficiency among older adults living in nursing homes?\nMethods\nCase report form\nA scheduled date was established for the collection of blood samples from each participating resident. On the same day, the attending nurse recorded information in the case report form, including age, gender, nursing home/ward, whether the resident had vitamin D supplementation, presence of a diagnosis of dementia, as well as the occurrence and duration of nonspecific symptoms: fatigue, restlessness, confusion, agitation/anger, tendency to fall, and a sense of not being oneself. The diagnosis of dementia in the medical records necessitated a comprehensive assessment, including a detailed medical history, physical examination conducted by a physician, laboratory tests, cognitive function assessment, and, if present, neuroimaging.", "doc_items_refs": ["#/texts/128", "#/texts/130"], "page_nos": [], "uuid": "56281cc3-dcae-451d-8d87-cbb9d90a081d"}
{"doc_id": "2025__Are_long-lasting_nonspecific_symptoms_related_to_vitamin_D_deficiency_among_olde__W4411573635", "source_path": "<redacted:source_path>", "chunk_id": 6, "source_chunk_idxs": [12, 13], "num_tokens": 375, "text": "Are long-lasting nonspecific symptoms related to vitamin D deficiency among older adults living in nursing homes?\nMethods\nLaboratory tests\nAs part of the larger project, the attending nurse obtained blood samples from each participating resident, and the concentrations of 25OHD in these samples were analysed at the accredited clinical chemistry laboratory of Södra Älvsborg Hospital in Borås, Sweden, using standard clinical procedures. The blood samples were cooled before transportation and typically reached the laboratory within 24 h. The measurement of 25OHD concentrations in serum was conducted using the LIAISON\n®\n25 OH Vitamin D TOTAL Assay by DiaSorin Inc., Stillwater, USA. This assay employed chemiluminescent immunoassay (CLIA) technology for the quantitative determination of 25OHD in human serum. The DiaSorin LIAISON\n®\n25 OH Vitamin D assay had a measuring range of 4.0-150 ng/mL.\n\nAre long-lasting nonspecific symptoms related to vitamin D deficiency among older adults living in nursing homes?\nMethods\nStatistical analysis\nThe descriptive statistics illustrated the population and proportion of residents who had experienced each nonspecific symptom for ≥ 3 months, as well as the median regarding the concentration of vitamin D in these groups. Logistic regressions were conducted to examine whether nonspecific symptoms ≥ 3 months were associated with vitamin D deficiency. For each nonspecific symptom a logistic regression analysis was performed with the symptom as the dependent variable, and the independent variables being gender, age, diagnosis of dementia, and vitamin D concentrations as a continuous variable.\nA significance level of\np\nPower calculation was performed with level of significance 0.05, power 95%, and two-tailed hypothesis testing. It was hypothesized that 40% of residents would experience vitamin D deficiency (25OHD", "doc_items_refs": ["#/texts/132", "#/texts/133", "#/texts/134", "#/texts/135", "#/texts/136", "#/texts/138", "#/texts/139", "#/texts/140", "#/texts/142"], "page_nos": [], "uuid": "867a1388-a60c-43fe-9cd1-9c22713f70ba"}
{"doc_id": "2025__Are_long-lasting_nonspecific_symptoms_related_to_vitamin_D_deficiency_among_olde__W4411573635", "source_path": "<redacted:source_path>", "chunk_id": 7, "source_chunk_idxs": [14, 15, 16, 17], "num_tokens": 369, "text": "Are long-lasting nonspecific symptoms related to vitamin D deficiency among older adults living in nursing homes?\nResults\nStudied population\nOut of 901 residents in 22 nursing homes, 836 met the inclusion criteria, and 596/836 (71%) chose to participate. Blood samples were collected, and study forms were completed for 545 residents, of whom 370 (68%) were women and the average age was 86 (SD 6.9). Of the 545 participants, 55% had dementia (Table\n1\n). A detailed description of the studied population has been published previously [\n21\n].\n\nAre long-lasting nonspecific symptoms related to vitamin D deficiency among older adults living in nursing homes?\nResults\nPrevalence of symptoms\nThe prevalence of symptoms persisting ≥ 3 months among the 545 residents were: fatigue 49%, restlessness 50%, confusion 53%, agitation/anger 47%, reduced appetite 45%, tendency to fall 48%, and a sense of not being oneself 35% (Table\n1\n).\n\nAre long-lasting nonspecific symptoms related to vitamin D deficiency among older adults living in nursing homes?\nResults\nSerum 25OHD concentrations\nThe mean concentration of 25OHD in serum for all participants was 34 nmol/L (SD 21, median 27, range 4-125), as previously published [\n21\n]. The 25OHD concentrations did not differ between various nonspecific symptoms (Table\n1\n).\n\nAre long-lasting nonspecific symptoms related to vitamin D deficiency among older adults living in nursing homes?\nResults\nFactors associated with nonspecific symptoms persisting ≥ 3 months\nThere was no association between any of the nonspecific symptoms persisting ≥ 3 months and vitamin D concentrations when adjusting for age, gender, and presence of dementia (Table\n2\n).", "doc_items_refs": ["#/texts/145", "#/texts/146", "#/texts/147", "#/texts/148", "#/texts/149", "#/texts/151", "#/texts/152", "#/texts/153", "#/texts/155", "#/texts/156", "#/texts/157", "#/texts/158", "#/texts/159", "#/texts/161", "#/texts/162", "#/texts/163"], "page_nos": [], "uuid": "0206ffa1-a5d1-4de0-9456-7dac62a272b4"}
{"doc_id": "2025__Are_long-lasting_nonspecific_symptoms_related_to_vitamin_D_deficiency_among_olde__W4411573635", "source_path": "<redacted:source_path>", "chunk_id": 8, "source_chunk_idxs": [18], "num_tokens": 418, "text": "Are long-lasting nonspecific symptoms related to vitamin D deficiency among older adults living in nursing homes?\nDiscussion\nAmong older adults living in nursing homes, vitamin D deficiency and nonspecific symptoms persisting ≥ 3 months were common. However, there was no association between these long-lasting nonspecific symptoms and vitamin D deficiency.\nThe intensity of nonspecific symptoms typically varies over time, and during episodes of increased severity nurses often misinterpret these symptoms as acute cystitis. Additionally, since 25OHD concentrations fluctuate slowly over time and potential deficiencies develop gradually, there is greater likelihood of them being associated with symptoms persisting for an extended period. Based on this reasoning, and according to the pre-specified statistical analysis plan, we analyzed long-lasting nonspecific symptoms persisting ≥ 3 months instead of symptoms of shorter duration. Exploratively, we also carried out the analysis with a cut-off for nonspecific symptoms lasting ≥ 1 month. Also with this duration cut-off there was no association between nonspecific symptoms and vitamin D concentrations.\nThe median concentration of vitamin D and interquartile ranges were similar across groups (Table\n1\n). In the regression analysis (Table\n2\n), vitamin D was treated as a continuous variable. This approach allows to maximize the use of all available data points, while adjusting for confounders like dementia (Table\n2\n). An alternative method of categorizing vitamin D levels into predefined cut-off values would result in a loss of data granularity. For this reason, vitamin D was treated as a continuous variable. Given that none of the\np\n-values in Table\n2\nwere close to statistical significance and that the median values between groups were similar (Table\n1\n), it is unlikely that dividing the data into categorical cut-offs would yield a different result. Furthermore, exploratory analyses using different cut-off levels would generate numerous\np\n-values, raising the risk of type I errors due to multiple testing.", "doc_items_refs": ["#/texts/165", "#/texts/166", "#/texts/167", "#/texts/168", "#/texts/169", "#/texts/170", "#/texts/171", "#/texts/172", "#/texts/173", "#/texts/174", "#/texts/175", "#/texts/176", "#/texts/177", "#/texts/178", "#/texts/179", "#/texts/180", "#/texts/181"], "page_nos": [], "uuid": "c2dedc9a-1fbb-4196-b69c-b305e8622b25"}
{"doc_id": "2025__Are_long-lasting_nonspecific_symptoms_related_to_vitamin_D_deficiency_among_olde__W4411573635", "source_path": "<redacted:source_path>", "chunk_id": 9, "source_chunk_idxs": [19], "num_tokens": 127, "text": "Are long-lasting nonspecific symptoms related to vitamin D deficiency among older adults living in nursing homes?\nDiscussion\nDue to the data being 10 years old the prevalence of vitamin D deficiency today may differ. However, the aim of this sub-study was not to describe the prevalence of vitamin D deficiency, but rather to investigate any association between low concentrations of vitamin D and presence of symptoms. Therefore, the conclusions are not influenced by potential changes in vitamin D supplementation over the years or the current prevalence of vitamin D deficiency. Furthermore, there is no recommendation for general supplementation with vitamin D of all residents in nursing homes in Sweden.", "doc_items_refs": ["#/texts/182"], "page_nos": [], "uuid": "35053ca8-bd12-4e68-bd3b-b195ed620d75"}
{"doc_id": "2025__Are_long-lasting_nonspecific_symptoms_related_to_vitamin_D_deficiency_among_olde__W4411573635", "source_path": "<redacted:source_path>", "chunk_id": 10, "source_chunk_idxs": [20], "num_tokens": 458, "text": "Are long-lasting nonspecific symptoms related to vitamin D deficiency among older adults living in nursing homes?\nDiscussion\nStrengths and limitations\nOne strength of this study is that blood samples were collected from all participating residents for whom it was possible to obtain a blood sample during the study period. Case report forms and blood samples were collected from 60% (545/901) of all registered residents in the nursing homes (Fig.\n1\n). While 60% participation may seem low it is consistent with previous studies conducted in nursing homes [\n14\n]. It is challenging to include frail older adult research participants in nursing homes and collect blood samples. A large proportion have dementia, and when the research participants cannot provide informed consent, according to ethical regulations, relatives must be contacted, informed, and asked if they do not oppose participation by their relative in the study.\nFig. 1\nAnother strength is that we adjusted for dementia, in which nonspecific symptoms are common. There may be differences between the groups with and without dementia. Therefore, we used dementia as an independent variable in the regression analysis. As expected, confusion was more common in individuals with dementia, with an adjusted odds ratio of 1.6 (95% CI 1.1-1.2),\np\n= 0.011 (Table\n2\n).\nVitamin D deficiency is also more common among older adults living in nursing homes suffering from dementia, compared to older adults without dementia [\n18\n,\n19\n,\n20\n,\n21\n]. There were more women than men in this study which reflects the gender distribution among older adults living in nursing homes. In the logistic regressions we also adjusted for gender. Despite adjusting for confounders there is potential for residual confounding.\nA weakness may be that nurses themselves had to determine whether residents had any of the nonspecific symptoms, as validated instruments were not used for this purpose. However, this is also a strength because the symptoms registered by nurses in this study were evaluated in the same way as by nurses in clinical practice. With or without dementia, individuals with nonspecific symptoms, such as confusion, may be unable to articulate their symptoms. Therefore, these individuals were assessed by nurses who had a thorough and comprehensive understanding of the resident's condition.", "doc_items_refs": ["#/texts/184", "#/texts/185", "#/texts/186", "#/texts/187", "#/texts/188", "#/texts/189", "#/texts/190", "#/texts/191", "#/texts/192", "#/texts/193", "#/texts/194", "#/texts/195", "#/texts/196", "#/texts/197", "#/texts/198", "#/texts/199", "#/texts/200", "#/texts/201", "#/texts/202", "#/texts/203", "#/texts/204"], "page_nos": [], "uuid": "dc3594d2-2325-4140-9a5d-019b10f0308a"}
{"doc_id": "2025__Are_long-lasting_nonspecific_symptoms_related_to_vitamin_D_deficiency_among_olde__W4411573635", "source_path": "<redacted:source_path>", "chunk_id": 11, "source_chunk_idxs": [21, 22, 23], "num_tokens": 427, "text": "Are long-lasting nonspecific symptoms related to vitamin D deficiency among older adults living in nursing homes?\nDiscussion\nClinical relevance\nIn everyday clinical practice it is important to note that low concentrations of vitamin D and long-lasting nonspecific symptoms are very common among older adults living in nursing homes. Efforts should be made to identify the possible cause of these symptoms and not hastily conclude that it is an acute cystitis when simultaneous lower urinary tract symptoms are absent, leading to unnecessary antibiotic treatment. Given the growing problem of antibiotic-resistant bacteria, it is crucial not to overuse antibiotics [\n5\n].\nNumerous potential associations with vitamin D are described in the literature and prior research, varying in their level of substantiation [\n14\n,\n17\n,\n18\n,\n19\n,\n20\n,\n21\n,\n22\n,\n24\n,\n25\n,\n26\n,\n27\n,\n28\n,\n29\n,\n30\n]. However, it is equally important to publish articles that demonstrate conditions and factors not related to vitamin D deficiency. Thus, even if there was no association between vitamin D concentrations and nonspecific symptoms in this study, the information still contributes to the ongoing research on vitamin D.\nIn future studies, it is important to continue searching for other causes of these nonspecific symptoms among older adults living in nursing homes. In consideration of a population where the average age is constantly rising and life expectancy increasing, it is important to study factors that affect the health of older adults.\n\nAre long-lasting nonspecific symptoms related to vitamin D deficiency among older adults living in nursing homes?\nConclusions\nNonspecific symptoms persisting ≥ 3 months and vitamin D deficiency were common among older adults living in nursing homes. However, there was no association between these long-lasting nonspecific symptoms and vitamin D concentrations. Although there was no association, valuable information is still contributed to the ongoing research on vitamin D and older adults.\n\nAre long-lasting nonspecific symptoms related to vitamin D deficiency among older adults living in nursing homes?\nData availability\nThe data supporting the conclusions of this study can be obtained from the corresponding author upon reasonable request.", "doc_items_refs": ["#/texts/206", "#/texts/207", "#/texts/208", "#/texts/209", "#/texts/210", "#/texts/211", "#/texts/212", "#/texts/213", "#/texts/214", "#/texts/215", "#/texts/216", "#/texts/217", "#/texts/218", "#/texts/219", "#/texts/220", "#/texts/221", "#/texts/222", "#/texts/223", "#/texts/224", "#/texts/225", "#/texts/226", "#/texts/227", "#/texts/228", "#/texts/229", "#/texts/230", "#/texts/231", "#/texts/232", "#/texts/233", "#/texts/234", "#/texts/235", "#/texts/236", "#/texts/237", "#/texts/238", "#/texts/240", "#/texts/242"], "page_nos": [], "uuid": "df2a26ad-5786-4356-8089-bc51f202d4b3"}
{"doc_id": "2025__Are_long-lasting_nonspecific_symptoms_related_to_vitamin_D_deficiency_among_olde__W4411573635", "source_path": "<redacted:source_path>", "chunk_id": 12, "source_chunk_idxs": [24], "num_tokens": 425, "text": "Are long-lasting nonspecific symptoms related to vitamin D deficiency among older adults living in nursing homes?\nReferences\n1. Sundvall PD, Elm M, Ulleryd P, Molstad S, Rodhe N, Jonsson L, Andersson B, Hahn-Zoric M, Gunnarsson R. Interleukin-6 concentrations in the urine and dipstick analyses were related to bacteriuria but not symptoms in the elderly: a cross sectional study of 421 nursing home residents. BMC Geriatr. 2014;14:88.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n2. Sundvall PD, Ulleryd P, Gunnarsson RK. Urine culture doubtful in determining etiology of diffuse symptoms among elderly individuals: a cross-sectional study of 32 nursing homes. BMC Fam Pract. 2011;12:36.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n3. Nicolle LE. Urinary tract infection in long-term-care facility residents. Clin Infect Dis. 2000;31(3):757-61.\nArticle\nPubMed\nCAS\nGoogle Scholar\n4. Phillips CD, Adepoju O, Stone N, Moudouni DK, Nwaiwu O, Zhao H, Frentzel E, Mehr D, Garfinkel S. Asymptomatic bacteriuria, antibiotic use, and suspected urinary tract infections in four nursing homes. BMC Geriatr. 2012;12:73.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n5. WHO. The evolving threat of antimicrobial resistance - Options for action. Geneva: World Health Organization; 2012.\nGoogle Scholar\n6. Jump RLP, Crnich CJ, Mody L, Bradley SF, Nicolle LE, Yoshikawa TT. Infectious diseases in older adults of Long-Term care facilities: update on approach to diagnosis and management. J Am Geriatr Soc. 2018;66(4):789-803.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/244", "#/texts/245", "#/texts/246", "#/texts/247", "#/texts/248", "#/texts/249"], "page_nos": [], "uuid": "990ece46-5dd4-4e7b-8dc4-266b9e281260"}
{"doc_id": "2025__Are_long-lasting_nonspecific_symptoms_related_to_vitamin_D_deficiency_among_olde__W4411573635", "source_path": "<redacted:source_path>", "chunk_id": 13, "source_chunk_idxs": [25], "num_tokens": 436, "text": "Are long-lasting nonspecific symptoms related to vitamin D deficiency among older adults living in nursing homes?\nReferences\n7. Loeb M, Brazil K, Lohfeld L, McGeer A, Simor A, Stevenson K, Zoutman D, Smith S, Liu X, Walter SD. Effect of a multifaceted intervention on number of antimicrobial prescriptions for suspected urinary tract infections in residents of nursing homes: cluster randomised controlled trial. BMJ. 2005;331(7518):669.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n8. Stone ND, Ashraf MS, Calder J, Crnich CJ, Crossley K, Drinka PJ, Gould CV, Juthani-Mehta M, Lautenbach E, Loeb M, et al. Surveillance definitions of infections in long-term care facilities: revisiting the McGeer criteria. Infect Control Hosp Epidemiol. 2012;33(10):965-77.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n9. D'Agata E, Loeb MB, Mitchell SL. Challenges in assessing nursing home residents with advanced dementia for suspected urinary tract infections. J Am Geriatr Soc. 2013;61(1):62-6.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n10. Juthani-Mehta M, Tinetti M, Perrelli E, Towle V, Van Ness PH, Quagliarello V. Interobserver variability in the assessment of clinical criteria for suspected urinary tract infection in nursing home residents. Infect Control Hosp Epidemiol. 2008;29(5):446-9.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n11. Juthani-Mehta M, Drickamer MA, Towle V, Zhang Y, Tinetti ME, Quagliarello VJ. Nursing home practitioner survey of diagnostic criteria for urinary tract infections. J Am Geriatr Soc. 2005;53(11):1986-90.\nArticle\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/250", "#/texts/251", "#/texts/252", "#/texts/253", "#/texts/254"], "page_nos": [], "uuid": "95c7ca12-8673-497f-9fc3-0b7b8f09e3e2"}
{"doc_id": "2025__Are_long-lasting_nonspecific_symptoms_related_to_vitamin_D_deficiency_among_olde__W4411573635", "source_path": "<redacted:source_path>", "chunk_id": 14, "source_chunk_idxs": [26], "num_tokens": 447, "text": "Are long-lasting nonspecific symptoms related to vitamin D deficiency among older adults living in nursing homes?\nReferences\n12. Walker S, McGeer A, Simor AE, Armstrong-Evans M, Loeb M. Why are antibiotics prescribed for asymptomatic bacteriuria in institutionalized elderly people? A qualitative study of physicians' and nurses' perceptions. CMAJ. 2000;163(3):273-7.\nPubMed\nPubMed Central\nCAS\nGoogle Scholar\n13. Schweizer AK, Hughes CM, Macauley DC, O'Neill C. Managing urinary tract infections in nursing homes: a qualitative assessment. Pharm World Sci. 2005;27(3):159-65.\nArticle\nPubMed\nGoogle Scholar\n14. Samefors M, Ostgren CJ, Molstad S, Lannering C, Midlov P, Tengblad A. Vitamin D deficiency in elderly people in Swedish nursing homes is associated with increased mortality. Eur J Endocrinol. 2014;170(5):667-75.\nArticle\nPubMed\nCAS\nGoogle Scholar\n15. Bruyere O, Decock C, Delhez M, Collette J, Reginster JY. Highest prevalence of vitamin D inadequacy in institutionalized women compared with noninstitutionalized women: a case-control study. Women's Health (London England). 2009;5(1):49-54.\nArticle\nPubMed\nGoogle Scholar\n16. Feehan O, Magee PJ, Pourshahidi LK, Armstrong DJ, McSorley EM. Vitamin D deficiency in nursing home residents: a systematic review. Nutr Rev. 2023;81(7):804-22.\nArticle\nPubMed\nGoogle Scholar\n17. Ling Y, Xu F, Xia X, Dai D, Xiong A, Sun R, Qiu L, Xie Z. Vitamin D supplementation reduces the risk of fall in the vitamin D deficient elderly: an updated meta-analysis. Clin Nutr. 2021;40(11):5531-7.\nArticle\nPubMed\nCAS\nGoogle Scholar", "doc_items_refs": ["#/texts/255", "#/texts/256", "#/texts/257", "#/texts/258", "#/texts/259", "#/texts/260"], "page_nos": [], "uuid": "e3d5c9b8-68b1-49eb-b683-20c264d46280"}
{"doc_id": "2025__Are_long-lasting_nonspecific_symptoms_related_to_vitamin_D_deficiency_among_olde__W4411573635", "source_path": "<redacted:source_path>", "chunk_id": 15, "source_chunk_idxs": [27], "num_tokens": 502, "text": "Are long-lasting nonspecific symptoms related to vitamin D deficiency among older adults living in nursing homes?\nReferences\n18. Karakis I, Pase MP, Beiser A, Booth SL, Jacques PF, Rogers G, DeCarli C, Vasan RS, Wang TJ, Himali JJ, et al. Association of serum vitamin D with the risk of incident dementia and subclinical indices of brain aging: the Framingham heart study. J Alzheimers Dis. 2016;51(2):451-61.\nArticle\nPubMed\nPubMed Central\nCAS\nGoogle Scholar\n19. Afzal S, Bojesen SE, Nordestgaard BG. Reduced 25-hydroxyvitamin D and risk of alzheimer's disease and vascular dementia. Alzheimer's Dement J Alzheimer's Assoc. 2014;10(3):296-302.\nArticle\nGoogle Scholar\n20. Chai B, Gao F, Wu R, Dong T, Gu C, Lin Q, Zhang Y. Vitamin D deficiency as a risk factor for dementia and alzheimer's disease: an updated meta-analysis. BMC Neurol. 2019;19(1):284.\nArticle\nPubMed\nPubMed Central\nCAS\nGoogle Scholar\n21. Arnljots R, Thorn J, Elm M, Moore M, Sundvall PD. Vitamin D deficiency was common among nursing home residents and associated with dementia: a cross sectional study of 545 Swedish nursing home residents. BMC Geriatr. 2017;17(1):229.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n22. van Melo D, Egert S, Wolfsgruber S, Kleineidam L, Weinhold L, Wagner-Thelen H, Stoffel-Wagner B, Bickel H, Wiese B, Weyerer S, et al. Low Serum Vitamin D Status Is Associated with Incident Alzheimer's Dementia in the Oldest Old. Nutrients. 2022;15(1):61.\nArticle\nGoogle Scholar\n23. Sundvall PD, Elm M, Gunnarsson R, Molstad S, Rodhe N, Jonsson L, Ulleryd P. Antimicrobial resistance in urinary pathogens among Swedish nursing home residents remains low: a cross-sectional study comparing antimicrobial resistance from 2003 to 2012. BMC Geriatr. 2014;14:30.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/261", "#/texts/262", "#/texts/263", "#/texts/264", "#/texts/265", "#/texts/266"], "page_nos": [], "uuid": "4eece5ec-5f1d-4632-8b48-374e8a5ee43a"}
{"doc_id": "2025__Are_long-lasting_nonspecific_symptoms_related_to_vitamin_D_deficiency_among_olde__W4411573635", "source_path": "<redacted:source_path>", "chunk_id": 16, "source_chunk_idxs": [28], "num_tokens": 493, "text": "Are long-lasting nonspecific symptoms related to vitamin D deficiency among older adults living in nursing homes?\nReferences\n24. Bischoff-Ferrari HA, Willett WC, Wong JB, Stuck AE, Staehelin HB, Orav EJ, Thoma A, Kiel DP, Henschkowski J. Prevention of nonvertebral fractures with oral vitamin D and dose dependency: a meta-analysis of randomized controlled trials. Arch Intern Med. 2009;169(6):551-61.\nArticle\nPubMed\nCAS\nGoogle Scholar\n25. Pludowski P, Holick MF, Pilz S, Wagner CL, Hollis BW, Grant WB, Shoenfeld Y, Lerchbaum E, Llewellyn DJ, Kienreich K, et al. Vitamin D effects on musculoskeletal health, immunity, autoimmunity, cardiovascular disease, cancer, fertility, pregnancy, dementia and mortality-a review of recent evidence. Autoimmun Rev. 2013;12(10):976-89.\nArticle\nPubMed\nCAS\nGoogle Scholar\n26. Nakashima A, Yokoyama K, Yokoo T, Urashima M. Role of vitamin D in diabetes mellitus and chronic kidney disease. World J Diabetes. 2016;7(5):89-100.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n27. Hejazi ME, Modarresi-Ghazani F, Entezari-Maleki T. A review of vitamin D effects on common respiratory diseases: asthma, chronic obstructive pulmonary disease, and tuberculosis. J Res Pharm Pract. 2016;5(1):7-15.\nArticle\nPubMed\nPubMed Central\nCAS\nGoogle Scholar\n28. Grant WB, Boucher BJ. Randomized controlled trials of vitamin D and cancer incidence: A modeling study. PLoS ONE. 2017;12(5):e0176448.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n29. Meng J, Li X, Liu W, Xiao Y, Tang H, Wu Y, Xiong Y, Gao S. The role of vitamin D in the prevention and treatment of SARS-CoV-2 infection: A meta-analysis of randomized controlled trials. Clin Nutr. 2023;42(11):2198-206.\nArticle\nPubMed\nCAS\nGoogle Scholar", "doc_items_refs": ["#/texts/267", "#/texts/268", "#/texts/269", "#/texts/270", "#/texts/271", "#/texts/272"], "page_nos": [], "uuid": "3fefe8f6-7b87-470f-9f74-4c8c5de4137e"}
{"doc_id": "2025__Are_long-lasting_nonspecific_symptoms_related_to_vitamin_D_deficiency_among_olde__W4411573635", "source_path": "<redacted:source_path>", "chunk_id": 17, "source_chunk_idxs": [29, 30, 31], "num_tokens": 304, "text": "Are long-lasting nonspecific symptoms related to vitamin D deficiency among older adults living in nursing homes?\nReferences\n30. Neira Álvarez M, Navarro Jiménez G, Anguita Sánchez N, Del Mar Bermejo Olano M, Queipo R, Benavent Núñez M, Parralejo Jimenez A, López Yepes G, Sáez Nieto C. Vitamin D deficiency and SARS-CoV-2 infection: A retrospective case-Control study with big-data analysis covering March 2020 to March 2021. PLoS ONE. 2023;18(9):e0277388.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\nDownload references\n\nAre long-lasting nonspecific symptoms related to vitamin D deficiency among older adults living in nursing homes?\nAcknowledgements\nWe wish to express our gratitude to the participants at the nursing homes for older adults, the dedicated nursing home staff who supported this study, and the laboratory team at the Bio Imaging and Laboratory Medicine Unit, Södra Älvsborg Hospital.\n\nAre long-lasting nonspecific symptoms related to vitamin D deficiency among older adults living in nursing homes?\nFunding\nOpen access funding provided by University of Gothenburg. Financial support was obtained from primary health care in Södra Älvsborg County, the Research and Development Council of the Södra Älvsborg County and FoU Sjuhärad Välfärd. Sponsors were not involved in the design, methods, subject recruitment, data collection, analysis, or manuscript preparation.", "doc_items_refs": ["#/texts/273", "#/texts/274", "#/texts/276", "#/texts/278"], "page_nos": [], "uuid": "c47189c4-ec62-4054-ad49-07824a57f25b"}
{"doc_id": "2025__Are_long-lasting_nonspecific_symptoms_related_to_vitamin_D_deficiency_among_olde__W4411573635", "source_path": "<redacted:source_path>", "chunk_id": 18, "source_chunk_idxs": [32], "num_tokens": 432, "text": "Are long-lasting nonspecific symptoms related to vitamin D deficiency among older adults living in nursing homes?\nAuthor information\nAuthors and Affiliations\n1. Research, Education, Development &amp; Innovation, Primary Health Care, Region Västra Götaland, Sweden Rebeka Arnljots, Egill Snaebjörnsson Arnljots &amp; Pär-Daniel Sundvall\n2. General Practice/Family Medicine, School of Public Health and Community Medicine, Institute of Medicine, Sahlgrenska Academy, University of Gothenburg, Gothenburg, Sweden Rebeka Arnljots, Egill Snaebjörnsson Arnljots, Jörgen Thorn &amp; Pär-Daniel Sundvall\n3. Närhälsan Heimdal Health Care Center, Borås, Sweden Rebeka Arnljots &amp; Egill Snaebjörnsson Arnljots\n4. Centre for Antibiotic Resistance Research (CARe), University of Gothenburg, Gothenburg, Sweden Rebeka Arnljots &amp; Egill Snaebjörnsson Arnljots\n5. Närhälsan, Region Västra Götaland, Sweden Jörgen Thorn\n6. Health Care Unit, Borås Municipality, Sweden Marie Elm\n7. Academic Unit of Primary Care and Population Sciences, Faculty of Medicine, University of Southampton, Aldermoor Health Centre, Aldermoor Close, Southampton, UK Michael Moore\n8. Närhälsan Sandared Health Care Center, Sandared, Sweden Pär-Daniel Sundvall\nAuthors\n1. Rebeka Arnljots\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n2. Egill Snaebjörnsson Arnljots\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n3. Jörgen Thorn\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n4. Marie Elm\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n5. Michael Moore\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n6. Pär-Daniel Sundvall\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/281", "#/texts/282", "#/texts/283", "#/texts/284", "#/texts/285", "#/texts/286", "#/texts/287", "#/texts/288", "#/texts/289", "#/texts/290", "#/texts/291", "#/texts/292", "#/texts/293", "#/texts/294", "#/texts/295"], "page_nos": [], "uuid": "23740396-df5b-4f36-b82f-614a51d875c6"}
{"doc_id": "2025__Are_long-lasting_nonspecific_symptoms_related_to_vitamin_D_deficiency_among_olde__W4411573635", "source_path": "<redacted:source_path>", "chunk_id": 19, "source_chunk_idxs": [33, 34, 35, 36, 37, 38], "num_tokens": 300, "text": "Are long-lasting nonspecific symptoms related to vitamin D deficiency among older adults living in nursing homes?\nAuthor information\nContributions\nEach author contributed to the study design, with PDS and ME handling data collection. RA, ESA, and PDS conducted data analysis. RA drafted the manuscript. All authors contributed to the interpretation of the analyses, critical reviews, revisions, and final approval of the paper.\n\nAre long-lasting nonspecific symptoms related to vitamin D deficiency among older adults living in nursing homes?\nAuthor information\nCorresponding author\nCorrespondence to\nRebeka Arnljots\n.\n\nAre long-lasting nonspecific symptoms related to vitamin D deficiency among older adults living in nursing homes?\nEthics declarations\nEthics approval and consent to participate\nThe Regional Ethical Review Board of Gothenburg University approved the study (Reference number: 578 − 11). The detailed procedure for obtaining informed consent is outlined in the \"Statement of Consent\" section within the Methods.\n\nAre long-lasting nonspecific symptoms related to vitamin D deficiency among older adults living in nursing homes?\nEthics declarations\nConsent for publication\nNot applicable.\n\nAre long-lasting nonspecific symptoms related to vitamin D deficiency among older adults living in nursing homes?\nEthics declarations\nCompeting interests\nThe authors declare no competing interests.\n\nAre long-lasting nonspecific symptoms related to vitamin D deficiency among older adults living in nursing homes?\nAdditional information\nPublisher's note\nSpringer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations.", "doc_items_refs": ["#/texts/297", "#/texts/299", "#/texts/300", "#/texts/301", "#/texts/304", "#/texts/306", "#/texts/308", "#/texts/311"], "page_nos": [], "uuid": "778ae8d2-8ff6-411b-87de-53c84a91c450"}
{"doc_id": "2025__Are_long-lasting_nonspecific_symptoms_related_to_vitamin_D_deficiency_among_olde__W4411573635", "source_path": "<redacted:source_path>", "chunk_id": 20, "source_chunk_idxs": [39, 40], "num_tokens": 376, "text": "Are long-lasting nonspecific symptoms related to vitamin D deficiency among older adults living in nursing homes?\nRights and permissions\nOpen Access\nThis article is licensed under a Creative Commons Attribution 4.0 International License, which permits use, sharing, adaptation, distribution and reproduction in any medium or format, as long as you give appropriate credit to the original author(s) and the source, provide a link to the Creative Commons licence, and indicate if changes were made. The images or other third party material in this article are included in the article's Creative Commons licence, unless indicated otherwise in a credit line to the material. If material is not included in the article's Creative Commons licence and your intended use is not permitted by statutory regulation or exceeds the permitted use, you will need to obtain permission directly from the copyright holder. To view a copy of this licence, visit\nhttp://creativecommons.org/licenses/by/4.0/\n.\nReprints and permissions\n\nAre long-lasting nonspecific symptoms related to vitamin D deficiency among older adults living in nursing homes?\nAbout this article\nCite this article\nArnljots, R., Snaebjörnsson Arnljots, E., Thorn, J.\net al.\nAre long-lasting nonspecific symptoms related to vitamin D deficiency among older adults living in nursing homes?.\nBMC Geriatr\n25\n, 428 (2025). https://doi.org/10.1186/s12877-025-06132-z\nDownload citation\n- Received : 09 April 2024\n- Accepted : 08 June 2025\n- Published : 24 June 2025\n- DOI : https://doi.org/10.1186/s12877-025-06132-z", "doc_items_refs": ["#/texts/313", "#/texts/314", "#/texts/315", "#/texts/316", "#/texts/317", "#/texts/320", "#/texts/321", "#/texts/322", "#/texts/323", "#/texts/324", "#/texts/325", "#/texts/326", "#/texts/327", "#/texts/328", "#/texts/329", "#/texts/330"], "page_nos": [], "uuid": "53bd300a-20a9-477d-ad4b-fbfe0dc70f98"}
{"doc_id": "2025__Are_long-lasting_nonspecific_symptoms_related_to_vitamin_D_deficiency_among_olde__W4411573635", "source_path": "<redacted:source_path>", "chunk_id": 21, "source_chunk_idxs": [41, 42, 43], "num_tokens": 141, "text": "Are long-lasting nonspecific symptoms related to vitamin D deficiency among older adults living in nursing homes?\nAbout this article\nKeywords\n- Primary care\n- Vitamin D\n- Frail older adults\n- Homes for the aged\n- Nursing homes\n- Angers\n- Anxiety\n- Fatigue\n- Confusion\nDownload PDF\nAdvertisement\n\nAre long-lasting nonspecific symptoms related to vitamin D deficiency among older adults living in nursing homes?\nAbout this article\nKeywords\nBMC Geriatrics\nISSN: 1471-2318\n\nAre long-lasting nonspecific symptoms related to vitamin D deficiency among older adults living in nursing homes?\nAbout this article\nKeywords\nContact us\n- General enquiries:\njournalsubmissions@springernature.com", "doc_items_refs": ["#/texts/332", "#/texts/333", "#/texts/334", "#/texts/335", "#/texts/336", "#/texts/337", "#/texts/338", "#/texts/339", "#/texts/340", "#/texts/341", "#/texts/342", "#/texts/344", "#/texts/346"], "page_nos": [], "uuid": "b47f9c4a-8a5b-4d37-b319-5d52ee99cbdb"}
