{"doc_id": "2025__Acceptability_of_wearable_technology_for_the_early_detection_of_dementia-causing__W4413786476", "source_path": "<redacted:source_path>", "chunk_id": 0, "source_chunk_idxs": [0, 1], "num_tokens": 253, "text": "Acceptability of wearable technology for the early detection of dementia-causing diseases: perspectives from the CODEC II cohort | BMC Digital Health | Full Text\nSkip to main content\nAdvertisement\nSearch\n- Explore journals\n- Get published\n- About BMC\n- My account\nSearch all BMC articles\nSearch\nBMC Digital Health\n- Home\n- About\n- Articles\n- Submission Guidelines\n- Collections\n- Join the Board\n- Submit manuscript\nAcceptability of wearable technology for the early detection of dementia-causing diseases: perspectives from the CODEC II cohort\nDownload PDF\nDownload PDF\n- Research\n- Open access\n- Published: 29 August 2025\n\nAcceptability of wearable technology for the early detection of dementia-causing diseases: perspectives from the CODEC II cohort\n- Sarah Wilson\n1\n,\n- Emily Beswick\n2\n,\n- Rachel Morrell\n3\n,\n4\n,\n- Sharandeep Bhogal\n3\n,\n- Clare Tolley\n1\n,\n- Tim Whitfield\n3\n,\n- Kieran Wing\n3\n,\n- Riona Mc Ardle\n5\n,\n- Nehal Hassan\n1\n,\n- Zuzana Walker\n3\n,\n4\n&amp;\n- ...\n- Sarah Slight\n1\nShow authors\nBMC Digital Health\nvolume 3\n, Article number: 55 ( 2025 )\nCite this article\n- 812 Accesses\n- Metrics details", "doc_items_refs": ["#/texts/1", "#/texts/2", "#/texts/3", "#/texts/4", "#/texts/5", "#/texts/6", "#/texts/7", "#/texts/8", "#/texts/9", "#/texts/10", "#/texts/11", "#/texts/12", "#/texts/13", "#/texts/14", "#/texts/15", "#/texts/16", "#/texts/17", "#/texts/18", "#/texts/19", "#/texts/20", "#/texts/21", "#/texts/22", "#/texts/23", "#/texts/25", "#/texts/26", "#/texts/27", "#/texts/28", "#/texts/29", "#/texts/30", "#/texts/31", "#/texts/32", "#/texts/33", "#/texts/34", "#/texts/35", "#/texts/36", "#/texts/37", "#/texts/38", "#/texts/39", "#/texts/40", "#/texts/41", "#/texts/42", "#/texts/43"], "page_nos": [], "uuid": "21fc7b83-e379-40af-a370-e64091a8a2ba"}
{"doc_id": "2025__Acceptability_of_wearable_technology_for_the_early_detection_of_dementia-causing__W4413786476", "source_path": "<redacted:source_path>", "chunk_id": 1, "source_chunk_idxs": [2], "num_tokens": 503, "text": "Acceptability of wearable technology for the early detection of dementia-causing diseases: perspectives from the CODEC II cohort\nAbstract\nAbstractSection Background\nThe global prevalence of dementia is increasing exponentially. Early detection of dementia-causing diseases could support therapeutic intervention to decelerate disease progression. Wearable digital technologies can be used to identify early signs of such diseases and remotely monitor disease progression. However, technologies must be acceptable to users. This study explored the perspectives of participants on the acceptability of various wearable technologies for early detection.\nAbstractSection Method\nParticipants from the Cognitive Decline using Digital Devices (CODEC-II) cohort used four different wearables (smartwatch, electroencephalographic [EEG] headband, active and passive smartphone apps) for two weeks every three months over a year. A subgroup participated in semi structured interviews after two weeks to discuss their experiences and acceptance of the devices. Data was analysed using the framework analysis approach, aided by N-Vivo (v14.23.2).\nAbstractSection Results\nTwenty-one participants were interviewed, including individuals with subjective cognitive decline (\nn\n= 10), mild cognitive impairment (MCI) (\nn\n= 7), dementia with Lewy bodies (\nn\n= 1), and three caregivers. Five key themes were identified, including ease of use, wearability, usefulness, transparency, and behavioral intention. Many participants relied on the research team to help set up the technology for them due to high levels of digital anxiety. Individuals with MCI particularly struggled with cognitive testing games in the active smartphone app, which they experienced increased awareness of their own cognitive impairments. Participants preferred wrist-worn over head-worn devices due to familiarity and impact on their appearance. While some participants enjoyed using the wearables, others questioned their accuracy for medical purposes. There was also a lack of understanding around what data were being collected from the wearables and how it was being collected, with some expressing concerns about data disclosure. Participants with professional or caregiving responsibilities described how their busy lifestyles hindered daily use of the wearables.\nAbstractSection Conclusion\nThese findings highlight the importance of using an inclusive design approach to meet users' needs and support digital inclusivity, and an effective communication strategy to increase transparency and reduce data disclosure concerns. Future research is needed to explore the effectiveness of implementing current recommendations to support digital health equity and codesign a communication strategy with users to ensure the information is understandable.\nAbstractSection Trial registration", "doc_items_refs": ["#/texts/45", "#/texts/46", "#/texts/47", "#/texts/48", "#/texts/49", "#/texts/50", "#/texts/51", "#/texts/52", "#/texts/53", "#/texts/54", "#/texts/55", "#/texts/56", "#/texts/57", "#/texts/58", "#/texts/59"], "page_nos": [], "uuid": "561575c9-17c5-444b-b146-12247479e19f"}
{"doc_id": "2025__Acceptability_of_wearable_technology_for_the_early_detection_of_dementia-causing__W4413786476", "source_path": "<redacted:source_path>", "chunk_id": 2, "source_chunk_idxs": [3], "num_tokens": 71, "text": "Acceptability of wearable technology for the early detection of dementia-causing diseases: perspectives from the CODEC II cohort\nAbstract\nCODEC-II was retrospectively registered as a clinical trial under the registry ClinicalTrials.gov (trial registration number: NCT07051408, date of registration: 3rd June 2025).\nPeer Review reports", "doc_items_refs": ["#/texts/60", "#/texts/61"], "page_nos": [], "uuid": "9920dc25-a40f-42ea-b367-e22ed3b615df"}
{"doc_id": "2025__Acceptability_of_wearable_technology_for_the_early_detection_of_dementia-causing__W4413786476", "source_path": "<redacted:source_path>", "chunk_id": 3, "source_chunk_idxs": [4], "num_tokens": 447, "text": "Acceptability of wearable technology for the early detection of dementia-causing diseases: perspectives from the CODEC II cohort\nBackground\nGlobal prevalence of dementia is estimated to reach 152.8 million by 2050. [\n1\n] Dementia is a syndrome associated with the deterioration of cognitive function beyond normal aging [\n2\n] and is caused by a variety of different diseases that destroy neurons and damage neurophysiological processes [\n3\n]. The most common type of dementia-causing disease is Alzheimer's disease (AD), a progressive neurodegenerative disorder characterized by neuropathologic findings of amyloid plaques and neurofibrillary, tau-based tangles [\n4\n]. These features may begin 15 to 20 years before obvious cognitive symptoms [\n5\n]. Detecting dementia-causing disease early could support therapeutic intervention to decelerate disease progression, such as Lecanemab, a pharmacological intervention recently approved for use in the United Kingdom (UK) for the early stages of Alzheimer's disease [\n6\n]. Current dementia diagnostic workup includes a combination of expensive and invasive techniques, including neuroimaging and cerebral spinal fluid analysis, used once symptoms of dementia-causing diseases become clinically apparent [\n7\n,\n8\n].\nResearchers are currently exploring various other methods for detecting subtle changes in cognition, behavior and physiology early, such as the use of blood-based biomarkers (e.g., beta-amyloid) [\n9\n,\n10\n]. These biomarkers have shown promise and could help differentiate between different dementia-causing diseases in the future [\n11\n]. Wearable technologies can also collect data and monitor changes in behavior, such as gait [\n12\n], sleep [\n13\n] and cognition [\n14\n]. These technologies can be worn on the body or attached to clothing and provide a complementary, inexpensive, minimally invasive, and scalable techniques to support early detection for research purposes [\n15\n]. They can also capture changes in real-life (i.e., outside of the clinic) behavior, which may offer advantages over traditional methods, such as pen and paper cognitive screening tests such as the General Practitioner Assessment of Cognition (GPCOG) [\n7\n].", "doc_items_refs": ["#/texts/63", "#/texts/64", "#/texts/65", "#/texts/66", "#/texts/67", "#/texts/68", "#/texts/69", "#/texts/70", "#/texts/71", "#/texts/72", "#/texts/73", "#/texts/74", "#/texts/75", "#/texts/76", "#/texts/77", "#/texts/78", "#/texts/79", "#/texts/80", "#/texts/81", "#/texts/82", "#/texts/83", "#/texts/84", "#/texts/85", "#/texts/86", "#/texts/87", "#/texts/88", "#/texts/89", "#/texts/90", "#/texts/91", "#/texts/92", "#/texts/93", "#/texts/94", "#/texts/95", "#/texts/96"], "page_nos": [], "uuid": "3f65c807-6064-40d4-9dc8-c398cd5e1459"}
{"doc_id": "2025__Acceptability_of_wearable_technology_for_the_early_detection_of_dementia-causing__W4413786476", "source_path": "<redacted:source_path>", "chunk_id": 4, "source_chunk_idxs": [5, 6], "num_tokens": 475, "text": "Acceptability of wearable technology for the early detection of dementia-causing diseases: perspectives from the CODEC II cohort\nBackground\nRegulatory bodies, such as the European Medicines Agency (EMA), the United States Food and Drug Administration (FDA) and National Institute for Health and Care Excellence (NICE), have sought evidence of user involvement in design and development of digital technologies for clinical practice [\n16\n,\n17\n,\n18\n]. This includes seeking the perspectives of those most at risk of developing dementia-causing diseases, for example, people with subjective cognitive decline (SCD) (the self-reported experience of worsening cognitive function) [\n19\n,\n20\n], and mild cognitive impairment (MCI) (an intermediate cognitive state between normal aging and dementia, although not everyone with MCI progresses to dementia) [\n21\n,\n22\n]. It is also important to seek the views of those with a clinical diagnosis of dementia as their data, collected from wearables, could be used to monitor their disease progression; their caregivers are also likely be involved in supporting the use of this technology.\nPrevious research suggests specific features of technologies, such as aesthetics, can influence the acceptance of wearable technologies among people living with dementia and their caregivers [\n23\n]. Acceptability may also change with users' experience with an intervention [\n24\n]. Thus, we aimed to explore the perspectives of those living with a clinical diagnosis of dementia, SCD and MCI and their caregivers on the acceptability of the use of four wearable technologies measuring modalities of physical activity, sleep and cognitive function.\n\nAcceptability of wearable technology for the early detection of dementia-causing diseases: perspectives from the CODEC II cohort\nMethod\nStudy design\nThis study is part of the 'Early Detection of Neurodegenerative Diseases Initiative' (EDoN), an international consortium seeking to develop a clinically appropriate toolkit, composed of wearable technologies to support the early detection of dementia-causing diseases [\n15\n]. We conducted semi-structured qualitative interviews to explore the concurrent acceptability (a construct that reflects the extent to which an individual receiving an intervention finds it appropriate based on their cognitive and emotional responses while participating) [\n24\n] of wearables among older adults with cognitive impairments and caregivers to support the development of the EDoN toolkit.", "doc_items_refs": ["#/texts/97", "#/texts/98", "#/texts/99", "#/texts/100", "#/texts/101", "#/texts/102", "#/texts/103", "#/texts/104", "#/texts/105", "#/texts/106", "#/texts/107", "#/texts/108", "#/texts/109", "#/texts/110", "#/texts/111", "#/texts/112", "#/texts/113", "#/texts/114", "#/texts/115", "#/texts/116", "#/texts/119", "#/texts/120", "#/texts/121", "#/texts/122", "#/texts/123"], "page_nos": [], "uuid": "b840eee6-c2bb-4885-9ae0-10afa848041c"}
{"doc_id": "2025__Acceptability_of_wearable_technology_for_the_early_detection_of_dementia-causing__W4413786476", "source_path": "<redacted:source_path>", "chunk_id": 5, "source_chunk_idxs": [7], "num_tokens": 368, "text": "Acceptability of wearable technology for the early detection of dementia-causing diseases: perspectives from the CODEC II cohort\nMethod\nParticipants\nRecruitment and eligibility criteria\nParticipants were recruited through an existing EDoN affiliated research cohort, 'predictors of COgnitive DECline using digital devices' (CODEC-II) [\n25\n]. Participants in this cohort attended the Essex Memory Clinic at Essex Partnership University NHS Foundation Trust (Southeast England, UK) for either cognitive complaints or impairments or were relatives/caregivers of someone with cognitive complaints or impairments. The patient's cognitive status had been previously determined/diagnosed by qualified healthcare professionals within the Trust's memory clinic and was not measured as part of this research. Study eligibility criteria included the ability to speak English (to support comprehensive communication between participants and the research team who only spoke in English), owning a personal smartphone with internet access at home and having the ability to provide informed consent. Individuals who were diagnosed with an active major psychiatric disorder (e.g., schizophrenia, bipolar affective disorder), had a sensitivity or allergic reaction to latex, rubber or plastics (to minimize harm when using the wearable technologies), participating in any other clinical trials, and/or were receiving end-of-life care were excluded.\nDuring the CODEC-II recruitment process, researchers shared information about this qualitative sub-study in person both verbally and in a written form (via an information sheet) to all (n = 100) who were enrolled in the cohort. We did not record the reasons why individuals declined to participate. EB or SW contacted participants who volunteered to take part to organize a remote interview (phone call or Zoom (Zoom Technologies, Inc.)) after written consent was provided. Verbal consent was reconfirmed at the beginning of the interview.", "doc_items_refs": ["#/texts/126", "#/texts/127", "#/texts/128", "#/texts/129"], "page_nos": [], "uuid": "51982d9c-24c9-415b-b980-7e081e6eb1cd"}
{"doc_id": "2025__Acceptability_of_wearable_technology_for_the_early_detection_of_dementia-causing__W4413786476", "source_path": "<redacted:source_path>", "chunk_id": 6, "source_chunk_idxs": [8], "num_tokens": 280, "text": "Acceptability of wearable technology for the early detection of dementia-causing diseases: perspectives from the CODEC II cohort\nMethod\nParticipants\nProcedure\nParticipants used four wearable technologies that were selected based on a scoping review of commercially available technologies capable of measuring modalities associated with the early signs of dementia-causing diseases. This included a wrist-worn activity tracker, an electroencephalographic (EEG) headband, and a passive and active smartphone app (Table\n1\n). Participants used the EEG headband, activity tracker and passive app for 14 days, but were randomly allocated to either a 28-day schedule or a 14-day schedule on the active smartphone (Table\n1\n). This schedule was repeated every three months for one year (Fig.\n1\n).\nFig. 1\nA member of the research team (RM) (who had received training on how to set up and use the wearables by another member of the research team (SB) who worked closely with the technology companies and developers) provided each participant with the wearables and supported the initial on-boarding process during an in-person visit. This included helping participants download the relevant apps, create accounts, and pair the wearable devices with their personal smartphones. They also provided instructions on how to use the wearables, answered questions that they may have about the onboarding process, and resolved issues.", "doc_items_refs": ["#/texts/131", "#/texts/132", "#/texts/133", "#/texts/134", "#/texts/135", "#/texts/136", "#/texts/137", "#/texts/138", "#/texts/139"], "page_nos": [], "uuid": "f9f69514-9f4e-4e55-8d7f-7fe377d4a9fe"}
{"doc_id": "2025__Acceptability_of_wearable_technology_for_the_early_detection_of_dementia-causing__W4413786476", "source_path": "<redacted:source_path>", "chunk_id": 7, "source_chunk_idxs": [9, 10], "num_tokens": 481, "text": "Acceptability of wearable technology for the early detection of dementia-causing diseases: perspectives from the CODEC II cohort\nMethod\nParticipants\nData collection\nParticipants recruited for the CODEC-II study completed a quantitative questionnaire prior to taking part in the interview to gather relevant data on their sociodemographic background (e.g., date of birth, biological sex, ethnicity, educational attainment, residential type), medical history (e.g., self-reported diagnosis of dementia, MCI or SCD (including date of diagnosis) and other diseases/conditions/comorbidities)) and psychiatric history. Anonymized responses (e.g., birth year provided to calculate age) for those taking part in this qualitative sub-study were shared securely with the qualitative research team.\nSemi-structured interviews were conducted at the end of participants' first two weeks of using the technologies (between February 2023 and October 2023) to gather their initial perspectives and experiences. The interview topic guide was designed by the qualitative research team and explored key aspects relating to the research aims; it was piloted with nine individuals with various cognitive impairments, dementia, and their caregivers (Appendix\n1\n) [\n26\n]. Open ended questions explored participants' acceptance, barriers, and facilitators of using the different technologies. A researcher trained in qualitative methodologies (EB) conducted remote interviews (Zoom Technologies, Inc., or phone calls) lasting between 20 and 40 min. Interviews were audio recorded with permission, transcribed verbatim by a transcription company (University Transcriptions), and then anonymised and checked by the research team for accuracy. Participant names were replaced with a participant ID that included a number (chronological order of interviews), participant's cognitive status and gender (e.g., P1, F, person with SCD = participant who was interviewed first, identified as female and had subjective cognitive decline).\n\nAcceptability of wearable technology for the early detection of dementia-causing diseases: perspectives from the CODEC II cohort\nMethod\nData analysis\nQuantitative questionnaire\nThe quantitative questionnaire was analyzed via descriptive statistics using Excel (Microsoft, version 2412) to provide an overview of participants' age, gender, ethnicity, educational attainment, and date of diagnosis or caregivers (no cognitive impairment).", "doc_items_refs": ["#/texts/141", "#/texts/142", "#/texts/143", "#/texts/144", "#/texts/145", "#/texts/146", "#/texts/149"], "page_nos": [], "uuid": "272f5205-de6f-4ea1-ab8c-8b79f7b956ff"}
{"doc_id": "2025__Acceptability_of_wearable_technology_for_the_early_detection_of_dementia-causing__W4413786476", "source_path": "<redacted:source_path>", "chunk_id": 8, "source_chunk_idxs": [11], "num_tokens": 464, "text": "Acceptability of wearable technology for the early detection of dementia-causing diseases: perspectives from the CODEC II cohort\nMethod\nData analysis\nQualitative interviews\nTranscripts were uploaded to N-Vivo (QSR, version 14.23.2) to assist with analysis via an inductive and deductive framework approach [\n27\n,\n28\n]. The five main stages of the approach were followed, starting with the lead researcher (SW) familiarizing herself with the data by reading and rereading the transcripts. Initial codes were generated inductively by creating concepts in the data without preconceptions [\n29\n]. Codes with shared meanings were grouped into themes, forming an initial framework that was applied across the complete dataset. Data were charted into a matrix (row [themes], sub-row [sub-theme, i.e., codes], column [relevant quote]) to summarize the data [\n27\n,\n28\n]. Themes were refined using the constant comparative technique to move back and forth between the data, comparing and contracting themes and evolving explanations until a fit was made [\n30\n]. The lead researcher (SW) mapped these themes to a preexisting framework, the Intelligent Systems Technology Acceptance Model (ISTAM) [\n31\n] to support the refinement of key themes [\n32\n]. ISTAM is an expansion of the technology acceptance model (TAM) that incorporates aspects such as transparency, which affect users' acceptance of intelligent systems (e.g., AI, robotics, machine learning) (Fig.\n2\n) [\n31\n]. Apparent 'negative cases' were further examined to refine explanations [\n32\n]. Discussions with coauthors (SW, EB, CT, SPS, and RMA) and the wider CODEC-II research team (RM, SB, TW) were conducted at several stages throughout the analytical process.\nFig. 2\nData collection continued until data saturation was reached at 21 interviews. Data saturation is the point at which no new data relevant to the research question occurs in subsequent interviews [\n33\n]. Achieving data saturation ensures that the data captures the diversity, depth, and nuances of the factors affecting acceptance of using wearable technologies to support the early detection of dementia-causing diseases [\n33\n].", "doc_items_refs": ["#/texts/151", "#/texts/152", "#/texts/153", "#/texts/154", "#/texts/155", "#/texts/156", "#/texts/157", "#/texts/158", "#/texts/159", "#/texts/160", "#/texts/161", "#/texts/162", "#/texts/163", "#/texts/164", "#/texts/165", "#/texts/166", "#/texts/167", "#/texts/168", "#/texts/169", "#/texts/170", "#/texts/171", "#/texts/172", "#/texts/173", "#/texts/174", "#/texts/175", "#/texts/176", "#/texts/177", "#/texts/178", "#/texts/179"], "page_nos": [], "uuid": "545c01ca-a55a-4c84-abe8-9a81f17f861f"}
{"doc_id": "2025__Acceptability_of_wearable_technology_for_the_early_detection_of_dementia-causing__W4413786476", "source_path": "<redacted:source_path>", "chunk_id": 9, "source_chunk_idxs": [12, 13, 14], "num_tokens": 379, "text": "Acceptability of wearable technology for the early detection of dementia-causing diseases: perspectives from the CODEC II cohort\nMethod\nData analysis\nRigour\nThe Standards for Reporting Qualitative Research (SRQR) [\n34\n] were followed, and the Consolidated Criteria for Reporting Qualitative Research (COREQ) checklist was completed [\n35\n].\n\nAcceptability of wearable technology for the early detection of dementia-causing diseases: perspectives from the CODEC II cohort\nResults\nParticipants\nTwenty-one CODEC-II participants volunteered, of whom fourteen participants were female and seven male, ranging in age from 42 to 82 years old. Nine participants had SCD, eight had MCI, one was living with dementia with Lewy bodies (DLB), and three were caregivers (Table\n2\n). Most participants identified as white British (\nn\n= 19), with one participant identifying as white other and one as black Caribbean. Eleven participants reached the UK-mandated level of education (secondary school level), whereas 10 had received higher education (i.e., university level).\nAll participants used the activity tracker and EEG headband for two weeks. Two participants were either unable to use the passive smartphone app because their smartphones were incompatible with the app (P1, F, person with SCD) or did not feel comfortable using it (P10, F, person with SCD). Twelve participants were randomly allocated to the 28-day schedule on the active smartphone app, whereas nine participants were allocated to the 14-day schedule.\n\nAcceptability of wearable technology for the early detection of dementia-causing diseases: perspectives from the CODEC II cohort\nResults\nKey findings\nWe identified several factors that affected users'acceptance of using wearable technology (Fig.\n3\n). Key themes and subthemes are described below using direct quotations from interviews.\nFig. 3", "doc_items_refs": ["#/texts/181", "#/texts/182", "#/texts/183", "#/texts/184", "#/texts/185", "#/texts/188", "#/texts/189", "#/texts/190", "#/texts/191", "#/texts/192", "#/texts/193", "#/texts/195", "#/texts/196", "#/texts/197", "#/texts/198"], "page_nos": [], "uuid": "e32fd4cd-262e-489d-aa21-acbd654a8153"}
{"doc_id": "2025__Acceptability_of_wearable_technology_for_the_early_detection_of_dementia-causing__W4413786476", "source_path": "<redacted:source_path>", "chunk_id": 10, "source_chunk_idxs": [15], "num_tokens": 346, "text": "Acceptability of wearable technology for the early detection of dementia-causing diseases: perspectives from the CODEC II cohort\nResults\nEase of use\nDigital self-efficacy\nMany participants felt that they were\n\"not computer literate at all\"\n(P13, F, caregiver) and were\n\"a little bit wary of going into the apps because I didn't want to upset any of the settings or anything\n\" (P3, M, living with MCI)\n.\nSome participants appeared to have low digital self-efficacy (belief in their capacity and confidence in using digital technologies), describing how they were reluctant to use technology within their everyday lives because they did not have \"\nthe patience for it\n\" (P17, M, living with MCI). They described how important it was to have the support of the research team with the initial onboarding process because\n\"when it [technology] doesn't work, I don't know what to do with it\"\n(P6, M, person with SCD), but\n\"once it's up and running I'm all right\"\n(P13, F, caregiver). Another participant described how support at the onboarding stage provided reassurance that the technology was set up correctly; they would rather not \"\nfiddle with it [the technology], and then find out three days later it's not working because I did something wrong\n\" (P2, F, person with SCD). Only a few participants were confident in using technology and described how they \"\ncould probably have done it [set up the research study technologies] myself\"\n(P21, F, caregiver) without any support from the research team.", "doc_items_refs": ["#/texts/201", "#/texts/202", "#/texts/203", "#/texts/204", "#/texts/205", "#/texts/206", "#/texts/207", "#/texts/208", "#/texts/209", "#/texts/210", "#/texts/211", "#/texts/212", "#/texts/213", "#/texts/214", "#/texts/215", "#/texts/216", "#/texts/217"], "page_nos": [], "uuid": "424b0dcf-eb7e-4297-b63b-a755cd239108"}
{"doc_id": "2025__Acceptability_of_wearable_technology_for_the_early_detection_of_dementia-causing__W4413786476", "source_path": "<redacted:source_path>", "chunk_id": 11, "source_chunk_idxs": [16], "num_tokens": 488, "text": "Acceptability of wearable technology for the early detection of dementia-causing diseases: perspectives from the CODEC II cohort\nResults\nEase of use\nUsability\nMany participants thought that the technologies could not be used effectively by those with visual impairments, hearing impairments, mobility issues, or living with cognitive decline. Some participants found the activity tracker screen hard to see when scrolling through the watch display, with one explaining how\n\"I can't see unless I put my glasses on, and I haven't bothered to put my glasses on\n\" (P24, F, person with SCD). Others found the headband audio recording \"\nvery quiet. You have to almost have it to your ear to hear it\n\" (P21, F, caregiver). A caregiver described some concerns about the headband, explaining how her mum was \"\nquite weak, [...] she can't hold things very well. [...] trying to hold it [headband] in a position and concentrate on pressing the button is [was] hard for her\"\n(P21, F, caregiver). Participants with cognitive impairments struggled with the memory recall games within the active smartphone app, as they felt it increased their awareness of their decreased cognitive ability, which some found frustrating.\n\"\nBrought it to the forefront that I am forgetting things, I am getting confused, [...] when I was doing the tests at times, I was getting quite frustrated.\"\n(P3, M, living with MCI).\nSome compatibility issues between the research study technologies and the participants' own devices appeared to emerge. Participants found pairing new wearables with their existing smartphones was difficult due to connectivity issues (e.g., lack of access to Wi-Fi); this was felt to have contributed to many participants stopping their use of the technology, as they perceived it \"\na waste of time\"\nand a\n\"source of frustration because my life is very much on the go, I always have to make sure [that] the Wi-Fi at the place I'm at, is connected\n\" (P14, F, living with MCI). Other participants noticed that their phones were not compatible with all the games in the active smartphone app, particularly a game that required a gyroscope to detect tilting motion (unlikely to be included in older phone models).", "doc_items_refs": ["#/texts/219", "#/texts/220", "#/texts/221", "#/texts/222", "#/texts/223", "#/texts/224", "#/texts/225", "#/texts/226", "#/texts/227", "#/texts/228", "#/texts/229", "#/texts/230", "#/texts/231", "#/texts/232", "#/texts/233"], "page_nos": [], "uuid": "26fa6c61-b1ef-4f3f-bff9-f66add8c96d2"}
{"doc_id": "2025__Acceptability_of_wearable_technology_for_the_early_detection_of_dementia-causing__W4413786476", "source_path": "<redacted:source_path>", "chunk_id": 12, "source_chunk_idxs": [17], "num_tokens": 175, "text": "Acceptability of wearable technology for the early detection of dementia-causing diseases: perspectives from the CODEC II cohort\nResults\nWearability\nAppearance\nParticipants were conscious of their appearance when wearing the headband, particularly female participants, with one remarking how their \"\nhusband just laughs, obviously every time I get into bed [...] I've got my headset [headband] and he just looks at me and goes, night\n\" (P24, F, person with SCD). Some participants with long hair described how the headband\n\"makes my hair really flat. So, every night you sleep in it you've got to dampen your hair and blow dry and fluff it up a bit, which isn't great [...], it's annoying.\"\n(P14, F, living with MCI).", "doc_items_refs": ["#/texts/236", "#/texts/237", "#/texts/238", "#/texts/239", "#/texts/240"], "page_nos": [], "uuid": "27683952-72e0-4b41-ab41-d28590af7709"}
{"doc_id": "2025__Acceptability_of_wearable_technology_for_the_early_detection_of_dementia-causing__W4413786476", "source_path": "<redacted:source_path>", "chunk_id": 13, "source_chunk_idxs": [18], "num_tokens": 486, "text": "Acceptability of wearable technology for the early detection of dementia-causing diseases: perspectives from the CODEC II cohort\nResults\nWearability\nPlacement of the wearable & comfort\nMany found the wrist-worn device (activity tracker) the most comfortable device to wear and appeared familiar with its use, describing it as \"\nbasically a watch\"\n(P11, F, person with SCD). A small number reported irritation due to fastening the device too tightly or a possible allergic reaction to the strap material. Many participants felt that the headband was\n\"a bit strange the first night or so\n[...]\nyou're just aware something's there\n\" (P9, F, living with MCI). This unease appeared to make it harder for participants to sleep, with some removing the headband during the night. A few participants also reported waking up \"\nwith a splitting headache\"\n(P8, M, person with SCD), which they attributed to\n\"just physically having something around your [their] head\n\" (P8, M, person with SCD). Some participants also felt that the instructions that they had to follow to use the headband were quite challenging:\n\"\nThese two little lugs [prongs on the headband to stabilize the band] at the back, they rather make your neck sore, and you've got to make sure there's no hair under them. That's a nuisance because I could put a scarf round to keep the hair off, but that slips off\n\" (P2, F, person with SCD).\nAnother participant struggled with placing the headband correctly on their head, describing how they wore the headband one night \"\nslightly lower [...], when you lay on your ear, that hurts\n\" (P12, F, living with MCI). Another participant appeared to improvise by putting the headband \"\nover the top of everything\"\n(P3, M, living with MCI) to help ensure a tighter fit. However, participants also described becoming accustomed to wearing the headband over time but felt that two weeks was \"\nmore than enough. I don't think you could do any more than that. [...] I'll be glad to get this off and have a proper night's sleep\n\" (P10, F, person with SCD).", "doc_items_refs": ["#/texts/242", "#/texts/243", "#/texts/244", "#/texts/245", "#/texts/246", "#/texts/247", "#/texts/248", "#/texts/249", "#/texts/250", "#/texts/251", "#/texts/252", "#/texts/253", "#/texts/254", "#/texts/255", "#/texts/256", "#/texts/257", "#/texts/258", "#/texts/259", "#/texts/260", "#/texts/261", "#/texts/262"], "page_nos": [], "uuid": "0003583d-e231-4eb7-a420-a5c5ddc4055d"}
{"doc_id": "2025__Acceptability_of_wearable_technology_for_the_early_detection_of_dementia-causing__W4413786476", "source_path": "<redacted:source_path>", "chunk_id": 14, "source_chunk_idxs": [19], "num_tokens": 276, "text": "Acceptability of wearable technology for the early detection of dementia-causing diseases: perspectives from the CODEC II cohort\nResults\nUsefulness\nSelf-monitoring\nThe push notifications (set as a manufacture default on the activity tracker) were designed to encourage users to be more physically active and were well liked by some. One participant described how this functionality was\n\"good for me, [...] to give me a little push to move more\n\" (P10, F, person with SCD). Others used the activity tracker to monitor other aspects of their health, such as \"\ngetting my resting heart rate and everything. Then calories and steps and movement. I found that really useful\n\" (P15, M, living with DLB). Step count did not appear to interest other participants, with one explaining how she was \"\nforever walking about doing things\n\" (P19, F, caregiver). Another participant perceived the activity tracker as less useful, explaining how she did not \"\nneed another device in my life to tell me what I can and can't do\n\" (P14, F, living with MCI). This participant was already using a commercially available activity tracker (one that was not provided by the study team) that delivered behavioral prompts, which may have contributed to this sense of being overwhelmed with notifications and reduced perceived autonomy.", "doc_items_refs": ["#/texts/265", "#/texts/266", "#/texts/267", "#/texts/268", "#/texts/269", "#/texts/270", "#/texts/271", "#/texts/272", "#/texts/273"], "page_nos": [], "uuid": "60429792-ae06-42fd-a770-72bba25e628c"}
{"doc_id": "2025__Acceptability_of_wearable_technology_for_the_early_detection_of_dementia-causing__W4413786476", "source_path": "<redacted:source_path>", "chunk_id": 15, "source_chunk_idxs": [20], "num_tokens": 389, "text": "Acceptability of wearable technology for the early detection of dementia-causing diseases: perspectives from the CODEC II cohort\nResults\nUsefulness\nJob relevance: clinical usefulness\nSome participants thought that the data collected by the technology could support more efficient clinical care. One participant described how her doctor had recommended that she use a portable electrocardiogram (ECG) machine at home, and when she noticed her heart rate was too low, she:\n\"Just simply went to the stuff, printed out the last two weeks, wrote a letter to the GP on the Monday, Tuesday night, she was on the phone reducing my medication. You can't get more efficient than that\n\" (P22, F, person with SCD).\nHowever, some participants preferred meeting with their healthcare professional in person and having the opportunity to discuss their situation with them, explaining how \"\notherwise you can't really ask any questions\n\" (P9, F, living with MCI). Other participants were concerned that the technology might not capture the holistic information needed to support a diagnosis, with one participant sharing the belief that this could only be done by a healthcare professional \"\nactually talking to them [patients] and watching how they move and how they react and what their face is doing and those kind of things.\n\" (P8, M, person with SCD).\nA few participants also observed discrepancies between the activity data (steps) that were collected by the study device (activity tracker) and the activity data (steps) collected by their own devices, with one participant explaining:\n\"\nThe watch [their personal one] on one hand and the [study activity tracker] on the other, and the watch says I've done twelve thousand steps, and the [study activity tracker name] says sixteen thousand steps. [...] It can't be accurate\n\" (P2, F, person with SCD).", "doc_items_refs": ["#/texts/275", "#/texts/276", "#/texts/277", "#/texts/278", "#/texts/279", "#/texts/280", "#/texts/281", "#/texts/282", "#/texts/283", "#/texts/284", "#/texts/285", "#/texts/286"], "page_nos": [], "uuid": "1ab420b0-91bd-4e48-8f93-c8b42d2c1316"}
{"doc_id": "2025__Acceptability_of_wearable_technology_for_the_early_detection_of_dementia-causing__W4413786476", "source_path": "<redacted:source_path>", "chunk_id": 16, "source_chunk_idxs": [21, 22], "num_tokens": 365, "text": "Acceptability of wearable technology for the early detection of dementia-causing diseases: perspectives from the CODEC II cohort\nResults\nUsefulness\nJob relevance: clinical usefulness\nOthers perceived discrepancies in the sleep data collected by the headband in terms of the duration of sleep, describing\n\"I went to bed about nine o'clock at night and I woke at six o'clock in the morning, yet it [headband] told me I'd had three-and-a-half-hour sleep\n\" (P15, M, living with DLB). As well as stages of sleep when compared with another study device (activity tracker); \"\nthe [study activity tracker name] will tell me maybe I've had 50 min deep [sleep], and then the headset [headband] will tell me I've done an hour and a half or two hours [of deep sleep]\"\n(P24, F, person with SCD).\n\nAcceptability of wearable technology for the early detection of dementia-causing diseases: perspectives from the CODEC II cohort\nResults\nTransparency\nLack of coherence\nA lack of transparency on what data had been collected from wearable technologies appeared to make some participants anxious. They questioned whether their personal information, such as bank account passwords, might have been collected from the passive smartphone app. One participant who shared these concerns\n\"didn't want that one [passive smartphone app on their phone] because I've got various banks and stuff like that on my phone\"\n(P10, F, person with SCD). Other participants posed questions about the safety of the headband and whether wearing it to obtain the EEG \"\nrecording would have a long-term harmful effect\n\" (P3, M, living with MCI).", "doc_items_refs": ["#/texts/287", "#/texts/288", "#/texts/289", "#/texts/290", "#/texts/291", "#/texts/294", "#/texts/295", "#/texts/296", "#/texts/297", "#/texts/298"], "page_nos": [], "uuid": "73f044c0-f3ef-4f26-824e-2251566155cf"}
{"doc_id": "2025__Acceptability_of_wearable_technology_for_the_early_detection_of_dementia-causing__W4413786476", "source_path": "<redacted:source_path>", "chunk_id": 17, "source_chunk_idxs": [23, 24], "num_tokens": 445, "text": "Acceptability of wearable technology for the early detection of dementia-causing diseases: perspectives from the CODEC II cohort\nResults\nTransparency\nData disclosure concerns\nSome participants were concerned about whether the health-related data generated from the technology were shared with other entities. One participant wondered if the government might sell their health data to third-party companies, raising\n\"the whole question of how our data is being used and what it's being used for\"\n(P16, M, living with MCI). The majority believed that health-related data were \"\nnot the sort of information I can see being hacked for malicious purposes. Whereas finance, one's payment processes, ins and outs, clearly is a target for criminality.\"\n(P6, M, person with SCD).\n\nAcceptability of wearable technology for the early detection of dementia-causing diseases: perspectives from the CODEC II cohort\nResults\nBehavioral intention\nLifestyle conflicts\nParticipants reflected on how their daily routine and responsibilities influenced the use of the technologies. Retired participants, without cognitive impairment or with subjective cognitive impairment, commonly reflected on\n\"one of the beauties of being retired is we can do something like this without a struggle, I just fit it in. So it isn't even a chore\"\n(P22, F, person with SCD), while participants with work or volunteering commitments or greater cognitive impairments noted how it was more challenging to integrate these technologies into their lifestyles. For instance, one of the games within the active smartphone app was \"\na little bit time-restricting if I'm going to work, because it says, there's one that says it could be seven minutes long. Well, it may take you longer\n\" (P10, F, person with SCD). Others found that having a set time to do the game on the active smartphone every day or within a fixed time period was inconvenient, especially if it clashed with a work- or volunteering related meeting, as they would \"\nquiet[en] it [the reminder] and then think I'll do that when I've finished, and I forgot\"\n(P15, M, living with DLB).", "doc_items_refs": ["#/texts/300", "#/texts/301", "#/texts/302", "#/texts/303", "#/texts/304", "#/texts/307", "#/texts/308", "#/texts/309", "#/texts/310", "#/texts/311", "#/texts/312", "#/texts/313"], "page_nos": [], "uuid": "50e9c90d-d532-4671-b8b0-82fa4cca67a7"}
{"doc_id": "2025__Acceptability_of_wearable_technology_for_the_early_detection_of_dementia-causing__W4413786476", "source_path": "<redacted:source_path>", "chunk_id": 18, "source_chunk_idxs": [25], "num_tokens": 165, "text": "Acceptability of wearable technology for the early detection of dementia-causing diseases: perspectives from the CODEC II cohort\nDiscussion\nThis study identified several factors affecting the acceptability of wearable technologies for the early detection of dementia-causing diseases among users. These included ease of use, wearability, usefulness, data transparency and behavioral intention. Participants expressed barriers related to the usability of wearables for individuals with busy lifestyles, low digital self-efficacy, visual and hearing impairments, mobility issues, and/or cognitive impairment. Participants preferred wearables that could be worn in a familiar, unobtrusive place, such as the wrist. A lack of transparency about what data had been collected from these wearables and whether it was going to be shared with other entities appeared to make some participants anxious.", "doc_items_refs": ["#/texts/315"], "page_nos": [], "uuid": "006bd4d8-c27a-4297-8d48-4dd2b79a2e40"}
{"doc_id": "2025__Acceptability_of_wearable_technology_for_the_early_detection_of_dementia-causing__W4413786476", "source_path": "<redacted:source_path>", "chunk_id": 19, "source_chunk_idxs": [26], "num_tokens": 489, "text": "Acceptability of wearable technology for the early detection of dementia-causing diseases: perspectives from the CODEC II cohort\nDiscussion\nInclusive technology design is vital for the successful adoption of digital technology within healthcare to ensure equitable access, regardless of sociodemographic background [\n18\n,\n36\n]. However, current technologies often exclude individuals due to age-related factors, such as declining dexterity, mobility, eyesight, and drier finger skin which can reduce the inbuilt adaptability or functionality of touch screen technologies [\n37\n,\n38\n,\n39\n]. These barriers affect the reliability, validity, robustness, and clinical usefulness of technologies for older adults [\n39\n], who are at risk of developing dementia-causing diseases [\n40\n], The design of cognitive testing games in smartphone applications may deter engagement from those with cognitive impairments, as they became more aware of their cognitive impairments, leading to frustration and reduced motivation to use the application. By taking an inclusive-by-design approach, such as involving the user throughout the design and development phase, their needs can be met, and government regulations regarding accessible design standards can be followed [\n41\n,\n42\n]. This can proactively address various issues, such as technology abandonment (users stop using a device), while enhancing acceptance of these technologies [\n43\n,\n44\n,\n45\n,\n46\n,\n47\n]. An individual's digital self-efficacy and requirement(s) for support must also be considered and addressed to improve inclusivity, particularly during the onboarding process. The need to provide digital support has been recognized by various governments, with the Italian government building a 'digital academy' that disseminates educational material to improve the accessibility of digital solutions [\n48\n,\n49\n]. The Belgium Government allocated €450 million to the design and implementation of digital literacy projects [\n49\n,\n50\n]. The European Union (EU) digital competence framework [\n51\n] was produced to guide the development of curricula to equip older adults with essential basic digital skills [\n52\n]. In the UK, organisations such as the 'Centre for Aging Better' and the 'Good Things Foundation' have published good practice principles for delivering digital support to older adults [\n43\n]. These eight principles include tailoring the pace of teaching to an individual, creating space for repetition and reflection to consolidate learning, using simple language and avoiding technical terms, and codesigning services with users [\n43", "doc_items_refs": ["#/texts/316", "#/texts/317", "#/texts/318", "#/texts/319", "#/texts/320", "#/texts/321", "#/texts/322", "#/texts/323", "#/texts/324", "#/texts/325", "#/texts/326", "#/texts/327", "#/texts/328", "#/texts/329", "#/texts/330", "#/texts/331", "#/texts/332", "#/texts/333", "#/texts/334", "#/texts/335", "#/texts/336", "#/texts/337", "#/texts/338", "#/texts/339", "#/texts/340", "#/texts/341", "#/texts/342", "#/texts/343", "#/texts/344", "#/texts/345", "#/texts/346", "#/texts/347", "#/texts/348", "#/texts/349", "#/texts/350", "#/texts/351", "#/texts/352", "#/texts/353", "#/texts/354", "#/texts/355", "#/texts/356", "#/texts/357", "#/texts/358", "#/texts/359"], "page_nos": [], "uuid": "ef8b6e5d-98c0-4a1f-89b9-ce177faee810"}
{"doc_id": "2025__Acceptability_of_wearable_technology_for_the_early_detection_of_dementia-causing__W4413786476", "source_path": "<redacted:source_path>", "chunk_id": 20, "source_chunk_idxs": [27], "num_tokens": 236, "text": "Acceptability of wearable technology for the early detection of dementia-causing diseases: perspectives from the CODEC II cohort\nDiscussion\n]. These frameworks and principles should be integrated into the design of digital health research to ensure that the user is sufficiently supported in using the technology.\nIt is important to consider the wearability of the technology, including where the device is worn on the body, as this can affect the social acceptability of the wearable device, especially considering gestures and touches the user may make to the device [\n53\n]. Our study highlighted how individuals prefer wearable technology placed on the wrist rather than the head, which is consistent with previous research findings [\n53\n,\n54\n,\n55\n]. This is likely due to the increased familiarity and understanding of smartwatches [\n56\n,\n57\n]. Another key element of wearability that our study highlighted was the comfort an individual experiences when the technology was worn correctly versus incorrectly, highlighting the importance of providing adequate support and guidance to caregivers of individuals who cannot report their discomfort to aid proper use of the technology. For example, checking for skin changes (reddening or dryness) could help reduce harm to vulnerable groups.", "doc_items_refs": ["#/texts/360", "#/texts/361", "#/texts/362", "#/texts/363", "#/texts/364", "#/texts/365", "#/texts/366", "#/texts/367", "#/texts/368", "#/texts/369", "#/texts/370", "#/texts/371", "#/texts/372", "#/texts/373"], "page_nos": [], "uuid": "f9088c10-3e62-4974-bc60-fd49df2adcde"}
{"doc_id": "2025__Acceptability_of_wearable_technology_for_the_early_detection_of_dementia-causing__W4413786476", "source_path": "<redacted:source_path>", "chunk_id": 21, "source_chunk_idxs": [28], "num_tokens": 343, "text": "Acceptability of wearable technology for the early detection of dementia-causing diseases: perspectives from the CODEC II cohort\nDiscussion\nTrust and transparency also influenced the acceptance of wearable technologies for health purposes. Similar findings were reported in another study in which surveyed patients (n = 416) reported that trust and privacy concerns, perceived usefulness and perceived ease of use influenced their acceptance of digital health technology [\n58\n]. Trust, in particular, has been suggested to play an important role in the successful adoption of digital health technology in the clinical setting, and without it, there is a greater risk of devices not being used (which contributes to increasing costs), increasing user concerns and reducing acceptance of these devices [\n59\n,\n60\n]. Strategies are needed to improve communication around technology's limitations, capabilities, and data disclosure. This would help improve the clarity, navigability, and noticeability of the information provided to reassure the user and support their understanding [\n61\n]. Some strategies have included using a human-centered design [\n62\n], simple lay term language to improve readability for all users, avoiding vague terms that can leave an individual questioning the meaning of phrases, increasing the use of visualizations, meaningfully organizing the text (avoiding a 'wall of text' and scattered information around different documents), and considering the length of information as excessively lengthy documents are likely to cause information overload [\n61\n]. However, the feasibility of implementing such strategies is questionable due to the amount of resources needed in terms of man hours, technical skill, and time and funding to involve under-served groups (e.g., those with low educational attainment) in human centered design approaches [\n63\n].", "doc_items_refs": ["#/texts/374", "#/texts/375", "#/texts/376", "#/texts/377", "#/texts/378", "#/texts/379", "#/texts/380", "#/texts/381", "#/texts/382", "#/texts/383", "#/texts/384", "#/texts/385", "#/texts/386", "#/texts/387", "#/texts/388"], "page_nos": [], "uuid": "614b8ecb-79d0-478d-bde4-40da557c07f0"}
{"doc_id": "2025__Acceptability_of_wearable_technology_for_the_early_detection_of_dementia-causing__W4413786476", "source_path": "<redacted:source_path>", "chunk_id": 22, "source_chunk_idxs": [29], "num_tokens": 383, "text": "Acceptability of wearable technology for the early detection of dementia-causing diseases: perspectives from the CODEC II cohort\nDiscussion\nThe final key finding from this study related to unintended behavior changes, such as increasing activity levels, that some individuals reported when using wearable technologies. Previous research has shown various commercially available activity trackers, such as the one used in this study, contain several behavioral change techniques including positive reinforcing messages when physical activity is carried out, proven to increase physical activity in older adults [\n64\n]. However, one systematic review suggested wrist worn activity trackers cannot significantly improve physiology (e.g., reducing high blood pressure) [\n65\n]. As a higher activity level is known to be a modifiable protective lifestyle factor in reducing the risk of developing a dementia-causing disease [\n66\n], and high blood pressure increases an individual's risk of developing dementia causing diseases [\n67\n], further research is needed to explore the impact the use of wrist worn activity trackers may have on the ability to support early detection.\nFurthermore, this study highlighted the need to provide users with busy lifestyles with additional support and encouragement to aid in the adoption of technologies. This could be achieved by using behavior change frameworks, such as the COM-B (Capability, Opportunity, and Motivation) model, which support the understanding of why a specific behavior occurs and how to create targeted interventions that lead to effective change [\n68\n], The COM-B model could be integrated into the design, development and implementation of wearable technologies in healthcare to promote desired behaviors (i.e., technology adoption). The amount of effort needed from users to adopt the technology should also be minimal. We found that many participants in this study did not have any issues with continuing to use the passive smartphone app after the study had completed but struggled to use the active smartphone app continuously every day for two weeks.", "doc_items_refs": ["#/texts/389", "#/texts/390", "#/texts/391", "#/texts/392", "#/texts/393", "#/texts/394", "#/texts/395", "#/texts/396", "#/texts/397", "#/texts/398", "#/texts/399", "#/texts/400"], "page_nos": [], "uuid": "bdd64d30-f248-405f-ad16-8a2648e974aa"}
{"doc_id": "2025__Acceptability_of_wearable_technology_for_the_early_detection_of_dementia-causing__W4413786476", "source_path": "<redacted:source_path>", "chunk_id": 23, "source_chunk_idxs": [30], "num_tokens": 378, "text": "Acceptability of wearable technology for the early detection of dementia-causing diseases: perspectives from the CODEC II cohort\nRecommendations\nBuilding on the existing literature and the key findings from this qualitative study, we propose four novel practical recommendations need to be considered by researchers and technology developers when designing, developing, and implementing digital technologies to support the early detection of dementia-causing diseases (Fig.\n4\n).\nFig. 4\nThe first recommendation is to follow an inclusive by design approach. This involves codesigning the technology with the user or, if commercially available technology is used, then all the user guidance and additional health-related information relating to the technologies should be codesigned with the user. Accessibility design standards [\n41\n,\n42\n] must also be followed, and digital support services need to be codesigned with users, alongside guidance from the EU digital competence framework [\n51\n] and the Centre for Aging Better's eight good practice principles for delivering digital support to older adults [\n43\n]. We also recommend that the government and public health policy and regulatory bodies set recommendations and guidelines for delivering digital support for older adults to improve the standardization of digital support services.\nThe second recommendation is to consider the wearability of the device, opting for wrist placement or other unobtrusive areas that are not visible to others, to reduce the impact on appearance. It also needs to be easy to position correctly and comfortable (even when fitted incorrectly) to reduce unintended harm among vulnerable groups.\nThe third recommendation is to codevelop a communication plan with users to increase understanding of the technology and data transparency; this could include the use of visualizations and organizing information in a meaningful, logical manner [\n61\n].\nThe final recommendation is to consider the effort required from users of the technology, opting for passive technologies where possible, as well as embedding behavioral change strategies to promote adoption.", "doc_items_refs": ["#/texts/402", "#/texts/403", "#/texts/404", "#/texts/405", "#/texts/406", "#/texts/407", "#/texts/408", "#/texts/409", "#/texts/410", "#/texts/411", "#/texts/412", "#/texts/413", "#/texts/414", "#/texts/415", "#/texts/416", "#/texts/417", "#/texts/418", "#/texts/419"], "page_nos": [], "uuid": "58b88deb-a5b2-4549-8241-e0e27fd08d6a"}
{"doc_id": "2025__Acceptability_of_wearable_technology_for_the_early_detection_of_dementia-causing__W4413786476", "source_path": "<redacted:source_path>", "chunk_id": 24, "source_chunk_idxs": [31], "num_tokens": 509, "text": "Acceptability of wearable technology for the early detection of dementia-causing diseases: perspectives from the CODEC II cohort\nStrengths and limitations\nStrengths of this qualitative study include the collection of data until data saturation was achieved, peer-debriefing was conducted during analysis with various members of the research team, and that all aspects of the research were conducted and reported with a high level of transparency, ensuring rigour and trustworthiness of our findings [\n34\n,\n35\n]. Our use of the framework approach, which supports an inductive analysis followed by deductive analysis, aided the examination and refinement of existing technology acceptance theories. However, this study only included a sub-sample of participants from one cohort based in Essex who may hold different views compared to individuals residing in other areas of the UK. For example, the North East of England has the highest prevalence of individuals with low levels of digital engagement (32%) [\n69\n], low digital competency (28%) [\n70\n], and offline individuals (i.e., those who do not use internet enabled devices or internet based communication routes or information sources (5% in 2023 vs England's average of 3.6%) [\n70\n]. Within certain areas of the North East, older adults in particular, are extremely likely to face digital inequities as 94% of digitally excluded residents in North Tyneside were over 60 years old [\n71\n]. Thus, individuals residing in a region with low digital engagement and digital competencies may hold different opinions and perspectives on the use of technology to support the early detection of dementia causing diseases. Furthermore, this study excluded those who could not speak English, did not have a smartphone or internet access and lacked representation of underserved groups who are known to be at risk of digital exclusion, such as individuals without a fixed address or from ethnic minority groups [\n72\n]. The use of remote interviews may have unintentionally excluded those with low digital literacy skills and/or those without access to adequate connectivity to support the use of technologies in such a manner, as some participants with access to slow connectivity (Wi-Fi) bandwidth faced buffering issues when using zoom. Mitigating digital exclusion is vital when promoting inclusivity of digital health technologies, as failing to do so can exacerbate health inequities, with underserved groups facing additional barriers when using, accessing, and/or feeling motivated to use digital technology for healthcare purposes [\n73", "doc_items_refs": ["#/texts/421", "#/texts/422", "#/texts/423", "#/texts/424", "#/texts/425", "#/texts/426", "#/texts/427", "#/texts/428", "#/texts/429", "#/texts/430", "#/texts/431", "#/texts/432", "#/texts/433", "#/texts/434", "#/texts/435", "#/texts/436"], "page_nos": [], "uuid": "24097c95-5dba-4b60-ae09-70f66ba71054"}
{"doc_id": "2025__Acceptability_of_wearable_technology_for_the_early_detection_of_dementia-causing__W4413786476", "source_path": "<redacted:source_path>", "chunk_id": 25, "source_chunk_idxs": [32, 33, 34, 35], "num_tokens": 366, "text": "Acceptability of wearable technology for the early detection of dementia-causing diseases: perspectives from the CODEC II cohort\nStrengths and limitations\n]. Future work should explore the feasibility and effectiveness of implementing current recommendations to support digital health equity among underserved groups at risk of digital exclusion, such as adopting a collaborative working approach with all users and providers to ensure needs are met and promote inclusivity [\n8\n,\n72\n].\n\nAcceptability of wearable technology for the early detection of dementia-causing diseases: perspectives from the CODEC II cohort\nConclusion\nThis study identified five key themes that affected the acceptability of wearable technologies to support the early detection of dementia-causing diseases and proposed four novel practical recommendations to support researchers in designing, developing, and implementing digital health interventions in an acceptable, inclusive manner. Future research is needed to assess the effectiveness of implementing recommendations to support digital health equity.\n\nAcceptability of wearable technology for the early detection of dementia-causing diseases: perspectives from the CODEC II cohort\nData availability\nThe datasets generated and analyzed during this study are not publicly available due to a potential breach of participant confidentiality. Anonymized datasets may be available from the corresponding author upon reasonable request.\n\nAcceptability of wearable technology for the early detection of dementia-causing diseases: perspectives from the CODEC II cohort\nAbbreviations\nAD:\nAlzheimer's Disease\nCODEC:\nPredictors of COgnitive DECline using digital devices\nCOM-B:\nCapability, Opportunity, and Motivation model\nCOREQ:\nConsolidated Criteria for Reporting Qualitative Research\nDLB:\nDementia with Lewy Bodies\nEDoN:\nEarly Detection of Neurodegenerative Diseases\nISTAM:\nIntelligent Systems Technology Acceptance Model\nMCI:\nMild Cognitive Impairment\nSCD:\nSubjective Cognitive Decline\nSRQR:\nStandards for Reporting Qualitative Research\nUK:\nUnited Kingdom", "doc_items_refs": ["#/texts/437", "#/texts/438", "#/texts/439", "#/texts/440", "#/texts/441", "#/texts/443", "#/texts/445", "#/texts/447", "#/texts/448", "#/texts/449", "#/texts/450", "#/texts/451", "#/texts/452", "#/texts/453", "#/texts/454", "#/texts/455", "#/texts/456", "#/texts/457", "#/texts/458", "#/texts/459", "#/texts/460", "#/texts/461", "#/texts/462", "#/texts/463", "#/texts/464", "#/texts/465", "#/texts/466", "#/texts/467", "#/texts/468"], "page_nos": [], "uuid": "d07c48ae-1e07-480d-8a3e-f365bbd5dfa9"}
{"doc_id": "2025__Acceptability_of_wearable_technology_for_the_early_detection_of_dementia-causing__W4413786476", "source_path": "<redacted:source_path>", "chunk_id": 26, "source_chunk_idxs": [36], "num_tokens": 478, "text": "Acceptability of wearable technology for the early detection of dementia-causing diseases: perspectives from the CODEC II cohort\nReferences\n1. Nichols E, Steinmetz JD, Vollset SE, Fukutaki K, Chalek J, Abd-Allah F, Abdoli A, Abualhasan A, Abu-Gharbieh E, Akram TT, Al HH. Estimation of the global prevalence of dementia in 2019 and forecasted prevalence in 2050: an analysis for the Global Burden of Disease Study 2019. Lancet Public Health. 2022;7(2):e105-25.\nArticle\nGoogle Scholar\n2. What is dementia. NHS. Available from:\nhttps://www.nhs.uk/conditions/dementia/about-dementia/what-is-dementia/#:~:text=Dementia%20is%20a%20syndrome%20(a,between%20Alzheimer's%20disease%20and%20dementia\n. Accessed 2024-08-08.\n3. Causes of dementia. NHS. Available from:\nhttps://www.nhs.uk/conditions/dementia/about-dementia/causes/\n. Accessed 2024-08-08.\n4. Bryn Mawr Communications. Preclinical, prodromal, and dementia stages of Alzheimer's disease - Practical neurology. Practical Neurology. Available from:\nhttps://practicalneurology.com/articles/2019-june/preclinical-prodromal-and-dementia-stages-ofalzheimers-disease\n. Accessed 2024-08-08.\n5. Anderson R, Knapp M, Wittenberg R, Handels R, Schott JM. Economic modelling of disease-modifying therapies in Alzheimer's disease. London: School of Economics Personal Social Services Research Unit; 2018.\nGoogle Scholar\n6. Press release: Lecanemab licensed for adult patients in the early stages of Alzheimer's disease. Gov.uk. Available from:\nhttps://www.gov.uk/government/news/lecanemab-licensed-for-adult-patients-in-the-early-stages-of-alzheimers-disease\n. Accessed 2024-09-05.", "doc_items_refs": ["#/texts/470", "#/texts/471", "#/texts/472", "#/texts/473", "#/texts/474", "#/texts/475"], "page_nos": [], "uuid": "eb19883f-1652-4ea9-a2fe-c4799ed719b2"}
{"doc_id": "2025__Acceptability_of_wearable_technology_for_the_early_detection_of_dementia-causing__W4413786476", "source_path": "<redacted:source_path>", "chunk_id": 27, "source_chunk_idxs": [37], "num_tokens": 496, "text": "Acceptability of wearable technology for the early detection of dementia-causing diseases: perspectives from the CODEC II cohort\nReferences\n7. Tests for diagnosing dementia: dementia guide. NHS Choices.\nhttps://www.nhs.uk/conditions/dementia/diagnosis-tests/\n. Aaccessed 2024-08-08.\n8. Beyer L, Stocker H, Rujescu D, Holleczek B, Stockmann J, Nabers A, et al. Amyloid-beta misfolding and GFAP predict risk of clinical Alzheimer's disease diagnosis within 17 years. Alzheimers Dement. 2022;19(3):1020-8.\nArticle\nPubMed\nGoogle Scholar\n9. How biomarkers help diagnose dementia. National Institute on Aging. 2022. Available from:\nhttps://www.nia.nih.gov/health/alzheimers-symptoms-and-diagnosis/how-biomarkers-help-diagnose-dementia#blood\n.\n10. Farlow MR. Etiology and pathogenesis of Alzheimer's disease. Am J Health Syst Pharm. 1998;55(suppl\\_2):S5-10.\nArticle\nPubMed\nCAS\nGoogle Scholar\n11. Ryzhikova E, Kazakov O, Halamkova L, Celmins D, Malone P, Molho E, Zimmerman EA, Lednev IK. Raman spectroscopy of blood serum for Alzheimer's disease diagnostics: specificity relative to other types of dementia. J Biophotonics. 2015;8(7):584-96.\nArticle\nPubMed\nGoogle Scholar\n12. Mc Ardle R, Del Din S, Yarnall A. Gait analysis as a clinical tool for dementia: current perspectives and future challenges. Adv Clin Neurosci Rehabil. 2021;20.\n13. Robin J, Xu M, Kaufman LD, Simpson W. Using digital speech assessments to detect early signs of cognitive impairment. Front Digit Health. 2021;3:749758.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n14. Kaye J, Mattek N, Dodge HH, Campbell I, Hayes T, Austin D, et al. Unobtrusive measurement of daily computer use to detect mild cognitive impairment. Alzheimers Dement. 2014;10(1):10-7.\nArticle\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/476", "#/texts/477", "#/texts/478", "#/texts/479", "#/texts/480", "#/texts/481", "#/texts/482", "#/texts/483"], "page_nos": [], "uuid": "733a7ac2-4060-475f-a52b-cd3d0e747f79"}
{"doc_id": "2025__Acceptability_of_wearable_technology_for_the_early_detection_of_dementia-causing__W4413786476", "source_path": "<redacted:source_path>", "chunk_id": 28, "source_chunk_idxs": [38], "num_tokens": 428, "text": "Acceptability of wearable technology for the early detection of dementia-causing diseases: perspectives from the CODEC II cohort\nReferences\n15. Frey AL, Karran M, Jimenez R, Baxter J, Adeogun M, Bose N, et al. Harnessing the potential of digital technologies for the Early Detection of Neurodegenerative diseases (EDoN). OSF. Preprint posted online Oct 1, 2019.\n16. European Medicines Agency. Questions and answers: qualification of digital technology-based methodologies to support approval of medicinal products.\n17. US Food and Drug Administration. Digital health Technologies for Remote Data Acquisition in clinical investigations: guidance for industry, investigators, and other stakeholders.\n18. Evidence standards framework for digital health technologies. National Institute for Health and Clinical Excellence. 2023. Retrieved from: evidence-standards-framework-for-digital-health-technologies-pdf-1124017457605 (nice.org.uk).\n19. Jessen F, Amarigliod RE, et al. Subjective Cognitive Decline Initiative (SCD-I) Working Group, A conceptual framework for research on subjective cognitive decline in preclinical Alzheimer's disease. Alzheimers Dement. 2014;10(6):844-52.\nArticle\nPubMed\nGoogle Scholar\n20. Alzheimer's Association. Facts and Figures. Alzheimers Dement. 2018;14(3):367-429.\nGoogle Scholar\n21. Petersen RC, Caracciolo B, Brayne C, Gauthier S, Jelic V, Fratiglioni L. Mild cognitive impairment: a concept in evolution. J Intern Med. 2014;275:214-28.\nArticle\nPubMed\nPubMed Central\nCAS\nGoogle Scholar\n22. Sperling RA, Aisen PS, Beckett LA, et al. Toward defining the preclinical stages of Alzheimer's disease: recommendations from the National Institute on Aging-Alzheimer's Association workgroups on diagnostic guidelines for Alzheimer's disease. Alzheimers Dement. 2011;7:280-92.\nArticle\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/484", "#/texts/485", "#/texts/486", "#/texts/487", "#/texts/488", "#/texts/489", "#/texts/490", "#/texts/491"], "page_nos": [], "uuid": "9e6c3fd9-38bf-453b-9513-7229127c289b"}
{"doc_id": "2025__Acceptability_of_wearable_technology_for_the_early_detection_of_dementia-causing__W4413786476", "source_path": "<redacted:source_path>", "chunk_id": 29, "source_chunk_idxs": [39], "num_tokens": 512, "text": "Acceptability of wearable technology for the early detection of dementia-causing diseases: perspectives from the CODEC II cohort\nReferences\n23. Stavropoulos TG, Lazarou I, Diaz A, Gove D, Georges J, Manyakov NV, Pich EM, Hinds C, Tsolaki M, Nikolopoulos S, Kompatsiaris I. Wearable devices for assessing function in alzheimer's disease: a European public involvement activity about the features and preferences of patients and caregivers. Front Aging Neurosci. 2021;12(13):643135.\nArticle\nGoogle Scholar\n24. Sekhon M, Cartwright M, Francis JJ. Acceptability of healthcare interventions: an overview of reviews and development of a theoretical framework. BMC Health Serv Res. 2017;17:88.\nhttps://doi.org/10.1186/s12913-017-2031-8\n.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n25. NHS (2020). Predictors of COgnitive DECline using digital devices - CODEC II. [online] Health Research Authority. Available at:\nhttps://www.hra.nhs.uk/planning-and-improving-research/application-summaries/research-summaries/predictors-of-cognitive-decline-using-digital-devices-codec-ii/\n. Accessed 19 Aug. 2024.\n26. Wilson S, Mc Ardle R, Tolley C, Slight S. Usability and acceptability of wearable technology in the early detection of dementia. Alzheimers Dement. 2022;18(Suppl 2):e059820.\nhttps://doi.org/10.1002/alz.059820\n.\nArticle\nPubMed\nGoogle Scholar\n27. Ritchie J, Spencer L. Qualitative data analysis for applied policy research. In: Bryman A, Burgess RG, editors. Analyzing Qualitative Data. London, UK: Routledge; 1994. p. 173-94.\nChapter\nGoogle Scholar\n28. Gale NK, Heath G, Cameron E, Rashid S, Redwood S. Using the framework method for the analysis of qualitative data in multi-disciplinary health research. BMC Med Res Methodol. 2013;13:117.\nhttps://doi.org/10.1186/1471-2288-13-117\n.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/492", "#/texts/493", "#/texts/494", "#/texts/495", "#/texts/496", "#/texts/497"], "page_nos": [], "uuid": "f53e3eb2-25d3-41b9-acbc-c46c6f1a873a"}
{"doc_id": "2025__Acceptability_of_wearable_technology_for_the_early_detection_of_dementia-causing__W4413786476", "source_path": "<redacted:source_path>", "chunk_id": 30, "source_chunk_idxs": [40], "num_tokens": 413, "text": "Acceptability of wearable technology for the early detection of dementia-causing diseases: perspectives from the CODEC II cohort\nReferences\n29. Braun V, Clarke V. Using thematic analysis in psychology. Qual Res Psychol. 2006;3(2):77-101.\nhttps://doi.org/10.1191/1478088706qp063oa\n.\nArticle\nGoogle Scholar\n30. Pope C, Ziebland S, Mays N. Qualitative research in health care: Analysing qualitative data. BMJ. 2000;320(7227):114.\nArticle\nPubMed\nPubMed Central\nCAS\nGoogle Scholar\n31. Vorm ES, Combs DJ. Integrating transparency, trust, and acceptance: the intelligent systems technology acceptance model (ISTAM). Int J Hum Comput Int. 2022;38(18-20):1828-45.\nGoogle Scholar\n32. Glaser BG, Strauss A. The discovery of grounded theory: Strategies for qualitative research. Chicago, IL: Aldine; 1967.\nGoogle Scholar\n33. Francis JJ, Johnston M, Robertson C, Glidewell L, Entwistle V, Eccles MP, Grimshaw JM. What is an adequate sample size? Operationalising data saturation for theory-based interview studies. Psychol Health. 2010;25(10):1229-45.\nArticle\nPubMed\nGoogle Scholar\n34. O'Brien BC, Harris IB, Beckman TJ, Reed DA, Cook DA. Standards for reporting qualitative research: a synthesis of recommendations. Acad Med. 2014;89(9):1245-51.\nArticle\nPubMed\nGoogle Scholar\n35. Tong A, Sainsbury P, Craig J. Consolidated criteria for reporting qualitative research (COREQ): a 32-item checklist for interviews and focus groups. Int J Qual Health Care. 2007;19(6):349-57.\nArticle\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/498", "#/texts/499", "#/texts/500", "#/texts/501", "#/texts/502", "#/texts/503", "#/texts/504"], "page_nos": [], "uuid": "8a6e3598-350a-492d-bdfe-876db111620f"}
{"doc_id": "2025__Acceptability_of_wearable_technology_for_the_early_detection_of_dementia-causing__W4413786476", "source_path": "<redacted:source_path>", "chunk_id": 31, "source_chunk_idxs": [41], "num_tokens": 506, "text": "Acceptability of wearable technology for the early detection of dementia-causing diseases: perspectives from the CODEC II cohort\nReferences\n36. What is inclusive design and why is it important? - NHS England Digital. NHS England Digital. 2023. Available from:\nhttps://digital.nhs.uk/blog/design-matters/2023/what-is-inclusive-design#:~:text=%E2%80%9CInclusive%20design%20is%20an%20approach,their%20background%20or%20life%20experience.%E2%80%9D\n.\n37. Culén AL, Bratteteig T. Touch-screens and elderly users: A perfect match? In ACHI 2013, The Sixth International Conference on Advances in Computer-Human Interactions. 2013. pp. s460-465.\n38. Bakaev M. Fitts' law for older adults: considering a factor of age. Proceedings of the VIII Brazilian Symposium on Human Factors in Computing Systems. Porto Alegre, Brazil: Sociedade Brasileira de Computação; 2008. pp. 260-263.\n39. Jenkins A, et al. Administering cognitive tests through touch screen tablet devices: potential Issues'. 2016:1169-1182.\n40. Risk factors for dementia. Alzheimer's Society. 2024. Available from:\nhttps://www.alzheimers.org.uk/about-dementia/managing-the-risk-of-dementia/risk-factors-for-dementia#:~:text=The%20biggest%20risk%20factor%20for,roughly%20doubling%20every%20five%20years\n.\n41. Accessibility online. WCAG 2.0 and the Revised Section 508 Standards. Available from:\nhttps://www.accessibilityonline.org/cioc-508/archives/110612\n.\n42. Understanding accessibility requirements for public sector bodies. GOV.UK. 2023. Available from:\nhttps://www.gov.uk/guidance/accessibility-requirements-for-public-sector-websites-and-apps\n.\n43. Mouland J, Richardson J, Damadoran L. The digital age: new approaches to supporting people in later life get online. Centre for Ageing Better: London, UK; 2018.\nBook\nGoogle Scholar", "doc_items_refs": ["#/texts/505", "#/texts/506", "#/texts/507", "#/texts/508", "#/texts/509", "#/texts/510", "#/texts/511", "#/texts/512"], "page_nos": [], "uuid": "0b279c4e-bb9c-4354-8019-4209a0eec710"}
{"doc_id": "2025__Acceptability_of_wearable_technology_for_the_early_detection_of_dementia-causing__W4413786476", "source_path": "<redacted:source_path>", "chunk_id": 32, "source_chunk_idxs": [42], "num_tokens": 426, "text": "Acceptability of wearable technology for the early detection of dementia-causing diseases: perspectives from the CODEC II cohort\nReferences\n44. Crabtree A, Hemmings T, Rodden T, et al. (eds) Designing with care: adapting cultural probes to inform design in sensitive settings. In: Proceedings of the 2004 Australasian conference on computer-human interaction (OZCHI2004), Wollongong, New South Wales, Australia, November 22-24, 2004.\n45. Parette HP, Brotherson MJ. Family-centered and culturally responsive assistive technology decision making. Infants Young Child. 2004;17:355-67.\nArticle\nGoogle Scholar\n46. Parette HP, Huer MB, Scherer M. Effects of acculturation on assistive technology service delivery. J Special Educ Technol. 2004;19:31-41.\nArticle\nGoogle Scholar\n47. Scherer MJ. Matching person &amp; assistive technology: beyond access to participation. In: Proceedings of assistive technology &amp; the labour market, Prague, Czech Republic, 23-24 October 2008.\n48. Repubblica digitale. Dipartimento per La Trasformazione Digitale. 2021. Available from:\nhttps://innovazione.gov.it/progetti/repubblica-digitale/\n.\n49. Fundamental rights of older people: ensuring access to public services in digital societies. European Union Agency for Fundamental Rights. 2024. Available from:\nhttps://fra.europa.eu/en/publication/2023/older-people-digital-rights?page=5#read-online\n.\n50. Belgium, Office of the Secretary of State for Recovery and Strategic Investments, in charge of Scientific Policy (Cabinet du Secrétaire d'Etat à la Relance et aux Investissements Stratégiques, en charge de la Politique Scientifique). National Recovery and Resilience Plan (Plan national pour la reprise et la résilience): Brussels; 2021.", "doc_items_refs": ["#/texts/513", "#/texts/514", "#/texts/515", "#/texts/516", "#/texts/517", "#/texts/518", "#/texts/519"], "page_nos": [], "uuid": "eafbfcce-05b8-43be-9b14-4d9d43936f60"}
{"doc_id": "2025__Acceptability_of_wearable_technology_for_the_early_detection_of_dementia-causing__W4413786476", "source_path": "<redacted:source_path>", "chunk_id": 33, "source_chunk_idxs": [43], "num_tokens": 507, "text": "Acceptability of wearable technology for the early detection of dementia-causing diseases: perspectives from the CODEC II cohort\nReferences\n51. Vuorikari R, Kluzer S, Punie Y. DigComp 2.2: The Digital Competence Framework for Citizens - With new examples of knowledge, skills and attitudes, EUR 31006 EN, Publications Office of the European Union, Luxembourg, 2022, ISBN 978-92-76-48882-8.\nhttps://doi.org/10.2760/115376\n, JRC128415.\n52. Kebede AS, Ozolins LL, Holst H, Galvin K. Digital engagement of older adults: scoping review. J Med internet Res. 2022;24(12):e40192.\nhttps://doi.org/10.2196/40192\n. Published 2022 Dec 7.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n53. Scherer MJ, Craddock G, Mackeogh T. The relationship of personal factors and subjective well-being to the use of assistive technology devices. Disabil Rehabil. 2011;33:811-7.\nArticle\nPubMed\nGoogle Scholar\n54. Zeagler C. Where to wear it: functional, technical, and social considerations in on-body location for wearable technology 20 years of designing for wearability. In: Proceedings of the 2017 ACM International Symposium on Wearable Computers 2017. pp. 150-157.\n55. Bergmann JH, Chandaria V, McGregor A. Wearable and implantable sensors: the patient's perspective. Sensors (Basel). 2012;12(12):16695-709.\nhttps://doi.org/10.3390/s121216695\n. Published 2012 Dec 5.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n56. Peek ST, Wouters EJ, Van Hoof J, Luijkx KG, Boeije HR, Vrijhoef HJ. Factors influencing acceptance of technology for aging in place: a systematic review. Int J Med Informatics. 2014;83(4):235-48.\nArticle\nGoogle Scholar\n57. Brown SA, Venkatesh V. Model of adoption of technology in households: a baseline model test and extension incorporating household life cycle. MIS Q. 2005:399-426.", "doc_items_refs": ["#/texts/520", "#/texts/521", "#/texts/522", "#/texts/523", "#/texts/524", "#/texts/525", "#/texts/526"], "page_nos": [], "uuid": "061e707b-9ee5-4a14-80db-df5890ecef82"}
{"doc_id": "2025__Acceptability_of_wearable_technology_for_the_early_detection_of_dementia-causing__W4413786476", "source_path": "<redacted:source_path>", "chunk_id": 34, "source_chunk_idxs": [44], "num_tokens": 461, "text": "Acceptability of wearable technology for the early detection of dementia-causing diseases: perspectives from the CODEC II cohort\nReferences\n58. Dhagarra D, Goswami M, Kumar G. Impact of trust and privacy concerns on technology acceptance in healthcare: an Indian perspective. Int J Med Inform. 2020;141: 104164.\nhttps://doi.org/10.1016/j.ijmedinf.2020.104164\n.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n59. Shevtsova D, Ahmed A, Boot IWA, et al. Trust in and acceptance of artificial intelligence applications in medicine: mixed methods study. JMIR Hum Factors. 2024;11:e47031.\nhttps://doi.org/10.2196/47031\n. Published 2024 Jan 17.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n60. Kerasidou CX, Kerasidou A, Buscher M, Wilkinson S. Before and beyond trust: reliance in medical AI. J Med Ethics. 2022;48(11):852-6.\nArticle\nPubMed\nGoogle Scholar\n61. Rossi A, Lenzini G. Transparency by design in data-informed research: a collection of information design patterns. Comput Law Secur Rev. 2020;37(1): 105402.\nArticle\nGoogle Scholar\n62. Wang R, Bush-Evans R, Arden-Close E, Bolat E, McAlaney J, Hodge S, Thomas S, Phalp K. Transparency in persuasive technology, immersive technology, and online marketing: facilitating users' informed decision making and practical implications. Comput Hum Behav. 2023;139(1):107545.\nArticle\nGoogle Scholar\n63. Coe D, Bigirumurame T, Burgess M, Rouse J, Wroe C. Enablers and barriers to engaging under-served groups in research: Survey of the United Kingdom research professional's views. NIHR Open Res. 2023;3:37.\nhttps://doi.org/10.3310/nihropenres.13434.2\n. Published 2023 Dec 18.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/527", "#/texts/528", "#/texts/529", "#/texts/530", "#/texts/531", "#/texts/532"], "page_nos": [], "uuid": "a79b1546-829e-4f91-8bea-8fcf7995cc84"}
{"doc_id": "2025__Acceptability_of_wearable_technology_for_the_early_detection_of_dementia-causing__W4413786476", "source_path": "<redacted:source_path>", "chunk_id": 35, "source_chunk_idxs": [45], "num_tokens": 502, "text": "Acceptability of wearable technology for the early detection of dementia-causing diseases: perspectives from the CODEC II cohort\nReferences\n64. Mercer K, Li M, Giangregorio L, Burns C, Grindrod K. Behavior change techniques present in wearable activity trackers: a critical analysis. JMIR Mhealth Uhealth. 2016;4(2): e4461.\nArticle\nGoogle Scholar\n65. Ferguson T, Olds T, Curtis R, Blake H, Crozier AJ, Dankiw K, Dumuid D, Kasai D, O'Connor E, Virgara R, Maher C. Effectiveness of wearable activity trackers to increase physical activity and improve health: a systematic review of systematic reviews and meta-analyses. Lancet Digital Health. 2022;4(8):e615-26.\nArticle\nPubMed\nCAS\nGoogle Scholar\n66. Iso-Markku P, Kujala UM, Knittle K, Polet J, Vuoksimaa E, Waller K. Physical activity as a protective factor for dementia and Alzheimer's disease: systematic review, meta-analysis and quality assessment of cohort and case-control studies. Br J Sports Med. 2022;56(12):701-9.\nArticle\nPubMed\nGoogle Scholar\n67. High blood pressure and the risk of dementia. Alzheimer's Society. n.d.\nhttps://www.alzheimers.org.uk/about-dementia/managing-the-risk-of-dementia/reduce-your-risk-of-dementia/high-blood-pressure#:~:text=Evidence%20shows%20that%20high%20blood,later%20life%2C%20particularly%20vascular%20dementia\n.\n68. Michie S, van Stralen MM, West R. The behaviour change wheel: a new method for characterising and designing behaviour change interventions. Implement Sci. 2011;6:42.\nhttps://doi.org/10.1186/1748-5908-6-42\n.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n69. Roscoe E, Johns M. Addressing digital exclusion in North East England. Institute for Public Policy Research (IPPR); 2021.\n70. Bank L. Consumer Digital Index. The UK's largest study of digital and financial lives. 2023.", "doc_items_refs": ["#/texts/533", "#/texts/534", "#/texts/535", "#/texts/536", "#/texts/537", "#/texts/538", "#/texts/539"], "page_nos": [], "uuid": "fdf1137c-a797-4b41-8882-87f73f8a3c1e"}
{"doc_id": "2025__Acceptability_of_wearable_technology_for_the_early_detection_of_dementia-causing__W4413786476", "source_path": "<redacted:source_path>", "chunk_id": 36, "source_chunk_idxs": [46, 47, 48], "num_tokens": 493, "text": "Acceptability of wearable technology for the early detection of dementia-causing diseases: perspectives from the CODEC II cohort\nReferences\n71. Wilson-Menzfeld G, Erfani G, Charlton MW, De Luca H, Brittain K, Steven A, Young-Murphy L. Understanding digital exclusion across North Tyneside.\n72. Wilson S, Tolley C, Mc Ardle R, et al. Recommendations to advance digital health equity: a systematic review of qualitative studies. NPJ Digit Med. 2024;7(1):173.\nhttps://doi.org/10.1038/s41746-024-01177-7\n. Published 2024 Jun 29.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n73. Honeyman M, Maguire D, Evans H, Davies A. Digital technology and health inequalities: a scoping review. Cardiff: Public Health Wales NHS Trust; 2020.\nGoogle Scholar\nDownload references\n\nAcceptability of wearable technology for the early detection of dementia-causing diseases: perspectives from the CODEC II cohort\nAcknowledgements\nThe authors thank the participants for their time, contribution, and involvement in this study.\n\nAcceptability of wearable technology for the early detection of dementia-causing diseases: perspectives from the CODEC II cohort\nFunding\nThis work was supported by the Early Detection of Neurodegenerative Diseases (EDoN) research initiative, funded by Alzheimer's Research UK with support from Gates Ventures and the Alzheimer's Drug Discovery Foundation through its Diagnostic Accelerator Project. SS is funded by the NIHR (NIHR205190). The views expressed are those of the author and not necessarily those of the NIHR or the Department of Health and Social Care. RMA is funded by the National Institute for Health Research (NIHR) (NIHR301677) and the NIHR Newcastle Biomedical Research Centre (BRC) based at The Newcastle upon Tyne Hospital National Health Service (NHS) Foundation Trust; Newcastle University; and the Cumbria, Northumberland and Tyne and Wear (CNTW) NHS Foundation Trust. The views expressed in this publication are those of the author(s) and not necessarily those of the NIHR, NHS, or the UK Department of Health and Social Care. The funder(s) of the study had no role in the study design, data collection, data analysis, data interpretation, or writing of the report.", "doc_items_refs": ["#/texts/540", "#/texts/541", "#/texts/542", "#/texts/543", "#/texts/545", "#/texts/547"], "page_nos": [], "uuid": "adc5e11e-1709-4dd1-b78a-f4d3ceeee7a7"}
{"doc_id": "2025__Acceptability_of_wearable_technology_for_the_early_detection_of_dementia-causing__W4413786476", "source_path": "<redacted:source_path>", "chunk_id": 37, "source_chunk_idxs": [49], "num_tokens": 343, "text": "Acceptability of wearable technology for the early detection of dementia-causing diseases: perspectives from the CODEC II cohort\nAuthor information\nAuthors and Affiliations\n1. School of Pharmacy, Newcastle University, King George VI Building, Queen Victoria Road, Newcastle Upon Tyne, UK Sarah Wilson, Clare Tolley, Nehal Hassan &amp; Sarah Slight\n2. Trinity College Dublin, Dublin, Ireland Emily Beswick\n3. University College London, London, UK Rachel Morrell, Sharandeep Bhogal, Tim Whitfield, Kieran Wing &amp; Zuzana Walker\n4. Essex Partnership University NHS Foundation Trust, Essex, UK Rachel Morrell &amp; Zuzana Walker\n5. Translational and Clinical Research Institute, Newcastle University, Newcastle Upon Tyne, UK Riona Mc Ardle\nAuthors\n1. Sarah Wilson\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n2. Emily Beswick\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n3. Rachel Morrell\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n4. Sharandeep Bhogal\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n5. Clare Tolley\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n6. Tim Whitfield\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n7. Kieran Wing\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n8. Riona Mc Ardle\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n9. Nehal Hassan\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n10. Zuzana Walker\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n11. Sarah Slight\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/550", "#/texts/551", "#/texts/552", "#/texts/553", "#/texts/554", "#/texts/555", "#/texts/556", "#/texts/557", "#/texts/558", "#/texts/559", "#/texts/560", "#/texts/561", "#/texts/562", "#/texts/563", "#/texts/564", "#/texts/565", "#/texts/566"], "page_nos": [], "uuid": "64c6c1f8-6fb9-434f-b40b-4a4214bbdf69"}
{"doc_id": "2025__Acceptability_of_wearable_technology_for_the_early_detection_of_dementia-causing__W4413786476", "source_path": "<redacted:source_path>", "chunk_id": 38, "source_chunk_idxs": [50], "num_tokens": 328, "text": "Acceptability of wearable technology for the early detection of dementia-causing diseases: perspectives from the CODEC II cohort\nAuthor information\nContributions\nS.W. (Lead author): Data acquisition, analysis and interpretation. Drafting (writing of the original draft) and revisions. Visualizations (design and development of figure 1,3,4). Completion of the current version. Accounting for all aspects of this qualitative work ensures that questions related to the accuracy or integrity of any part of the work are appropriately investigated and resolved. E.B.: Data acquisition and analysis. R.M.: Participant recruitment, participant onboarding process, and provision of technical support. S.B.: Project management. Conception of the work. Ethical approval acquisition. Assisted with technical support. C.T.: Methodology. Supervision of lead author. Data analysis and interpretation. Provided feedback on drafts. T.W.: Supported project management. Provided feedback on drafts. K.W.: Conception of the work. Methodology. Ethical approval acquisition. Provided feedback on drafts. R.M.A.: Methodology. Ethical approval acquisition. Provided feedback on drafts. N.H.: Provided feedback on drafts. Z.W.: Funding acquisition. Conception of the work. Methodology. Provided feedback on drafts. S.S. (Corresponding author): Supervision of lead author and E.B. Data analysis and interpretation. Final approval of the completed version. Provided feedback on drafts. Accounting for all aspects of this qualitative work ensures that questions related to the accuracy or integrity of any part of the work are appropriately investigated and resolved.", "doc_items_refs": ["#/texts/568"], "page_nos": [], "uuid": "a546fddb-243e-41a8-8be6-f14f266da5a7"}
{"doc_id": "2025__Acceptability_of_wearable_technology_for_the_early_detection_of_dementia-causing__W4413786476", "source_path": "<redacted:source_path>", "chunk_id": 39, "source_chunk_idxs": [51, 52, 53], "num_tokens": 384, "text": "Acceptability of wearable technology for the early detection of dementia-causing diseases: perspectives from the CODEC II cohort\nAuthor information\nAuthors information\nThe interviewer (EB), a Research Associate at Newcastle University with a PhD in neuroscience and an interest in digital health technologies, did not disclose her background to participants to facilitate open discussions. There was no prior relationship between the participants and the research team. The interviewer was trained by a team member (SW, a Research Assistant who has an MSc in Cognitive Neuroscience and human neuroimaging) experienced in interviewing individuals with cognitive impairment and dementia. The researchers involved in the analysis (SW, CT, SS, RMA) were experienced qualitative researchers at various career stages, with diverse academic backgrounds in pharmacy, neuroscience, and digital health equity. This multidisciplinary approach ensured a comprehensive understanding of participants' experiences and mitigated bias from each researcher's interests.\n\nAcceptability of wearable technology for the early detection of dementia-causing diseases: perspectives from the CODEC II cohort\nAuthor information\nCorresponding author\nCorrespondence to\nSarah Slight\n.\n\nAcceptability of wearable technology for the early detection of dementia-causing diseases: perspectives from the CODEC II cohort\nEthics declarations\nEthics approval and consent to participate\nThis study was conducted in accordance with the principles of the Declaration of Helsinki. Ethical approval was granted by the Health Research Authority (HRA) and Health and Care Research Wales (HCRW) (Integrated Research Approval System (IRAS) ID 289028: REC reference 22/EM/0062). Every participant provided written and verbal consent to participate. Participants were not remunerated after taking part in the study. The Standards for Reporting Qualitative Research (SRQR) [\n35\n] were followed throughout this project, and the Consolidated Criteria for Reporting Qualitative Research (COREQ) checklist was completed [\n36\n].", "doc_items_refs": ["#/texts/570", "#/texts/572", "#/texts/573", "#/texts/574", "#/texts/577", "#/texts/578", "#/texts/579", "#/texts/580", "#/texts/581"], "page_nos": [], "uuid": "42f5f5e5-c008-4524-99bf-4198a98b8a93"}
{"doc_id": "2025__Acceptability_of_wearable_technology_for_the_early_detection_of_dementia-causing__W4413786476", "source_path": "<redacted:source_path>", "chunk_id": 40, "source_chunk_idxs": [54, 55, 56, 57], "num_tokens": 387, "text": "Acceptability of wearable technology for the early detection of dementia-causing diseases: perspectives from the CODEC II cohort\nEthics declarations\nConsent for publication\nWritten consent to publish any anonymized data was obtained from the participants before the interview. Direct quotations used in the analysis are not identifiable by name but correspond with the participant's identification number. Participants were fully informed of the anonymization process.\n\nAcceptability of wearable technology for the early detection of dementia-causing diseases: perspectives from the CODEC II cohort\nEthics declarations\nCompeting interests\nThe corresponding author, Prof. Sarah Slight, is an Associated Editor at BMC Medical informatics and decision making.\n\nAcceptability of wearable technology for the early detection of dementia-causing diseases: perspectives from the CODEC II cohort\nAdditional information\nPublisher's Note\nSpringer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations.\n\nAcceptability of wearable technology for the early detection of dementia-causing diseases: perspectives from the CODEC II cohort\nRights and permissions\nOpen Access\nThis article is licensed under a Creative Commons Attribution 4.0 International License, which permits use, sharing, adaptation, distribution and reproduction in any medium or format, as long as you give appropriate credit to the original author(s) and the source, provide a link to the Creative Commons licence, and indicate if changes were made. The images or other third party material in this article are included in the article's Creative Commons licence, unless indicated otherwise in a credit line to the material. If material is not included in the article's Creative Commons licence and your intended use is not permitted by statutory regulation or exceeds the permitted use, you will need to obtain permission directly from the copyright holder. To view a copy of this licence, visit\nhttp://creativecommons.org/licenses/by/4.0/\n.\nReprints and permissions", "doc_items_refs": ["#/texts/583", "#/texts/585", "#/texts/588", "#/texts/592", "#/texts/593", "#/texts/594", "#/texts/595", "#/texts/596"], "page_nos": [], "uuid": "9a8760cb-4a52-48c0-89c6-9cce9b44303e"}
{"doc_id": "2025__Acceptability_of_wearable_technology_for_the_early_detection_of_dementia-causing__W4413786476", "source_path": "<redacted:source_path>", "chunk_id": 41, "source_chunk_idxs": [58, 59, 60, 61, 62, 63], "num_tokens": 398, "text": "Acceptability of wearable technology for the early detection of dementia-causing diseases: perspectives from the CODEC II cohort\nAbout this article\nCite this article\nWilson, S., Beswick, E., Morrell, R.\net al.\nAcceptability of wearable technology for the early detection of dementia-causing diseases: perspectives from the CODEC II cohort.\nBMC Digit Health\n3\n, 55 (2025). https://doi.org/10.1186/s44247-025-00191-3\nDownload citation\n- Received : 05 September 2024\n- Accepted : 11 July 2025\n- Published : 29 August 2025\n- DOI : https://doi.org/10.1186/s44247-025-00191-3\n\nAcceptability of wearable technology for the early detection of dementia-causing diseases: perspectives from the CODEC II cohort\nAbout this article\nKeywords\n- Qualitative\n- Dementia\n- Early detection\n- Digital health technologies\n- Wearable technologies\nDownload PDF\n\nAcceptability of wearable technology for the early detection of dementia-causing diseases: perspectives from the CODEC II cohort\nAssociated content\nCollection\n\nAcceptability of wearable technology for the early detection of dementia-causing diseases: perspectives from the CODEC II cohort\nAssociated content\nThe role of digital health in supporting people with dementia\nAdvertisement\n\nAcceptability of wearable technology for the early detection of dementia-causing diseases: perspectives from the CODEC II cohort\nAssociated content\nThe role of digital health in supporting people with dementia\nBMC Digital Health\nISSN: 2731-684X\n\nAcceptability of wearable technology for the early detection of dementia-causing diseases: perspectives from the CODEC II cohort\nAssociated content\nThe role of digital health in supporting people with dementia\nContact us\n- Submission enquiries:\nbmcdigitalhealth@biomedcentral.com\n- General enquiries:\nORSupport@springernature.com", "doc_items_refs": ["#/texts/599", "#/texts/600", "#/texts/601", "#/texts/602", "#/texts/603", "#/texts/604", "#/texts/605", "#/texts/606", "#/texts/607", "#/texts/608", "#/texts/609", "#/texts/611", "#/texts/612", "#/texts/613", "#/texts/614", "#/texts/615", "#/texts/616", "#/texts/618", "#/texts/620", "#/texts/622", "#/texts/624", "#/texts/625"], "page_nos": [], "uuid": "f8479104-e666-4e0c-8de5-ef1c5faa0fe4"}
