{"doc_id": "2025__Exploring_the_impact_of_coffee_consumption_and_caffeine_intake_on_cognitive_perf__W4411868829", "source_path": "<redacted:source_path>", "chunk_id": 0, "source_chunk_idxs": [0, 1, 2, 3], "num_tokens": 457, "text": "Exploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis | Nutrition Journal | Full Text\nSkip to main content\nAdvertisement\nSearch\n- Explore journals\n- Get published\n- About BMC\n- My account\nSearch all BMC articles\nSearch\nNutrition Journal\n- Home\n- About\n- Articles\n- Submission Guidelines\n- Submit manuscript\nExploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nDownload PDF\nDownload ePub\nDownload PDF\nDownload ePub\n- Research\n- Open access\n- Published: 01 July 2025\n\nExploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\n- Jinrui Li\n1\n,\n2\nna1\n,\n- Kai Yu\n1\n,\n2\n,\n3\n,\n4\n,\n5\n,\n6\nna1\n,\n- Fan Bu\n3\n,\n- Peng Li\n2\n&amp;\n- ...\n- Lei Hao\n1\nShow authors\nNutrition Journal\nvolume 24\n, Article number: 102 ( 2025 )\nCite this article\n- 2890 Accesses\n- 24 Altmetric\n- Metrics details\n\nExploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nAbstract\nPurpose\nTo investigate the effects of coffee consumption and caffeine intake on cognitive performance in older adults, with a particular focus on the potential mediating role of alkaline phosphatase(ALP).\n\nExploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nAbstract\nMethods\nWe analyzed data from the National Health and Nutrition Examination Survey (NHANES) from 2011 to 2014, involving 2,254 participants aged 60 and older. Cognitive performance was assessed using the Consortium to Establish a Registry for Alzheimer's Disease (CERAD) test, Animal Fluency test, and Digit Symbol Substitution Test (DSST). To establish causal relationships between coffee consumption, caffeine intake, ALP levels, and cognitive performance, we employed methodologies such as Mendelian randomization, protein quantitative trait locus analysis, and protein-protein interaction networks.", "doc_items_refs": ["#/texts/1", "#/texts/2", "#/texts/3", "#/texts/4", "#/texts/5", "#/texts/6", "#/texts/7", "#/texts/8", "#/texts/9", "#/texts/10", "#/texts/11", "#/texts/12", "#/texts/13", "#/texts/14", "#/texts/15", "#/texts/16", "#/texts/17", "#/texts/18", "#/texts/19", "#/texts/20", "#/texts/21", "#/texts/22", "#/texts/23", "#/texts/25", "#/texts/26", "#/texts/27", "#/texts/28", "#/texts/29", "#/texts/30", "#/texts/31", "#/texts/32", "#/texts/33", "#/texts/34", "#/texts/35", "#/texts/36", "#/texts/37", "#/texts/38", "#/texts/41", "#/texts/43"], "page_nos": [], "uuid": "f0333d29-1f5d-42b4-ae82-09692e3dd680"}
{"doc_id": "2025__Exploring_the_impact_of_coffee_consumption_and_caffeine_intake_on_cognitive_perf__W4411868829", "source_path": "<redacted:source_path>", "chunk_id": 1, "source_chunk_idxs": [4, 5, 6], "num_tokens": 460, "text": "Exploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nAbstract\nResults\nThe NHANES study revealed significant findings regarding coffee consumption and cognitive performance. Compared to non-coffee consumers, individuals consuming ≥ 480 g/day of coffee had a significantly lower odds of low CERAD scores, with an adjusted OR of 0.58 (95% CI: 0.41-0.82) in the fully adjusted Model 4. Similarly, those consuming caffeinated coffee 477.9 g/day) had an OR of 0.56 (95% CI: 0.34-0.92). A comparison of the lowest quartile of ALP intake with the highest quartile showed an OR of 1.82 (95% CI: 1.16-2.85), indicating a negative correlation with cognitive performance. Mendelian Randomization (MR) studies suggested that increased coffee intake is associated with cognitive impairment progression, while coffee consumption may protect against Lewy body dementia (OR = 0.2365, 95% CI: 0.0582-0.9610). Additionally, coffee/caffeine intake affected serum ALP (OR = 0.86, 95% CI: 0.79-0.93) and cognitive ability (OR = 0.95, 95% CI: 0.92-0.98), both indicating protective effects. Finally, the IGFLR1 gene exhibited a moderate colocalization with ALP, suggesting potential therapeutic significance.\n\nExploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nAbstract\nConclusions\nThis study provides evidence of a positive correlation between coffee consumption, caffeine intake, and cognitive performance in older adults, with ALP potentially contributing to this relationship. These findings underscore the importance of considering dietary factors in cognitive health management for aging populations, highlighting the need for further research to clarify the specific mechanisms involved.\n\nExploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nAbstract\nClinical trial number\nNot applicable.\nPeer Review reports", "doc_items_refs": ["#/texts/45", "#/texts/47", "#/texts/49", "#/texts/50"], "page_nos": [], "uuid": "a9ab9ffe-ac80-4fbd-91cd-03fc5e531bb6"}
{"doc_id": "2025__Exploring_the_impact_of_coffee_consumption_and_caffeine_intake_on_cognitive_perf__W4411868829", "source_path": "<redacted:source_path>", "chunk_id": 2, "source_chunk_idxs": [7], "num_tokens": 379, "text": "Exploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nIntroduction\nAs the global population ages, cognitive impairments, particularly Alzheimer's disease (AD), are becoming increasingly prevalent, presenting one of the most significant health burdens of the 21st century. It is estimated that by 2050, over 130 million individuals will be affected by dementia, making the search for effective prevention and intervention strategies urgent [\n1\n].\nCoffee is one of the most popular and consumed beverages worldwide, and caffeine is its best-known component. The cognitive-enhancing effects of caffeine are well-documented, primarily through its action as an adenosine receptor antagonist, which promotes wakefulness and improves attention and memory consolidation [\n2\n]. Caffeine (1,3,7-trimethylxanthine) shares remarkable structural homology with the endogenous neuromodulator adenosine, enabling its specific binding to adenosine receptor subtypes (including A1 and A2A). Emerging evidence demonstrates that caffeine administration significantly suppresses the expression of β-secretase (BACE1) and γ-secretase, thereby effectively reducing β-amyloid (Aβ) production and ameliorating both cognitive deficits and neuropathological hallmarks in transgenic models of Alzheimer's disease [\n3\n]. Current evidence indicates caffeine is also believed to enhance alertness, attention and mood, and is thought to have a positive impact on long-term memory [\n4\n,\n5\n].\nMeanwhile, caffeine, as a multi-target neuromodulator, can significantly affect the dopaminergic, cholinergic and glutaminergic pathways closely related to neurodegenerative diseases [\n6\n].", "doc_items_refs": ["#/texts/52", "#/texts/53", "#/texts/54", "#/texts/55", "#/texts/56", "#/texts/57", "#/texts/58", "#/texts/59", "#/texts/60", "#/texts/61", "#/texts/62", "#/texts/63", "#/texts/64", "#/texts/65", "#/texts/66"], "page_nos": [], "uuid": "7fbbb058-d09f-48f6-b4f8-4ca4638c2bd0"}
{"doc_id": "2025__Exploring_the_impact_of_coffee_consumption_and_caffeine_intake_on_cognitive_perf__W4411868829", "source_path": "<redacted:source_path>", "chunk_id": 3, "source_chunk_idxs": [8], "num_tokens": 433, "text": "Exploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nIntroduction\nRecent years have seen extensive research into the relationship between caffeine and cognitive function. Epidemiological studies suggest that moderate caffeine intake is associated with better cognitive performance, and some laboratory studies have demonstrated neuroprotective properties of caffeine in animal models [\n7\n]. Some scholars also believe that there is a nonlinear \"U-shaped\" dose-effect relationship between caffeine intake and the risk of cognitive impairment, that is, caffeine at an appropriate dose can effectively reduce the occurrence of cognitive impairment [\n8\n]. However, results are inconsistent, with some studies failing to establish a significant impact of caffeine on human cognitive function [\n9\n]. Additionally, the effects of caffeine may be influenced by gender, genetic factors and the time of consumption [\n10\n], further complicating its investigation [\n11\n].\nIn cognitive neuroscience research, the systematic assessment of the cognitive domain usually covers core dimensions such as memory function, information processing and language ability, as well as their neurobiological basis. At present, there is heterogeneity in the results of caffeine's impact on memory function, which is largely due to the insufficiently detailed classification of memory subtypes. For instance, the latest research indicates that caffeine has differentiated regulatory effects on different memory systems - prospective memory and implicit memory show significant enhancement after acute caffeine intake [\n12\n]. In terms of information processing, caffeine shows a domain-selective enhancement effect. In terms of reward processing: It can shorten the response time to reward-related stimuli by enhancing the activation of the ventral striatum [\n13\n]. In terms of continuous attention: It can regulate the dopamine D1 receptor in the prefrontal lobe under sleep deprivation conditions, thereby improving the accuracy of alertness tasks [\n14\n].The inconsistent results regarding the cognitive effects of caffeine may stem from the insufficient degree of segmentation in different cognitive domains.", "doc_items_refs": ["#/texts/67", "#/texts/68", "#/texts/69", "#/texts/70", "#/texts/71", "#/texts/72", "#/texts/73", "#/texts/74", "#/texts/75", "#/texts/76", "#/texts/77", "#/texts/78", "#/texts/79", "#/texts/80", "#/texts/81", "#/texts/82", "#/texts/83", "#/texts/84"], "page_nos": [], "uuid": "3f712348-8b08-4a7e-bc25-1f627aea86f8"}
{"doc_id": "2025__Exploring_the_impact_of_coffee_consumption_and_caffeine_intake_on_cognitive_perf__W4411868829", "source_path": "<redacted:source_path>", "chunk_id": 4, "source_chunk_idxs": [9], "num_tokens": 221, "text": "Exploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nIntroduction\nThe heterogeneous findings on caffeine's cognitive effects likely arise from three key methodological challenges that warrant systematic investigation: (1) Domain-specific granularity - inadequate differentiation between cognitive subdomains (episodic vs. semantic memory) and limited assessment of cross-domain interactions (e.g., attention-memory coupling); (2) Experimental design variability - inconsistent caffeine administration protocols (acute vs. chronic, dosing windows) and lack of standardized cognitive batteries across studies; (3) Nonlinear dose-response relationships - threshold effects at receptor level (A1/A2A adenosine receptor occupancy) and inverted U-curve responses in prefrontal-dependent tasks. These factors collectively highlight the need for dose-finding studies using adaptive Bayesian designs, domain-specific cognitive profiling with standardized test batteries, and multimodal neuroimaging to disentangle neural mechanisms.", "doc_items_refs": ["#/texts/85"], "page_nos": [], "uuid": "acd67f0e-7872-4592-9540-68b29e770804"}
{"doc_id": "2025__Exploring_the_impact_of_coffee_consumption_and_caffeine_intake_on_cognitive_perf__W4411868829", "source_path": "<redacted:source_path>", "chunk_id": 5, "source_chunk_idxs": [10], "num_tokens": 457, "text": "Exploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nIntroduction\nALP is a family of enzymes encoded by multiple genes with remarkable tissue-specific isoenzyme characteristics. The human genome contains four ALP genes, encoding intestinal type (IAP), placental type (PLAP), germ cell type (GCAP) and tissue non-specific alkaline phosphatase (TNAP) [\n15\n]. Studies have shown that TNAP shows a unique expression pattern in neurodegenerative diseases: it is significantly increased in brain tissue and peripheral blood in patients with sporadic Alzheimer's disease (sAD) and familial Alzheimer's disease (fAD), but similar changes are not observed in normal aging [\n16\n], This differential expression profile makes TNAP a potential novel biomarker to distinguish pathological cognitive decline, such as AD, from physiological aging [\n17\n]. As a competitive adenosine receptor antagonist, caffeine exhibits complex neuromodulatory effects during development. Animal experiments have shown that maternal caffeine intake can inhibit protein synthesis and membrane cholesterol metabolism in the brain of neonatal rats in a dose-dependent manner [\n18\n], this effect may be related to the inhibition of ALP activity by caffeine through A1 receptors and the interference of zinc ion homeostasis [\n19\n]. However, direct evidence is lacking on whether the inhibitory effects of caffeine on the developing nervous system will translate into neuroprotective effects in old age.\nWhile the adenosine-mediated pathway represents the primary mechanism of caffeine's action, other biological pathways may contribute to its cognitive effects. ALP, an important enzyme, has been shown to play a critical role in neuronal development and functional maintenance [\n20\n,\n21\n]. Research indicates that ALP activity increases during brain injury and in patients with cognitive impairment, exhibiting a negative correlation with cognitive performance [\n22\n]. We hypothesize that ALP might represent a novel pathway through which caffeine could influence cognitive function, though this potential relationship remains largely unexplored in existing literature.", "doc_items_refs": ["#/texts/86", "#/texts/87", "#/texts/88", "#/texts/89", "#/texts/90", "#/texts/91", "#/texts/92", "#/texts/93", "#/texts/94", "#/texts/95", "#/texts/96", "#/texts/97", "#/texts/98", "#/texts/99", "#/texts/100", "#/texts/101", "#/texts/102", "#/texts/103"], "page_nos": [], "uuid": "c38d19fe-b455-42ca-bf14-70d5e5acde10"}
{"doc_id": "2025__Exploring_the_impact_of_coffee_consumption_and_caffeine_intake_on_cognitive_perf__W4411868829", "source_path": "<redacted:source_path>", "chunk_id": 6, "source_chunk_idxs": [11], "num_tokens": 124, "text": "Exploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nIntroduction\nTherefore, this study aims to utilize the NHANES and GWAS databases to explore the effects of coffee and caffeine on cognitive function, while investigating ALP as a potential mediator in this relationship. By comprehensively analyzing the relationships between caffeine intake, ALP activity, and cognitive performance, we hope to provide new insights into the potential role of caffeine in the prevention of cognitive impairments and establish a theoretical foundation for future intervention strategies.", "doc_items_refs": ["#/texts/104"], "page_nos": [], "uuid": "6b9dfbe7-e681-46c0-8be9-6e3cdf6b32e1"}
{"doc_id": "2025__Exploring_the_impact_of_coffee_consumption_and_caffeine_intake_on_cognitive_perf__W4411868829", "source_path": "<redacted:source_path>", "chunk_id": 7, "source_chunk_idxs": [12], "num_tokens": 404, "text": "Exploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nMaterials and methods\nNHANES data collection and study population\nThe National Health and Nutrition Examination Survey (NHANES), a biennial cross-sectional study organized by the Centers for Disease Control and Prevention (CDC), evaluates the health and nutritional status of individuals in the United States. This study employs a complex, stratified, multistage sampling method to ensure that it captures a representative sample from the non-institutionalized population. Participants first complete a home interview, and then they receive health examinations at mobile examination centers (MEC). As of now, the official NHANES documentation (\nhttps://www.cdc.gov/nchs/nhanes/\n) does not provide a clear specification of the time interval between the household interview and the health assessment at the Mobile Examination Center (MEC). This interval appears to depend on scheduling coordination between participants and the survey team, and may range from several days to a few weeks, with no standardized timeframe explicitly stated. The study protocols have been ethically approved by the National Center for Health Statistics Ethics Review Board at the CDC, and all participants provide written informed consent prior to involvement.\nFor this analysis, data from the 2011-2012 and 2013-2014 survey cycles were combined, focusing on coffee and caffeine intake and cognitive function measures. Out of 19,931 individuals who participated in NHANES during this period, 2,934 were aged 60 years or older. Exclusions included participants with incomplete cognitive tests (\nn\n= 16,997), unreliable dietary recall data (\nn\n= 187), and missing information regarding smoking, stroke, alcohol consumption, and other variables (\nn\n= 493). The final sample included 2,254 participants aged 60 and older (1,074 men and 1,180 women). (Figure\n1\n)\nFig. 1", "doc_items_refs": ["#/texts/107", "#/texts/108", "#/texts/109", "#/texts/110", "#/texts/111", "#/texts/112", "#/texts/113", "#/texts/114", "#/texts/115", "#/texts/116", "#/texts/117", "#/texts/118", "#/texts/119"], "page_nos": [], "uuid": "f1c8e342-59f6-4672-9ee4-ed065f9de553"}
{"doc_id": "2025__Exploring_the_impact_of_coffee_consumption_and_caffeine_intake_on_cognitive_perf__W4411868829", "source_path": "<redacted:source_path>", "chunk_id": 8, "source_chunk_idxs": [13], "num_tokens": 475, "text": "Exploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nMaterials and methods\nCognitive performance assessment\nCognitive performance in individuals aged 60 and older was assessed through a series of tests during the survey cycles from 2011 to 2014. These assessments were conducted at mobile examination centers (MEC) and included the Consortium to Establish a Registry for Alzheimer's Disease (CERAD) Word Learning sub-test, the Animal Fluency test, and the Digit Symbol Substitution Test (DSST) [\n23\n,\n24\n]. These tools were designed to evaluate various cognitive domains, such as working memory, language skills, processing speed, and executive function. Participants provided informed consent for the audio recording of the testing sessions, which aided in quality control. Responses were transcribed and scored by two interviewers, in both English and Spanish, typically on the same day. For those who spoke different languages, verbatim transcriptions were made, and scores were assigned later by language consultants, with any discrepancies resolved by a third party. About 10% of the interviews underwent independent review.\nThe CERAD test consists of three learning trials followed by a delayed recall component, designed to assess participants' immediate and delayed verbal information recall abilities. During the testing process, participants are required to read aloud a list of ten unrelated words and then immediately recall as many words as possible. Delayed recall occurs after the verbal fluency test and the Digit Symbol Substitution Test (DSST). Each learning trial scores range from 0 to 10, and the overall CERAD score is calculated by summing the scores from all trials and the delayed recall, reflecting the participants' mastery of verbal information. The Animal Fluency test aims to evaluate participants' categorical language fluency, asking them to name as many animals as possible within one minute. Concurrently, the DSST assesses participants' processing speed, sustained attention, and working memory, with scores ranging from 0 to 133 based on the number of correct matches. However, DSST provides only the total score based on the number of correct symbol-digit matches completed within a fixed time period, without separate measures of reaction time or latency. Therefore, in this study, we used the DSST total score as a proxy for cognitive processing speed, consistent with previous research [\n25\n,\n26\n].", "doc_items_refs": ["#/texts/121", "#/texts/122", "#/texts/123", "#/texts/124", "#/texts/125", "#/texts/126", "#/texts/127", "#/texts/128", "#/texts/129", "#/texts/130"], "page_nos": [], "uuid": "d0691500-9e5c-4006-9917-70ac3296f828"}
{"doc_id": "2025__Exploring_the_impact_of_coffee_consumption_and_caffeine_intake_on_cognitive_perf__W4411868829", "source_path": "<redacted:source_path>", "chunk_id": 9, "source_chunk_idxs": [14, 15], "num_tokens": 298, "text": "Exploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nMaterials and methods\nCognitive performance assessment\nGiven the absence of standardized cutoff scores for these cognitive tests, the study adopts the 25th percentile as the threshold for assessing low cognitive performance, consistent with approaches found in the relevant literature [\n27\n]. Additionally, scores are categorized by age groups (60 to\n28\n].\n\nExploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nMaterials and methods\nAlkaline phosphatase data\nBlood specimens were collected during participants' first visit to the Mobile Examination Center (MEC), as part of the standard NHANES physical examination protocol [\n29\n]. Serum specimens were processed and sent to Collaborative Laboratory Services for analysis, following the NHANES Laboratory/Medical Technologists Procedures Manual (LPM). They were stored at − 30 °C until testing at the National Center for Environmental Health. ALP levels (U/L) were measured using the DxC800 system with a kinetic rate method and a 2-Amino-2-Methyl-1-Propanol (AMP) buffer, monitoring the hydrolysis of p-Nitrophenylphosphate to p-Nitrophenol at an alkaline pH of 10.3 by measuring absorbance at 410 nm.", "doc_items_refs": ["#/texts/131", "#/texts/132", "#/texts/133", "#/texts/134", "#/texts/135", "#/texts/137", "#/texts/138", "#/texts/139"], "page_nos": [], "uuid": "16a69dda-38fa-41c4-9e34-4ec9c2fe7b4a"}
{"doc_id": "2025__Exploring_the_impact_of_coffee_consumption_and_caffeine_intake_on_cognitive_perf__W4411868829", "source_path": "<redacted:source_path>", "chunk_id": 10, "source_chunk_idxs": [16], "num_tokens": 423, "text": "Exploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nMaterials and methods\nDietary intake assessment\nDietary intake data were collected through two 24-hour dietary recall interviews from NHANES. The first recall was conducted in person by trained interviewers at the Mobile Examination Center (MEC), and the second was conducted by telephone 3 to 10 days later. Both interviews used the Automated Multiple-Pass Method (AMPM) developed by the U.S. Department of Agriculture (USDA), a highly standardized method designed to improve the accuracy of dietary intake reporting and reduce recall bias. The dietary recalls covered both weekdays and weekends to capture differences in routine dietary patterns [\n30\n,\n31\n,\n32\n,\n33\n].\nNutrient intake (including caffeine) was estimated using the Food and Nutrient Database for Dietary Studies (FNDDS), which is integrated with NHANES data. FNDDS provides detailed information about the types of coffee consumed, including whether it was decaffeinated. The generated dataset includes frequency data, which can be used to estimate total coffee consumption or classify it by type (Supplementary Table\n12\n).\nDue to the high consistency between the two dietary recalls, for participants with complete data from both interviews, we used R version 4.4.2 to calculate the average intake over two days to enhance data reliability.\nCaffeine intake (in mg/day) was divided into quartiles, with the first quartile used as the reference group. When exploring the relationship between caffeine and ALP concentration, caffeine intake was categorized into four groups: non-consumers as a separate group, and the remaining consumers divided into tertiles. Total coffee intake (g/day) and caffeinated coffee intake (g/day) were also grouped into four categories: non-consumers as one group, and the rest divided into tertiles. Decaffeinated coffee intake was categorized into two groups: non-consumers and those consuming more than 0 g/day.", "doc_items_refs": ["#/texts/141", "#/texts/142", "#/texts/143", "#/texts/144", "#/texts/145", "#/texts/146", "#/texts/147", "#/texts/148", "#/texts/149", "#/texts/150", "#/texts/151", "#/texts/152", "#/texts/153", "#/texts/154"], "page_nos": [], "uuid": "9717eafb-62f0-4460-b3a8-1ac251ebe76b"}
{"doc_id": "2025__Exploring_the_impact_of_coffee_consumption_and_caffeine_intake_on_cognitive_perf__W4411868829", "source_path": "<redacted:source_path>", "chunk_id": 11, "source_chunk_idxs": [17, 18], "num_tokens": 416, "text": "Exploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nMaterials and methods\nDietary intake assessment\nAlthough caffeine can come from various foods and beverages such as tea, soft drinks, energy drinks, and chocolate, in this study, caffeine exposure specifically referred to caffeine intake from coffee, not total caffeine intake. This was confirmed using FNDDS food codes (Supplementary Table\n12\n). All related information came from the 24-hour dietary recall data-no separate questionnaire was used to assess coffee intake. Intake calculations were based on standard reference values and consistent portion size conversion methods provided by FNDDS.\n\nExploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nMaterials and methods\nCovariates\nPotential confounding factors included age (60-70 years, 70-80 years, 80 years and older), gender (male and female), body mass index (BMI), race (Mexican American/other Hispanic, Non-Hispanic White, Non-Hispanic Black, and other races), marital status (married/living with partner, widowed/divorced/separated, and never married), educational level (less than high school, above high school, and college or more), physical activity (classified based on whether participants met the U.S. Physical Activity Guidelines using metabolic equivalents converted from the Global Physical Activity Questionnaire) [\n34\n,\n35\n,\n36\n], alcohol consumption (at least 12 drinks per year or not), smoking status (smoked at least 100 cigarettes in life or not), sleep duration (1-12 h), and milk intake status (none, whole milk, reduced-fat milk, low-fat milk, or nonfat milk). History of diabetes or stroke was determined based on self-reported physician diagnoses. Total sugar and total saturated fat intake were estimated from 24-hour dietary recall interviews.", "doc_items_refs": ["#/texts/155", "#/texts/156", "#/texts/157", "#/texts/159", "#/texts/160", "#/texts/161", "#/texts/162", "#/texts/163", "#/texts/164", "#/texts/165"], "page_nos": [], "uuid": "b8df636c-6d06-4e6b-8447-2f1a3b55f9e0"}
{"doc_id": "2025__Exploring_the_impact_of_coffee_consumption_and_caffeine_intake_on_cognitive_perf__W4411868829", "source_path": "<redacted:source_path>", "chunk_id": 12, "source_chunk_idxs": [19, 20], "num_tokens": 323, "text": "Exploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nMaterials and methods\nSummary data for coffee/caffeine, cognitive performance, and alkaline phosphatase from GWAS\nTo establish reliable causal relationships, we conducted a thorough search for eligible summary-level data from major publicly available genome-wide association studies (GWAS) for each trait. All utilized data were publicly accessible, negating the need for additional ethical approval. Summary statistics concerning 24 types of coffee or caffeine, 9 types of cognitive performance, and 14 types of ALP were extracted from the IEU Open GWAS project, adhering to the diagnostic criteria and inclusion methods of the original literature (Supplementary Table\n13\n).\n\nExploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nMaterials and methods\nSelection of druggable genes\nEnsembl, a bioinformatics initiative, offers automated genomic annotations. In version 73, a total of 4,479 protein-coding genes are categorized as either druggable or potentially druggable, divided into three tiers: 1,427 genes identified as efficacy targets for approved drugs; 682 genes associated with known bioactive small-molecule binding partners; and 2,370 genes that encode secretory or extracellular proteins, which show lower similarity to established drug targets [\n37\n]. All 4,479 druggable genes were incorporated into the subsequent analyses.", "doc_items_refs": ["#/texts/167", "#/texts/168", "#/texts/169", "#/texts/171", "#/texts/172", "#/texts/173"], "page_nos": [], "uuid": "f760d436-2027-4de7-889d-01524956961d"}
{"doc_id": "2025__Exploring_the_impact_of_coffee_consumption_and_caffeine_intake_on_cognitive_perf__W4411868829", "source_path": "<redacted:source_path>", "chunk_id": 13, "source_chunk_idxs": [21], "num_tokens": 220, "text": "Exploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nMaterials and methods\npQTL dataset\nCis-protein quantitative trait loci (cis-pQTLs) are found in close proximity to their respective target genes or proteins. This study referenced two sources of pQTL data, which included 738 cis-SNPs associated with 734 proteins from the work of Zheng et al. [\n38\n], as well as supplementary pQTL data from the deCODE database [\n39\n]. Instrumental variables for cis-pQTLs were selected according to specific criteria: a p-value threshold of less than 5 × 10^−8, exclusion of SNPs located within the major histocompatibility complex (MHC) region [\n40\n], inclusion of SNPs situated within 1 MB of the gene, and a linkage disequilibrium threshold of r²\n41\n]. All datasets employed in this analysis were derived from individuals of European ancestry.", "doc_items_refs": ["#/texts/175", "#/texts/176", "#/texts/177", "#/texts/178", "#/texts/179", "#/texts/180", "#/texts/181", "#/texts/182", "#/texts/183"], "page_nos": [], "uuid": "4147f808-d210-4902-a826-c7a38cd4cd61"}
{"doc_id": "2025__Exploring_the_impact_of_coffee_consumption_and_caffeine_intake_on_cognitive_perf__W4411868829", "source_path": "<redacted:source_path>", "chunk_id": 14, "source_chunk_idxs": [22], "num_tokens": 492, "text": "Exploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nMaterials and methods\nStatistical analysis\nStatistical analyses were performed using R version 4.4.2. A new sample weight was created for the combined survey cycles in accordance with NHANES analytical guidelines. The Kolmogorov-Smirnov test was employed to evaluate the normality of continuous variables. Variables that followed a normal distribution were reported as mean and standard deviation, while those that did not conform to normality were expressed as median and interquartile range. The Student's t-test was used to compare means between cognitive performance groups for normally distributed variables, whereas the Mann-Whitney U test was applied for non-normally distributed variables. Chi-square tests were utilized to assess the percentages of categorical variables across different groups.\nIn this study, coffee and caffeine intake were categorized into groups. Total coffee intake, caffeine intake, and caffeinated coffee intake were divided into four groups, while decaffeinated coffee intake was categorized into two groups. Cognitive performance was treated as a binary outcome variable. Binary logistic regression analyses were conducted to evaluate the associations between overall coffee consumption, caffeinated and decaffeinated coffee consumption, and caffeine intake with cognitive performance, controlling for known confounding variables. Model 1 did not include adjustments for confounders, while Model 2 adjusted for age and gender. Model 3 included additional covariates such as body mass index (BMI), race, marital status, alcohol consumption, smoking status, diabetes, and history of stroke. Model 4 further adjusted for additional covariates based on Model 3, including educational level, physical activity, milk intake status, sleep hours, total sugar intake, and total saturated fat intake. Sensitivity analyses were conducted by excluding caffeinated coffee consumers from decaffeinated coffee analyses and vice versa. Subgroup analyses were performed to investigate the associations between caffeine intake and various dimensions of cognitive performance. Additionally, linear regression analyses were utilized to examine the relationships between coffee/caffeine consumption, cognitive performance, and ALP, treating all variables as continuous. Restricted cubic spline analysis was employed to explore dose-response relationships within logistic regression Model 3, with statistical significance defined as a two-sided p-value of less than 0.05.", "doc_items_refs": ["#/texts/185", "#/texts/186"], "page_nos": [], "uuid": "a298a9a0-fe00-4463-ad45-7d8ab38155d4"}
{"doc_id": "2025__Exploring_the_impact_of_coffee_consumption_and_caffeine_intake_on_cognitive_perf__W4411868829", "source_path": "<redacted:source_path>", "chunk_id": 15, "source_chunk_idxs": [23, 24], "num_tokens": 286, "text": "Exploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nMaterials and methods\nSelection of genetic instrumental variables\nIn GWAS data, SNPs were identified as instrumental variables (IVs) based on strong associations with exposure, applying a significance threshold of\np\nF statistics for each SNP were calculated, with values exceeding 10 indicating suitable representation. The resultant SNPs were compiled as definitive IVs for two-sample Mendelian randomization (MR) analyses.\n\nExploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nMaterials and methods\nTwo-Sample MR\nStatistical significance was set at\np\np\np\np\nThis comprehensive approach aimed to elucidate the genetic underpinnings of cognitive performance and ALP levels while integrating pQTL data to enhance the understanding of potential biological mechanisms. The findings underscore the importance of diverse MR methodologies for reliable causal inferences in complex biological systems.\nFurthermore, the Mendelian randomization component of this manuscript was prepared in accordance with the STROBE-MR (Strengthening the Reporting of Observational Studies in Epidemiology using Mendelian Randomization) reporting guidelines to ensure methodological transparency and reproducibility. The STROBE-MR checklist is provided in Supplementary Materials\n24\n.", "doc_items_refs": ["#/texts/188", "#/texts/189", "#/texts/191", "#/texts/193", "#/texts/194", "#/texts/196", "#/texts/198", "#/texts/200", "#/texts/202", "#/texts/203", "#/texts/204", "#/texts/205"], "page_nos": [], "uuid": "39fc4cbe-8670-4cd8-a17a-82e68dac8d7c"}
{"doc_id": "2025__Exploring_the_impact_of_coffee_consumption_and_caffeine_intake_on_cognitive_perf__W4411868829", "source_path": "<redacted:source_path>", "chunk_id": 16, "source_chunk_idxs": [25, 26], "num_tokens": 257, "text": "Exploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nMaterials and methods\nMediation analysis\nA mediation analysis utilizing a two-step Mendelian randomization (MR) design examined ALP levels' mediating role in the relationship between coffee/caffeine and cognitive performance. The total effect was decomposed into direct and indirect components, with the ratio of the indirect effect to the direct effect quantifying the mediation proportion. (Fig.\n2\n)\nFig. 2\n\nExploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nMaterials and methods\nSMR analysis\nSummary data-based MR (SMR) analyzes GWAS summary data alongside expression quantitative trait loci (QTL) studies to evaluate pleiotropic associations between protein expression levels and complex traits. The HEIDI test assessed potential horizontal pleiotropy in colocalization signals, testing the null hypothesis of no horizontal pleiotropy. SMR and HEIDI methods determined whether genetic variants affect phenotypes through protein expression or alternative biological pathways [\n42\n,\n43\n]. We utilized the SMR Windows version for analysis.", "doc_items_refs": ["#/texts/207", "#/texts/208", "#/texts/209", "#/texts/210", "#/texts/212", "#/texts/213", "#/texts/214", "#/texts/215", "#/texts/216"], "page_nos": [], "uuid": "e6af9b58-3f3f-495a-9d8f-72ed11dfb5da"}
{"doc_id": "2025__Exploring_the_impact_of_coffee_consumption_and_caffeine_intake_on_cognitive_perf__W4411868829", "source_path": "<redacted:source_path>", "chunk_id": 17, "source_chunk_idxs": [27, 28, 29], "num_tokens": 464, "text": "Exploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nMaterials and methods\nColocalization analysis\nColocalization analysis was performed using the coloc package, employing a Bayesian approach to evaluate five exclusivity hypotheses regarding SNP associations with traits. For each selected protein, SNPs within 250 kb of the top SNP were analyzed, with a posterior probability of PH4 &gt; 0.8 indicating evidence of colocalization between GWAS and pQTL data.\n\nExploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nMaterials and methods\nDrug target analysis\nThe protein-protein interaction (PPI) network comprises interactions among individual proteins. The STRING database was used to investigate interactions among known and predicted proteins [\n44\n]. In this study, we set the biological species to human and retrieved proteins interacting with druggable proteins that exhibited a high correlation coefficient exceeding 0.700. All visual representations and functional analyses were derived from the STRING database to ensure findings are based on comprehensive and reliable protein interaction data. (2.13-2.15 see Fig.\n3\n)\nFig. 3\n\nExploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nResults\nNHANES analysis\nSignificant differences were observed across various demographic and health-related variables-including age, sex, race, marital status, educational level, history of diabetes and stroke, physical activity level, total saturated fatty acid intake, ALP levels, and caffeine consumption-between participants with different levels of cognitive function (\np\n1\n). Notably, individuals with lower cognitive performance were more likely to be married or cohabiting and less likely to meet recommended physical activity guidelines. Compared to those with normal cognitive function, this group also had lower prevalence rates of diabetes and stroke. Participants with lower cognitive performance were predominantly aged 60-70 years and reported higher levels of alcohol consumption. Furthermore, in both the CERAD and DSST cognitive assessments, males were more prevalent in the low cognitive performance group, whereas females were more frequently represented in the normal cognitive function group.", "doc_items_refs": ["#/texts/218", "#/texts/220", "#/texts/221", "#/texts/222", "#/texts/223", "#/texts/224", "#/texts/225", "#/texts/228", "#/texts/229", "#/texts/231", "#/texts/232"], "page_nos": [], "uuid": "75b4b5f7-9471-48ba-812b-ec7c3915ea98"}
{"doc_id": "2025__Exploring_the_impact_of_coffee_consumption_and_caffeine_intake_on_cognitive_perf__W4411868829", "source_path": "<redacted:source_path>", "chunk_id": 18, "source_chunk_idxs": [30], "num_tokens": 438, "text": "Exploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nResults\nNHANES analysis\nCompared to non-coffee consumers, individuals consuming 1-299 g/day of coffee had a higher unadjusted odds ratio (OR) for CERAD scores (OR = 1.48, 95% CI: 1.04-2.11), whereas those consuming ≥ 480 g/day had a significantly lower unadjusted OR of 0.53 (95% CI: 0.41-0.68). This inverse association remained significant after multivariable adjustment, with an OR of 0.58 (95% CI: 0.41-0.82) in Model 4. Additionally, coffee intake of 1-299 g/day was associated with higher Animal Fluency scores (OR = 1.38, 95% CI: 1.00-1.89), and intake of ≥ 480 g/day was linked to better DSST performance (OR = 0.64, 95% CI: 0.49-0.84), which remained significant after adjustment for age and sex (OR = 0.63, 95% CI: 0.47-0.85) (Table\n2\n). The initially observed significant associations between coffee consumption and performance on both the Animal Fluency test and the Digit Symbol Substitution Test (DSST) were no longer statistically significant after additional adjustments for potential confounders, indicating that these relationships may have been influenced by underlying confounding factors. In sensitivity analyses, the association between ≥ 472.9 g/day coffee intake and improved CERAD scores persisted. Furthermore, coffee consumption was significantly associated with DSST scores in unadjusted models. Notably, individuals consuming 296.4-472.9 g/day showed a significant association with better DSST performance after multivariable adjustment, with an OR of 0.58 (95% CI: 0.36-0.93) in Model 4 (Supplementary Table\n1\n). More detailed data are available in Table\n2\nand Supplementary Table\n1\n.", "doc_items_refs": ["#/texts/233", "#/texts/234", "#/texts/235", "#/texts/236", "#/texts/237", "#/texts/238", "#/texts/239", "#/texts/240", "#/texts/241"], "page_nos": [], "uuid": "54f24c33-1ea1-4004-a3b2-b0b036ec9899"}
{"doc_id": "2025__Exploring_the_impact_of_coffee_consumption_and_caffeine_intake_on_cognitive_perf__W4411868829", "source_path": "<redacted:source_path>", "chunk_id": 19, "source_chunk_idxs": [31], "num_tokens": 364, "text": "Exploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nResults\nNHANES analysis\nCompared to non-consumers of the corresponding coffee category, individuals consuming more than 477.9 g/day of caffeinated coffee had a lower crude odds ratio (OR) for CERAD scores (OR = 0.50, 95% CI: 0.35-0.72), which remained significant after multivariable adjustment (Model 4: OR = 0.56, 95% CI: 0.34-0.92). A significant association was also observed with DSST scores, both in the unadjusted model (OR = 0.68, 95% CI: 0.51-0.90) and after adjustment for age and sex (OR = 0.70, 95% CI: 0.52-0.94) (Table\n3\n). For individuals consuming 300.1-477.9 g/day of caffeinated coffee, a significant association with DSST scores was observed only after adjustment for age and sex when compared to decaffeinated coffee consumers. Sensitivity analyses confirmed that the association between high caffeinated coffee intake (&gt; 477.9 g/day) and CERAD scores remained robust, while the association with DSST scores was significant only in the unadjusted model. Furthermore, the association between intake of 300.1-477.9 g/day of caffeinated coffee and DSST scores remained significant only after adjusting for age and sex. No significant associations were found between decaffeinated coffee consumption and any cognitive performance measures (Supplementary Table\n2\n). More detailed data are available in Table\n3\nand Supplementary Table\n2\n.", "doc_items_refs": ["#/texts/242", "#/texts/243", "#/texts/244", "#/texts/245", "#/texts/246", "#/texts/247", "#/texts/248", "#/texts/249", "#/texts/250"], "page_nos": [], "uuid": "133c21b7-6711-432d-83b5-d3b16cffbf42"}
{"doc_id": "2025__Exploring_the_impact_of_coffee_consumption_and_caffeine_intake_on_cognitive_perf__W4411868829", "source_path": "<redacted:source_path>", "chunk_id": 20, "source_chunk_idxs": [32], "num_tokens": 269, "text": "Exploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nResults\nNHANES analysis\nComparing individuals in the lowest quartile of caffeine intake with those in the highest quartile, the crude odds ratio (OR) for CERAD scores was 0.40 (95% CI: 0.30-0.53). This association remained significant after multivariable adjustment, with an OR of 0.59 (95% CI: 0.40-0.88) in Model 4. A significant association was also observed with DSST scores, both in the unadjusted model (OR = 0.50, 95% CI: 0.36-0.68) and after adjustment for age and sex (OR = 0.66, 95% CI: 0.48-0.91) (Table\n4\n). Sensitivity analyses confirmed that these associations remained significant. In contrast, when comparing individuals in the lowest quartile of caffeine intake with those in the third quartile, a significant association with DSST scores was observed only in the unadjusted model, with no significant results in the sensitivity analysis (Supplementary Table\n3\n). More detailed data are available in Table\n4\nand Supplementary Table\n3\n.", "doc_items_refs": ["#/texts/251", "#/texts/252", "#/texts/253", "#/texts/254", "#/texts/255", "#/texts/256", "#/texts/257", "#/texts/258", "#/texts/259"], "page_nos": [], "uuid": "abb6ce09-955a-46b4-bdae-54f76c77e51a"}
{"doc_id": "2025__Exploring_the_impact_of_coffee_consumption_and_caffeine_intake_on_cognitive_perf__W4411868829", "source_path": "<redacted:source_path>", "chunk_id": 21, "source_chunk_idxs": [33], "num_tokens": 371, "text": "Exploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nResults\nNHANES analysis\nWhen comparing individuals in the lowest quartile of ALP concentration to those in the highest quartile, the crude odds ratio (OR) for CERAD scores was 1.71 (95% CI: 1.17-2.50). This association remained significant after multivariable adjustment, with an OR of 1.82 (95% CI: 1.16-2.85) in Model 4. A significant association with Animal Fluency test scores was observed only after adjusting for age and sex (OR = 1.65, 95% CI: 1.11-2.46). For DSST scores, significant associations were found in both the unadjusted model (OR = 1.45, 95% CI: 1.00-2.10) and the age- and sex-adjusted model (OR = 1.62, 95% CI: 1.12-2.34). When comparing the lowest ALP quartile to the third quartile, a significant association with CERAD scores was observed only after adjustment for age and sex (Table\n5\n). Sensitivity analyses further supported a robust and consistent association between the highest quartile of ALP concentration and poorer CERAD test performance. Significant associations with Animal Fluency and DSST scores were also observed in both unadjusted and age- and sex-adjusted models. Notably, a significant association between the third ALP quartile and CERAD scores emerged in Model 3. Overall, ALP concentration was inversely associated with cognitive performance across all cognitive assessments (Supplementary Table\n4\n). More detailed data are available in Table\n5\nand Supplementary Table\n4\n.", "doc_items_refs": ["#/texts/260", "#/texts/261", "#/texts/262", "#/texts/263", "#/texts/264", "#/texts/265", "#/texts/266", "#/texts/267", "#/texts/268"], "page_nos": [], "uuid": "536da3e7-01b3-4d27-8969-dc872d23a593"}
{"doc_id": "2025__Exploring_the_impact_of_coffee_consumption_and_caffeine_intake_on_cognitive_perf__W4411868829", "source_path": "<redacted:source_path>", "chunk_id": 22, "source_chunk_idxs": [34], "num_tokens": 443, "text": "Exploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nResults\nNHANES analysis\nCompared to individuals in the lowest quartile of caffeine intake, those in the third quartile showed a significantly lower crude odds ratio (OR) for ALP concentration (OR = 0.62, 95% CI: 0.45-0.86). This association remained significant after adjusting for age and sex, with a multivariable-adjusted OR of 0.70 (95% CI: 0.49-1.00) in Model 3. Furthermore, compared to non-caffeine consumers, individuals with a daily caffeine intake of 86-162 mg had significantly lower ALP concentrations in both unadjusted and multivariable-adjusted models, with crude and Model 4 ORs of 0.66 (95% CI: 0.49-0.89) and 0.69 (95% CI: 0.48-0.98), respectively. Those consuming more than 162 mg/day also showed significant associations with ALP levels in unadjusted and age- and sex-adjusted models, with crude and Model 2 ORs of 0.63 (95% CI: 0.45-0.88) and 0.66 (95% CI: 0.47-0.92), respectively (Table\n6\n). Sensitivity analyses confirmed the robustness of these associations. Notably, when comparing individuals with caffeine intake of 84.1-162 mg/day to non-consumers, the association with ALP concentration remained marginally significant in Model 4 (OR = 0.70, 95% CI: 0.49-1.00) (Supplementary Table\n5\n). More detailed data are available in Table\n6\nand Supplementary Table\n5\n.\nA subgroup analysis with Model 4 adjustment was conducted to evaluate the association between caffeine intake from coffee and cognitive function. Statistically significant interactions between caffeine intake and age groups were observed across Figs.\n4\n,\n5\nand\n6\n(\np\n4\n).\nFig. 4\nFig. 5\nFig. 6", "doc_items_refs": ["#/texts/269", "#/texts/270", "#/texts/271", "#/texts/272", "#/texts/273", "#/texts/274", "#/texts/275", "#/texts/276", "#/texts/277", "#/texts/278", "#/texts/279", "#/texts/280", "#/texts/281", "#/texts/282", "#/texts/283", "#/texts/284", "#/texts/285", "#/texts/287", "#/texts/288", "#/texts/289", "#/texts/290", "#/texts/291"], "page_nos": [], "uuid": "a6c160ae-e892-4a66-85d0-92200452b42e"}
{"doc_id": "2025__Exploring_the_impact_of_coffee_consumption_and_caffeine_intake_on_cognitive_perf__W4411868829", "source_path": "<redacted:source_path>", "chunk_id": 23, "source_chunk_idxs": [35], "num_tokens": 452, "text": "Exploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nResults\nNHANES analysis\nIn Fig.\n5\n, significant interactions were identified between caffeine intake and both sex (\np\n= 0.031808) and milk consumption status (\np\n= 0.0042). Specifically, significant associations with Animal Fluency test scores were observed among males and non-milk consumers in the third quartile of caffeine intake.\nFigure\n6\ndemonstrated a significant interaction between caffeine intake and smoking status (\np\n= 0.027465), with non-smokers in the third quartile of caffeine intake showing a significant association with DSST scores.\nFully adjusted linear regression models (Model 4) indicated no statistically significant associations between total coffee intake or caffeinated coffee intake and cognitive function scores. However, after full adjustment, decaffeinated coffee intake was significantly associated with Animal Fluency test scores (β = − 0.00228, 95% CI: − 0.00387 to − 0.00069). Significant associations were also observed between caffeine from coffee and both CERAD and DSST scores (β = 0.00473, 95% CI: 0.00130 to 0.00816; β = 0.01092, 95% CI: 0.00190 to 0.01993). ALP levels were negatively associated with CERAD and Animal Fluency test scores (β = − 0.03085, 95% CI: − 0.04387 to − 0.01784; β = − 0.01784, 95% CI: − 0.02925 to − 0.00642). Moreover, among individuals in the caffeine intake group that included non-consumers, a significant inverse association was observed between ALP levels and caffeine intake (β = − 0.01558, 95% CI: − 0.02681 to − 0.00434). More detailed data are available in Supplementary Tables\n6\n-\n11\n.", "doc_items_refs": ["#/texts/292", "#/texts/293", "#/texts/294", "#/texts/295", "#/texts/296", "#/texts/297", "#/texts/298", "#/texts/299", "#/texts/300", "#/texts/301", "#/texts/302", "#/texts/303", "#/texts/304", "#/texts/305", "#/texts/306", "#/texts/307", "#/texts/308"], "page_nos": [], "uuid": "2f6e8eda-e9ee-4b90-8ec5-2b46868699d1"}
{"doc_id": "2025__Exploring_the_impact_of_coffee_consumption_and_caffeine_intake_on_cognitive_perf__W4411868829", "source_path": "<redacted:source_path>", "chunk_id": 24, "source_chunk_idxs": [36, 37], "num_tokens": 492, "text": "Exploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nResults\nNHANES analysis\nFigure\n7\nemployed restricted cubic spline models to explore the potential nonlinear associations between total coffee intake, caffeinated coffee intake, caffeine intake from daily coffee consumption, and serum ALP levels with various domains of cognitive test performance. A p-value for nonlinearity\n7\n.L demonstrated a significant nonlinear association between ALP levels and DSST scores, characterized by a U-shaped curve (the nadir indicated by a blue reference line). Specifically, when ALP levels were below 72.8 U/L, the odds ratio (OR) for DSST scores decreased, whereas levels above 72.8 U/L were associated with increasing ORs, indicating a nonlinear dose-response relationship. Additionally, Fig.\n8\nexamined the association between ALP levels and caffeine intake, revealing that serum ALP levels declined with increasing caffeine consumption, suggesting a negative linear trend.\nFig. 7\nFig. 8\n\nExploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nResults\nMR Mendelian analysis of mediation\nMendelian randomization analysis results of coffee/caffeine and cognitive performance\nAt a significance level of\nP\n15\n.\nIncreased intake of nine types of coffee was associated with the progression of various cognitive impairments, while three types of coffee were linked to a reduction in cognitive disorder progression. Specifically, decaffeinated coffee emerged as a risk factor for Lewy body dementia (OR = 3.5905, 95% CI: 1.4326-8.9988,\np\n= 0.0064), whereas coffee consumption exhibited a protective effect against Lewy body dementia (OR = 0.2365, 95% CI: 0.0582-0.9610,\np\n= 0.0438). Further details are available in Supplementary Tables\n14\nand Fig.\n9\n.\nFig. 9\nBoth MR-Egger intercept tests and MR-PRESSO (Mendelian Randomization Pleiotropy RESidual Sum and Outlier) yielded nonsignificant results, indicating no evidence of horizontal pleiotropy. Additionally, no directional heterogeneity was observed in the MR analysis (Supplementary Table\n14\n).", "doc_items_refs": ["#/texts/309", "#/texts/310", "#/texts/311", "#/texts/312", "#/texts/313", "#/texts/314", "#/texts/315", "#/texts/316", "#/texts/317", "#/texts/320", "#/texts/321", "#/texts/323", "#/texts/324", "#/texts/325", "#/texts/326", "#/texts/327", "#/texts/328", "#/texts/329", "#/texts/330", "#/texts/331", "#/texts/332", "#/texts/333", "#/texts/334", "#/texts/335", "#/texts/336", "#/texts/337"], "page_nos": [], "uuid": "613c97b6-d440-4b2e-a5e9-c01c419e5c71"}
{"doc_id": "2025__Exploring_the_impact_of_coffee_consumption_and_caffeine_intake_on_cognitive_perf__W4411868829", "source_path": "<redacted:source_path>", "chunk_id": 25, "source_chunk_idxs": [38, 39], "num_tokens": 428, "text": "Exploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nResults\nMR Mendelian analysis of mediation\nMendelian randomization analysis results of coffee/caffeine and alkaline phosphatase\nAt a significance level of\nP\n17\n.\nConsumption of 21 types of coffee was identified as a protective factor for serum ALP levels, while six types were indicated as risk factors. A meta-analysis across multiple datasets revealed that coffee/caffeine intake had a random effect on serum ALP, with an OR of 0.86 (95% CI: 0.79-0.93), suggesting a protective trend. Additional results can be found in Supplementary Tables\n16\nand Figs.\n10\nand\n11\n.\nFig. 10\nFig. 11\nBoth MR-Egger intercept tests and MR-PRESSO produced nonsignificant results, showing no evidence of horizontal pleiotropy, and no directional heterogeneity was observed in the MR analysis (Supplementary Table\n16\n).\n\nExploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nResults\nMR Mendelian analysis of mediation\nMendelian randomization analysis results of alkaline phosphatase and cognitive performance\nAt a significance level of\nP\n19\n).\nEight types of ALP were found to be protective factors for cognitive performance, while one type was noted as a risk factor. A meta-analysis indicated that serum ALP had a random effect on cognitive performance with an OR of 0.95 (95% CI: 0.92-0.98), suggesting an overall protective effect. Additional results are documented in Supplementary Tables 18 and Figs.\n12\nand\n13\n.\nFig. 12\nFig. 13\nBoth MR-Egger intercept tests and MR-PRESSO yielded nonsignificant results, indicating no evidence of horizontal pleiotropy, and directional heterogeneity was not observed in the MR analysis (Supplementary Table\n18\n).", "doc_items_refs": ["#/texts/339", "#/texts/340", "#/texts/342", "#/texts/343", "#/texts/344", "#/texts/345", "#/texts/346", "#/texts/347", "#/texts/348", "#/texts/349", "#/texts/350", "#/texts/351", "#/texts/352", "#/texts/353", "#/texts/354", "#/texts/355", "#/texts/357", "#/texts/358", "#/texts/360", "#/texts/361", "#/texts/362", "#/texts/363", "#/texts/364", "#/texts/365", "#/texts/366", "#/texts/367", "#/texts/368", "#/texts/369", "#/texts/370", "#/texts/371"], "page_nos": [], "uuid": "141bfd21-17d3-4e67-9f8a-a9abf6ba1bf7"}
{"doc_id": "2025__Exploring_the_impact_of_coffee_consumption_and_caffeine_intake_on_cognitive_perf__W4411868829", "source_path": "<redacted:source_path>", "chunk_id": 26, "source_chunk_idxs": [40], "num_tokens": 335, "text": "Exploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nResults\nMR Mendelian analysis of mediation\nMediated effect\nThis study investigates the relationship between coffee intake and cognitive function, focusing on the role of ALP. Data analysis revealed a positive correlation between coffee consumption and serum ALP levels, with a regression coefficient of 0.2583 (standard error 0.1129,\np\n= 0.02), indicating that each unit increase in coffee intake corresponds to an elevation in ALP levels. Additionally, consumption of strong coffee (e.g., espresso and filter coffee) significantly raised ALP levels, with a regression coefficient of 1.0730 (standard error 0.1988,\np\n= 6.74E-08). In the regression analysis for cognitive function, ALP levels negatively correlated with cognitive performance, yielding a regression coefficient of -0.2614 (standard error 0.0629,\np\n= 3.23E-05, mediated proportion 4.47 − 4.77%). An analysis of different coffee consumption types showed an even more pronounced effect of ALP on cognitive function, with a regression coefficient of -10.2684 (standard error 1.7966,\np\n= 1.09E-08, mediated proportion 1.50 − 1.78%), further supporting a causal relationship among the three variables. However, these results do not definitively establish a mediating effect, suggesting that coffee intake may influence cognitive abilities by elevating ALP levels. (Supplementary Tables\n20\nand Fig.\n14\n).\nFig. 14", "doc_items_refs": ["#/texts/373", "#/texts/374", "#/texts/375", "#/texts/376", "#/texts/377", "#/texts/378", "#/texts/379", "#/texts/380", "#/texts/381", "#/texts/382", "#/texts/383", "#/texts/384", "#/texts/385", "#/texts/386"], "page_nos": [], "uuid": "cb10fc5d-6dad-48db-86c9-aff4074fe79f"}
{"doc_id": "2025__Exploring_the_impact_of_coffee_consumption_and_caffeine_intake_on_cognitive_perf__W4411868829", "source_path": "<redacted:source_path>", "chunk_id": 27, "source_chunk_idxs": [41], "num_tokens": 344, "text": "Exploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nResults\nMR analysis of druggable available proteins\nAn intersection analysis of the 734 proteins studied by Zheng et al. was performed, utilizing a protein dataset that includes 4,479 existing patented drug targets. This analysis identified 511 proteins that were both investigated by Zheng et al. and function as patented drug targets, indicating their potential therapeutic relevance. (Supplementary Table\n21\n).\nSubsequently, we employed the TwoSampleMR package to evaluate potential causal relationships between these proteins and ALP. In the initial screening, a significance threshold of\np\n7\n).\nDue to each protein corresponding to a single nucleotide polymorphism (SNP), further sensitivity analyses could not be conducted. We downloaded the pQTL files for these 67 proteins from the deCODE database for subsequent analysis. We applied cis-pQTL filtering criteria to the pQTL files, identifying relevant cis-pQTLs.\nNext, we carried out two-sample Mendelian randomization (MR) analyses on these proteins concerning ALP. In the second round of screening, we implemented a stricter Bonferroni correction for p-value adjustment, using a threshold of\n8\n). Among these, 17 proteins showed a positive correlation with serum ALP levels, while 5 proteins indicated a negative correlation.\nBoth MR-Egger intercept tests and MR-PRESSO yielded nonsignificant results, indicating no evidence of horizontal pleiotropy, and directional heterogeneity was not observed in the MR analysis (Supplementary Tables\n22\n-\n23\n).", "doc_items_refs": ["#/texts/388", "#/texts/389", "#/texts/390", "#/texts/391", "#/texts/392", "#/texts/394", "#/texts/395", "#/texts/396", "#/texts/397", "#/texts/398", "#/texts/399", "#/texts/400", "#/texts/401", "#/texts/402", "#/texts/403", "#/texts/404"], "page_nos": [], "uuid": "f9def381-2768-466f-a361-121084a28dd0"}
{"doc_id": "2025__Exploring_the_impact_of_coffee_consumption_and_caffeine_intake_on_cognitive_perf__W4411868829", "source_path": "<redacted:source_path>", "chunk_id": 28, "source_chunk_idxs": [42, 43], "num_tokens": 322, "text": "Exploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nResults\nSMR analysis and colocalization analysis\nThe HEIDI test was conducted to confirm the presence of pleiotropy. The results indicated that HEIDI test p-values (p\\_HEIDI) for PDCD1LG2, IGFLR1, and FCN1 were all greater than 0.05, suggesting that the SNPs of these three proteins do not exhibit pleiotropy. Furthermore, the SMR analysis revealed p-values less than 0.05, indicating a causal relationship between these three proteins and ALP (Table\n9\n).\nAccording to the co-localization analysis results IGFLR1 shows a moderate co-localization relationship with ALP (0.5  0.8) (Table\n10\n).\n\nExploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nResults\nDrug target analysis\nA PPI analysis of the drug target IGFLR1, which exhibits a moderate co-localization relationship with ALP, was performed using the STRING database. A set of drug-related targets was constructed, including IGFLR1, IGFL1, and IGFL3. Additionally, we utilized the TWRING website's analysis tools for functional enrichment visualization to explore the pathways through which ALP may influence cognitive function (Figs.\n15\nand\n16\n).\nFig. 15\nFig. 16", "doc_items_refs": ["#/texts/406", "#/texts/407", "#/texts/408", "#/texts/409", "#/texts/410", "#/texts/411", "#/texts/413", "#/texts/414", "#/texts/415", "#/texts/416", "#/texts/417", "#/texts/418", "#/texts/419"], "page_nos": [], "uuid": "8e1f598e-5648-4060-9eab-62c2a0d7f3bc"}
{"doc_id": "2025__Exploring_the_impact_of_coffee_consumption_and_caffeine_intake_on_cognitive_perf__W4411868829", "source_path": "<redacted:source_path>", "chunk_id": 29, "source_chunk_idxs": [44], "num_tokens": 310, "text": "Exploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nDiscussion\nThis study explores the relationship between coffee consumption, caffeine intake, ALP activity, and cognitive function in older adults. We utilized various methods, including data from the NHANES (National Health and Nutrition Examination Survey) database, two-sample Mendelian randomization (MR), genome-wide association (pQTL) analysis, Summary data-based MR (SMR) analysis, and colocalization analysis. Our findings indicate a significant positive correlation between coffee and caffeine intake and cognitive performance, with ALP levels potentially playing a mediating role in this relationship, although the effect is relatively minor.\nCurrent studies generally support a positive association between coffee consumption and cognitive function improvement [\n45\n,\n46\n,\n47\n,\n48\n]. For instance, a systematic review suggests that caffeine consumption, especially moderate quantities consumed through coffee or green tea and in women, may reduce the risk of dementia and cognitive decline, and may ameliorate cognitive decline in cognitively impaired individuals [\n45\n]. Our research further corroborated that higher levels of coffee and caffeine intake are associated with better cognitive performance, particularly in memory and processing speed assessments.\nAlthough studies on the relationship between caffeine intake and ALP activity are relatively limited, our research emphasizes the significance of this connection. ALP plays a crucial role in maintaining bone health and neurological function [\n49\n].", "doc_items_refs": ["#/texts/421", "#/texts/422", "#/texts/423", "#/texts/424", "#/texts/425", "#/texts/426", "#/texts/427", "#/texts/428", "#/texts/429", "#/texts/430", "#/texts/431", "#/texts/432", "#/texts/433", "#/texts/434", "#/texts/435"], "page_nos": [], "uuid": "deb2cc86-fa05-4dd2-ae19-630513a32bc5"}
{"doc_id": "2025__Exploring_the_impact_of_coffee_consumption_and_caffeine_intake_on_cognitive_perf__W4411868829", "source_path": "<redacted:source_path>", "chunk_id": 30, "source_chunk_idxs": [45], "num_tokens": 471, "text": "Exploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nDiscussion\nOur study indicates that subjects with high levels of ALP experience impairments in memory and recognition abilities compared to those with low levels. This suggests the significant role of ALP in the nervous system. Tissue-nonspecific alkaline phosphatase (TNAP) is a specific isoenzyme of ALP that is widely expressed in various tissues, particularly in the brain, where it plays a crucial role. TNAP is expressed in both developing and adult mammalian brains, with strong expression in the developing nervous system that is closely associated with neurogenic activity. Although TNAP expression decreases later in development, it remains highly expressed in the subventricular zone of the adult lateral ventricles, supporting the generation of new neurons in the olfactory bulb. Despite its widespread presence, the expression and physiological regulatory functions of TNAP in neural tissues are still poorly understood, which may contribute to its limited attention in neurological research [\n50\n]. Nonetheless, the strong expression of TNAP in the developing brain highlights its important role in neurodevelopment. Additionally, studies have suggested that TNAP may serve as a potential biomarker for gout and various diseases, with gout complications including Alzheimer's disease (AD) [\n51\n], thereby indirectly supporting our research findings.\nResearch indicates that tissue-nonspecific alkaline phosphatase (TNAP), particularly its isoenzymes, can exacerbate the neurotoxicity of tau protein by promoting its hyperphosphorylation, thereby triggering neuroinflammatory responses and aberrant synaptic phagocytosis by microglia [\n52\n]. This pathological cascade further induces mitochondrial dysfunction and reactive oxygen species (ROS) accumulation, intensifying cerebral oxidative stress and ultimately aggravating cognitive impairment [\n53\n]. Intervention studies demonstrate that ameliorating mitochondrial function can effectively rescue synaptic loss in mouse models and significantly improve cognitive performance. Furthermore, epidemiological investigations reveal that caffeine consumption exhibits protective effects on cognitive function in specific populations, such as Mediterranean elderly individuals with metabolic syndrome [\n54\n].", "doc_items_refs": ["#/texts/436", "#/texts/437", "#/texts/438", "#/texts/439", "#/texts/440", "#/texts/441", "#/texts/442", "#/texts/443", "#/texts/444", "#/texts/445", "#/texts/446", "#/texts/447"], "page_nos": [], "uuid": "f7a60c23-f0dc-486e-a2af-fb3acc5b5deb"}
{"doc_id": "2025__Exploring_the_impact_of_coffee_consumption_and_caffeine_intake_on_cognitive_perf__W4411868829", "source_path": "<redacted:source_path>", "chunk_id": 31, "source_chunk_idxs": [46], "num_tokens": 478, "text": "Exploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nDiscussion\nCurrent studies have shown that tissue-nonspecific ALP has a layer-specific distribution in the human cerebral cortex, especially in layer 5 of the prefrontal cortex, which is a neurotransmission hub for higher cognitive functions [\n55\n]. In Alzheimer's disease (AD) patients, the protein expression level and enzyme activity of TNAP are significantly increased in the temporal lobe and hippocampus (the core regions of abnormal tau deposition), suggesting that TNAP may be involved in the pathological process of AD and play a dual regulatory role. On the one hand, TNAP catalyzes the dephosphorylation of extracellular ATP to generate adenosine, which not only inhibits neuroinflammation but also helps maintain blood-brain barrier homeostasis [\n56\n]. Adenosine accumulation may play a neuroprotective role by activating adenosine receptors, such as A1 receptors. On the other hand, recent evidence suggests that TNAP may mediate the dephosphorylation of hyperphosphorylated tau protein and promote its abnormal interaction with muscarinic receptors, which may interfere with intracellular calcium homeostasis and eventually lead to apoptosis. This mechanism may explain the potential promoting role of TNAP in AD neurodegeneration [\n57\n].\nWe found that caffeine intake has been found to significantly reduce ALP levels in the body, which may have profound implications for the function of tissue-nonspecific ALP. TNAP plays multiple critical roles in the brain, including involvement in the formation and maintenance of the blood-brain barrier [\n56\n], synthesis of neurotransmitters [\n58\n], interaction with the extracellular matrix [\n59\n], and regulation of neuroinflammation [\n60\n,\n61\n]. The activity of TNAP is crucial during neurodevelopment, as its high expression during brain development supports the growth and differentiation of neurons. By lowering ALP levels, caffeine may alter the biochemical environment in the brain, consequently affecting neuronal access to nutrients and metabolism, thereby influencing normal neural function [\n57\n].", "doc_items_refs": ["#/texts/448", "#/texts/449", "#/texts/450", "#/texts/451", "#/texts/452", "#/texts/453", "#/texts/454", "#/texts/455", "#/texts/456", "#/texts/457", "#/texts/458", "#/texts/459", "#/texts/460", "#/texts/461", "#/texts/462", "#/texts/463", "#/texts/464", "#/texts/465", "#/texts/466", "#/texts/467"], "page_nos": [], "uuid": "03739a20-cbf3-4147-8c73-bd065db4327b"}
{"doc_id": "2025__Exploring_the_impact_of_coffee_consumption_and_caffeine_intake_on_cognitive_perf__W4411868829", "source_path": "<redacted:source_path>", "chunk_id": 32, "source_chunk_idxs": [47], "num_tokens": 344, "text": "Exploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nDiscussion\nIn acute ischemic events, studies have indicated that elevated TNAP levels are often associated with poor prognosis [\n62\n,\n63\n,\n64\n,\n65\n]. This phenomenon suggests that TNAP may play a complex role in neural injury and recovery processes. Whether caffeine intake can mitigate neuronal damage or inflammatory responses by inhibiting TNAP activity is an important question worth exploring [\n60\n]. Specifically, caffeine may exert its anti-inflammatory effects by impacting TNAP's role in regulating neuroinflammation, thereby alleviating inflammation triggered by neural damage. This mechanism not only helps elucidate the potential neuroprotective effects of caffeine but also provides a theoretical basis for developing new therapeutic strategies.\nHowever, it is important to note that long-term caffeine use may negatively affect the physiological functions of TNAP. While caffeine may help reduce inflammatory responses in the short term, prolonged suppression of TNAP activity could disrupt its essential roles in neurodevelopment and maintenance of neural function. Research indicates that TNAP is indispensable for neuronal development, synaptogenesis, and functional maintenance [\n66\n,\n67\n]; thus, chronic caffeine intake may lead to neural developmental issues or functional impairments. Future studies should systematically assess the specific effects of caffeine on TNAP activity and its potential implications in various neuropathological conditions to gain a comprehensive understanding of caffeine's neuroprotective mechanisms and potential risks.", "doc_items_refs": ["#/texts/468", "#/texts/469", "#/texts/470", "#/texts/471", "#/texts/472", "#/texts/473", "#/texts/474", "#/texts/475", "#/texts/476", "#/texts/477", "#/texts/478", "#/texts/479", "#/texts/480", "#/texts/481", "#/texts/482", "#/texts/483"], "page_nos": [], "uuid": "f3881bed-372e-47f1-a44c-53bec24fb684"}
{"doc_id": "2025__Exploring_the_impact_of_coffee_consumption_and_caffeine_intake_on_cognitive_perf__W4411868829", "source_path": "<redacted:source_path>", "chunk_id": 33, "source_chunk_idxs": [48], "num_tokens": 452, "text": "Exploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nDiscussion\nOur research has also revealed a moderate degree of co-localization between insulin-like growth factor-like receptor 1 (IGFLR1) and ALP, highlighting the potential interactions of these two molecules in cellular functions and pathological conditions. IGFLR1 plays a significant role in cellular signaling, participating in the regulation of cell proliferation, survival, and migration. Previous studies have indicated that IGFLR1 is closely linked to the regulation of cancer activation, intercellular adhesion among lymphocytes, and drug resistance, suggesting its critical function within the tumor microenvironment [\n68\n]. Conversely, ALP affects intracellular signaling pathways through its dephosphorylation activity [\n69\n]. Therefore, the interaction between IGFLR1 and ALP may play a pivotal role in the biological behavior of cancer cells, influencing tumorigenesis and potentially impacting the nervous system, thereby affecting cognitive function.\nOur analysis supports the causal relationship between coffee/caffeine intake and cognitive performance and further explores the possibility of ALP as a potential mediating variable. Although the role of ALP as a mediating variable is supported to some extent, it is not significant.\nThis indicates that although ALP may play a role in the observed associations, the existing evidence does not support it as the main mediating factor. In the future, studies with larger sample sizes and longitudinal designs are needed to clarify the specific role of ALP in this process.\nInterestingly, while the consumption of caffeinated coffee is significantly related to cognitive performance, decaffeinated coffee does not show the same effect. This finding aligns with previous research, highlighting the critical role of caffeine in cognitive function [\n28\n]. Furthermore, our study underscores the necessity of considering confounding factors such as age, sex, and lifestyle habits (e.g., smoking and alcohol consumption), which may influence cognitive performance. Subgroup analyses revealed an interaction between caffeine intake and smoking status, indicating the complex interplay between lifestyle factors and dietary components in shaping cognitive health.", "doc_items_refs": ["#/texts/484", "#/texts/485", "#/texts/486", "#/texts/487", "#/texts/488", "#/texts/489", "#/texts/490", "#/texts/491", "#/texts/492", "#/texts/493"], "page_nos": [], "uuid": "05d1d0cc-f923-4e38-9f32-e7389d0a954f"}
{"doc_id": "2025__Exploring_the_impact_of_coffee_consumption_and_caffeine_intake_on_cognitive_perf__W4411868829", "source_path": "<redacted:source_path>", "chunk_id": 34, "source_chunk_idxs": [49], "num_tokens": 224, "text": "Exploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nDiscussion\nWhile a large proportion of the statistically significant associations in our study were observed with cognitive outcomes derived from the CERAD battery, it is noteworthy that meaningful associations were also detected with the Animal Fluency Test and the Digit Symbol Substitution Test (DSST). These findings indicate that the observed effects of coffee consumption may extend beyond memory-related domains to encompass broader aspects of executive function and processing speed. However, the predominance of CERAD-related results may be attributed to the greater sensitivity of its subtests-particularly those assessing episodic memory and verbal fluency-to subtle cognitive changes influenced by nutritional exposures. Differences in domain-specific sensitivity across cognitive tests should be considered when interpreting the distribution of results. Future longitudinal studies employing comprehensive neuropsychological batteries will be valuable in delineating the cognitive domains most responsive to dietary factors such as coffee intake.\nDespite employing multiple methods to enhance the reliability of our conclusions, certain limitations remain:", "doc_items_refs": ["#/texts/494", "#/texts/495"], "page_nos": [], "uuid": "b33c05f6-cd8b-4824-afe5-cb5952bcf9e0"}
{"doc_id": "2025__Exploring_the_impact_of_coffee_consumption_and_caffeine_intake_on_cognitive_perf__W4411868829", "source_path": "<redacted:source_path>", "chunk_id": 35, "source_chunk_idxs": [50], "num_tokens": 391, "text": "Exploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nDiscussion\n1. 1. Unclear Causality: Although the two-sample Mendelian randomization (MR), pQTL analysis, SMR analysis, and colocalization analysis employed in this study help reduce confounding and bias, they still rely on the suitability of genetic instruments, and gene-environment interactions may bias causal inferences.\n2. 2. Limitations of the Dataset: The NHANES dataset provides rich population information, but its cross-sectional design restricts the capture of causal relationships. Additionally, self-reported dietary data from participants may be biased, potentially affecting the accuracy of coffee and caffeine intake measurements. The changes of systemic ALP level caused by underlying diseases such as hepatitis, cirrhosis and some autoimmune diseases (such as primary biliary cholangitis and autoimmune hepatitis) in the study population are difficult to control, which may be one of the factors affecting the results. In future clinical studies, the corresponding medical history should be screened to better reduce the influence of confounding variables and other factors.\n3. 3. During the cognitive assessment process, although we adopted a standardized bilingual assessment procedure, language and cultural differences may still have an impact on the test results. This impact is mainly reflected in the following aspects: (1) Test items in different language versions may have incomplete equivalent cultural adaptability. (2) Differences in language structure may affect performance in specific cognitive domains, such as language fluency and working memory. Cultural background may regulate the way participants understand and respond to the test situation.\nFuture research can adopt fully parallel designed multilingual version testing tools, use cross-cultural norms for score correction, or add measurement indicators of cultural adaptability to better control this potential source of bias.", "doc_items_refs": ["#/texts/496", "#/texts/497", "#/texts/498", "#/texts/499"], "page_nos": [], "uuid": "799b367e-161e-4635-86c5-20dd02bacc4a"}
{"doc_id": "2025__Exploring_the_impact_of_coffee_consumption_and_caffeine_intake_on_cognitive_perf__W4411868829", "source_path": "<redacted:source_path>", "chunk_id": 36, "source_chunk_idxs": [51], "num_tokens": 482, "text": "Exploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nDiscussion\n1. 4. Influence of Confounding Factors: While we controlled for some confounding factors (such as age, sex, and lifestyle habits), there may still be other unmeasured confounding variables that could impact result interpretations. Future Research Directions: To gain a deeper understanding of the relationship between coffee consumption, ALP levels, and cognitive function, future studies should consider longitudinal designs and more stringent data collection methods to better confirm causal relationships among these variables.\n2. 5. In terms of the types of caffeine and its mechanism of action, existing studies have shown that caffeine from natural sources (such as caffeine in coffee and tea) usually coexists with polyphenolic compounds (such as chlorogenic acid in coffee, catechin in tea) and a variety of antioxidants, which may synergistically inhibit the phosphorylation activity of TNAP, thereby more effectively reducing ALP levels. In contrast, synthetic caffeine, such as caffeine in energy drinks and pharmaceuticals, may require higher doses to achieve equivalent ALP inhibition due to the lack of these natural synergistic components, which may become a new direction for future research.\n3. 6. It is worth noting that although our study analyzed overall intake of caffeinated coffee, different types and modes of coffee consumption-such as pure black coffee versus coffee with added milk, plant-based milk, sugar, or creamer-may be associated with distinct metabolic profiles and health effects. These variations could stem from the influence of added ingredients on the absorption, metabolism, or bioavailability of bioactive compounds in coffee, such as caffeine and polyphenols. Moreover, individual preferences for specific coffee types may correlate with lifestyle factors or health status, introducing potential confounding. Therefore, future studies should aim to enhance both sample size and granularity of dietary data collection, particularly by capturing detailed patterns of coffee consumption. This would enable more refined subgroup or stratified sensitivity analyses, which are essential to uncover potential heterogeneity in health outcomes associated with different coffee consumption habits and to support more tailored dietary recommendations.", "doc_items_refs": ["#/texts/500", "#/texts/501", "#/texts/502"], "page_nos": [], "uuid": "f64f7e1a-dfc2-4f05-9cba-7ec5bf6aebd4"}
{"doc_id": "2025__Exploring_the_impact_of_coffee_consumption_and_caffeine_intake_on_cognitive_perf__W4411868829", "source_path": "<redacted:source_path>", "chunk_id": 37, "source_chunk_idxs": [52, 53, 54], "num_tokens": 422, "text": "Exploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nDiscussion\n4. 7. In addition, coffee brand and brewing parameters were not recorded in the study, and there may still be differences in the bioavailability of caffeine among different individuals, which may affect the individual differences in caffeine metabolism. Current dose-response analysis is mainly based on cross-sectional data, which fails to establish long-term follow-up dose-response curves, especially lack of real-time monitoring data of dynamic changes in blood-brain barrier permeability. Future research recommendations include: (1) individualized dose adjustment in combination with pharmacogenomic testing (e.g., CYP1A2 genotyping); (2) To simultaneously monitor the BBB permeability of caffeine from different sources using organoid models or microdialysis technology; (3) to establish the dynamic association between caffeine intake and ALP activity in a long-term cohort study. These improvements should allow more precise assessment of the neuroprotective effects of caffeine.\n\nExploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nConclusion\nThis study provides important empirical evidence regarding the relationship between coffee consumption, caffeine intake, ALP activity, and cognitive function in older adults. The results indicate a significant positive correlation between coffee and caffeine intake and cognitive performance, with ALP potentially serving as a mediating factor. Specifically, higher levels of coffee and caffeine consumption are closely associated with improved cognitive abilities, particularly in memory and processing speed. Furthermore, the critical role of ALP in neural health further elucidates the complex interplay among these variables.\n\nExploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nData availability\nData is provided within the manuscript.", "doc_items_refs": ["#/texts/503", "#/texts/505", "#/texts/507"], "page_nos": [], "uuid": "ef9d4043-6a00-44ad-a3fc-3ca98badba55"}
{"doc_id": "2025__Exploring_the_impact_of_coffee_consumption_and_caffeine_intake_on_cognitive_perf__W4411868829", "source_path": "<redacted:source_path>", "chunk_id": 38, "source_chunk_idxs": [55], "num_tokens": 463, "text": "Exploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nReferences\n1. de Gonzalez E, Ramirez-Mares MV. Impact of caffeine and coffee on our health. Trends Endocrinol Metab. 2014;25:489-92.\nArticle\nGoogle Scholar\n2. Zhong Z, Dong H, Zhou S, Lin C, Huang P, Li X, Zhang J, Xie J, Wu Y, Li P. Caffeine's neuroprotective effect on memory impairment: suppression of adenosine A(2)A receptor and enhancement of tyrosine hydroxylase in dopaminergic neurons under hypobaric hypoxia conditions. CNS Neurosci Ther. 2024;30:e70134.\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n3. Merighi S, Travagli A, Nigro M, Pasquini S, Cappello M, Contri C, Varani K, Vincenzi F, Borea PA, Gessi S. Caffeine for Prevention of Alzheimer's Disease: Is the A(2A) Adenosine Receptor Its Target? Biomolecules 2023, 13.\n4. Abalo R. Coffee and caffeine consumption for human health. Nutrients. 2021;13(9):2918.\n5. Bouchard C, Ordovas J. Preface. Advances in nutrigenetics and nutrigenomics. Prog Mol Biol Transl Sci. 2012;108:xv.\nPubMed\nGoogle Scholar\n6. Raeis-Abdollahi E, Raise-Abdullahi P, Rashidy-Pour A, Meamar M, Askari H. Coffee's protective mechanisms against neurodegeneration. Prog Brain Res. 2024;288:167-200.\nArticle\nPubMed\nGoogle Scholar\n7. YM MY, Waldvogel HJ, Faull RLM, Kwakowsky A. Neuroprotective Effect of Caffeine in Alzheimer's Disease. Molecules. 2022;27(12):3737.", "doc_items_refs": ["#/texts/509", "#/texts/510", "#/texts/511", "#/texts/512", "#/texts/513", "#/texts/514", "#/texts/515"], "page_nos": [], "uuid": "1417493e-a9a7-4f46-ad23-93c87c9c5aab"}
{"doc_id": "2025__Exploring_the_impact_of_coffee_consumption_and_caffeine_intake_on_cognitive_perf__W4411868829", "source_path": "<redacted:source_path>", "chunk_id": 39, "source_chunk_idxs": [56], "num_tokens": 489, "text": "Exploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nReferences\n8. Raise-Abdullahi P, Raeis-Abdollahi E, Meamar M, Rashidy-Pour A. Effects of coffee on cognitive function. Prog Brain Res. 2024;288:133-66.\nArticle\nPubMed\nGoogle Scholar\n9. Cornelis MC, Weintraub S, Morris MC. Caffeinated coffee and tea consumption, genetic variation and cognitive function in the UK biobank. J Nutr. 2020;150:2164-74.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n10. Bagheri Davisaraei Y, Nateghi S, Rashidipour H, Raise-Abdullahi P, Rashidy-Pour A. Coffee and sleep: benefits and risks. Prog Brain Res. 2024;288:81-114.\nArticle\nPubMed\nGoogle Scholar\n11. Heckman MA, Weil J, Gonzalez de Mejia E. Caffeine (1, 3, 7-trimethylxanthine) in foods: a comprehensive review on consumption, functionality, safety, and regulatory matters. J Food Sci. 2010;75:R77-87.\nArticle\nCAS\nPubMed\nGoogle Scholar\n12. Zhang RC, Madan CR. How does caffeine influence memory? Drug, experimental, and demographic factors. Neurosci Biobehav Rev. 2021;131:525-38.\nArticle\nCAS\nPubMed\nGoogle Scholar\n13. van den Berg B, de Jong M, Woldorff MG, Lorist MM. Caffeine boosts preparatory attention for Reward-related stimulus information. J Cogn Neurosci. 2021;33:104-18.\nArticle\nPubMed\nGoogle Scholar\n14. Repantis D, Bovy L, Ohla K, Kühn S, Dresler M. Cognitive enhancement effects of stimulants: a randomized controlled trial testing methylphenidate, modafinil, and caffeine. Psychopharmacology. 2021;238:441-51.\nArticle\nCAS\nPubMed\nGoogle Scholar\n15. Vimalraj S. Alkaline phosphatase: structure, expression and its function in bone mineralization. Gene. 2020;754:144855.\nArticle\nCAS\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/516", "#/texts/517", "#/texts/518", "#/texts/519", "#/texts/520", "#/texts/521", "#/texts/522", "#/texts/523"], "page_nos": [], "uuid": "71360a35-8ad8-4a36-9bdb-a4f96b0ccd35"}
{"doc_id": "2025__Exploring_the_impact_of_coffee_consumption_and_caffeine_intake_on_cognitive_perf__W4411868829", "source_path": "<redacted:source_path>", "chunk_id": 40, "source_chunk_idxs": [57], "num_tokens": 419, "text": "Exploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nReferences\n16. Vardy ER, Kellett KA, Cocklin SL, Hooper NM. Alkaline phosphatase is increased in both brain and plasma in alzheimer's disease. Neurodegener Dis. 2012;9:31-7.\nArticle\nCAS\nPubMed\nGoogle Scholar\n17. Soria-Tobar L, Román-Valero L, Sebastián-Serrano Á, Aivar P, Álvarez-Castelao B, Díaz-Hernández M. Blockade of brain alkaline phosphatase efficiently reduces amyloid-β plaque burden and associated cognitive impairment. Alzheimers Res Ther. 2024;16:233.\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n18. Nakamoto T, Joseph F Jr., Yazdani M, Hartman AD. Effects of different levels of caffeine supplemented to the maternal diet on the brains of newborn rats and their dams. Toxicol Lett. 1988;44:167-75.\nArticle\nCAS\nPubMed\nGoogle Scholar\n19. Nakamoto T, Hartman AD, Joseph F Jr. Interaction between caffeine intake and nutritional status on growing brains in newborn rats. Ann Nutr Metab. 1989;33:92-9.\nArticle\nCAS\nPubMed\nGoogle Scholar\n20. Marani E, van der Veeken JG, Lakke EA. Simultaneous demonstration of CD15 and alkaline phosphatase activity in cryostat sections of rat fetuses: a detailed technical description for the developing brain. Eur J Morphol. 1995;33:137-47.\nCAS\nPubMed\nGoogle Scholar\n21. Tam PP, Kwong WH. A study on the pattern of alkaline phosphatase activity correlated with observations on silver-impregnated structures in the developing mouse brain. J Anat. 1987;150:169-80.\nCAS\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/524", "#/texts/525", "#/texts/526", "#/texts/527", "#/texts/528", "#/texts/529"], "page_nos": [], "uuid": "f12451d0-aafd-4d5f-b5ac-095cad021a10"}
{"doc_id": "2025__Exploring_the_impact_of_coffee_consumption_and_caffeine_intake_on_cognitive_perf__W4411868829", "source_path": "<redacted:source_path>", "chunk_id": 41, "source_chunk_idxs": [58], "num_tokens": 499, "text": "Exploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nReferences\n22. Boccardi V, Bubba V, Murasecco I, Pigliautile M, Monastero R, Cecchetti R, Scamosci M, Bastiani P, Mecocci P. Serum alkaline phosphatase is elevated and inversely correlated with cognitive functions in subjective cognitive decline: results from the ReGAl 2.0 project. Aging Clin Exp Res. 2021;33:603-9.\nArticle\nPubMed\nGoogle Scholar\n23. National Health and Nutrition Examination. Survey 2011-2012 Data Documentation, Codebook, and Frequencies, Cognitive Functioning (CFQ\\_G).\nhttps://wwwn.cdc.gov/Nchs/Data/Nhanes/Public/2011/DataFiles/CFQ\\_G.htm\n24. National Health and Nutrition Examination Survey. 2013-2014 Data Documentation, Codebook, and Frequencies, Cognitive Functioning (CFQ\\_H).\nhttps://wwwn.cdc.gov/Nchs/Data/Nhanes/Public/2013/DataFiles/CFQ\\_H.htm\n25. Li T, Hu Z, Qiao L, Wu Y, Ye T. Chronic kidney disease and cognitive performance: NHANES 2011-2014. BMC Geriatr. 2024;24:351.\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n26. Wei B, Dong Q, Ma J, Zhang A. The association between triglyceride-glucose index and cognitive function in nondiabetic elderly: NHANES 2011-2014. Lipids Health Dis. 2023;22:188.\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n27. Chen SP, Bhattacharya J, Pershing S. Association of vision loss with cognition in older adults. JAMA Ophthalmol. 2017;135:963-70.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n28. Dong X, Li S, Sun J, Li Y, Zhang D. Association of coffee, decaffeinated coffee and caffeine intake from coffee with cognitive performance in older adults: National health and nutrition examination survey (NHANES) 2011-2014. Nutrients. 2020;12(3):840.", "doc_items_refs": ["#/texts/530", "#/texts/531", "#/texts/532", "#/texts/533", "#/texts/534", "#/texts/535", "#/texts/536"], "page_nos": [], "uuid": "f7f74978-1318-49e7-b625-73787b605534"}
{"doc_id": "2025__Exploring_the_impact_of_coffee_consumption_and_caffeine_intake_on_cognitive_perf__W4411868829", "source_path": "<redacted:source_path>", "chunk_id": 42, "source_chunk_idxs": [59], "num_tokens": 487, "text": "Exploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nReferences\n29. NHANES 2011-2012. Laboratory Data Overview.\nhttps://wwwn.cdc.gov/nchs/nhanes/continuousnhanes/overviewlab.aspx?BeginYear=2011\n30. National Health and Nutrition Examination Survey. 2011-2012 Data Documentation, Codebook, and Frequencies Dietary Interview - Individual Foods, First Day (DR1IFF\\_G).\nhttps://wwwn.cdc.gov/Nchs/Data/Nhanes/Public/2011/DataFiles/DR1IFF\\_G.htm\n31. National Health and Nutrition Examination Survey. 2011-2012 Data Documentation, Codebook, and Frequencies Dietary Interview - Individual Foods, Second Day (DR2IFF\\_G).\nhttps://wwwn.cdc.gov/Nchs/Data/Nhanes/Public/2011/DataFiles/DR2IFF\\_G.htm\n32. National Health and Nutrition Examination Survey. 2013-2014 Data Documentation, Codebook, and Frequencies Dietary Interview - Individual Foods, First Day (DR1IFF\\_H).\nhttps://wwwn.cdc.gov/Nchs/Data/Nhanes/Public/2013/DataFiles/DR1IFF\\_H.htm\n33. National Health and Nutrition Examination Survey. 2013-2014 Data Documentation, Codebook, and Frequencies Dietary Interview - Individual Foods, Second Day (DR2IFF\\_H).\nhttps://wwwn.cdc.gov/Nchs/Data/Nhanes/Public/2013/DataFiles/DR2IFF\\_H.htm\n34. Ford ES, Bergmann MM, Boeing H, Li C, Capewell S. Healthy lifestyle behaviors and all-cause mortality among adults in the united States. Prev Med. 2012;55:23-7.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n35. Piercy KL, Troiano RP, Ballard RM, Carlson SA, Fulton JE, Galuska DA, George SM, Olson RD. The physical activity guidelines for Americans. JAMA. 2018;320:2020-8.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/537", "#/texts/538", "#/texts/539", "#/texts/540", "#/texts/541", "#/texts/542", "#/texts/543"], "page_nos": [], "uuid": "1a1fc860-d64c-48e8-a9b8-73c537fe8636"}
{"doc_id": "2025__Exploring_the_impact_of_coffee_consumption_and_caffeine_intake_on_cognitive_perf__W4411868829", "source_path": "<redacted:source_path>", "chunk_id": 43, "source_chunk_idxs": [60], "num_tokens": 486, "text": "Exploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nReferences\n36. Organization WH. Global Physical Activity Questionnaire (GPAQ) Analysis Guide. Global Physical Activity Questionnaire (GPAQ) Analysis Guide.\nhttps://www.whoint/ncds/surveillance/steps/resources/GPAQ\\_Analysis\\_Guidepdf\n37. Zheng J, Haberland V, Baird D, Walker V, Haycock PC, Hurle MR, Gutteridge A, Erola P, Liu Y, Luo S, et al. Phenome-wide Mendelian randomization mapping the influence of the plasma proteome on complex diseases. Nat Genet. 2020;52:1122-31.\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n38. Finan C, Gaulton A, Kruger FA, Lumbers RT, Shah T, Engmann J, Galver L, Kelley R, Karlsson A, Santos R et al. The druggable genome and support for target identification and validation in drug development. Sci Transl Med. 2017;9(383):eaag1166.\n39. Ferkingstad E, Sulem P, Atlason BA, Sveinbjornsson G, Magnusson MI, Styrmisdottir EL, Gunnarsdottir K, Helgason A, Oddsson A, Halldorsson BV, et al. Large-scale integration of the plasma proteome with genetics and disease. Nat Genet. 2021;53:1712-21.\nArticle\nCAS\nPubMed\nGoogle Scholar\n40. Price AL, Patterson NJ, Plenge RM, Weinblatt ME, Shadick NA, Reich D. Principal components analysis corrects for stratification in genome-wide association studies. Nat Genet. 2006;38:904-9.\nArticle\nCAS\nPubMed\nGoogle Scholar\n41. Revez JA, Lin T, Qiao Z, Xue A, Holtz Y, Zhu Z, Zeng J, Wang H, Sidorenko J, Kemper KE, et al. Genome-wide association study identifies 143 loci associated with 25 hydroxyvitamin D concentration. Nat Commun. 2020;11:1647.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/544", "#/texts/545", "#/texts/546", "#/texts/547", "#/texts/548", "#/texts/549"], "page_nos": [], "uuid": "36780051-1969-4c4e-9a53-011ef1a12b88"}
{"doc_id": "2025__Exploring_the_impact_of_coffee_consumption_and_caffeine_intake_on_cognitive_perf__W4411868829", "source_path": "<redacted:source_path>", "chunk_id": 44, "source_chunk_idxs": [61], "num_tokens": 503, "text": "Exploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nReferences\n42. Li X, Meng X, Spiliopoulou A, Timofeeva M, Wei WQ, Gifford A, Shen X, He Y, Varley T, McKeigue P, et al. MR-PheWAS: exploring the causal effect of SUA level on multiple disease outcomes by using genetic instruments in UK biobank. Ann Rheum Dis. 2018;77:1039-47.\nArticle\nCAS\nPubMed\nGoogle Scholar\n43. Zhu Z, Zhang F, Hu H, Bakshi A, Robinson MR, Powell JE, Montgomery GW, Goddard ME, Wray NR, Visscher PM, Yang J. Integration of summary data from GWAS and eQTL studies predicts complex trait gene targets. Nat Genet. 2016;48:481-7.\nArticle\nCAS\nPubMed\nGoogle Scholar\n44. Szklarczyk D, Gable AL, Lyon D, Junge A, Wyder S, Huerta-Cepas J, Simonovic M, Doncheva NT, Morris JH, Bork P, et al. STRING v11: protein-protein association networks with increased coverage, supporting functional discovery in genome-wide experimental datasets. Nucleic Acids Res. 2019;47:D607-13.\nArticle\nCAS\nPubMed\nGoogle Scholar\n45. Plumber N, Majeed M, Ziff S, Thomas SE, Bolla SR, Gorantla VR. Stimulant usage by medical students for cognitive enhancement: A systematic review. Cureus. 2021;13:e15163.\nPubMed\nPubMed Central\nGoogle Scholar\n46. Fiani B, Zhu L, Musch BL, Briceno S, Andel R, Sadeq N, Ansari AZ. The neurophysiology of caffeine as a central nervous system stimulant and the resultant effects on cognitive function. Cureus. 2021;13:e15032.\nPubMed\nPubMed Central\nGoogle Scholar\n47. Chen JQA, Scheltens P, Groot C, Ossenkoppele R. Associations between caffeine consumption, cognitive decline, and dementia: A systematic review. J Alzheimers Dis. 2020;78:1519-46.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/550", "#/texts/551", "#/texts/552", "#/texts/553", "#/texts/554", "#/texts/555"], "page_nos": [], "uuid": "b7ae6ff8-6bdb-42bd-84c7-729854709419"}
{"doc_id": "2025__Exploring_the_impact_of_coffee_consumption_and_caffeine_intake_on_cognitive_perf__W4411868829", "source_path": "<redacted:source_path>", "chunk_id": 45, "source_chunk_idxs": [62], "num_tokens": 447, "text": "Exploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nReferences\n48. Nehlig A. Effects of coffee/caffeine on brain health and disease: what should I tell my patients? Pract Neurol. 2016;16:89-95.\nArticle\nPubMed\nGoogle Scholar\n49. Bozchaloei SS, Gong SG, Dehpour AR, Farrokh P, Khoshayand MR, Oskoui M. Caffeine alters mitochondrial dehydrogenase and alkaline phosphatase activity of human gingival fibroblasts in vitro. J Investig Clin Dent. 2013;4:233-9.\nArticle\nPubMed\nGoogle Scholar\n50. Zimmermann H, Langer D. Tissue-Nonspecific alkaline phosphatase in the developing brain and in adult neurogenesis. Subcell Biochem. 2015;76:61-84.\nArticle\nCAS\nPubMed\nGoogle Scholar\n51. Brichacek AL, Brown CM. Alkaline phosphatase: a potential biomarker for stroke and implications for treatment. Metab Brain Dis. 2019;34:3-19.\nArticle\nPubMed\nGoogle Scholar\n52. Sun XY, Li LJ, Dong QX, Zhu J, Huang YR, Hou SJ, Yu XL, Liu RT. Rutin prevents Tau pathology and neuroinflammation in a mouse model of alzheimer's disease. J Neuroinflammation. 2021;18:131.\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n53. Zhao Y, Zhang J, Zheng Y, Zhang Y, Zhang XJ, Wang H, Du Y, Guan J, Wang X, Fu J. NAD(+) improves cognitive function and reduces neuroinflammation by ameliorating mitochondrial damage and decreasing ROS production in chronic cerebral hypoperfusion models through Sirt1/PGC-1α pathway. J Neuroinflammation. 2021;18:207.\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/556", "#/texts/557", "#/texts/558", "#/texts/559", "#/texts/560", "#/texts/561"], "page_nos": [], "uuid": "f2b85cd0-3403-46d3-9958-1ef8729fc780"}
{"doc_id": "2025__Exploring_the_impact_of_coffee_consumption_and_caffeine_intake_on_cognitive_perf__W4411868829", "source_path": "<redacted:source_path>", "chunk_id": 46, "source_chunk_idxs": [63], "num_tokens": 449, "text": "Exploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nReferences\n54. Paz-Graniel I, Babio N, Becerra-Tomás N, Toledo E, Camacho-Barcia L, Corella D, Castañer-Niño O, Romaguera D, Vioque J, Alonso-Gómez ÁM, et al. Association between coffee consumption and total dietary caffeine intake with cognitive functioning: cross-sectional assessment in an elderly mediterranean population. Eur J Nutr. 2021;60:2381-96.\nArticle\nCAS\nPubMed\nGoogle Scholar\n55. Négyessy L, Xiao J, Kántor O, Kovács GG, Palkovits M, Dóczi TP, Renaud L, Baksa G, Glasz T, Ashaber M, et al. Layer-specific activity of tissue non-specific alkaline phosphatase in the human neocortex. Neuroscience. 2011;172:406-18.\nArticle\nPubMed\nGoogle Scholar\n56. Deracinois B, Lenfant AM, Dehouck MP, Flahaut C. Tissue Non-specific alkaline phosphatase (TNAP) in vessels of the brain. Subcell Biochem. 2015;76:125-51.\nArticle\nCAS\nPubMed\nGoogle Scholar\n57. Sekaran S, Vimalraj S, Thangavelu L. The physiological and pathological role of tissue nonspecific alkaline phosphatase beyond mineralization. Biomolecules. 2021;11(11):1564.\n58. Brichacek AL, Benkovic SA, Chakraborty S, Nwafor DC, Wang W, Jun S, Dakhlallah D, Geldenhuys WJ, Pinkerton AB, Millán JL, Brown CM. Systemic Inhibition of tissue-nonspecific alkaline phosphatase alters the brain-immune axis in experimental sepsis. Sci Rep. 2019;9:18788.\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/562", "#/texts/563", "#/texts/564", "#/texts/565", "#/texts/566"], "page_nos": [], "uuid": "c056c0bd-325d-4889-b150-8c820fab18b2"}
{"doc_id": "2025__Exploring_the_impact_of_coffee_consumption_and_caffeine_intake_on_cognitive_perf__W4411868829", "source_path": "<redacted:source_path>", "chunk_id": 47, "source_chunk_idxs": [64], "num_tokens": 477, "text": "Exploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nReferences\n59. Díaz-Hernández M, Gómez-Ramos A, Rubio A, Gómez-Villafuertes R, Naranjo JR, Miras-Portugal MT, Avila J. Tissue-nonspecific alkaline phosphatase promotes the neurotoxicity effect of extracellular Tau. J Biol Chem. 2010;285:32539-48.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n60. Idzko M, Ferrari D, Eltzschig HK. Nucleotide signalling during inflammation. Nature. 2014;509:310-7.\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n61. Sebastián-Serrano Á, Merchán-Rubira J, Di Lauro C, Bianchi C, Soria-Tobar L, Narisawa S, Millán JL, Ávila J, Hernández F, Díaz-Hernández M. TNAP upregulation is a critical factor in tauopathies and its Blockade ameliorates neurotoxicity and increases life-expectancy. Neurobiol Dis. 2022;165:105632.\nArticle\nPubMed\nGoogle Scholar\n62. Ryu WS, Lee SH, Kim CK, Kim BJ, Yoon BW. Increased serum alkaline phosphatase as a predictor of long-term mortality after stroke. Neurology. 2010;75:1995-2002.\nArticle\nCAS\nPubMed\nGoogle Scholar\n63. Uehara T, Ohara T, Minematsu K, Nagatsuka K, Toyoda K. Predictors of stroke events in patients with transient ischemic attack attributable to intracranial stenotic lesions. Intern Med. 2018;57:295-300.\nArticle\nCAS\nPubMed\nGoogle Scholar\n64. Zhong C, You S, Chen J, Zhai G, Du H, Luo Y, Dong X, Cao Y, Liu CF, Zhang Y. Serum alkaline phosphatase, phosphate, and In-Hospital mortality in acute ischemic stroke patients. J Stroke Cerebrovasc Dis. 2018;27:257-66.\nArticle\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/567", "#/texts/568", "#/texts/569", "#/texts/570", "#/texts/571", "#/texts/572"], "page_nos": [], "uuid": "ced5d3b8-5c63-4a7f-aa4e-90d2d18af578"}
{"doc_id": "2025__Exploring_the_impact_of_coffee_consumption_and_caffeine_intake_on_cognitive_perf__W4411868829", "source_path": "<redacted:source_path>", "chunk_id": 48, "source_chunk_idxs": [65], "num_tokens": 367, "text": "Exploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nReferences\n65. Liu Y, Liang X, Xu X, Dong M, Jia S, Lu C, Wei Y. Increased serum alkaline phosphatase in patients with acute ischemic stroke. J Stroke Cerebrovasc Dis. 2019;28:21-5.\nArticle\nPubMed\nGoogle Scholar\n66. Fonta C, Barone P, Rodriguez Martinez L, Négyessy L. Rediscovering TNAP in the brain: A major role in regulating the function and development of the cerebral cortex. Subcell Biochem. 2015;76:85-106.\nArticle\nCAS\nPubMed\nGoogle Scholar\n67. Coburn SP. Vitamin B-6 metabolism and interactions with TNAP. Subcell Biochem. 2015;76:207-38.\nArticle\nCAS\nPubMed\nGoogle Scholar\n68. Song W, Shao Y, He X, Gong P, Yang Y, Huang S, Zeng Y, Wei L, Zhang J. IGFLR1 as a novel prognostic biomarker in clear cell renal cell Cancer correlating with immune infiltrates. Front Mol Biosci. 2020;7:565173.\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n69. Imam I, Rautureau GJP, Violot S, Drevet Mulard E, Magne D, Ballut L. Structural and functional integration of Tissue-Nonspecific alkaline phosphatase within the alkaline phosphatase superfamily: evolutionary insights and functional implications. Metabolites. 2024;14(12):659.\nDownload references", "doc_items_refs": ["#/texts/573", "#/texts/574", "#/texts/575", "#/texts/576", "#/texts/577", "#/texts/578"], "page_nos": [], "uuid": "c4a8a20b-4659-407e-9722-25b845d01e15"}
{"doc_id": "2025__Exploring_the_impact_of_coffee_consumption_and_caffeine_intake_on_cognitive_perf__W4411868829", "source_path": "<redacted:source_path>", "chunk_id": 49, "source_chunk_idxs": [66, 67, 68], "num_tokens": 408, "text": "Exploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nAcknowledgements\nThank for all the patients in this research, thank for all the scholars in this article. Thank for all the teammates for supporting this research. This work was financially supported by Research project of the Science and Technology Development Project of Jilin Province, China(20200201315JC).We are also particularly grateful to our colleagues in The First Affiliated Hospital of Jilin University for their contributions.\n\nExploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nFunding\nThis study received support from the Inner Mongolia Natural Science Foundation Project (2023LHMS08057), Inner Mongolia Health and Family Planning Commission Research Project (201303069,202201220), Inner Mongolia Higher Education Science and Technology Research Project (NJZY22629), Inner Mongolia Medical University Scientific Research Project (YKD2024LH012), Inner Mongolia Medical University Ying Cai Support Program (YCPY 2025049), Inner Mongolia Medical University Maker Incubation Program (101322025026), the Natural Science Foundation Project of Jilin Province (YDZJ202301ZYTS100), the Science Foundation of Jilin Province (20210101272JC), Jilin Province Tianhua Health Foundation (J2023JKJ017) and the Bethune Urological Oncology Special Grant from the Beijing Bethune Charity Foundation (mnzl202022). We are grateful for the funding provided by these organizations, which enabled us to carry out this research.\n\nExploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nAuthor information\nAuthor notes\n1. Jinrui Li and Kai Yu contributed equally to this article.", "doc_items_refs": ["#/texts/580", "#/texts/582", "#/texts/584", "#/texts/585"], "page_nos": [], "uuid": "9fe05384-0ad1-42ab-a189-ffb1c75b58ec"}
{"doc_id": "2025__Exploring_the_impact_of_coffee_consumption_and_caffeine_intake_on_cognitive_perf__W4411868829", "source_path": "<redacted:source_path>", "chunk_id": 50, "source_chunk_idxs": [69], "num_tokens": 350, "text": "Exploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nAuthor information\nAuthors and Affiliations\n1. Department of Pathophysiology, Inner Mongolia Medical University, No. 1 North Passage Road, Hohhot City, Corresponding, Inner Mongolia Autonomous Region, 010107, China Jinrui Li, Kai Yu &amp; Lei Hao\n2. Department of Pediatrics, Affiliated Hospital of Inner Mongolia Medical University, No. 1 North Passage Road, Hohhot City, Inner Mongolia Autonomous Region, 010107, China Jinrui Li, Kai Yu &amp; Peng Li\n3. Department of Plastic and Aesthetic Surgery, The First Hospital of Jilin University, Changchun, Jilin, 130061, China Kai Yu &amp; Fan Bu\n4. Department of Urology, The First Hospital of Jilin University, No. 1 Xinmin Street, Changchun City, Jilin Province, 130061, China Kai Yu\n5. Center of Infectious Diseases and Pathogen Biology, The First Hospital of Jilin University, Changchun, 130021, China Kai Yu\n6. Institute of Virology and AIDS Research, The First Hospital of Jilin University, Changchun, 130021, China Kai Yu\nAuthors\n1. Jinrui Li\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n2. Kai Yu\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n3. Fan Bu\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n4. Peng Li\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n5. Lei Hao\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/587", "#/texts/588", "#/texts/589", "#/texts/590", "#/texts/591", "#/texts/592", "#/texts/593", "#/texts/594", "#/texts/595", "#/texts/596", "#/texts/597", "#/texts/598"], "page_nos": [], "uuid": "897d7054-77a8-46d0-bca5-3607cf158ca7"}
{"doc_id": "2025__Exploring_the_impact_of_coffee_consumption_and_caffeine_intake_on_cognitive_perf__W4411868829", "source_path": "<redacted:source_path>", "chunk_id": 51, "source_chunk_idxs": [70, 71, 72], "num_tokens": 306, "text": "Exploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nAuthor information\nContributions\nL: Study design, literature search and manuscript writing. Y: Study selection and data analysis. B: Data collection. H and L: Article Guidance. All authors revised the manuscript and approved the final manuscript as submitted and agree to be accountable for all aspects of the work.\n\nExploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nAuthor information\nCorresponding authors\nCorrespondence to\nPeng Li\nor\nLei Hao\n.\n\nExploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nEthics declarations\nHuman ethics and consent to participate\nThe data we used comes from GWAS, for which participant informed consent was obtained, and the data was de-identified before publication. We adhere to the usage guidelines provided by the data providers. For the NHANES portion, we used publicly available data from the National Health and Nutrition Examination Survey, which was collected with participant informed consent and has been de-identified. We follow the analysis guidelines provided by the CDC. All analyses were conducted on de-identified data, and no personally identifiable information was accessed or used in a way that could lead to participant re-identification. This study complies with the Declaration of Helsinki and other relevant ethical guidelines for research involving human subjects.", "doc_items_refs": ["#/texts/600", "#/texts/602", "#/texts/603", "#/texts/604", "#/texts/605", "#/texts/606", "#/texts/609"], "page_nos": [], "uuid": "a046da67-ef3a-430e-a728-86bd9e1c189f"}
{"doc_id": "2025__Exploring_the_impact_of_coffee_consumption_and_caffeine_intake_on_cognitive_perf__W4411868829", "source_path": "<redacted:source_path>", "chunk_id": 52, "source_chunk_idxs": [73, 74, 75, 76, 77, 78], "num_tokens": 332, "text": "Exploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nEthics declarations\nConsent for publication\nNot applicable.\n\nExploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nEthics declarations\nCompeting interests\nThe authors declare no competing interests.\n\nExploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nAdditional information\nPublisher's note\nSpringer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations.\n\nExploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nElectronic supplementary material\nBelow is the link to the electronic supplementary material.\n\nExploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nElectronic supplementary material\n12937_2025_1173_MOESM4_ESM.xlsx\nSupplementary Material 4: Table 14 Results of Mendelian Randomization analysis related to coffee intake and cognitive test.\n\nExploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nElectronic supplementary material\n12937_2025_1173_MOESM6_ESM.xlsx\nSupplementary Material 6: Table 16 Results of Mendelian Randomization analysis related to coffee intake and alkaline phosphatase levels.", "doc_items_refs": ["#/texts/611", "#/texts/613", "#/texts/616", "#/texts/618", "#/texts/623", "#/texts/626"], "page_nos": [], "uuid": "a019b87b-dd7d-425a-8567-de134626c1f6"}
{"doc_id": "2025__Exploring_the_impact_of_coffee_consumption_and_caffeine_intake_on_cognitive_perf__W4411868829", "source_path": "<redacted:source_path>", "chunk_id": 53, "source_chunk_idxs": [79, 80, 81, 82], "num_tokens": 315, "text": "Exploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nElectronic supplementary material\n12937_2025_1173_MOESM7_ESM.xlsx\nSupplementary Material 7: Table 17 Detailed information about screened out SNPs for coffee intake and alkaline phosphatase levels.\n\nExploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nElectronic supplementary material\n12937_2025_1173_MOESM8_ESM.xlsx\nSupplementary Material 8: Table 18 Results of Mendelian Randomization analysis related to phosphatase levels and cognitive test.\n\nExploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nElectronic supplementary material\n12937_2025_1173_MOESM9_ESM.xlsx\nSupplementary Material 9: Table 19 Detailed information about screened out SNPs for phosphatase levels and cognitive test.\n\nExploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nElectronic supplementary material\n12937_2025_1173_MOESM10_ESM.xlsx\nSupplementary Material 10: Table 20 Mendelian Randomization mediation analysis results for coffee intake, cognitive testing, and alkaline phosphatase levels.", "doc_items_refs": ["#/texts/628", "#/texts/630", "#/texts/632", "#/texts/634"], "page_nos": [], "uuid": "1c932348-b904-42ae-aeb9-edc76900f7d1"}
{"doc_id": "2025__Exploring_the_impact_of_coffee_consumption_and_caffeine_intake_on_cognitive_perf__W4411868829", "source_path": "<redacted:source_path>", "chunk_id": 54, "source_chunk_idxs": [83, 84], "num_tokens": 329, "text": "Exploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nElectronic supplementary material\n12937_2025_1173_MOESM13_ESM.xlsx\nSupplementary Material 13: Table 23 Detailed information about screened out SNPs for alkaline phosphatase and drug protein targets.\n\nExploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nRights and permissions\nOpen Access\nThis article is licensed under a Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International License, which permits any non-commercial use, sharing, distribution and reproduction in any medium or format, as long as you give appropriate credit to the original author(s) and the source, provide a link to the Creative Commons licence, and indicate if you modified the licensed material. You do not have permission under this licence to share adapted material derived from this article or parts of it. The images or other third party material in this article are included in the article's Creative Commons licence, unless indicated otherwise in a credit line to the material. If material is not included in the article's Creative Commons licence and your intended use is not permitted by statutory regulation or exceeds the permitted use, you will need to obtain permission directly from the copyright holder. To view a copy of this licence, visit\nhttp://creativecommons.org/licenses/by-nc-nd/4.0/\n.\nReprints and permissions", "doc_items_refs": ["#/texts/638", "#/texts/641", "#/texts/642", "#/texts/643", "#/texts/644", "#/texts/645"], "page_nos": [], "uuid": "5684c773-26e4-4b15-9f96-175b4ab638da"}
{"doc_id": "2025__Exploring_the_impact_of_coffee_consumption_and_caffeine_intake_on_cognitive_perf__W4411868829", "source_path": "<redacted:source_path>", "chunk_id": 55, "source_chunk_idxs": [85, 86, 87, 88], "num_tokens": 335, "text": "Exploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nAbout this article\nCite this article\nLi, J., Yu, K., Bu, F.\net al.\nExploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis.\nNutr J\n24\n, 102 (2025). https://doi.org/10.1186/s12937-025-01173-x\nDownload citation\n- Received : 09 March 2025\n- Accepted : 23 June 2025\n- Published : 01 July 2025\n- DOI : https://doi.org/10.1186/s12937-025-01173-x\n\nExploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nAbout this article\nKeywords\n- Coffee consumption\n- Caffeine intake\n- Cognitive performance\n- ALP\n- Mendelian randomization\n- NHANES\nDownload PDF\nDownload ePub\nAdvertisement\n\nExploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nAbout this article\nKeywords\nNutrition Journal\nISSN: 1475-2891\n\nExploring the impact of coffee consumption and caffeine intake on cognitive performance in older adults: a comprehensive analysis using NHANES data and gene correlation analysis\nAbout this article\nKeywords\nContact us\n- General enquiries:\njournalsubmissions@springernature.com", "doc_items_refs": ["#/texts/648", "#/texts/649", "#/texts/650", "#/texts/651", "#/texts/652", "#/texts/653", "#/texts/654", "#/texts/655", "#/texts/656", "#/texts/657", "#/texts/658", "#/texts/660", "#/texts/661", "#/texts/662", "#/texts/663", "#/texts/664", "#/texts/665", "#/texts/666", "#/texts/667", "#/texts/668", "#/texts/670", "#/texts/672"], "page_nos": [], "uuid": "4bec90df-0621-4512-a855-c28d092d4278"}
