{"doc_id": "2025__Research_collaboration_with_care_home_residents_a_systematic_review_of_public_in__W4410395807", "source_path": "<redacted:source_path>", "chunk_id": 0, "source_chunk_idxs": [0, 1], "num_tokens": 373, "text": "Research collaboration with care home residents: a systematic review of public involvement approaches | Research Involvement and Engagement | Full Text\nSkip to main content\nAdvertisement\nSearch\n- Explore journals\n- Get published\n- About BMC\n- My account\nSearch all BMC articles\nSearch\nResearch Involvement and Engagement\n- Home\n- About\n- Articles\n- Submission Guidelines\n- Submit manuscript\nResearch collaboration with care home residents: a systematic review of public involvement approaches\nDownload PDF\nDownload ePub\nDownload PDF\nDownload ePub\n- Review\n- Open access\n- Published: 15 May 2025\n\nResearch collaboration with care home residents: a systematic review of public involvement approaches\n- Megan Davies\nORCID: orcid.org/0000-0003-1795-177X\n1\n,\n- Lisa Irvine\nORCID: orcid.org/0000-0003-1936-3584\n2\n,\n- Tamara Backhouse\nORCID: orcid.org/0000-0001-8194-4174\n1\n,\n- Poppy Carr\nORCID: orcid.org/0009-0003-4242-0660\n1\n,\n- Elspeth Mathie\nORCID: orcid.org/0000-0002-5871-436X\n2\n,\n- Michelle Drury-Mulholland\nORCID: orcid.org/0009-0003-1809-966X\n3\n,\n- Gizdem Akdur\nORCID: orcid.org/0000-0001-7326-4750\n2\n&amp;\n- ...\n- Anne Killett\nORCID: orcid.org/0000-0003-4080-8365\n1\nShow authors\nResearch Involvement and Engagement\nvolume 11\n, Article number: 49 ( 2025 )\nCite this article\n- 798 Accesses\n- 1 Altmetric\n- Metrics details", "doc_items_refs": ["#/texts/1", "#/texts/2", "#/texts/3", "#/texts/4", "#/texts/5", "#/texts/6", "#/texts/7", "#/texts/8", "#/texts/9", "#/texts/10", "#/texts/11", "#/texts/12", "#/texts/13", "#/texts/14", "#/texts/15", "#/texts/16", "#/texts/17", "#/texts/18", "#/texts/19", "#/texts/20", "#/texts/21", "#/texts/22", "#/texts/23", "#/texts/25", "#/texts/26", "#/texts/27", "#/texts/28", "#/texts/29", "#/texts/30", "#/texts/31", "#/texts/32", "#/texts/33", "#/texts/34", "#/texts/35", "#/texts/36", "#/texts/37", "#/texts/38", "#/texts/39", "#/texts/40", "#/texts/41"], "page_nos": [], "uuid": "952e3f48-0905-412f-ae35-29ba3e59d3a5"}
{"doc_id": "2025__Research_collaboration_with_care_home_residents_a_systematic_review_of_public_in__W4410395807", "source_path": "<redacted:source_path>", "chunk_id": 1, "source_chunk_idxs": [2, 3, 4, 5], "num_tokens": 391, "text": "Research collaboration with care home residents: a systematic review of public involvement approaches\nAbstract\nBackground\nPublic involvement is crucial to ensure research is relevant and addresses the needs of its target population. However, care home residents, a potentially vulnerable group, are often excluded from research that could directly benefit them. This systematic review examined the existing literature on public involvement approaches in research involving older adults residing in long-term care homes.\n\nResearch collaboration with care home residents: a systematic review of public involvement approaches\nAbstract\nMethods\nA systematic search of CINAHL, MEDLINE and PsychINFO was conducted, using search terms related to public involvement and long-term care. The search was limited to English language papers published from 2014, building on a 2016 review conducted by Backhouse et al. Articles were screened by title and abstract, and full texts of potentially eligible papers were reviewed for inclusion. Data from included studies was extracted and synthesised using a narrative approach.\n\nResearch collaboration with care home residents: a systematic review of public involvement approaches\nAbstract\nResults\nThis review identified 15,809 citations, abstract-screened 4000, and ultimately included six articles after applying eligibility criteria and a rigorous screening process. Reported public involvement in this setting was limited, with even fewer studies demonstrating genuine collaboration and the full involvement of residents throughout the research process. There was a lack of representation of residents with advanced cognitive decline or dementia. Terminology used to describe public involvement varied considerably across studies, highlighting a lack of clarity in defining and reporting activities.\n\nResearch collaboration with care home residents: a systematic review of public involvement approaches\nAbstract\nConclusions\nThis review highlights the need for greater emphasis on public involvement in care home research, particularly for residents with cognitive impairments. Future research should prioritise transparent reporting of public involvement processes, involving residents as active partners from the outset, and ensuring research findings are effectively communicated for all stakeholders, including residents. Barriers and facilitators to public involvement activities in care homes are summarised.\nPeer Review reports", "doc_items_refs": ["#/texts/44", "#/texts/46", "#/texts/48", "#/texts/50", "#/texts/51"], "page_nos": [], "uuid": "b1b4e783-284a-4a01-ba72-100788dd5910"}
{"doc_id": "2025__Research_collaboration_with_care_home_residents_a_systematic_review_of_public_in__W4410395807", "source_path": "<redacted:source_path>", "chunk_id": 2, "source_chunk_idxs": [6], "num_tokens": 341, "text": "Research collaboration with care home residents: a systematic review of public involvement approaches\nBackground\nSuccessful research in long-term care, such as nursing or care homes, can enable value-based decisions and inform improvements to policy and care practices [\n1\n]. This can include the understanding of information gained from speaking to residents, staff, family members and the wider community. Recent research has shown the importance of including a range of long-term care residents, including those living with cognitive decline or dementia, which account for up to 80% of residents in long-term care [\n2\n], in research practices [\n3\n]. Long-term care is a 'unique and complex environment' and it is important that the experiences of people living within the environment are considered in research [\n4\n]. Despite this, long-term care residents, particularly those living with a level of cognitive decline remain an under-represented population in long-term care research [\n5\n,\n6\n]. Using more adaptable methods can facilitate research with residents in long-term care [\n7\n]. This includes the overall methodology, for example using ethnographic techniques, which allows for informal conversations during naturally occurring events and immersion within an environment during periods of data collection [\n8\n]. This also includes restructuring research relationships, to include residents and other key stakeholders' input throughout the whole research process, using methods such as co-production, participatory action research (PAR), patient and public involvement (PPI) and patient and public involvement and engagement (PPIE). Involving a full range of stakeholders, and residents in long-term care research is important to enhance the quality and the relevance of the research [\n3\n,\n9\n,\n10\n].", "doc_items_refs": ["#/texts/53", "#/texts/54", "#/texts/55", "#/texts/56", "#/texts/57", "#/texts/58", "#/texts/59", "#/texts/60", "#/texts/61", "#/texts/62", "#/texts/63", "#/texts/64", "#/texts/65", "#/texts/66", "#/texts/67", "#/texts/68", "#/texts/69", "#/texts/70", "#/texts/71", "#/texts/72", "#/texts/73", "#/texts/74", "#/texts/75"], "page_nos": [], "uuid": "a8684ec5-f139-4e9d-9bae-9fae7629d991"}
{"doc_id": "2025__Research_collaboration_with_care_home_residents_a_systematic_review_of_public_in__W4410395807", "source_path": "<redacted:source_path>", "chunk_id": 3, "source_chunk_idxs": [7], "num_tokens": 512, "text": "Research collaboration with care home residents: a systematic review of public involvement approaches\nBackground\nWhile the term PPI is widely used, this paper focuses on the involvement of older adults residing in long-term care homes. Given the setting and the holistic nature of care within these environments, where residents may not always primarily identify as'patients'in a medical context, we have chosen to use the term'public involvement'to encompass the broad range of residents'perspectives and experiences. This aligns with the understanding that long-term care is a 'unique and complex environment' where the experiences of all people living within it are important to consider in research. A spectrum of public involvement exists in research, with some highlighting co-production as an 'ideal' practice to be included [\n11\n]. Co-producing research means involvement is incorporated throughout the entirety of the project, including consultation, protocol development and review, input to manuscripts, feedback on research questions, participant materials, editing survey questions, consent forms, information sheets and summaries for readability and providing assistance with recruitment, public engagement and dissemination [\n11\n]. Co-production, along with some other research practices on the public involvement spectrum, involves close collaboration, sharing of power and knowledge and levels of respect and reciprocity between researchers, practitioners and the public, which can lead to lasting relationships [\n12\n]. Also noted as part of the public involvement research spectrum is PAR, which focuses on bringing together a group of people to help improve or solve a known problem with shared relevance. Here, a partnership is created to generate, test, and provide feedback on the solution [\n13\n].\nSeveral existing reviews highlight effective implementation of public involvement. Backhouse et al. [\n3\n] reviewed the feasibility of public involvement with older adults living in long-term care homes and concluded that older residents can be successfully involved in the research process, but there were few examples of care home research where this was achieved. Typically, the studies that achieved more collaborative public involvement practices were smaller scale studies with public involvement practices in larger scale studies confined to advisory roles. Baldwin et al. [\n14\n] reviewed research involving older adults in public involvement in health and social care research. Their study concluded a need for future consideration of older adult's skills and motivation when matching individuals to a project as well as the individual's level of involvement and embedding evaluation into an iterative research process. Both reviews successfully incorporated their own public involvement through reviewing the themes with public involvement team members [\n3\n] and advisory group participants [\n14\n].", "doc_items_refs": ["#/texts/76", "#/texts/77", "#/texts/78", "#/texts/79", "#/texts/80", "#/texts/81", "#/texts/82", "#/texts/83", "#/texts/84", "#/texts/85", "#/texts/86", "#/texts/87", "#/texts/88", "#/texts/89", "#/texts/90", "#/texts/91", "#/texts/92", "#/texts/93"], "page_nos": [], "uuid": "f026e082-3f39-48dc-8a72-fac44107001c"}
{"doc_id": "2025__Research_collaboration_with_care_home_residents_a_systematic_review_of_public_in__W4410395807", "source_path": "<redacted:source_path>", "chunk_id": 4, "source_chunk_idxs": [8], "num_tokens": 510, "text": "Research collaboration with care home residents: a systematic review of public involvement approaches\nBackground\nPrice et al. [\n15\n] acknowledged limitations stemming from the lack of standardised public involvement reporting guidance and structure, which could have caused missed public involvement reporting in literature. In general, continued under-reporting of public involvement, has been found by Gray et al. [\n16\n] as an ongoing issue. None of the included randomised control trials within their research reported on public involvement activities, meaning they were unable to identify differences recorded in public involvement reporting [\n16\n]. More recent research by Lang et al. [\n17\n] suggested future research could focus on the \"quality of [public involvement] reporting, perhaps based on established criteria\" [\n17\n]. In 2023, a review by Burgher et al. found that implementing a person-centred approach to public involvement could improve stakeholder involvement at different levels. Communication barriers across staff and resident groups in public involvement sessions, for example during the set-up of activities, can make public involvement challenging. In addition, they noted that a gap in including residents with higher needs in terms of functional or cognitive decline was still evident. The additional needs and often time pressured studies presented challenges in bridging this gap in research, which still needs to be addressed [\n9\n]. It should be noted that while resident voices have been included within previous reviews, they were involved to varying degrees within the included papers, with many articles still including no resident voices. The evidence-based public involvement guidelines for future long-term care home research were therefore not specifically tailored to encourage resident involvement [\n9\n]. Overall, it is evident that research papers often report on the process of public involvement more heavily than the impact of the public involvement, which not only hinders learning about the benefits, but risks acceptance of tokenistic public involvement practices [\n18\n]. Furthermore, despite a noticeable increase in the number of public involvement papers being published in recent years, challenges in public involvement still persist [\n19\n].\nPrevious research, including Backhouse et al. [\n3\n] and Burgher et al. [\n9\n], has contributed to the understanding of public involvement in long-term care. This systematic review provides a necessary update to account for more recent literature and has a specific focus on the collaborative involvement and experiences of care home residents themselves. This review aimed to understand approaches, successes, barriers and facilitators of public involvement activities for older adults residing in long-term care homes, in research published between 2014 and 2023, including:", "doc_items_refs": ["#/texts/94", "#/texts/95", "#/texts/96", "#/texts/97", "#/texts/98", "#/texts/99", "#/texts/100", "#/texts/101", "#/texts/102", "#/texts/103", "#/texts/104", "#/texts/105", "#/texts/106", "#/texts/107", "#/texts/108", "#/texts/109", "#/texts/110", "#/texts/111", "#/texts/112", "#/texts/113", "#/texts/114", "#/texts/115", "#/texts/116", "#/texts/117"], "page_nos": [], "uuid": "b386a986-ee91-4bc2-9f7b-e34fde549c5b"}
{"doc_id": "2025__Research_collaboration_with_care_home_residents_a_systematic_review_of_public_in__W4410395807", "source_path": "<redacted:source_path>", "chunk_id": 5, "source_chunk_idxs": [9, 10, 11, 12], "num_tokens": 483, "text": "Research collaboration with care home residents: a systematic review of public involvement approaches\nBackground\n- The latest key research messages from successful collaborative research involving older adults living in long-term care homes,\n- Successes in public involvement with older adults in care home settings,\n- The skills, resources, and planning needed and who the key stakeholders are\n- Potential barriers and facilitators to public involvement activities that include older adults living in long-term care homes.\n\nResearch collaboration with care home residents: a systematic review of public involvement approaches\nMain text\nMethods\nA systematic review was conducted following guidance from the PRISMA 2020 checklist [\n20\n]. This includes developing informed research questions, extracting selective and relevant data from documents and synthesising data in the final review using appropriate techniques.\n\nResearch collaboration with care home residents: a systematic review of public involvement approaches\nMain text\nMethods\nEligibility criteria\nStudies were included if they were primary studies. All studies had to include older adults (&gt; 65) residing in long-term care homes (including care homes, nursing homes or any residential facility providing 24-h services or care to older adults). The older adults had to have been included in public involvement or a public involvement variant activity. Only English language papers were included.\n\nResearch collaboration with care home residents: a systematic review of public involvement approaches\nMain text\nMethods\nInformation sources and search strategy\nOnline databases CINAHL (EBSCO), MEDLINE (Pubmed) and PsychINFO (OVID) were systematically searched using two facets including variants of 1) Public Involvement in Research and 2) Long-Term Care. Boolean operators AND and OR were used to combine search terms. For full list of Information Sources see Appendix 1. Phrase searches, proximity operators and truncation were also used. All terms were searched for by title and abstract. Limits were set to 2014, which was the year in which searches from the paper being updated [\n3\n] were completed. Controlled vocabulary terms were used when provided by the database. In addition, searches of NHS/NICE evidence, the Cochrane Library and Google Scholar were conducted. Snowballing (searches of references within papers that have cited Backhouse et al., [\n3\n] and Burgher et al., [\n9\n] was used to identify further potential papers for inclusion. Papers found through snowballing were cross-referenced with papers included from the initial database search to remove duplicates.", "doc_items_refs": ["#/texts/118", "#/texts/119", "#/texts/120", "#/texts/121", "#/texts/124", "#/texts/125", "#/texts/126", "#/texts/128", "#/texts/130", "#/texts/131", "#/texts/132", "#/texts/133", "#/texts/134", "#/texts/135", "#/texts/136"], "page_nos": [], "uuid": "b0ef3bff-f840-4620-97ee-ab50aa90819d"}
{"doc_id": "2025__Research_collaboration_with_care_home_residents_a_systematic_review_of_public_in__W4410395807", "source_path": "<redacted:source_path>", "chunk_id": 6, "source_chunk_idxs": [13, 14], "num_tokens": 306, "text": "Research collaboration with care home residents: a systematic review of public involvement approaches\nMain text\nMethods\nSelection process\nAll citations were exported to EndNote X9. One reviewer (MD) removed all duplicates in the first instance. Papers for inclusion were then dual screened by title and abstract and following this screened by full text. This was undertaken independently by two reviewers (MD and LI), and any discrepancies were resolved through discussion.\n\nResearch collaboration with care home residents: a systematic review of public involvement approaches\nMain text\nMethods\nData collection process\nData was extracted by two reviewers. Data to be extracted was discussed and decided with input from the lead author on the review paper being built upon (TB) to ensure this paper would bridge any gaps in knowledge. Any uncertainties and discrepancies were discussed. Extracted data from included papers was input into a Microsoft Excel spreadsheet to record details. As this is a systematic review, we used PRISMA to guide our reporting. The lack of GRIPP2 (international guidance for reporting of patient and public involvement in health and social care research) in the primary studies means there is potentially less transparent justification of the public involvement processes within those individual studies. While GRIPP2 could have provided a more standardised framework for\nwhat\nto report in primary studies about public involvement, this review had to work with the information that was actually reported. The variability in terminology and the lack of detailed reporting in the included studies made a comprehensive extraction based on GRIPP2 principles challenging, as that information was often missing.", "doc_items_refs": ["#/texts/138", "#/texts/140", "#/texts/141", "#/texts/142"], "page_nos": [], "uuid": "41bfdf40-a7ba-4249-b2db-9e49d31519a1"}
{"doc_id": "2025__Research_collaboration_with_care_home_residents_a_systematic_review_of_public_in__W4410395807", "source_path": "<redacted:source_path>", "chunk_id": 7, "source_chunk_idxs": [15, 16, 17], "num_tokens": 299, "text": "Research collaboration with care home residents: a systematic review of public involvement approaches\nMain text\nMethods\nData items\nData items for extraction were author name, publication year, methodology, title, country, public involvement definition and resident involvement in public involvement, stages of research, how the process was closed/ended, barriers, facilitators, remuneration and reasons for resident exclusion from studies.\n\nResearch collaboration with care home residents: a systematic review of public involvement approaches\nMain text\nMethods\nSynthesis methods\nAll study characteristics, including stages of research and methods for public involvement were tabulated using Microsoft Excel. From this, the two reviewers were able to determine the eligibility for inclusion for each study. Full study characteristics of included papers can be found in Table\n1\n. A narrative synthesis output was selected as a means of further explaining and presenting critical but trustworthy information (Popay et al., 2006).\n\nResearch collaboration with care home residents: a systematic review of public involvement approaches\nMain text\nMethods\nStudy risk of bias assessment\nThe aim of the systematic review was to explore the landscape of public involvement approaches in long-term care research, identify successful practices, barriers, and facilitators, and update a previous review. This is inherently a process-focused endeavour. We are interested in understanding how public involvement was being conducted and reported, not in evaluating the effectiveness of research interventions in care homes. Therefore, applying tools designed to assess bias in effect estimates would not be an appropriate methodological choice for the review question [\n27\n].", "doc_items_refs": ["#/texts/144", "#/texts/146", "#/texts/147", "#/texts/148", "#/texts/150", "#/texts/151", "#/texts/152"], "page_nos": [], "uuid": "2b1ae9be-f299-49b2-833f-76ec2144b022"}
{"doc_id": "2025__Research_collaboration_with_care_home_residents_a_systematic_review_of_public_in__W4410395807", "source_path": "<redacted:source_path>", "chunk_id": 8, "source_chunk_idxs": [18], "num_tokens": 296, "text": "Research collaboration with care home residents: a systematic review of public involvement approaches\nResults\nStudy selection\nThe search initially identified 15,809 citations (see Fig.\n1\nPRISMA Flow Diagram). Following the initial search, it was clear that there was a lack of sensitivity in the original search strategy. For example, 'PPI' as a term picked up 'Protein Pump Inhibitors' and conference proceedings and children's/learning disability care homes were also retrieved in the search. Therefore, further filters were applied to ensure only relevant papers remained, which left 4000 papers to be screened by title and abstract after duplicates were also removed. After title and abstract screening took place, 44 papers were screened by full text for inclusion, of which 15 were initially selected for inclusion. All 15 had at least 2 of the following: older adults, public involvement, or took place in a care home however, after reviewer discussion, only six articles were found to meet the full inclusion criteria (see Fig.\n2\n).\nFig. 1\nFig. 2\nStudy designs comprised a combination of qualitative, quantitative and mixed methods research. For the most part, included papers benefitted from some level of qualitative information, which included data collection methods as well as critical reflections. Most of the studies were conducted in the Netherlands (three studies), with one taking place across Scotland and Spain, one in Canada and one in Australia. All studies stated a focus on including care home residents in public involvement activities.", "doc_items_refs": ["#/texts/155", "#/texts/156", "#/texts/157", "#/texts/158", "#/texts/159", "#/texts/160", "#/texts/161", "#/texts/162"], "page_nos": [], "uuid": "a15cded6-5310-4d18-8109-2158113728b1"}
{"doc_id": "2025__Research_collaboration_with_care_home_residents_a_systematic_review_of_public_in__W4410395807", "source_path": "<redacted:source_path>", "chunk_id": 9, "source_chunk_idxs": [19, 20, 21], "num_tokens": 394, "text": "Research collaboration with care home residents: a systematic review of public involvement approaches\nSynthesis of results\nPublic involvement activities as defined by authors\nThe included papers span the spectrum of public involvement techniques, using different terminology and descriptions to achieve a similar goal (see Table\n2\n). Multiple terms were described throughout the papers, including Participatory Research, Co-creation, Stakeholder Engagement and Collaboration. The broad range of terminology included demonstrates the complexity and potential for vague descriptions within public involvement techniques.\n\nResearch collaboration with care home residents: a systematic review of public involvement approaches\nSynthesis of results\nPeople involved in public involvement activities\nAll papers presented results addressing resident voices within the respective studies. However, only three papers within this review put the resident voices at the forefront of the results [\n22\n,\n25\n,\n26\n]. Furthermore, these papers still included a combination of older adults' voices with other stakeholders in the results. Within the papers engaging multiple stakeholders within long-term care home communities, the number of residents included were notably lower than other groups. In general, all included studies seemed to be inclusive of all long-term care residents, although they remained low in participant number across the papers. It was common in all papers for researchers to state no reason for not including residents in public involvement activities. Although, Giné-Garriga et al. [\n22\n] specifically noted that while no residents were excluded due to health reasons, residents were recruited based on their assumed ability to hold discussions with the student researchers involved in the study.\n\nResearch collaboration with care home residents: a systematic review of public involvement approaches\nSynthesis of results\nRecruitment processes\nNot all studies were clear on the recruitment process. In some cases, the care organisation or individual care home had partnered with a university or was already part of an ongoing collaborative project, where the whole care home had been recruited [\n22\n,\n23\n]. This meant that the justification for and actions towards the recruitment process only outlined that of the care home rather than recruitment of individual residents.", "doc_items_refs": ["#/texts/165", "#/texts/166", "#/texts/167", "#/texts/169", "#/texts/170", "#/texts/171", "#/texts/172", "#/texts/173", "#/texts/174", "#/texts/175", "#/texts/176", "#/texts/177", "#/texts/179", "#/texts/180", "#/texts/181", "#/texts/182", "#/texts/183"], "page_nos": [], "uuid": "868bb6ba-d2da-4fe3-b935-6b6f865b2b57"}
{"doc_id": "2025__Research_collaboration_with_care_home_residents_a_systematic_review_of_public_in__W4410395807", "source_path": "<redacted:source_path>", "chunk_id": 10, "source_chunk_idxs": [22], "num_tokens": 352, "text": "Research collaboration with care home residents: a systematic review of public involvement approaches\nSynthesis of results\nStages of resident involvement and means of engagement\nResident involvement within each of the research stages varied across the included papers. For the most part, residents were reported to have been involved in the early stages of the research process, which was reflected in successful research designs [\n21\n,\n22\n,\n23\n]. This included development of care models and designing the research topic. Involvement for these papers continued throughout the research, with residents participating in interactive activities such as workshops, interviews, surveys and focus groups. One study [\n26\n], which specifically referred to using PAR did not include older adults in the design or set up of their study, instead including them only in the PAR groups. This was also seen from de Boer et al. [\n21\n], who did not include older adults in the 'core development' stage, instead including older adults in working groups for feedback. All studies failed to report dissemination of information to older adults participating or whether any debrief session took place at the end of the studies. It was reported that this tended to leave older adults feeling dissatisfied rather than having a positive experience of information shared.\nOlder adults were engaged in public involvement activities in a variety of ways. Some studies mentioned workshops/focus groups/stakeholder meetings or semi-structured interviews with no elaboration on what this looked like. Others described 'creative work forms' used, such as board games, interactive meetings and role play. The more creative tools used were found to be successful in facilitating engagement and communication with a study facilitator or 'communication expert in place', but staff shortages and knowledge gaps in day-to-day use hindered their use beyond the specific research being conducted.", "doc_items_refs": ["#/texts/185", "#/texts/186", "#/texts/187", "#/texts/188", "#/texts/189", "#/texts/190", "#/texts/191", "#/texts/192", "#/texts/193", "#/texts/194", "#/texts/195", "#/texts/196"], "page_nos": [], "uuid": "2112a6d3-3c09-4601-9e68-33b0102afcd1"}
{"doc_id": "2025__Research_collaboration_with_care_home_residents_a_systematic_review_of_public_in__W4410395807", "source_path": "<redacted:source_path>", "chunk_id": 11, "source_chunk_idxs": [23, 24], "num_tokens": 397, "text": "Research collaboration with care home residents: a systematic review of public involvement approaches\nSynthesis of results\nRemuneration\nRemuneration was not discussed in any of the included papers. Although, it is not possible to confirm that researchers did not follow up with residents after the specific papers had been published as some were described as an 'ongoing collaboration' [\n21\n,\n23\n].\n\nResearch collaboration with care home residents: a systematic review of public involvement approaches\nSynthesis of results\nBarriers and facilitators to public involvement activities\nTable\n3\nshows the main barriers and facilitators to Public Involvement activities with care home residents from this review and the previous Backhouse et al. review. Recent data showed realistic outcomes of care organisations over-ruled expected or hoped for outcomes. Having an 'implementation expert' as part of one study to assess the readiness to use intended tools within an individual organisation helped to overcome this [\n23\n]. Regardless of outcomes, buy-in from care home staff and management was noted as either a barrier or facilitator depending on the levels of enthusiasm, with higher buy-in acting as facilitators and lower becoming barriers to Public Involvement activities. Including internal facilitators, varied backgrounds among the research team and stakeholder groups and the research group being known to the care home/organisation helped with both communication and buy-in. External facilitators were found in more than one paper to increase rigour and candidness among older adults joining public involvement activities. Although, researchers with less experience in involving older adults in research were noted as a barrier. Resident health issues (specifically residents living with mild to moderate dementia) and resident tiredness/loss of concentration during focus groups were noted in one paper as a barrier to obtaining information. Additionally, miscommunication and a lack of confidence in residents were also noted as barriers. In general, a lack of evaluation of implementation processes/public involvement activities made it difficult to clearly outline the barriers or facilitators.", "doc_items_refs": ["#/texts/198", "#/texts/199", "#/texts/200", "#/texts/201", "#/texts/202", "#/texts/204", "#/texts/205", "#/texts/206", "#/texts/207", "#/texts/208"], "page_nos": [], "uuid": "4fe380ca-f6e6-45cd-afe8-2ed3d454f3c9"}
{"doc_id": "2025__Research_collaboration_with_care_home_residents_a_systematic_review_of_public_in__W4410395807", "source_path": "<redacted:source_path>", "chunk_id": 12, "source_chunk_idxs": [25], "num_tokens": 180, "text": "Research collaboration with care home residents: a systematic review of public involvement approaches\nDiscussion\nSummary of findings\nThis systematic review aimed to examine the public involvement reported in studies taking place in care homes and involving older adults. It aimed to explore the latest key research practice messages from collaborative research involving older adults living in long-term care homes, the barriers and facilitators to this and the skills, resources and planning needed. Multiple terms to describe public involvement have been used across the included studies, with limited expansion on what public involvement activities actually looked like in practice. Resident voices in public involvement were acknowledged as the focus, although half of the included papers still failed to put them at the forefront or standalone of results presented. Furthermore, even where residents were reportedly involved in all stages of the research/public involvement process, dissemination practice and remuneration were omitted. The included information was synthesised to explore these aspects.", "doc_items_refs": ["#/texts/211"], "page_nos": [], "uuid": "497c453a-3ba2-49db-97cf-46d9e3050184"}
{"doc_id": "2025__Research_collaboration_with_care_home_residents_a_systematic_review_of_public_in__W4410395807", "source_path": "<redacted:source_path>", "chunk_id": 13, "source_chunk_idxs": [26], "num_tokens": 506, "text": "Research collaboration with care home residents: a systematic review of public involvement approaches\nDiscussion\nPersistent gaps in reporting and collaborative involvement\nLimited research reporting public involvement activities in research involving care homes was found, and those involving older adults were even fewer. This was also found in the review preceding this by Backhouse et al. [\n3\n], with literature searches concluded 9 years prior to those completed in this review. Coproduction and public involvement with care home residents in research activities in the health and social care sector goes beyond consulting residents and power should shift towards the end users [\n28\n,\n29\n]. Despite coproduction and public involvement activities being described in the included papers, involvement of residents from start to end of the research being conducted was seen in few. Furthermore, there was a distinct lack of residents who were living with advanced cognitive decline or dementia mentioned in the included papers, which reinforces previous research highlighting the underrepresentation of such residents in research activities [\n5\n,\n6\n]. In theory, it is possible for all health and social care research to include public involvement activities with residents, including residents living with dementia. Practically, however, accessibility, health and safety and ethical concerns surrounding potential residents to be included in public involvement activities still limits the level of inclusivity seen. Woelders and Abma [\n26\n] introduced named facilitators, who were found to improve resident involvement in research activities, particularly facilitators who were known members of the care home community, such as spiritual counsellors. This gave residents a platform that encouraged information sharing and problem solving. However, gaps between facilitators and care teams were still evident, which prevented information from residents reaching care teams. Participatory processes increasingly enable resident voices in care home research and the facilitators known to residents stand to enable coproduction and the inclusion of resident voices within the context of a care home setting [\n30\n]. Failure to share information that comes from care home residents, as well as a failure to share research results, can leave residents feeling frustrated and underappreciated. Despite this being acknowledged within the included papers, no clear follow up was mentioned.\nThere is a shortage of public involvement reported in wider health and social care research, but it appears there has been an acceptance of the need to report limitations and the shortcomings of public involvement activities [\n31\n]. Furthermore, reported public involvement activities have low participation rates, or none have been included in the final results presented [\n9\n].", "doc_items_refs": ["#/texts/213", "#/texts/214", "#/texts/215", "#/texts/216", "#/texts/217", "#/texts/218", "#/texts/219", "#/texts/220", "#/texts/221", "#/texts/222", "#/texts/223", "#/texts/224", "#/texts/225", "#/texts/226", "#/texts/227", "#/texts/228", "#/texts/229", "#/texts/230", "#/texts/231", "#/texts/232"], "page_nos": [], "uuid": "807419c3-5d92-4088-b3aa-2d9ed0fbd24e"}
{"doc_id": "2025__Research_collaboration_with_care_home_residents_a_systematic_review_of_public_in__W4410395807", "source_path": "<redacted:source_path>", "chunk_id": 14, "source_chunk_idxs": [27, 28], "num_tokens": 280, "text": "Research collaboration with care home residents: a systematic review of public involvement approaches\nDiscussion\nPersistent gaps in reporting and collaborative involvement\nIt has been found that papers largely ignore issues of power dynamics and disengagement from the public involvement or provide more tokenistic attempts to involve patients or the public. Price et al. [\n15\n] concluded that the shortage of public involvement reporting may also be due to the aversion to report unsuccessful public involvement or absence of public involvement work to report on.\n\nResearch collaboration with care home residents: a systematic review of public involvement approaches\nDiscussion\nLimitations of this review\nThis review was limited by the inclusion of only English language papers due to language restrictions within the team, which may have restricted access to research presented across a broader range of countries. With this limit set, most research presented came from the Netherlands and then from English speaking countries. There was a lack of reporting on public involvement activities, and in fact, some public involvement methodology described were actually research methods, potentially blurring roles between public involvement activities and participants (see Table\n4\n). Therefore, we may not know the full involvement of care home residents within the studies presented and also may have missed other research including resident Public Involvement due to lack of reporting. The quality of the included studies'methodologies might influence the robustness of the reported information on public involvement, even though it wasn't the primary focus of their appraisal.", "doc_items_refs": ["#/texts/233", "#/texts/234", "#/texts/235", "#/texts/237", "#/texts/238", "#/texts/239"], "page_nos": [], "uuid": "a9932fbe-f703-42ec-b8a8-df7fda794921"}
{"doc_id": "2025__Research_collaboration_with_care_home_residents_a_systematic_review_of_public_in__W4410395807", "source_path": "<redacted:source_path>", "chunk_id": 15, "source_chunk_idxs": [29], "num_tokens": 295, "text": "Research collaboration with care home residents: a systematic review of public involvement approaches\nDiscussion\nComparison with findings from Backhouse - what has changed?\nThis review has added knowledge to the previous Backhouse et al. [\n3\n] review which it has updated. New evidence shows how residents have been involved, highlighting that resident involvement can be successful when facilitated by independent or external personnel, when they have specific involvement separate from other stakeholders, and when research groups have previous connections with care organisations. However, since the previous search conducted in 2014 only six articles explicitly report involvement of care home residents as public involvement collaborators or advisors. As was highlighted in the Backhouse et al. review, quantitative research involving residents is still lacking, as are larger studies. While public involvement reporting guidelines (GRIPP2) [\n32\n] have been developed, there are still reporting limitations in the included studies, which, in fact, did not report using GRIPP2. Evidence from both reviews demonstrates that older care-home residents can be successfully involved in research processes. This knowledge coupled with increased emphasis from research funders to involve people with lived experience in research, demonstrates that there is clear scope to augment the role of resident involvement. Researchers may feel wary of involving residents due to access and capacity challenges and care-home managers as gatekeepers may feel protective about resident involvement however, findings from both reviews (Table\n3\n) outline clear facilitators for involving care home residents, which will be of practical use to researchers.", "doc_items_refs": ["#/texts/241", "#/texts/242", "#/texts/243", "#/texts/244", "#/texts/245", "#/texts/246", "#/texts/247"], "page_nos": [], "uuid": "a20dac9e-beca-4b47-a23e-e7b812f3ede8"}
{"doc_id": "2025__Research_collaboration_with_care_home_residents_a_systematic_review_of_public_in__W4410395807", "source_path": "<redacted:source_path>", "chunk_id": 16, "source_chunk_idxs": [30, 31, 32], "num_tokens": 337, "text": "Research collaboration with care home residents: a systematic review of public involvement approaches\nConclusions\nPublic involvement activities in care homes, including the terminology used for public involvement, remains broad and vague across studies, making it difficult to define and implement. A broader understanding of what public involvement within research means is needed to aid the identification of relevant papers. Regardless of how successful public involvement activities within research are reported to be, the description and amount of resident involvement is still lacking. Papers highlighting the use of public involvement activities as a strategy for research are still at risk of the tokenistic inclusion of residents, particularly those living with cognitive decline, regardless of steps taken to creatively facilitate inclusivity. Residents and care staff should be included as early as possible in research as part of a co-production design to facilitate the use of public involvement activities, improve resident confidence and increase staff buy-in. Further information on how residents are engaged and how activities are adapted to make them more inclusive for all residents, regardless of needs, is essential to successfully implement future public involvement activities. Future research should also focus on dissemination of results to residents and remuneration, which are currently under-reported.\n\nResearch collaboration with care home residents: a systematic review of public involvement approaches\nData availability\nNo datasets were generated or analysed during the current study.\n\nResearch collaboration with care home residents: a systematic review of public involvement approaches\nAbbreviations\nPPI:\nPublic and Patient Involvement\nNIHR:\nNational Institute for Health and Care Research\nPAR:\nParticipatory Action Research\nNHS:\nNational Health Service\nNICE:\nNational Institute for Health and Care Excellence\nGRIPP2:\nInternational guidance for reporting of patient and public involvement in health and social care research", "doc_items_refs": ["#/texts/249", "#/texts/251", "#/texts/253", "#/texts/254", "#/texts/255", "#/texts/256", "#/texts/257", "#/texts/258", "#/texts/259", "#/texts/260", "#/texts/261", "#/texts/262", "#/texts/263", "#/texts/264"], "page_nos": [], "uuid": "8c3e30b3-f144-4d6d-8b8b-10643dcae85b"}
{"doc_id": "2025__Research_collaboration_with_care_home_residents_a_systematic_review_of_public_in__W4410395807", "source_path": "<redacted:source_path>", "chunk_id": 17, "source_chunk_idxs": [33], "num_tokens": 509, "text": "Research collaboration with care home residents: a systematic review of public involvement approaches\nReferences\n1. Davis SF, Woodward C, Greenfield B, Homer C, Williams K, Hameed W, Riley B, Roberts D, Bryan G. Bringing lived experience into research: good practices for public involvement in research. Perspect Public Health. 2022;142(4):205-8.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n2. Irvine L, Burton J, Ali M, Booth J, Desborough J, Logan P, Moniz-Cook E, Surr C, Wright D, Goodman C. (2023). Data resource profile: the virtual international care homes trials archive (VICHTA). Int J Population Data Sci. 8(6).\n3. Backhouse T, Kenkmann A, Lane K, Penhale B, Poland F, Killett A. Older care-home residents as collaborators or advisors in research: a systematic review. Age Ageing. 2016;45(3):337-45.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n4. Luff R, Laybourne A, Ferreira Z, Meyer J. A guide to research with care homes. Qual Ageing Older Adults. 2015;16(4):186-94.\nhttps://doi.org/10.1108/QAOA-06-2015-0027\n.\nArticle\nGoogle Scholar\n5. Milte R, Ratcliffe J, Bradley C, Shulver W, Crotty M. Evaluating the quality of care received in long-term care facilities from a consumer perspective: development and construct validity of the Consumer Choice Index-Six Dimension instrument. Ageing Soc. 2019;39(1):138-60.\nArticle\nGoogle Scholar\n6. Morris JN, Declercq A, Hirdes JP, Finne-Soveri H, Fries BE, James ML, Geffen L, Kehyayan V, Saks K, Szczerbińska K. Hearing the voice of the resident in long-term care facilities-An internationally based approach to assessing quality of life. J Am Med Dir Assoc. 2018;19(3):207-15.\nArticle\nPubMed\nGoogle Scholar\n7. Davies M, Staudacher S, Zúñiga F, Verbeek H, Fowler-Davis S. (2024). Enabling resident voices within long-term residential care research: Critical Reflection on a multi-national rapid ethnographic approach.", "doc_items_refs": ["#/texts/266", "#/texts/267", "#/texts/268", "#/texts/269", "#/texts/270", "#/texts/271", "#/texts/272"], "page_nos": [], "uuid": "8df2290d-44e1-4f63-832b-bfdb0d06d4fe"}
{"doc_id": "2025__Research_collaboration_with_care_home_residents_a_systematic_review_of_public_in__W4410395807", "source_path": "<redacted:source_path>", "chunk_id": 18, "source_chunk_idxs": [34], "num_tokens": 505, "text": "Research collaboration with care home residents: a systematic review of public involvement approaches\nReferences\n8. Vindrola-Padros C, Johnson GA. Rapid techniques in qualitative research: a critical review of the literature. Qual Health Res. 2020;30(10):1596-604.\nArticle\nPubMed\nGoogle Scholar\n9. Burgher T, Shepherd V, Nollett C. Effective approaches to public involvement in care home research: a systematic review and narrative synthesis. Res Involve Engagement. 2023;9(1):38.\nArticle\nGoogle Scholar\n10. Nygaard A, Halvorsrud L, Grov EK, Bergland A. What matters to you when the nursing home is your home: a qualitative study on the views of residents with dementia living in nursing homes. BMC Geriatr. 2020;20:1-13.\nArticle\nGoogle Scholar\n11. Price A, Clarke M, Staniszewska S, Chu L, Tembo D, Kirkpatrick M, Nelken Y. Patient and public involvement in research: a journey to co-production. Patient Educ Couns. 2022;105(4):1041-7.\nArticle\nPubMed\nGoogle Scholar\n12. (NIHR), N. I. f. H. a. C. R. (2021, April 2024). Guidance on co-producing a research project. Retrieved 28th October from\n13. Mc Menamin R, Isaksen J, Manning M, Tierney E. Distinctions and blurred boundaries between qualitative approaches and public and patient involvement (PPI) in research. Int J Speech Lang Pathol. 2022;24(5):515-26.\nArticle\nPubMed\nGoogle Scholar\n14. Baldwin JN, Napier S, Neville S, Wright-St Clair VA. Impacts of older people's patient and public involvement in health and social care research: a systematic review. Age Ageing. 2018;47(6):801-9.\nArticle\nPubMed\nGoogle Scholar\n15. Price A, Schroter S, Snow R, Hicks M, Harmston R, Staniszewska S, Parker S, Richards T. Frequency of reporting on patient and public involvement (PPI) in research studies published in a general medical journal: a descriptive study. BMJ Open. 2018;8(3):e020452.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/273", "#/texts/274", "#/texts/275", "#/texts/276", "#/texts/277", "#/texts/278", "#/texts/279", "#/texts/280"], "page_nos": [], "uuid": "5fea2537-0394-4c59-b294-5e0c0df56576"}
{"doc_id": "2025__Research_collaboration_with_care_home_residents_a_systematic_review_of_public_in__W4410395807", "source_path": "<redacted:source_path>", "chunk_id": 19, "source_chunk_idxs": [35], "num_tokens": 501, "text": "Research collaboration with care home residents: a systematic review of public involvement approaches\nReferences\n16. Gray R, Brasier C, Zirnsak T-M, Ng AH. Reporting of patient and public involvement and engagement (PPIE) in clinical trials published in nursing science journals: a descriptive study. Res Involve Engage. 2021;7:1-7.\nArticle\nGoogle Scholar\n17. Lang I, King A, Jenkins G, Boddy K, Khan Z, Liabo K. How common is patient and public involvement (PPI)? Cross-sectional analysis of frequency of PPI reporting in health research papers and associations with methods, funding sources and other factors. BMJ Open. 2022;12(5):e063356.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n18. Hughes M, Duffy C. Public involvement in health and social sciences research: a concept analysis. Health Expect. 2018;21(6):1183-90.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n19. Staniszewska S, Denegri S, Matthews R, Minogue V. Reviewing progress in public involvement in NIHR research: developing and implementing a new vision for the future. BMJ Open. 2018;8(7):e017124.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n20. Page MJ, McKenzie JE, Bossuyt PM, Boutron I, Hoffmann TC, Mulrow CD, Shamseer L, Tetzlaff JM, Akl EA, Brennan SE. (2021). The PRISMA 2020 statement: an updated guideline for reporting systematic reviews. Bmj, 372.\n21. de Boer B, Bozdemir B, Jansen J, Hermans M, Hamers JP, Verbeek H. The homestead: developing a conceptual framework through co-creation for innovating long-term dementia care environments. Int J Environ Res Public Health. 2021;18(1):57.\nArticle\nGoogle Scholar\n22. Giné-Garriga M, Sandlund M, Dall PM, Chastin SF, Pérez S, Skelton DA. A novel approach to reduce sedentary behaviour in care home residents: The GET READY study utilising service-learning and co-creation. Int J Environ Res Public Health. 2019;16(3):418.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/281", "#/texts/282", "#/texts/283", "#/texts/284", "#/texts/285", "#/texts/286", "#/texts/287"], "page_nos": [], "uuid": "796d96df-d1b8-403e-b671-7b9f27727a49"}
{"doc_id": "2025__Research_collaboration_with_care_home_residents_a_systematic_review_of_public_in__W4410395807", "source_path": "<redacted:source_path>", "chunk_id": 20, "source_chunk_idxs": [36], "num_tokens": 502, "text": "Research collaboration with care home residents: a systematic review of public involvement approaches\nReferences\n23. Luijkx K, van Boekel L, Janssen M, Verbiest M, Stoop A. The academic collaborative center older adults: A description of co-creation between science, care practice and education with the aim to contribute to person-centered care for older adults. Int J Environ Res Public Health. 2020;17(23):9014.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n24. Hemphill J, MacGregor L, Austen A, Calay R, Kikuta SC, Dockery J, Sheppard CL, Hitzig SsL. (2023). The process of implementing culture change across a city-operated long-term care home and the importance of stakeholder engagement. Healthcare Management Forum,\n25. Petriwskyj A, Gibson A, Webby G. What does client 'engagement'mean in aged care? An analysis of practice. Ageing Soc. 2018;38(7):1350-76.\nArticle\nGoogle Scholar\n26. Woelders S, Abma T. Participatory action research to enhance the collective involvement of residents in elderly care: About power, dialogue and understanding. Action research. 2019;17(4):528-48.\nArticle\nGoogle Scholar\n27. Viswanathan M, Patnode CD, Berkman ND, Bass EB, Chang S, Hartling L, Murad MH, Treadwell JR, Kane RL. (2018). Assessing the risk of bias in systematic reviews of health care interventions.\n28. Bandola-Gill J, Arthur M, Leng RI. What is co-production? Conceptualising and understanding co-production of knowledge and policy across different theoretical perspectives. Evid Policy. 2023;19(2):275-98.\nArticle\nGoogle Scholar\n29. Realpe A, Wallace LM. What is co-production. London: The Health Foundation; 2010. p. 1-1.\nGoogle Scholar\n30. Willis P, Almack K, Hafford-Letchfield T, Simpson P, Billings B, Mall N. Turning the co-production corner: methodological reflections from an action research project to promote LGBT inclusion in care homes for older people. Int J Environ Res Public Health. 2018;15(4):695.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/288", "#/texts/289", "#/texts/290", "#/texts/291", "#/texts/292", "#/texts/293", "#/texts/294", "#/texts/295"], "page_nos": [], "uuid": "0f0f7661-e136-46f7-b496-e7f68f6f200a"}
{"doc_id": "2025__Research_collaboration_with_care_home_residents_a_systematic_review_of_public_in__W4410395807", "source_path": "<redacted:source_path>", "chunk_id": 21, "source_chunk_idxs": [37, 38, 39], "num_tokens": 399, "text": "Research collaboration with care home residents: a systematic review of public involvement approaches\nReferences\n31. Froggatt K, Goodman C, Morbey H, Davies SL, Masey H, Dickinson A, Martin W, Victor C. Public involvement in research within care homes: benefits and challenges in the APPROACH study. Health Expect. 2016;19(6):1336-45.\nArticle\nPubMed\nGoogle Scholar\n32. Staniszewska S, Brett J, Simera I, Seers K, Mockford C, Goodlad S, Altman D, Moher, D, Barber R, Denegri S. (2017). GRIPP2 reporting checklists: tools to improve reporting of patient and public involvement in research. Bmj, 358.\nDownload references\n\nResearch collaboration with care home residents: a systematic review of public involvement approaches\nAcknowledgements\nWe are grateful for the contributions of the CHAPPI study team members who contributed to the discussions about this review and different work streams throughout the CHAPPI project: Marlene Kelly (Auburn Mere Residential Care Home), Talia Leaf (London Borough of Barnet), Natalie Ravenscroft (NAPA), Hilary Woodhead (NAPA) and Anqa Tirmazee-Kaleem (NAPA. We also thank Margaret Fox (formerly Skills for Care), who contributed to the CHAPPI project during its inception and early stages.\n\nResearch collaboration with care home residents: a systematic review of public involvement approaches\nFunding\nThe CHAPPI (Care Home Activity Providers facilitating Public Involvement in research as meaningful activity for care home residents) study is funded by the National Institute for Health and Care Research (NIHR) Research for Social Care (NIHR204264) and supported by the NIHR Applied Research Collaboration  East of England (NIHR ARC EoE) at Cambridgeshire and Peterborough NHS Foundation Trust. The views expressed are those of the authors and not necessarily those of the NIHR or the Department of Health and Social Care.", "doc_items_refs": ["#/texts/296", "#/texts/297", "#/texts/298", "#/texts/300", "#/texts/302"], "page_nos": [], "uuid": "6c1d54ff-44f6-47f0-8484-d62fa7865bb7"}
{"doc_id": "2025__Research_collaboration_with_care_home_residents_a_systematic_review_of_public_in__W4410395807", "source_path": "<redacted:source_path>", "chunk_id": 22, "source_chunk_idxs": [40], "num_tokens": 270, "text": "Research collaboration with care home residents: a systematic review of public involvement approaches\nAuthor information\nAuthors and Affiliations\n1. School of Health Sciences, Faculty of Medicine and Health Sciences, University of East Anglia, Norwich, NR4 7TJ, UK Megan Davies, Tamara Backhouse, Poppy Carr &amp; Anne Killett\n2. Centre for Research in Public Health and Community Care (CRIPACC), University of Hertfordshire, College Lane, Hatfield, AL10 9AB, UK Lisa Irvine, Elspeth Mathie &amp; Gizdem Akdur\n3. Skills for Care, 6 Grace Street, Leeds, LS1 2RP, UK Michelle Drury-Mulholland\nAuthors\n1. Megan Davies\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n2. Lisa Irvine\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n3. Tamara Backhouse\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n4. Poppy Carr\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n5. Elspeth Mathie\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n6. Michelle Drury-Mulholland\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n7. Gizdem Akdur\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n8. Anne Killett\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/305", "#/texts/306", "#/texts/307", "#/texts/308", "#/texts/309", "#/texts/310", "#/texts/311", "#/texts/312", "#/texts/313", "#/texts/314", "#/texts/315", "#/texts/316"], "page_nos": [], "uuid": "c09a9fe2-2cca-4dd6-8007-d918a8b2472b"}
{"doc_id": "2025__Research_collaboration_with_care_home_residents_a_systematic_review_of_public_in__W4410395807", "source_path": "<redacted:source_path>", "chunk_id": 23, "source_chunk_idxs": [41, 42, 43, 44, 45, 46, 47], "num_tokens": 436, "text": "Research collaboration with care home residents: a systematic review of public involvement approaches\nAuthor information\nContributions\nDatabase searches and data extraction were completed by authors Megan Davies and Lisa Irvine. The main body of the review was written by Megan Davies. Author Poppy Carr contributed to the introduction and discussion section. Author Tamara Backhouse wrote sections comparing this review to Backhouse et al. (2016). Authors Anne Killett, Elspeth Mathie, Michelle Drury-Mulholland and Gizdem Adkur contributed to all sections with information and feedback.\n\nResearch collaboration with care home residents: a systematic review of public involvement approaches\nAuthor information\nCorresponding author\nCorrespondence to\nMegan Davies\n.\n\nResearch collaboration with care home residents: a systematic review of public involvement approaches\nEthics declarations\nEthics approval and consent to participate\nNot applicable.\n\nResearch collaboration with care home residents: a systematic review of public involvement approaches\nEthics declarations\nConsent for publication\nNot applicable.\n\nResearch collaboration with care home residents: a systematic review of public involvement approaches\nEthics declarations\nCompeting interests\nThe authors declare no competing interests.\n\nResearch collaboration with care home residents: a systematic review of public involvement approaches\nAdditional information\nPublisher's Note\nSpringer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations.\n\nResearch collaboration with care home residents: a systematic review of public involvement approaches\nRights and permissions\nOpen Access\nThis article is licensed under a Creative Commons Attribution 4.0 International License, which permits use, sharing, adaptation, distribution and reproduction in any medium or format, as long as you give appropriate credit to the original author(s) and the source, provide a link to the Creative Commons licence, and indicate if changes were made. The images or other third party material in this article are included in the article's Creative Commons licence, unless indicated otherwise in a credit line to the material. If material is not included in the article's Creative Commons licence and your intended use is not permitted by statutory regulation or exceeds the permitted use, you will need to obtain permission directly from the copyright holder. To view a copy of this licence, visit\nhttp://creativecommons.org/licenses/by/4.0/\n.\nReprints and permissions", "doc_items_refs": ["#/texts/318", "#/texts/320", "#/texts/321", "#/texts/322", "#/texts/325", "#/texts/327", "#/texts/329", "#/texts/332", "#/texts/336", "#/texts/337", "#/texts/338", "#/texts/339", "#/texts/340"], "page_nos": [], "uuid": "7b432483-bd17-452c-9757-152c4dc4f0c8"}
{"doc_id": "2025__Research_collaboration_with_care_home_residents_a_systematic_review_of_public_in__W4410395807", "source_path": "<redacted:source_path>", "chunk_id": 24, "source_chunk_idxs": [48, 49, 50, 51], "num_tokens": 255, "text": "Research collaboration with care home residents: a systematic review of public involvement approaches\nAbout this article\nCite this article\nDavies, M., Irvine, L., Backhouse, T.\net al.\nResearch collaboration with care home residents: a systematic review of public involvement approaches.\nRes Involv Engagem\n11\n, 49 (2025). https://doi.org/10.1186/s40900-025-00724-0\nDownload citation\n- Received : 08 December 2024\n- Accepted : 25 April 2025\n- Published : 15 May 2025\n- DOI : https://doi.org/10.1186/s40900-025-00724-0\n\nResearch collaboration with care home residents: a systematic review of public involvement approaches\nAbout this article\nKeywords\n- Public Involvement\n- PPI\n- Older Adults\n- Long-Term Care\n- Care Homes\nDownload PDF\nDownload ePub\nAdvertisement\n\nResearch collaboration with care home residents: a systematic review of public involvement approaches\nAbout this article\nKeywords\nResearch Involvement and Engagement\nISSN: 2056-7529\n\nResearch collaboration with care home residents: a systematic review of public involvement approaches\nAbout this article\nKeywords\nContact us\n- General enquiries:\njournalsubmissions@springernature.com", "doc_items_refs": ["#/texts/343", "#/texts/344", "#/texts/345", "#/texts/346", "#/texts/347", "#/texts/348", "#/texts/349", "#/texts/350", "#/texts/351", "#/texts/352", "#/texts/353", "#/texts/355", "#/texts/356", "#/texts/357", "#/texts/358", "#/texts/359", "#/texts/360", "#/texts/361", "#/texts/362", "#/texts/364", "#/texts/366"], "page_nos": [], "uuid": "349216f5-3e2d-438a-a258-b9ba576d0f54"}
