{"doc_id": "2025__Olfactory_dysfunction_increases_progression_to_dementia_in_cognitively_impaired___W4410804130", "source_path": "<redacted:source_path>", "chunk_id": 0, "source_chunk_idxs": [0, 1, 2], "num_tokens": 492, "text": "Olfactory dysfunction increases progression to dementia in cognitively impaired older adults: a 12-year population-based study | GeroScience\nSkip to main content\nAdvertisement\nLog in\nMenu\nFind a journal\nPublish with us\nTrack your research\nSearch\nCart\n1. Home\n2. GeroScience\n3. Article\n\nOlfactory dysfunction increases progression to dementia in cognitively impaired older adults: a 12-year population-based study\n- ORIGINAL ARTICLE\n- Open access\n- Published: 28 May 2025\n- ( 2025 )\n- Cite this article\nDownload PDF\nYou have full access to this\nopen access\narticle\nGeroScience\nAims and scope\nSubmit manuscript\nOlfactory dysfunction increases progression to dementia in cognitively impaired older adults: a 12-year population-based study\nDownload PDF\n- Javier Oltra\nORCID: orcid.org/0000-0002-9268-4504\n1\n,\n- Ingrid Ekström\n1\n,\n- Maria Larsson\n2\n,\n- Jane Yan\n1\n,\n- Giulia Grande\n1\n,\n3\n&amp;\n- ...\n- Erika J. Laukka\n1\n,\n3\nShow authors\n- 884 Accesses\n- 18 Altmetric\n- 1 Mention\n- Explore all metrics\n\nOlfactory dysfunction increases progression to dementia in cognitively impaired older adults: a 12-year population-based study\nAbstract\nOlfactory deficits are hypothesized to precede cognitive decline and be independently associated with future dementia. Conversely, the concurrency of cognitive and olfactory impairments is expected to represent an advanced stage, associated with shorter time to diagnosis. Limited research has examined the association of isolated and concurrent cognitive and olfactory impairments with incident dementia. We aimed to estimate the 12-year dementia hazard for cognitive impairment no dementia (CIND), olfactory dysfunction (OD), and their combination in a population-based cohort of older adults. We classified 2406 participants from the Swedish National Study on Aging and Care in Kungsholmen (SNAC-K) based on baseline CIND and OD. Dementia hazard was estimated with Cox regressions for the whole period and two timeframes (baseline to 6-year follow-up and 6- to 12-year follow-up), and time until receiving a diagnosis via Laplace regressions. CIND+OD was associated with increased hazard ratio (HR) of dementia over 6 years (HR 11.38; 95% CI 6.70, 19.32;\np\np\np\np\np", "doc_items_refs": ["#/texts/1", "#/texts/2", "#/texts/3", "#/texts/4", "#/texts/5", "#/texts/6", "#/texts/7", "#/texts/8", "#/texts/9", "#/texts/10", "#/texts/11", "#/texts/12", "#/texts/14", "#/texts/15", "#/texts/16", "#/texts/17", "#/texts/18", "#/texts/19", "#/texts/20", "#/texts/21", "#/texts/22", "#/texts/23", "#/texts/24", "#/texts/25", "#/texts/26", "#/texts/27", "#/texts/28", "#/texts/29", "#/texts/30", "#/texts/31", "#/texts/32", "#/texts/33", "#/texts/34", "#/texts/35", "#/texts/36", "#/texts/37", "#/texts/38", "#/texts/39", "#/texts/41", "#/texts/42", "#/texts/44", "#/texts/46", "#/texts/48", "#/texts/50"], "page_nos": [], "uuid": "7b02d89f-f96a-4fbe-b2c5-20764960e5dc"}
{"doc_id": "2025__Olfactory_dysfunction_increases_progression_to_dementia_in_cognitively_impaired___W4410804130", "source_path": "<redacted:source_path>", "chunk_id": 1, "source_chunk_idxs": [3, 4, 5, 6], "num_tokens": 214, "text": "Olfactory dysfunction increases progression to dementia in cognitively impaired older adults: a 12-year population-based study\nAbstract\nAssociations between olfactory dysfunction and cognition: a scoping review\nArticle\n13 January 2024\n\nOlfactory dysfunction increases progression to dementia in cognitively impaired older adults: a 12-year population-based study\nAbstract\nOlfactory testing in consecutive patients referred with suspected dementia\nArticle\nOpen access\n20 June 2017\n\nOlfactory dysfunction increases progression to dementia in cognitively impaired older adults: a 12-year population-based study\nAbstract\nCould Early Identification of Changes in Olfactory Function Be an Indicator of Preclinical Neurodegenerative Disease? A Systematic Review\nArticle\nOpen access\n11 June 2020\n\nOlfactory dysfunction increases progression to dementia in cognitively impaired older adults: a 12-year population-based study\nAbstract\nExplore related subjects\nDiscover the latest articles, books and news in related subjects, suggested using machine learning.\n- Alzheimer's disease\n- Cognitive ageing\n- Dementia\n- Olfactory cortex\n- Olfactory System\n- Risk Factors\nUse our pre-submission checklist\nAvoid common mistakes on your manuscript.", "doc_items_refs": ["#/texts/54", "#/texts/55", "#/texts/57", "#/texts/58", "#/texts/59", "#/texts/61", "#/texts/62", "#/texts/63", "#/texts/65", "#/texts/66", "#/texts/67", "#/texts/68", "#/texts/69", "#/texts/70", "#/texts/71", "#/texts/72", "#/texts/73"], "page_nos": [], "uuid": "5bb48eb3-80c4-4b22-8a51-e6de4ac8e023"}
{"doc_id": "2025__Olfactory_dysfunction_increases_progression_to_dementia_in_cognitively_impaired___W4410804130", "source_path": "<redacted:source_path>", "chunk_id": 2, "source_chunk_idxs": [7], "num_tokens": 411, "text": "Olfactory dysfunction increases progression to dementia in cognitively impaired older adults: a 12-year population-based study\nIntroduction\nDementia, especially Alzheimer's disease (AD), is characterized by a long prodromal phase [\n1\n]. Olfactory dysfunction (OD) has emerged as an early dementia sign [\n2\n,\n3\n,\n4\n]. However, several questions remain regarding the interplay between olfactory and other predementia markers.\nOlfactory markers have been postulated to stratify individuals at different risk levels for dementia. In previous studies, a worse odor identification (OID) ability predicted progression from cognitive impairment (CI) to AD dementia in older adults [\n5\n]. Furthermore, better OID was associated with a reduced likelihood of transition from CI to all-type dementia and with cognitive maintenance in cognitively unimpaired individuals [\n6\n,\n7\n,\n8\n]. More recently, combining cognitive screening and OID tests has shown to be comparable to amyloid PET scans in estimating progression to CI or dementia [\n9\n].\nThese findings suggest that olfactory assessment could be a simple and cost-efficient tool for monitoring patients in primary care, identifying those at higher risk of dementia for referral to memory clinics, and selecting participants for clinical trials. However, there is a research gap in exploring the association of isolated and concurrent cognitive and olfactory impairments with future dementia. In this regard, an early study showed that older individuals with CI and OD showed an almost two-fold increased risk of progression to all-type dementia over 3.5 years compared to individuals with only CI [\n10\n]. Moreover, it has been hypothesized that olfactory deficits may appear early in the dementia course preceding memory deterioration and CI [\n2\n]. Considering the suggested sequence of pre-dementia events for cognitive and olfactory impairments, one could hypothesize that their concurrency would be related to incipient dementia in the short term, whereas presenting OD alone would be an early pre-dementia marker.", "doc_items_refs": ["#/texts/75", "#/texts/76", "#/texts/77", "#/texts/78", "#/texts/79", "#/texts/80", "#/texts/81", "#/texts/82", "#/texts/83", "#/texts/84", "#/texts/85", "#/texts/86", "#/texts/87", "#/texts/88", "#/texts/89", "#/texts/90", "#/texts/91", "#/texts/92", "#/texts/93", "#/texts/94", "#/texts/95", "#/texts/96", "#/texts/97", "#/texts/98", "#/texts/99"], "page_nos": [], "uuid": "f3b8c8e5-ad18-45ae-8987-b3c62866b286"}
{"doc_id": "2025__Olfactory_dysfunction_increases_progression_to_dementia_in_cognitively_impaired___W4410804130", "source_path": "<redacted:source_path>", "chunk_id": 3, "source_chunk_idxs": [8, 9], "num_tokens": 381, "text": "Olfactory dysfunction increases progression to dementia in cognitively impaired older adults: a 12-year population-based study\nIntroduction\nTo increase our understanding of the contribution of OD in early dementia detection, in this epidemiological study, we aimed to examine the association between isolated and combined CI and OD with progression to dementia across 12 years in a large community-based cohort of older adults. We further focused on exploring these associations in two timeframes, closer (0-6 years) and further away (6-12 years) from baseline. Additionally, we aimed to evaluate the impact of memory impairment,\nAPOE\nε4 status, age, and sex on these relationships.\n\nOlfactory dysfunction increases progression to dementia in cognitively impaired older adults: a 12-year population-based study\nMethods\nStudy design and participants\nThe Swedish National Study on Aging and Care in Kungsholmen (SNAC-K) is a population-based study consisting of 3363 older adults, recruited from 2001 to 2003, who belonged to predefined age strata and were randomly selected from the Kungsholmen area in central Stockholm [\n11\n]. For the current study, we selected 2406 participants with available baseline cognitive and olfactory data (Fig.\n1\n). All participants underwent a nurse interview, a medical examination, and a neuropsychological assessment at baseline. At follow-up, participants in the younger groups (60, 66, 72 years old) underwent re-examinations every 6 years and every 3 years after turning 78. For the older age groups, 78 years and over, participants were called back every 3 years.\nFig. 1\nAll parts of SNAC-K were approved by the ethical committee at Karolinska Institutet or the Regional Ethical Review Board in Stockholm. In compliance with the Declaration of Helsinki, all participants or their appropriate surrogates provided written informed consent.", "doc_items_refs": ["#/texts/100", "#/texts/101", "#/texts/102", "#/texts/105", "#/texts/106", "#/texts/107", "#/texts/108", "#/texts/109", "#/texts/110", "#/texts/111"], "page_nos": [], "uuid": "b499641d-5114-40f3-898e-f1ac7ee1f11e"}
{"doc_id": "2025__Olfactory_dysfunction_increases_progression_to_dementia_in_cognitively_impaired___W4410804130", "source_path": "<redacted:source_path>", "chunk_id": 4, "source_chunk_idxs": [10], "num_tokens": 473, "text": "Olfactory dysfunction increases progression to dementia in cognitively impaired older adults: a 12-year population-based study\nMethods\nNeuropsychological assessment\nParticipants underwent a comprehensive neuropsychological assessment administered by psychologists addressing five cognitive domains, as follows:\nEpisodic memory: The episodic memory task tailored for SNAC-K consisted of a list of 16 unrelated concrete nouns presented both orally and visually [\n12\n]. After their presentation, the participants had 2 min for free oral recall. The free recall score, computed as the number of correctly recalled words, was used for CIND classification.\nExecutive function: The executive function task was the trail making test-B (TMT-B), which required participants to connect 13 encircled digits and letters in an alternating numerical and alphabetical order (1-A, 2-B, 3-C, etc.) [\n13\n]. The TMT-B score was computed as the number of correct connections.\nLanguage: Language tasks consisted of two letter fluency (F and A) and two category fluency (animals and professions) tasks [\n13\n]. Participants were given 60 s to orally generate as many words as possible. The scores consisted of the number of words generated in one minute for each one of the tasks.\nVisuospatial abilities: The visuospatial abilities task consisted of a 10-item version of the Shepherd-Metzler mental rotation test [\n14\n,\n15\n]. In each item, the participant should decide, within 45 s, which one of the three rotated figures presented matched a target figure. The score was computed as the number of correctly selected figures.\nPerceptual speed: The perceptual speed tasks consisted of two paper-and-pencil tests. In digit cancellation, 11 rows of random digits ranging from 1 to 9 were presented and the participants should inspect the rows sequentially and cross out every digit 4 they detected [\n16\n]. In pattern comparison, the participants should sequentially judge and mark accordingly if 30 different pairs of line-segment patterns presented in two different sheets (15 pairs per sheet) were \"same\" or \"different\" [\n17\n]. The score was the number of digits correctly crossed out within 30 s for digit cancellation and the mean number of correct classifications within 30 s for the two trials for pattern comparison.", "doc_items_refs": ["#/texts/113", "#/texts/114", "#/texts/115", "#/texts/116", "#/texts/117", "#/texts/118", "#/texts/119", "#/texts/120", "#/texts/121", "#/texts/122", "#/texts/123", "#/texts/124", "#/texts/125", "#/texts/126", "#/texts/127", "#/texts/128", "#/texts/129", "#/texts/130", "#/texts/131", "#/texts/132"], "page_nos": [], "uuid": "64cdc538-3b69-4714-a42f-134626117ed5"}
{"doc_id": "2025__Olfactory_dysfunction_increases_progression_to_dementia_in_cognitively_impaired___W4410804130", "source_path": "<redacted:source_path>", "chunk_id": 5, "source_chunk_idxs": [11], "num_tokens": 293, "text": "Olfactory dysfunction increases progression to dementia in cognitively impaired older adults: a 12-year population-based study\nMethods\nDementia diagnosis\nAll-cause dementia was diagnosed at baseline and follow-ups according to the\nDiagnostic and Statistical Manual of Mental Disorders, 4 th edition\n(\nDSM-IV\n), based on the information collected during the medical examination [\n18\n]. A preliminary diagnosis was made by a physician after a medical examination, which included a neurological examination and assessment of clinical history, drug use, and cognitive functioning. Performance on the neuropsychological assessment presented above was not used for diagnostic purposes. The cognitive evaluation used for dementia diagnosis included the Mini-Mental State Examination (MMSE) [\n19\n], the clock test [\n20\n], digit span [\n21\n], a frontal lobe task [\n22\n], and items regarding problem-solving, abstract thinking, self- and time-space orientation, and general knowledge [\n23\n]. A second physician made an independent diagnosis based on the documentation from the medical examination. In case of disagreement, the final diagnosis was made by a senior neurologist. Furthermore, the Swedish National Cause of Death Register, clinical charts, and medical records were examined to identify additional dementia cases among participants who died between two assessments and developed dementia after their last examination. The date of diagnosis was the examination date for participants receiving a dementia diagnosis in SNAC-K and the date of death for dementia cases identified using alternative sources of information.", "doc_items_refs": ["#/texts/134", "#/texts/135", "#/texts/136", "#/texts/137", "#/texts/138", "#/texts/139", "#/texts/140", "#/texts/141", "#/texts/142", "#/texts/143", "#/texts/144", "#/texts/145", "#/texts/146", "#/texts/147", "#/texts/148", "#/texts/149", "#/texts/150"], "page_nos": [], "uuid": "f7c22ce9-e71d-44b6-92a2-322617eb9cf0"}
{"doc_id": "2025__Olfactory_dysfunction_increases_progression_to_dementia_in_cognitively_impaired___W4410804130", "source_path": "<redacted:source_path>", "chunk_id": 6, "source_chunk_idxs": [12, 13], "num_tokens": 382, "text": "Olfactory dysfunction increases progression to dementia in cognitively impaired older adults: a 12-year population-based study\nMethods\nOperationalization of cognitive impairment no dementia (CIND)\nFor CIND classification,\nz\nscores for each test and participant were computed based on the baseline age group-specific mean and SD. The average of the relevant\nz\nscores was calculated when a specific domain involved more than one test (language and perceptual speed). Participants with a\nz\nscore of 1.5 or more below the age group-specific mean in at least one cognitive domain in the absence of dementia were classified as having CIND. We further classified CIND into subtypes depending on the impairment in the memory domain (amnestic CIND, aCIND) or only in non-memory domains (non-amnestic CIND, naCIND).\n\nOlfactory dysfunction increases progression to dementia in cognitively impaired older adults: a 12-year population-based study\nMethods\nOlfactory assessment\nOlfactory function was assessed with a normative OID test with high test-retest reliability, the Sniffin' Sticks [\n24\n,\n25\n]. The administrator asked the participants to freely identify 16 common household odors presented individually in felt-tip pens. If the participant was unable to produce a name or failed to provide the correct name for a specific odor, four written alternatives were provided (one target and three foils). The participants were instructed to select the option that best matched the presented odor. They received a score of 1 for each correct identification. In the few cases where information for an item was missing (e.g., due to administration error or allergy), they received a score of 0.25 (equivalent to the chance level). The OID score ranges from 0 to 16. OD was operationalized based on normative data as scoring\n26\n,\n27\n,\n28\n].", "doc_items_refs": ["#/texts/152", "#/texts/153", "#/texts/154", "#/texts/155", "#/texts/156", "#/texts/157", "#/texts/158", "#/texts/160", "#/texts/161", "#/texts/162", "#/texts/163", "#/texts/164", "#/texts/165", "#/texts/166", "#/texts/167", "#/texts/168", "#/texts/169", "#/texts/170"], "page_nos": [], "uuid": "505ef1e0-f7f4-4196-b34d-0890ee0f1cb2"}
{"doc_id": "2025__Olfactory_dysfunction_increases_progression_to_dementia_in_cognitively_impaired___W4410804130", "source_path": "<redacted:source_path>", "chunk_id": 7, "source_chunk_idxs": [14], "num_tokens": 203, "text": "Olfactory dysfunction increases progression to dementia in cognitively impaired older adults: a 12-year population-based study\nMethods\nCovariates\nDemographics (age, sex, and education as years of formal schooling) and lifestyle (smoking status as never/former or current smoking) information were collected in the baseline interview. We used mean-centered age and education in further analysis. Information on vascular risk factors (presence/absence of diabetes and hypertension), cardiovascular (presence/absence of ischemic heart disease, heart failure, or atrial fibrillation), and cerebrovascular (presence/absence of stroke) diseases was collected via the nurse interview, medical examination, medication lists, laboratory tests, and the Swedish National Patient Register [\n29\n].\nGenotyping was performed on the Sequenom MassARRAY® platform at the Mutation Analysis Facility, Karolinska Institutet, and\nAPOE\nwas dichotomized into ε4 carriers vs. non-ε4 carriers.", "doc_items_refs": ["#/texts/172", "#/texts/173", "#/texts/174", "#/texts/175", "#/texts/176", "#/texts/177"], "page_nos": [], "uuid": "8a511100-ab49-40e1-9cc0-5f041c1b4d23"}
{"doc_id": "2025__Olfactory_dysfunction_increases_progression_to_dementia_in_cognitively_impaired___W4410804130", "source_path": "<redacted:source_path>", "chunk_id": 8, "source_chunk_idxs": [15], "num_tokens": 483, "text": "Olfactory dysfunction increases progression to dementia in cognitively impaired older adults: a 12-year population-based study\nMethods\nStatistical analysis\nWe used Cox regressions to estimate hazard ratios (HRs) for incident dementia between baseline and the 12-year follow-up. We used participants with unimpaired cognition and olfaction as the reference group (unimpaired), and the remaining groups indicated an impairment only in olfaction or cognition (isolated CIND and isolated OD) or in both domains (CIND+OD). We applied a basic model (adjusted for sex, age, and education) and a multi-adjusted model including smoking status, hypertension, diabetes, cardiovascular disease, stroke, and\nAPOE\nε4 status as additional covariates. The follow-up time was computed as years from baseline to dementia diagnosis, death without dementia, dropout without dementia, or end of follow-up. The difference in dementia hazard between impaired groups within the entire period was statistically tested by running pairwise models.\nFurthermore, we ran equivalent Cox regressions after splitting the timing of dementia diagnoses into two periods, between baseline and 6-year follow-up and between 6- and 12-year follow-ups, to investigate progression to dementia closer and further from baseline. We applied Cox regressions with a time-varying coefficient [\n30\n]. Following the study design, we split the time based on the last participant who underwent the 6-year follow-up visit, 6.68 years after baseline (first period: 0.003-6.68 years, second period: 6.69-13.61 years). For the second period, participants who were diagnosed with dementia, died without dementia, and dropped out without dementia during the first period were omitted.\nThe proportional hazard assumption was tested using Schoenfeld's residuals regressed against follow-up time. A deviation from the assumption was detected for CIND+OD, reflecting a weaker association after the 6-year follow-up.\nIn supplementary analyses, we performed interaction analyses on progression to dementia over 12 years of CIND and OD combinations for\nAPOE\nε4 status, age group (young-old,\nIn sensitivity analyses, we accounted for death as a competing risk event by estimating the subdistribution hazard ratio (sHR) [\n31\n].", "doc_items_refs": ["#/texts/179", "#/texts/180", "#/texts/181", "#/texts/182", "#/texts/183", "#/texts/184", "#/texts/185", "#/texts/186", "#/texts/187", "#/texts/188", "#/texts/189", "#/texts/190", "#/texts/191"], "page_nos": [], "uuid": "abc596f8-f7ce-4b58-b024-a785e7af7dd8"}
{"doc_id": "2025__Olfactory_dysfunction_increases_progression_to_dementia_in_cognitively_impaired___W4410804130", "source_path": "<redacted:source_path>", "chunk_id": 9, "source_chunk_idxs": [16], "num_tokens": 243, "text": "Olfactory dysfunction increases progression to dementia in cognitively impaired older adults: a 12-year population-based study\nMethods\nStatistical analysis\nLastly, we used Laplace regressions to estimate the time until receiving a dementia diagnosis as a function of the CIND and OD combinations [\n32\n]. We ran three different models based on the observed percentage of progression to dementia over 15 years within groups (unimpaired ≈ 5%, isolated CIND ≈ 9%, isolated OD ≈ 19%). In the first model, we assessed differences in the time until the first 5% of participants in each group developed dementia (5 th percentile survival time [ST]; reference group: unimpaired). In the subsequent models, we assessed differences in the median time until the first 9% of participants in each impaired group (9 th percentile ST; reference group: isolated CIND) and until 19% of participants in isolated OD and CIND+OD groups developed dementia (19 th percentile ST; reference group: isolated OD). We ran pairwise comparisons to test differences between impaired groups.\nWe used Stata version 18 (StataCorp LLC) for all the analyses.", "doc_items_refs": ["#/texts/192", "#/texts/193", "#/texts/194", "#/texts/195"], "page_nos": [], "uuid": "683d8ba1-3d96-463b-a15d-e8e1ac9870aa"}
{"doc_id": "2025__Olfactory_dysfunction_increases_progression_to_dementia_in_cognitively_impaired___W4410804130", "source_path": "<redacted:source_path>", "chunk_id": 10, "source_chunk_idxs": [17], "num_tokens": 442, "text": "Olfactory dysfunction increases progression to dementia in cognitively impaired older adults: a 12-year population-based study\nResults\nThe mean age at baseline of the total sample was 71.8 years (SD 9.7), 60.8% were females, and the average years of formal schooling was 12.3 (SD 4.2). Participants with CIND+OD scored lower on the MMSE and the OID task, and were more likely to be older, have fewer years of education, and have hypertension, history of heart disease, and stroke (Table\n1\n).\nDuring the 12-year follow-up (mean 8.2 years, SD 4.2), 603 participants died without dementia, 221 dropped out without dementia after the baseline examination, 207 dropped out without dementia after completing at least one follow-up examination, and 259 incident dementia cases were identified. Participants with isolated OD and CIND+OD were overrepresented among those who developed dementia and died but were not more likely to drop out of the study (Supplementary Table\n1\n).\nDuring the 12-year follow-up period, compared with unimpaired participants, the HR of dementia was 2.05 (95% CI 1.34, 3.12;\np\np\np\n2\nA). The HR was two to three times and significantly higher for participants with CIND+OD compared with those with isolated CIND (\np\np\np\n= 0.626). In the multi-adjusted models, the HRs were generally slightly attenuated (Supplementary Table\n2\n).\nFig. 2\nIn the first time period, between baseline and 6-year follow-up, 129 participants were diagnosed with dementia. During this period, compared with unimpaired participants, the HR was 3.38 (95% CI 1.75, 6.49;\np\np\np\n2\n). The HR was three to five times and significantly higher for participants with CIND+OD compared with those with isolated CIND (\np\np\np\n= 0.406). In the multi-adjusted models, the HRs were generally slightly attenuated (Supplementary Table\n3\n).", "doc_items_refs": ["#/texts/197", "#/texts/198", "#/texts/199", "#/texts/200", "#/texts/201", "#/texts/202", "#/texts/203", "#/texts/204", "#/texts/206", "#/texts/208", "#/texts/210", "#/texts/211", "#/texts/212", "#/texts/214", "#/texts/216", "#/texts/217", "#/texts/218", "#/texts/219", "#/texts/220", "#/texts/221", "#/texts/222", "#/texts/224", "#/texts/226", "#/texts/228", "#/texts/229", "#/texts/230", "#/texts/232", "#/texts/234", "#/texts/235", "#/texts/236", "#/texts/237"], "page_nos": [], "uuid": "2ebe2251-354c-4cdb-86f1-2fd0a8822fcd"}
{"doc_id": "2025__Olfactory_dysfunction_increases_progression_to_dementia_in_cognitively_impaired___W4410804130", "source_path": "<redacted:source_path>", "chunk_id": 11, "source_chunk_idxs": [18], "num_tokens": 245, "text": "Olfactory dysfunction increases progression to dementia in cognitively impaired older adults: a 12-year population-based study\nResults\nIn the second time period, between 6- and 12-year follow-ups, 130 participants were diagnosed with dementia. During this period, compared with unimpaired participants, the HR of dementia was 1.47 (95% CI 0.82, 2.61;\np\n= 0.195) for those with isolated CIND, 2.12 (95% CI 1.41, 3.19;\np\np\n= 0.074) for those with CIND+OD (Table\n2\n). The HR was not significantly different between participants with isolated CIND compared with those with isolated OD (\np\n= 0.203) and CIND+OD (\np\n= 0.770), nor between those with isolated OD compared with those with CIND+OD (\np\n= 0.851). In the multi-adjusted models, the HRs were generally slightly attenuated (Supplementary Table\n3\n). The main difference was that the HR was significant for those with CIND+OD, while the association was still weaker than for the first period.", "doc_items_refs": ["#/texts/238", "#/texts/239", "#/texts/240", "#/texts/241", "#/texts/243", "#/texts/244", "#/texts/245", "#/texts/246", "#/texts/247", "#/texts/248", "#/texts/249", "#/texts/250", "#/texts/251", "#/texts/252", "#/texts/253", "#/texts/254"], "page_nos": [], "uuid": "8d95bcf8-25ac-4516-84f2-e0a45a1f65d8"}
{"doc_id": "2025__Olfactory_dysfunction_increases_progression_to_dementia_in_cognitively_impaired___W4410804130", "source_path": "<redacted:source_path>", "chunk_id": 12, "source_chunk_idxs": [19], "num_tokens": 443, "text": "Olfactory dysfunction increases progression to dementia in cognitively impaired older adults: a 12-year population-based study\nResults\nThe results from the Cox regressions for CIND subtypes in combination with OD revealed that, during the 12-year follow-up period, participants with aCIND+OD (HR 10.67; 95% CI 6.54, 17.42;\np\np\n= 0.042), and that participants with naCIND+OD (HR 4.54; 95% CI 3.01, 6.83;\np\np\n= 0.004; Fig.\n2\nB). During the period between baseline and 6-year follow-up, participants with aCIND+OD (HR 22.23; 95% CI 11.79, 41.90;\np\np\n= 0.290) and participants with naCIND+OD (HR 8.57; 95% CI 4.82, 15.25;\np\np\n2\n). Between 6- and 12-year follow-ups, the HRs were largely attenuated, and CIND subtypes either isolated or with OD were not significantly associated with incident dementia (Table\n2\n). In the multi-adjusted models, the HRs were generally slightly attenuated (Supplementary Tables\n2\n&amp;\n3\n). The main difference was that, for the second period, the HR was significant for participants with isolated aCIND, while the association was still weaker than for the first period.\nSupplementary analyses revealed a significant interaction between age groups, isolated OD, and dementia diagnosis over 12 years in the basic model (\np\n= 0.017). Young-old participants with isolated OD (HR 3.50; 95% CI 1.96, 6.27;\np\np\np\n= 0.011): young-old participants (HR 4.19; 95% CI 2.32, 7.60;\np\np\nSensitivity analyses treating death as a competing risk event showed similar results to those reported (Supplementary Table\n4\n). The main difference was that the HR was not significant for participants with isolated aCIND over 12 years in the basic model.", "doc_items_refs": ["#/texts/255", "#/texts/256", "#/texts/258", "#/texts/259", "#/texts/260", "#/texts/262", "#/texts/263", "#/texts/264", "#/texts/265", "#/texts/266", "#/texts/268", "#/texts/269", "#/texts/270", "#/texts/272", "#/texts/274", "#/texts/275", "#/texts/276", "#/texts/277", "#/texts/278", "#/texts/279", "#/texts/280", "#/texts/281", "#/texts/282", "#/texts/283", "#/texts/284", "#/texts/285", "#/texts/287", "#/texts/289", "#/texts/290", "#/texts/291", "#/texts/293", "#/texts/295", "#/texts/296", "#/texts/297"], "page_nos": [], "uuid": "9f4f9408-c7c8-45f2-8b9c-fc3de1ab82d4"}
{"doc_id": "2025__Olfactory_dysfunction_increases_progression_to_dementia_in_cognitively_impaired___W4410804130", "source_path": "<redacted:source_path>", "chunk_id": 13, "source_chunk_idxs": [20], "num_tokens": 262, "text": "Olfactory dysfunction increases progression to dementia in cognitively impaired older adults: a 12-year population-based study\nResults\nParticipants with CIND+OD reached a lower survival rate within the first 6 years after baseline (Fig.\n3\n). Results from the Laplace regressions are displayed in Table\n3\n. The first model estimated that 5% of participants with CIND+OD converted to dementia almost 5 years after baseline, while individuals with isolated CIND and isolated OD reached the same proportion of incident dementia after around 8 years. There was no statistically significant difference between isolated OD and isolated CIND in time in reaching 5% of incident dementia cases. The second model resulted in slightly longer STs for 9% of progression to dementia; participants with CIND+OD reached such a percentage of progression after 5 years and isolated CIND and isolated OD after around 9 years. The third model estimated that 19% of participants with CIND+OD converted to dementia around 8 years after baseline, while those with isolated OD reached the same proportion of dementia cases after almost 11 years. In the multi-adjusted model, the STs were longer; moreover, participants with isolated CIND did not differ from unimpaired individuals in the time to reach 5% of incident dementia.\nFig. 3", "doc_items_refs": ["#/texts/298", "#/texts/299", "#/texts/300", "#/texts/301", "#/texts/302", "#/texts/303"], "page_nos": [], "uuid": "93d93195-1350-4446-af93-3f2c1f7078d7"}
{"doc_id": "2025__Olfactory_dysfunction_increases_progression_to_dementia_in_cognitively_impaired___W4410804130", "source_path": "<redacted:source_path>", "chunk_id": 14, "source_chunk_idxs": [21], "num_tokens": 465, "text": "Olfactory dysfunction increases progression to dementia in cognitively impaired older adults: a 12-year population-based study\nDiscussion\nThis population-based study of older adults showed that individuals with combined cognitive and olfactory impairments had a two to three times higher risk of developing dementia over the next 6 years compared to those only presenting impairment in one modality. The results suggest that this combination is associated with a higher progression to dementia within the next few years, and the association was even more pronounced in individuals with amnestic CI. Individuals with either isolated cognitive or olfactory impairments displayed a comparable elevated dementia risk over the first 6 years after examination, whereas individuals with isolated smell impairment displayed a reliably higher dementia hazard across the whole 12-year follow-up interval.\nIsolated CI was associated with a higher hazard of dementia, which was most pronounced within the first 6 years and in individuals with the amnestic form. Participants with isolated CI displayed 9.5% dementia progression over the whole period, while those with combined cognitive and olfactory impairments displayed 30% dementia progression. These observations align with previous studies suggesting that the presence of objective CI may be insufficient to capture the complexity of predementia stages [\n33\n]. Other markers, such as olfactory deficits, could enhance the identification of specific groups with a higher likelihood of dementia progression.\nHaving isolated OD was associated with a more than two times increased hazard of dementia over 12 years. Importantly, this association remained stable in the period closest and furthest to baseline. This finding is in line with previous population-based studies, showing that the worse olfactory performance is associated with future dementia [\n3\n,\n4\n,\n5\n,\n34\n,\n35\n]. Notably, we observed this relationship in a group of individuals classified as cognitively unimpaired using a comprehensive neuropsychological assessment, whereas prior reports applied shorter cognitive screening tests to exclude CI at baseline [\n3\n,\n4\n,\n34\n]. The detected relation between isolated OD and incident dementia over 12 years reinforces its status as an early predementia marker, highlighting its independence of displaying concurrent CI. This finding is especially relevant since a crucial issue is that once objective CI is evident, the disease progression is already quite far gone for those where the cognitive symptoms are due to AD [\n1\n].", "doc_items_refs": ["#/texts/305", "#/texts/306", "#/texts/307", "#/texts/308", "#/texts/309", "#/texts/310", "#/texts/311", "#/texts/312", "#/texts/313", "#/texts/314", "#/texts/315", "#/texts/316", "#/texts/317", "#/texts/318", "#/texts/319", "#/texts/320", "#/texts/321", "#/texts/322", "#/texts/323", "#/texts/324", "#/texts/325", "#/texts/326", "#/texts/327"], "page_nos": [], "uuid": "2ad66cd6-4b30-4e29-8e52-8fd779e42831"}
{"doc_id": "2025__Olfactory_dysfunction_increases_progression_to_dementia_in_cognitively_impaired___W4410804130", "source_path": "<redacted:source_path>", "chunk_id": 15, "source_chunk_idxs": [22], "num_tokens": 434, "text": "Olfactory dysfunction increases progression to dementia in cognitively impaired older adults: a 12-year population-based study\nDiscussion\nThose individuals classified as CI with OD displayed a three times higher hazard of dementia across 12 years compared with those having isolated CI. After splitting the time to incident dementia, the relationship was more pronounced within the first 6 years from baseline examination. Our findings align with prior reports of increased dementia progression for the concurrence of cognitive and olfactory impairments over shorter follow-ups in clinical and population-based settings [\n10\n,\n36\n]. Although, in the multi-adjusted model, their concurrency was significantly associated with a higher hazard of dementia between 6- and 12-year follow-ups, it remained at the same level of isolated OD and was no longer significant after considering death as a competing risk event. Thus, we expand previous knowledge by circumscribing their incremented joint predictive value to a short term.\nNext, we explored the potential modifying effects of\nAPOE\nε4 status, age, and sex. We found that for those individuals with isolated OD, the young-old group showed a higher hazard of dementia over 12 years than the old-old. This finding strengthens the notion that special attention should be given to olfactory deficits at younger old age [\n3\n].\nThe hazard associated with CI subtypes was higher for those having the memory domain affected, especially in combination with OD. When having OD, amnestic individuals had more than a doubled risk of developing dementia than those with non-amnestic impairment. The association was more pronounced within the first 6 years after baseline, reaching a 22.2-fold increased risk for amnestic CI with OD, nearly three times higher than for those with memory preserved. Our findings are consistent with previous studies reporting a higher progression to dementia in amnestic CI with olfactory deficits in population-based and clinical settings [\n10\n,\n37\n].\nCognitive and olfactory impairments are also associated with decreased survival [\n38\n,\n39\n,\n40\n]. However, sensitivity analyses treating death as a competing event produced similar results.", "doc_items_refs": ["#/texts/328", "#/texts/329", "#/texts/330", "#/texts/331", "#/texts/332", "#/texts/333", "#/texts/334", "#/texts/335", "#/texts/336", "#/texts/337", "#/texts/338", "#/texts/339", "#/texts/340", "#/texts/341", "#/texts/342", "#/texts/343", "#/texts/344", "#/texts/345", "#/texts/346", "#/texts/347", "#/texts/348", "#/texts/349"], "page_nos": [], "uuid": "c3fa6af7-6685-4050-aa9d-77b3febecd08"}
{"doc_id": "2025__Olfactory_dysfunction_increases_progression_to_dementia_in_cognitively_impaired___W4410804130", "source_path": "<redacted:source_path>", "chunk_id": 16, "source_chunk_idxs": [23], "num_tokens": 472, "text": "Olfactory dysfunction increases progression to dementia in cognitively impaired older adults: a 12-year population-based study\nDiscussion\nA further point of interest was whether the importance of cognitive and olfactory impairments varies at different predementia stages. Olfactory deficits have been suggested to precede cognitive decline and impairment [\n2\n], which is supported by evidence from population-based and community-based studies [\n10\n,\n41\n,\n42\n,\n43\n,\n44\n]. These functional changes are expected to accompany pathological events in the brain, characterized by amyloid deposition and tau formation in olfactory-related brain areas, potentially leading to neurodegeneration [\n2\n]. In this context, one could argue that isolated OD would be a long-standing predictor of dementia, while once CI concurs, it predicts dementia in the short term. In our cohort, it could be expected that those classified as isolated OD later developed CI as an intermediate predementia stage [\n8\n]. We found that having CI with OD accelerated the onset of dementia by 3 years compared to their isolated forms.\nOverall, our findings are in line with the hypothesis of olfactory-first impairment in predementia stages. In addition, they highlight its relevance as an indicator of more imminent dementia progression when accompanied by CI. Further studies should address whether combining cognitive and olfactory trajectories improves dementia detection, as previous single-modality studies suggested [\n18\n,\n43\n]. They should also investigate alternative pathways not accompanied by olfactory deficits, as suggested, for example, by our results showing that isolated CI is still related to future dementia. This approach could help protect against false positives. In this sense, better OID performance has been previously associated with a higher likelihood of transition from CI back to normal [\n8\n].\nThe main strength of this study is that it includes a combination of a broad neuropsychological assessment and OID testing in a large sample with a long follow-up interval involving thorough dementia assessment. The main limitation is that due to the clinical nature of dementia diagnosis, we could not perform split analyses by dementia subtypes. Moreover, the generalizability could be limited because of the participants' profile (relativity healthy and fit, predominantly high socioeconomic standing, and mainly Swedish-born).", "doc_items_refs": ["#/texts/350", "#/texts/351", "#/texts/352", "#/texts/353", "#/texts/354", "#/texts/355", "#/texts/356", "#/texts/357", "#/texts/358", "#/texts/359", "#/texts/360", "#/texts/361", "#/texts/362", "#/texts/363", "#/texts/364", "#/texts/365", "#/texts/366", "#/texts/367", "#/texts/368", "#/texts/369", "#/texts/370", "#/texts/371", "#/texts/372", "#/texts/373", "#/texts/374"], "page_nos": [], "uuid": "77e1bb8c-6716-41f6-b7ea-a7ff445b21ff"}
{"doc_id": "2025__Olfactory_dysfunction_increases_progression_to_dementia_in_cognitively_impaired___W4410804130", "source_path": "<redacted:source_path>", "chunk_id": 17, "source_chunk_idxs": [24, 25], "num_tokens": 419, "text": "Olfactory dysfunction increases progression to dementia in cognitively impaired older adults: a 12-year population-based study\nDiscussion\nIt is important to note that the sample size might have limited the ability to capture events (dementia diagnoses) when subtyping and splitting the timing of dementia diagnoses, especially for aCIND. Although the observed data and statistical findings reinforce the potential role of OID tasks in identifying amnestic cognitively impaired individuals at a higher short-term risk of dementia, interpretations should be cautious. Future multi-sample studies could help overcome this limitation.\nOID performance relies in part on declarative memory processes [\n45\n,\n46\n], raising the possibility that the observed olfactory impairment in individuals with aCIND reflects, at least partially, underlying deficits in verbal and semantic memory. This overlap is important to consider when interpreting the results in this group. However, our findings support the role of OD as a distinct early marker of dementia and clearly demonstrate the added value of assessing olfactory impairment in addition to memory impairment for detecting individuals with a high risk of progressing to dementia in the short term. Further studies are warranted to quantify shared and unique contributions of olfactory and memory deficits in dementia risk.\nThis study demonstrates the added advantage of combining cognitive and olfactory testing to identify people with increased dementia risk. The results suggest that CI accompanied by OD is a signal of incipient dementia in the coming years, especially for those with the memory domain affected. Furthermore, our findings reaffirm the robustness of OD as a long-standing early marker of dementia on its own. Our results support the notion that including an OID test in predementia screening could be a cost-efficient approach for early dementia detection in clinical settings and selection of participants for clinical trials.\n\nOlfactory dysfunction increases progression to dementia in cognitively impaired older adults: a 12-year population-based study\nData availability\nData can be made available on reasonable request and approval by the SNAC-K data management and maintenance committee (snac-k.se).", "doc_items_refs": ["#/texts/375", "#/texts/376", "#/texts/377", "#/texts/378", "#/texts/379", "#/texts/380", "#/texts/381", "#/texts/383"], "page_nos": [], "uuid": "a5d9f3ef-7c96-4456-b539-23441e37d21d"}
{"doc_id": "2025__Olfactory_dysfunction_increases_progression_to_dementia_in_cognitively_impaired___W4410804130", "source_path": "<redacted:source_path>", "chunk_id": 18, "source_chunk_idxs": [26], "num_tokens": 454, "text": "Olfactory dysfunction increases progression to dementia in cognitively impaired older adults: a 12-year population-based study\nReferences\n1. Jack CRJ, Andrews JS, Beach TG, et al. Revised criteria for diagnosis and staging of Alzheimer's disease: Alzheimer's Association Workgroup. Alzheimers Dement. 2024;20:5143-69.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n2. Murphy C. Olfactory and other sensory impairments in Alzheimer disease. Nat Rev Neurol. 2019;15:11-24.\nArticle\nPubMed\nCAS\nGoogle Scholar\n3. Adams DR, Kern DW, Wroblewski KE, McClintock MK, Dale W, Pinto JM. Olfactory dysfunction predicts subsequent dementia in older U.S. adults. J Am Geriatr Soc. 2018;66:140-4.\nArticle\nPubMed\nGoogle Scholar\n4. Laukka EJ, Ekström I, Larsson M, Grande G, Fratiglioni L, Rizzuto D. Markers of olfactory dysfunction and progression to dementia: a 12-year population-based study. Alzheimers Dement. 2023;19:3019-27.\nArticle\nPubMed\nCAS\nGoogle Scholar\n5. Devanand DP, Lee S, Manly J, Andrews H, Schupf N, Doty RL, Stern Y, Zahodne LB, Louis ED, Mayeux R. Olfactory deficits predict cognitive decline and Alzheimer dementia in an urban community. Neurology. 2015;84:182-9.\nArticle\nPubMed\nPubMed Central\nCAS\nGoogle Scholar\n6. Devanand DP, Lee S, Luchsinger JA, et al. Intact global cognitive and olfactory ability predicts lack of transition to dementia. Alzheimers Dement. 2020;16:326-34.\nArticle\nPubMed\nGoogle Scholar\n7. Motter JN, Choi J, Lee S, Goldberg TE, Albert S, Devanand DP. Association of performance on olfactory and cognitive screening tests with conversion to dementia in a biracial cohort of older adults. Neurology. 2023;101:e1046-55.\nArticle\nPubMed\nPubMed Central\nCAS\nGoogle Scholar", "doc_items_refs": ["#/texts/385", "#/texts/386", "#/texts/387", "#/texts/388", "#/texts/389", "#/texts/390", "#/texts/391"], "page_nos": [], "uuid": "902cb812-1621-458c-aefb-15922cf5a975"}
{"doc_id": "2025__Olfactory_dysfunction_increases_progression_to_dementia_in_cognitively_impaired___W4410804130", "source_path": "<redacted:source_path>", "chunk_id": 19, "source_chunk_idxs": [27], "num_tokens": 478, "text": "Olfactory dysfunction increases progression to dementia in cognitively impaired older adults: a 12-year population-based study\nReferences\n8. Knight JE, Yoneda T, Lewis NA, Muniz-Terrera G, Bennett DA, Piccinin AM. Transitions between mild cognitive impairment, dementia, and mortality: the importance of olfaction. J Gerontol A Biol Sci Med Sci. 2023;78:1284-91.\nArticle\nPubMed\nPubMed Central\nCAS\nGoogle Scholar\n9. Devanand DP, Lee S, Luchsinger JA, Knopman D, Vassilaki M, Motter JN. Comparison of brief olfactory and cognitive assessments to neuroimaging biomarkers in the prediction of cognitive decline and dementia in the MCSA cohort. Alzheimers Dement. 2024.\nhttps://doi.org/10.1002/alz.14261\n.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n10. Roberts RO, Christianson TJH, Kremers WK, Mielke MM, Machulda MM, Vassilaki M, Alhurani RE, Geda YE, Knopman DS, Petersen RC. Association Between olfactory dysfunction and amnestic mild cognitive impairment and Alzheimer disease dementia. JAMA Neurol. 2016;73:93-101.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n11. Lagergren M, Fratiglioni L, Hallberg IR, et al. A longitudinal study integrating population, care and social services data. The Swedish National study on Aging and Care (SNAC). Aging Clin Exp Res. 2004;16:158-68.\nArticle\nPubMed\nGoogle Scholar\n12. Laukka EJ, Lövdén M, Herlitz A, Karlsson S, Ferencz B, Pantzar A, Keller L, Graff C, Fratiglioni L, Bäckman L. Genetic effects on old-age cognitive functioning: a population-based study. Psychol Aging. 2013;28:262-74.\nArticle\nPubMed\nGoogle Scholar\n13. Lezak MD, Howieson DB, Loring DW, Hannay HJ, Fischer JS. Neuropsychological assessment. 4th ed. New York: Oxford University Press; 2004.\nGoogle Scholar", "doc_items_refs": ["#/texts/392", "#/texts/393", "#/texts/394", "#/texts/395", "#/texts/396", "#/texts/397"], "page_nos": [], "uuid": "e64a6ee0-f2d6-4f16-8a7a-5e1d403a0edd"}
{"doc_id": "2025__Olfactory_dysfunction_increases_progression_to_dementia_in_cognitively_impaired___W4410804130", "source_path": "<redacted:source_path>", "chunk_id": 20, "source_chunk_idxs": [28], "num_tokens": 473, "text": "Olfactory dysfunction increases progression to dementia in cognitively impaired older adults: a 12-year population-based study\nReferences\n14. Vandenberg SG, Kuse AR. Mental rotations, a group test of three-dimensional spatial visualization. Percept Mot Skills. 1978;47:599-604.\nArticle\nPubMed\nCAS\nGoogle Scholar\n15. Rehnman J, Herlitz A. Higher face recognition ability in girls: magnified by own-sex and own-ethnicity bias. Mem. 2006;14:289-96.\nGoogle Scholar\n16. Zazzo R. Test Des Deux Barrages. Actualités Pedagogiques Et Psychologiques. Neuchâtel, Switzerland: Delachaux et Nestlé. 1974.\n17. Salthouse TA, Kersten AW. Decomposing adult age differences in symbol arithmetic. Mem Cogn. 1993;21:699-710.\nArticle\nCAS\nGoogle Scholar\n18. Payton NM, Marseglia A, Grande G, Fratiglioni L, Kivipelto M, Bäckman L, Laukka EJ. Trajectories of cognitive decline and dementia development: a 12-year longitudinal study. Alzheimers Dement Alzheimers Dement. 2022;19:857-67.\nArticle\nPubMed\nGoogle Scholar\n19. Folstein MF, Folstein SE, McHugh PR. \"Mini-mental state\". A practical method for grading the cognitive state of patients for the clinician. J Psychiatr Res. 1975;12:189-98.\nArticle\nPubMed\nCAS\nGoogle Scholar\n20. Manos PJ, Wu R. The ten point clock test: a quick screen and grading method for cognitive impairment in medical and surgical patients. Int J Psychiatry Med. 1994;24:229-44.\nArticle\nPubMed\nCAS\nGoogle Scholar\n21. Wechsler, D. WAIS-R: Wechsler adult intelligence scale-revised. N.Y.C., N.Y., U.S.: Harcourt Brace Jovanovich for Psychological Corporation. 1981.\n22. Stone VE, Baron-Cohen S, Knight RT. Frontal lobe contributions to theory of mind. J Cogn Neurosci. 1998;10:640-56.\nArticle\nPubMed\nCAS\nGoogle Scholar", "doc_items_refs": ["#/texts/398", "#/texts/399", "#/texts/400", "#/texts/401", "#/texts/402", "#/texts/403", "#/texts/404", "#/texts/405", "#/texts/406"], "page_nos": [], "uuid": "6ba58970-71c3-4fbd-ab17-22ba695b4028"}
{"doc_id": "2025__Olfactory_dysfunction_increases_progression_to_dementia_in_cognitively_impaired___W4410804130", "source_path": "<redacted:source_path>", "chunk_id": 21, "source_chunk_idxs": [29], "num_tokens": 478, "text": "Olfactory dysfunction increases progression to dementia in cognitively impaired older adults: a 12-year population-based study\nReferences\n23. Grande G, Valletta M, Rizzuto D, et al. Blood-based biomarkers of Alzheimer's disease and incident dementia in the community. Nat Med. 2025.\nhttps://doi.org/10.1038/s41591-025-03605-x\n.\nArticle\nPubMed\nGoogle Scholar\n24. Croy I, Zehner C, Larsson M, Zucco GM, Hummel T. Test-retest reliability and validity of the Sniffin' TOM odor memory test. Chem Senses. 2015;40:173-9.\nArticle\nPubMed\nGoogle Scholar\n25. Larsson M, Hedner M, Papenberg G, Seubert J, Bäckman L, Laukka EJ. Olfactory memory in the old and very old: relations to episodic and semantic memory and APOE genotype. Neurobiol Aging. 2016;38:118-26.\nArticle\nPubMed\nCAS\nGoogle Scholar\n26. Kobal G, Klimek L, Wolfensberger M, Gudziol H, Temmel A, Owen CM, Seeber H, Pauli E, Hummel T. Multicenter investigation of 1,036 subjects using a standardized method for the assessment of olfactory function combining tests of odor identification, odor discrimination, and olfactory thresholds. Eur Arch Otorhinolaryngol. 2000;257:205-11.\nArticle\nPubMed\nCAS\nGoogle Scholar\n27. Hummel T, Kobal G, Gudziol H, Mackay-Sim A. Normative data for the \"Sniffin' Sticks\" including tests of odor identification, odor discrimination, and olfactory thresholds: an upgrade based on a group of more than 3,000 subjects. Eur Arch Otorhinolaryngol. 2007;264:237-43.\nArticle\nPubMed\nCAS\nGoogle Scholar\n28. Oleszkiewicz A, Schriever VA, Croy I, Hähner A, Hummel T. Updated Sniffin' Sticks normative data based on an extended sample of 9139 subjects. Eur Arch Otorhinolaryngol. 2019;276:719-28.\nArticle\nPubMed\nCAS\nGoogle Scholar", "doc_items_refs": ["#/texts/407", "#/texts/408", "#/texts/409", "#/texts/410", "#/texts/411", "#/texts/412"], "page_nos": [], "uuid": "0ef99df6-ce88-447e-9019-18e6ad82ce6d"}
{"doc_id": "2025__Olfactory_dysfunction_increases_progression_to_dementia_in_cognitively_impaired___W4410804130", "source_path": "<redacted:source_path>", "chunk_id": 22, "source_chunk_idxs": [30], "num_tokens": 509, "text": "Olfactory dysfunction increases progression to dementia in cognitively impaired older adults: a 12-year population-based study\nReferences\n29. Shang Y, Fratiglioni L, Marseglia A, Plym A, Welmer A-K, Wang H-X, Wang R, Xu W. Association of diabetes with stroke and post-stroke dementia: a population-based cohort study. Alzheimers Dement. 2020;16:1003-12.\nArticle\nPubMed\nGoogle Scholar\n30. Lu Tian DZ, Wei LJ. On the Cox model with time-varying regression coefficients. J Am Stat Assoc. 2005;100:172-83.\nArticle\nGoogle Scholar\n31. Andersen PK, Geskus RB, de Witte T, Putter H. Competing risks in epidemiology: possibilities and pitfalls. Int J Epidemiol. 2012;41:861-70.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n32. Bottai M, Orsini N. A command for Laplace regression. Stata J. 2013;13:302-14.\nArticle\nGoogle Scholar\n33. Machado-Fragua MD, Dugravot A, Dumurgier J, Kivimaki M, Sommerlad A, Landré B, Fayosse A, Sabia S, Singh-Manoux A. Comparison of the predictive accuracy of multiple definitions of cognitive impairment for incident dementia: a 20-year follow-up of the Whitehall II cohort study. Lancet Healthy Longev. 2021;2:e407-16.\nhttps://doi.org/10.1016/S2666-7568(21)00117-3\n.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n34. Stanciu I, Larsson M, Nordin S, Adolfsson R, Nilsson L-G, Olofsson JK. Olfactory impairment and subjective olfactory complaints independently predict conversion to dementia: a longitudinal, population-based study. J Int Neuropsychol Soc. 2014;20:209-17.\nArticle\nPubMed\nGoogle Scholar\n35. Yaffe K, Freimer D, Chen H, Asao K, Rosso A, Rubin S, Tranah G, Cummings S, Simonsick E. Olfaction and risk of dementia in a biracial cohort of older adults. Neurology. 2017;88:456-62.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/413", "#/texts/414", "#/texts/415", "#/texts/416", "#/texts/417", "#/texts/418", "#/texts/419"], "page_nos": [], "uuid": "004330f6-2acb-4140-af04-9ab30ae474e6"}
{"doc_id": "2025__Olfactory_dysfunction_increases_progression_to_dementia_in_cognitively_impaired___W4410804130", "source_path": "<redacted:source_path>", "chunk_id": 23, "source_chunk_idxs": [31], "num_tokens": 475, "text": "Olfactory dysfunction increases progression to dementia in cognitively impaired older adults: a 12-year population-based study\nReferences\n36. Conti MZ, Vicini-Chilovi B, Riva M, Zanetti M, Liberini P, Padovani A, Rozzini L. Odor identification deficit predicts clinical conversion from mild cognitive impairment to dementia due to Alzheimer's disease. Arch Clin Neuropsychol. 2013;28:391-9.\nArticle\nPubMed\nGoogle Scholar\n37. Woodward MR, Amrutkar CV, Shah HC, Benedict RHB, Rajakrishnan S, Doody RS, Yan L, Szigeti K. Validation of olfactory deficit as a biomarker of Alzheimer disease. Neurol Clin Pract. 2017;7:5-14.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n38. Hunderfund AL, Roberts RO, Slusser TC, Leibson CL, Geda YE, Ivnik RJ, Tangalos EG, Petersen RC. Mortality in amnestic mild cognitive impairment: a prospective community study. Neurology. 2006;67:1764-8.\nArticle\nPubMed\nCAS\nGoogle Scholar\n39. Ekström I, Sjölund S, Nordin S, Nordin Adolfsson A, Adolfsson R, Nilsson L-G, Larsson M, Olofsson JK. Smell loss predicts mortality risk regardless of dementia conversion. J Am Geriatr Soc. 2017;65:1238-43.\nArticle\nPubMed\nGoogle Scholar\n40. Ruane R, Lampert O, Larsson M, Vetrano DL, Laukka EJ, Ekström I. Olfactory deficits and mortality in older adults. JAMA Otolaryngol Head Neck Surg. 2025.\nhttps://doi.org/10.1001/jamaoto.2025.0174\n.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n41. Graves AB, Bowen JD, Rajaram L, McCormick WC, McCurry SM, Schellenberg GD, Larson EB. Impaired olfaction as a marker for cognitive decline: interaction with apolipoprotein E ε4 status. Neurology. 1999;53:1480-7.\nArticle\nPubMed\nCAS\nGoogle Scholar", "doc_items_refs": ["#/texts/420", "#/texts/421", "#/texts/422", "#/texts/423", "#/texts/424", "#/texts/425"], "page_nos": [], "uuid": "7d0c3a39-6935-4c43-b02e-ab80dddfb9d8"}
{"doc_id": "2025__Olfactory_dysfunction_increases_progression_to_dementia_in_cognitively_impaired___W4410804130", "source_path": "<redacted:source_path>", "chunk_id": 24, "source_chunk_idxs": [32], "num_tokens": 429, "text": "Olfactory dysfunction increases progression to dementia in cognitively impaired older adults: a 12-year population-based study\nReferences\n42. Schubert CR, Carmichael LL, Murphy C, Klein BEK, Klein R, Cruickshanks KJ. Olfaction and the 5-year incidence of cognitive impairment in an epidemiological study of older adults. J Am Geriatr Soc. 2008;56:1517-21.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n43. Guo J, Dove A, Wang J, Laukka EJ, Ekström I, Dunk MM, Bennett DA, Xu W. Trajectories of olfactory identification preceding incident mild cognitive impairment and dementia: a longitudinal study. eBioMedicine. 2023.\nhttps://doi.org/10.1016/j.ebiom.2023.104862\n.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n44. Tian Q, An Y, Kitner-Triolo MH, Davatzikos C, Studenski SA, Ferrucci L, Resnick SM. Associations of olfaction with longitudinal trajectories of brain volumes and neuropsychological function in older adults. Neurology. 2023;100:e964-74.\nhttps://doi.org/10.1212/WNL.00000000002016\n.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n45. Larsson M, Finkel D, Pedersen NL. Odor identification: influences of age, gender, cognition, and personality. J Gerontol B Psychol Sci Soc Sci. 2000;55:304-10.\nArticle\nGoogle Scholar\n46. Jobin B, Roy-Côté F, Frasnelli J, Boller B. Olfaction and declarative memory in aging: a meta-analysis. Chem Senses. 2023;48:bjad045.\nhttps://doi.org/10.1093/chemse/bjad045\n.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\nDownload references", "doc_items_refs": ["#/texts/426", "#/texts/427", "#/texts/428", "#/texts/429", "#/texts/430", "#/texts/431"], "page_nos": [], "uuid": "1a26f116-1f3e-4320-96ca-6b23021bb714"}
{"doc_id": "2025__Olfactory_dysfunction_increases_progression_to_dementia_in_cognitively_impaired___W4410804130", "source_path": "<redacted:source_path>", "chunk_id": 25, "source_chunk_idxs": [33, 34, 35], "num_tokens": 408, "text": "Olfactory dysfunction increases progression to dementia in cognitively impaired older adults: a 12-year population-based study\nAcknowledgements\nThe authors thank the participants as well as all staff involved in the data collection and management of the SNAC-K study.\n\nOlfactory dysfunction increases progression to dementia in cognitively impaired older adults: a 12-year population-based study\nFunding\nOpen access funding provided by Karolinska Institute. The SNACK data collection is financially supported by the Swedish Ministry of Health and Social Affairs, the participating County Councils and Municipalities, and the Swedish Research Council (current grant: 2021-00178). This work was further funded by a grant from the Foundation for Geriatric Diseases at Karolinska Institutet to J.O. (2024-02121) and grants from the Swedish Research Council to E.L. (2020-01030, 2024-00721).\n\nOlfactory dysfunction increases progression to dementia in cognitively impaired older adults: a 12-year population-based study\nAuthor information\nAuthors and Affiliations\n1. Aging Research Center, Department of Neurobiology, Care Sciences and Society, Karolinska Institutet and Stockholm University, Stockholm, Sweden Javier Oltra, Ingrid Ekström, Jane Yan, Giulia Grande &amp; Erika J. Laukka\n2. Gösta Ekman Laboratory, Department of Psychology, Stockholm University, Stockholm, Sweden Maria Larsson\n3. Stockholm Gerontology Research Center, Stockholm, Sweden Giulia Grande &amp; Erika J. Laukka\nAuthors\n1. Javier Oltra\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n2. Ingrid Ekström\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n3. Maria Larsson\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n4. Jane Yan\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n5. Giulia Grande\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n6. Erika J. Laukka\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/433", "#/texts/435", "#/texts/438", "#/texts/439", "#/texts/440", "#/texts/441", "#/texts/442", "#/texts/443", "#/texts/444", "#/texts/445", "#/texts/446", "#/texts/447"], "page_nos": [], "uuid": "d6b5ee77-96cd-4f1d-ac88-fc23fe02d9e5"}
{"doc_id": "2025__Olfactory_dysfunction_increases_progression_to_dementia_in_cognitively_impaired___W4410804130", "source_path": "<redacted:source_path>", "chunk_id": 26, "source_chunk_idxs": [36, 37, 38, 39], "num_tokens": 301, "text": "Olfactory dysfunction increases progression to dementia in cognitively impaired older adults: a 12-year population-based study\nAuthor information\nContributions\nJ.O. and E.L. contributed to the conceptualization. I.E., M.L., G.G., and E.L. contributed to the investigation. J.O., I.E., M.L., J.Y., G.G., and E.L. contributed to the methodology. J.O. contributed to the formal analysis. E.L. contributed to the resources. J.O. contributed to the writing-original draft. J.O., I.E., M.L., J.Y., G.G., and E.L. contributed to the writing-review and editing. J.O. contributed to the visualization. E.L. contributed to the supervision.\n\nOlfactory dysfunction increases progression to dementia in cognitively impaired older adults: a 12-year population-based study\nAuthor information\nCorresponding author\nCorrespondence to\nJavier Oltra\n.\n\nOlfactory dysfunction increases progression to dementia in cognitively impaired older adults: a 12-year population-based study\nEthics declarations\nCompeting interests\nThe authors declare no competing interests.\n\nOlfactory dysfunction increases progression to dementia in cognitively impaired older adults: a 12-year population-based study\nAdditional information\nPublisher's Note\nSpringer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations.", "doc_items_refs": ["#/texts/449", "#/texts/451", "#/texts/452", "#/texts/453", "#/texts/456", "#/texts/459"], "page_nos": [], "uuid": "4c1c62de-291a-4439-a66d-d9bbd7fa47f4"}
{"doc_id": "2025__Olfactory_dysfunction_increases_progression_to_dementia_in_cognitively_impaired___W4410804130", "source_path": "<redacted:source_path>", "chunk_id": 27, "source_chunk_idxs": [40, 41, 42], "num_tokens": 292, "text": "Olfactory dysfunction increases progression to dementia in cognitively impaired older adults: a 12-year population-based study\nSupplementary Information\nBelow is the link to the electronic supplementary material.\n\nOlfactory dysfunction increases progression to dementia in cognitively impaired older adults: a 12-year population-based study\nRights and permissions\nThis article is published under an open access license.\nPlease check the 'Copyright Information' section either on this page or in the PDF\nfor details of this license and what re-use is permitted.\nIf your intended use exceeds what is permitted by the license or if\nyou are unable to locate the licence and re-use information,\nplease contact the\nRights and\nPermissions team\n.\n\nOlfactory dysfunction increases progression to dementia in cognitively impaired older adults: a 12-year population-based study\nAbout this article\nCite this article\nOltra, J., Ekström, I., Larsson, M.\net al.\nOlfactory dysfunction increases progression to dementia in cognitively impaired older adults: a 12-year population-based study.\nGeroScience\n(2025). https://doi.org/10.1007/s11357-025-01705-7\nDownload citation\n- Received : 18 March 2025\n- Accepted : 12 May 2025\n- Published : 28 May 2025\n- DOI : https://doi.org/10.1007/s11357-025-01705-7", "doc_items_refs": ["#/texts/461", "#/texts/464", "#/texts/465", "#/texts/466", "#/texts/467", "#/texts/468", "#/texts/469", "#/texts/470", "#/texts/471", "#/texts/472", "#/texts/475", "#/texts/476", "#/texts/477", "#/texts/478", "#/texts/479", "#/texts/480", "#/texts/481", "#/texts/482", "#/texts/483", "#/texts/484"], "page_nos": [], "uuid": "5976e3d7-51c2-4ac8-b863-644309c11080"}
{"doc_id": "2025__Olfactory_dysfunction_increases_progression_to_dementia_in_cognitively_impaired___W4410804130", "source_path": "<redacted:source_path>", "chunk_id": 28, "source_chunk_idxs": [43, 44, 45, 46, 47, 48, 49, 50], "num_tokens": 369, "text": "Olfactory dysfunction increases progression to dementia in cognitively impaired older adults: a 12-year population-based study\nAbout this article\nKeywords\n- Dementia\n- Olfaction\n- Population-based study\n- Preclinical marker\n\nOlfactory dysfunction increases progression to dementia in cognitively impaired older adults: a 12-year population-based study\nAbout this article\nProfiles\n1. Javier Oltra\nView author profile\nUse our pre-submission checklist\nAvoid common mistakes on your manuscript.\nAdvertisement\n\nOlfactory dysfunction increases progression to dementia in cognitively impaired older adults: a 12-year population-based study\nSearch\nSearch by keyword or author\nSearch\n\nOlfactory dysfunction increases progression to dementia in cognitively impaired older adults: a 12-year population-based study\nNavigation\n- Find a journal\n- Publish with us\n- Track your research\n\nOlfactory dysfunction increases progression to dementia in cognitively impaired older adults: a 12-year population-based study\nNavigation\nDiscover content\n- Journals A-Z\n- Books A-Z\n\nOlfactory dysfunction increases progression to dementia in cognitively impaired older adults: a 12-year population-based study\nNavigation\nPublish with us\n- Journal finder\n- Publish your research\n- Language editing\n- Open access publishing\n\nOlfactory dysfunction increases progression to dementia in cognitively impaired older adults: a 12-year population-based study\nNavigation\nProducts and services\n- Our products\n- Librarians\n- Societies\n- Partners and advertisers\n\nOlfactory dysfunction increases progression to dementia in cognitively impaired older adults: a 12-year population-based study\nNavigation\nOur brands\n- Springer\n- Nature Portfolio\n- BMC\n- Palgrave Macmillan\n- Apress\n- Discover\n- Your privacy choices/Manage cookies\n- Your US state privacy rights\n- Accessibility statement\n- Terms and conditions\n- Privacy policy\n- Help and support\n- Legal notice\n- Cancel contracts here\n173.68.96.214\nNot affiliated\nImage Hyperlink.\n© 2025 Springer Nature", "doc_items_refs": ["#/texts/486", "#/texts/487", "#/texts/488", "#/texts/489", "#/texts/491", "#/texts/492", "#/texts/493", "#/texts/494", "#/texts/496", "#/texts/497", "#/texts/499", "#/texts/500", "#/texts/501", "#/texts/503", "#/texts/504", "#/texts/506", "#/texts/507", "#/texts/508", "#/texts/509", "#/texts/511", "#/texts/512", "#/texts/513", "#/texts/514", "#/texts/516", "#/texts/517", "#/texts/518", "#/texts/519", "#/texts/520", "#/texts/521", "#/texts/522", "#/texts/523", "#/texts/524", "#/texts/525", "#/texts/526", "#/texts/527", "#/texts/528", "#/texts/529", "#/texts/530", "#/texts/531", "#/texts/532", "#/texts/533"], "page_nos": [], "uuid": "62108baa-b326-4945-aeeb-f71035f38b5a"}
