{"doc_id": "2025__Communicating_the_risk_of_dementia_a_scoping_review__W4412582631", "source_path": "<redacted:source_path>", "chunk_id": 0, "source_chunk_idxs": [0, 1, 2], "num_tokens": 449, "text": "Communicating the risk of dementia: a scoping review | BMJ Neurology Open\nSkip to main content Intended for healthcare professionals Search\nAdvanced search\nLatest content\nTopic Collections\nArchive\nFor authors\nAbout\nHome\n/\nArchive\n/\nVolume 7, Issue 2\nSystematic review • • Open access\nRequest permissions\nDownload PDF\n\nCommunicating the risk of dementia: a scoping review\nAuthor affiliations\n•\nMaja Swirska\n1\norcid logo\n,\nAxel A S Laurell\n1 2\n,\nEmad Sidhom\n1 2\n,\nDamiano Pizzol\n3\n,\nLee Smith\n4\n,\nBenjamin R Underwood\n1 2\nemail\n... 0 Show all authors\nArticle options\n\nCommunicating the risk of dementia: a scoping review\nAbstract\nBackground\nDementia is a syndrome characterised by progressive cognitive and functional decline arising from a neurodegenerative disease. Genetic testing, imaging and fluid biomarkers mean that levels of risk of dementia diagnosis are becoming frequent and complex. How risk is communicated in this context is an increasingly important topic.\nAims\nThe aim of this scoping review is to map the existing literature regarding the components of risk communication, the factors influencing its outcomes and the guidelines developed to support clinicians in this process.\nMethods\nThis is a systematic scoping review addressing the communication of risk to individuals living with or at risk of dementia, as well as perspectives of family, carers and healthcare professionals.\nResults\n115 articles were identified, including genetic (n=41), amyloid (n=45) and other biomarkers (n=9). Patients expressed a desire to be informed about their risk of developing dementia, listing future planning and participation in clinical research as benefits of disclosure. While risk disclosure did not significantly impact anxiety or depression, it was associated with increased event distress among participants identified as elevated risk. Individuals at high risk frequently overestimated their likelihood of developing dementia. Tools and guidelines that have supported clinicians in risk disclosure emphasised the use of educational materials, clear communication about risk and prognosis, and regular follow-up appointments. Gaps in literature include blood biomarkers, non-Alzheimer's disease dementias and communication to people with cognitive impairment.\nConclusions\nRisk communication is a crucial topic for healthcare professionals, especially since the emergence of novel techniques to predict dementia.\nBack to top", "doc_items_refs": ["#/texts/1", "#/texts/2", "#/texts/3", "#/texts/4", "#/texts/5", "#/texts/6", "#/texts/7", "#/texts/8", "#/texts/9", "#/texts/10", "#/texts/11", "#/texts/12", "#/texts/13", "#/texts/14", "#/texts/15", "#/texts/17", "#/texts/18", "#/texts/19", "#/texts/20", "#/texts/21", "#/texts/22", "#/texts/23", "#/texts/24", "#/texts/25", "#/texts/26", "#/texts/27", "#/texts/28", "#/texts/29", "#/texts/30", "#/texts/31", "#/texts/32", "#/texts/33", "#/texts/34", "#/texts/35", "#/texts/36", "#/texts/37", "#/texts/38", "#/texts/39", "#/texts/41", "#/texts/42", "#/texts/43", "#/texts/44", "#/texts/45", "#/texts/46", "#/texts/47", "#/texts/48", "#/texts/49", "#/texts/50", "#/texts/51"], "page_nos": [], "uuid": "9cb0611f-5a53-452b-a3cb-c482c6f8d686"}
{"doc_id": "2025__Communicating_the_risk_of_dementia_a_scoping_review__W4412582631", "source_path": "<redacted:source_path>", "chunk_id": 1, "source_chunk_idxs": [3, 4, 5], "num_tokens": 213, "text": "Communicating the risk of dementia: a scoping review\nAbstract\nWhat is already known on this topic\n- Risk communication in dementia is an emerging field, with existing reviews focusing on the psychological and behavioural effects of risk disclosure in cognitively unimpaired individuals. However, there is limited research on risk communication in those who suffer from dementia, as well as other outcomes of risk communication on individuals.\n\nCommunicating the risk of dementia: a scoping review\nAbstract\nWhat this study adds\n- This scoping review provides the first comprehensive synthesis of how different types of dementia-related risks are communicated to various populations of participants, including those suffering from dementia and cognitive impairments. It also identifies existing tools and guidelines developed to allow for more effective patient-centred risk communication.\n\nCommunicating the risk of dementia: a scoping review\nAbstract\nHow this study might affect research, practice or policy\n- By mapping available evidence and highlighting literature gaps, this review can inform future research on risk communication, support the integration of risk communication tools into memory clinic practice and guide policy on shared decision-making in dementia care.", "doc_items_refs": ["#/texts/53", "#/texts/55", "#/texts/57"], "page_nos": [], "uuid": "819c3ab6-40cf-4cbf-9da1-f38bf3c3f788"}
{"doc_id": "2025__Communicating_the_risk_of_dementia_a_scoping_review__W4412582631", "source_path": "<redacted:source_path>", "chunk_id": 2, "source_chunk_idxs": [6], "num_tokens": 503, "text": "Communicating the risk of dementia: a scoping review\nIntroduction\nDementia is a syndrome that describes a progressive decline in cognitive and functional ability, commonly secondary to a neurodegenerative disease.\n1\nAbout 55 million people have dementia, with the number estimated to increase to over 139 million by 2050.\n2\nWith an increase in the prevalence of dementia, effective risk communication between clinicians and patients has become an essential component in dementia care. Risk communication is crucial as it informs individuals of the challenges they may face and empowers individuals to make informed choices regarding their future. Conveying complex numerical or statistical information can be challenging to all patients but can prove to be especially difficult to those suffering from dementia, mild cognitive impairment (MCI) or other cognitive deficits.\n3 4\nTherefore, understanding how to easily and accessibly deliver risk information is important to all healthcare professionals.\nThere has been significant progress in the field of dementia research, including the identification of genes which are associated with a higher risk of disease and imaging and fluid biomarkers of pathology.\n5 6\nSome of the most commonly known risk factors for Alzheimer's disease (AD) include\napolipoprotein E\nε4 (\nAPOE\nε4) and build-up of amyloid-beta (Aβ) plaques or neurofibrillary tangles in the brain.\n7 8\nOther genetic factors which cause familial AD are mutations in the\namyloid precursor protein\n(\nAPP\n) gene,\npresenilin 1\n(\nPSEN1\n) gene and the\npresenilin 2\n(\nPSEN2\n) gene.\n9\nAlternatively, structural MRI can be used for detecting brain atrophy prognostic for dementia, and Dopamine Transporter Scan, to support a diagnosis of Parkinson's disease dementia.\n10 11\nMost recently, cerebrospinal fluid (CSF) and blood-based biomarkers (BBMs) offer an accessible approach to early detection, with some markers predicting dementia risk up to 15 years before diagnosis.\n12 13\nKey BBMs, including phosphorylated tau (\neg, p-tau217\n), amyloid-beta (\neg, Aβ40\n), glial fibrillar acidic protein (\nGFAP\n) and neurofilament light are being evaluated as part of a 5-year multisite UK study with hope that these diagnostic and prognostic tools may soon be integrated into routine National Health Service (NHS) dementia clinics.\n14 15", "doc_items_refs": ["#/texts/59", "#/texts/60", "#/texts/61", "#/texts/62", "#/texts/63", "#/texts/64", "#/texts/65", "#/texts/66", "#/texts/67", "#/texts/68", "#/texts/69", "#/texts/70", "#/texts/71", "#/texts/72", "#/texts/73", "#/texts/74", "#/texts/75", "#/texts/76", "#/texts/77", "#/texts/78", "#/texts/79", "#/texts/80", "#/texts/81", "#/texts/82", "#/texts/83", "#/texts/84", "#/texts/85", "#/texts/86", "#/texts/87", "#/texts/88", "#/texts/89", "#/texts/90", "#/texts/91", "#/texts/92", "#/texts/93", "#/texts/94", "#/texts/95", "#/texts/96", "#/texts/97", "#/texts/98", "#/texts/99"], "page_nos": [], "uuid": "6ec79223-458a-496a-bb33-0b5135e168b4"}
{"doc_id": "2025__Communicating_the_risk_of_dementia_a_scoping_review__W4412582631", "source_path": "<redacted:source_path>", "chunk_id": 3, "source_chunk_idxs": [7, 8], "num_tokens": 321, "text": "Communicating the risk of dementia: a scoping review\nIntroduction\nWith the emergence of new diagnostic tools and increasing interest in early detection of dementia, understanding how to effectively communicate risk information is necessary. Previous systematic reviews in this area have focused on the psychological and behavioural impact of risk communication.\n16-20\nThese reviews, such as Bemelmans\net al\n, generally found no significant long-term impact on anxiety or health-related behaviour, though disclosure was associated with short-term event-related distress. While valuable in establishing the relative safety of risk disclosure, these reviews have largely focused on amyloid Positron Emission Tomography (PET) or\nAPOE\ndisclosure in cognitively unimpaired individuals. In contrast, this review provides a broader and up-to-date synthesis of literature, including diverse populations (including those with MCI and dementia) and a wide range of risk types (eg, genetic, biomarker, prognostic) and a specific focus on communication tools and guidelines used to aid in disclosure. To the best of our knowledge, this is the first review that has focused on communication strategies, which will enrich current knowledge that may be applied to real-life clinics.\nBack to top\n\nCommunicating the risk of dementia: a scoping review\nMethods\nA scoping review format was chosen to map and summarise current evidence, to identify areas suitable for future systematic reviews, and to highlight any gaps in the literature to bolster future primary research.\n21\nA protocol for this scoping review is available (\nhttps://osf.io/39pez/\n).", "doc_items_refs": ["#/texts/100", "#/texts/101", "#/texts/102", "#/texts/103", "#/texts/104", "#/texts/105", "#/texts/106", "#/texts/107", "#/texts/109", "#/texts/110", "#/texts/111", "#/texts/112", "#/texts/113"], "page_nos": [], "uuid": "f7edd917-5372-442c-9abc-1bdfb3213508"}
{"doc_id": "2025__Communicating_the_risk_of_dementia_a_scoping_review__W4412582631", "source_path": "<redacted:source_path>", "chunk_id": 4, "source_chunk_idxs": [9, 10, 11], "num_tokens": 266, "text": "Communicating the risk of dementia: a scoping review\nMethods\nDeveloping the search strategy\nThe following search strategy was used: (risk* OR prognos* OR likelihood OR chance) AND (communicat* OR disclos* OR conversation*) AND (dementia OR MCI OR \"cognitive impairment\" OR Alzheimer*) AND (patient* OR people OR person* OR participant*). We conducted the final literature search on 7 November 2024 on EMBASE and MEDLINE (via the OVID platform).\n\nCommunicating the risk of dementia: a scoping review\nMethods\nPaper selection and defining the inclusion criteria\nInclusion criteria\nWe included original research relating to any aspect of communication with people with dementia, people at risk of developing dementia, carers and healthcare professionals. These studies included but were not limited to the emotional impact or behavioural changes following risk disclosure, or communication strategies implemented by clinicians when disclosing prognosis. We included randomised and non-randomised controlled trials, cohort, cross-sectional, qualitative and case-control studies.\n\nCommunicating the risk of dementia: a scoping review\nMethods\nPaper selection and defining the inclusion criteria\nExclusion criteria\nReviews (ie, systematic, scoping, umbrella) and meta-analysis were not included in this scoping review.\nOnly studies published in English were included.", "doc_items_refs": ["#/texts/115", "#/texts/118", "#/texts/120", "#/texts/121"], "page_nos": [], "uuid": "b8839aed-3228-43ab-a18f-71b0b53800f8"}
{"doc_id": "2025__Communicating_the_risk_of_dementia_a_scoping_review__W4412582631", "source_path": "<redacted:source_path>", "chunk_id": 5, "source_chunk_idxs": [12, 13, 14, 15], "num_tokens": 358, "text": "Communicating the risk of dementia: a scoping review\nMethods\nScreening and assessment\nAll identified citations were uploaded onto Rayyan systematic review management platform (\nhttps://www.rayyan.ai/\n). Titles, abstracts and full texts were screened blindly by two independent reviewers (MS and AASL) against the inclusion criteria. A third reviewer (BRU) acted as an arbiter to resolve any conflicts.\nAll references of the included papers were then screened using the software ResearchRabbit (\nhttps://researchrabbitapp.com/\n) to identify relevant articles that might have been missed in the original search.\n\nCommunicating the risk of dementia: a scoping review\nMethods\nCollating the data\nData were extracted by one author (MS). The included studies were categorised into subgroups based on themes that emerged during data extraction according to the type of risk being communicated and grouped by their primary topics and objectives. Data visualisation was done using Microsoft Power BI, Microsoft Excel and R Studio software.\n\nCommunicating the risk of dementia: a scoping review\nMethods\nPatient and public involvement\nThis study did not involve patients or the public.\nBack to top\n\nCommunicating the risk of dementia: a scoping review\nResults\nSearch results\nThe search strategy yielded a total of 5146 articles. 1360 duplicates were removed, resulting in 3787 articles. Following two rounds of the screening process, we identified 103 eligible papers. Following scanning of the reference lists, we identified 12 additional papers (\nfigure 1\n).\n22\nThe final analysis for this scoping review included 115 articles. The summary of the findings for each article is available in\nonline supplemental materials I\n.\nFigure 1\nRequest permissions\nPRISMA flow diagram of study identification process. PRISMA, Preferred Reporting Items for Systematic Reviews and Meta-Analyses.", "doc_items_refs": ["#/texts/123", "#/texts/124", "#/texts/125", "#/texts/126", "#/texts/127", "#/texts/128", "#/texts/130", "#/texts/132", "#/texts/133", "#/texts/136", "#/texts/137", "#/texts/138", "#/texts/139", "#/texts/140", "#/texts/141", "#/texts/142", "#/texts/143", "#/texts/144", "#/texts/145"], "page_nos": [], "uuid": "b3e1f638-00bb-4b75-bb9e-1a7be69e2f0f"}
{"doc_id": "2025__Communicating_the_risk_of_dementia_a_scoping_review__W4412582631", "source_path": "<redacted:source_path>", "chunk_id": 6, "source_chunk_idxs": [16], "num_tokens": 418, "text": "Communicating the risk of dementia: a scoping review\nResults\nCharacteristics of included studies\nThe majority of the studies were conducted in the USA (n=70), followed by the Netherlands (n=14), UK (n=10), Australia (n=6), Belgium (n=3), Switzerland (n=2), Japan (n=2), Germany and Spain (n=2), Germany (n=1), Finland (n=1), Singapore (n=1), Denmark (n=1), Italy (n=1) and Poland (n=1) (\nfigure 2\n).\nFigure 2\nRequest permissions\nMap visualisation of geographical distribution of included studies. The study number is represented by the gradient colour. Generated by Microsoft Power BI.\nThe study designs included: qualitative (n\n=\n29), randomised control trials (n\n=\n25), cross-sectional (n\n=\n22), cohort (n=15), qualitative cohort (n\n=\n5), mixed methods (n\n=\n12), feasibility trials (n\n=\n5), case-control (n\n=\n2) (\nfigure 3\n).\nFigure 3\nRequest permissions\nStudy designs of the 115 included studies. Bar graph showing the number of studies included in the scoping review grouped by study design. Generated by R Studio.\nOut of 115 studies, 65.2% (n=75) included patient perspectives on disclosing risk. 66 studies (57.3%) enrolled adults without cognitive impairment. Other studies included participants with MCI (n=24), subjective cognitive decline (SCD) (n=9) and dementia (n=14). The perspectives of healthcare professionals were explored in 21 studies, and the perspectives of carers were also explored in 21 studies. Of the 115 studies, 65.2% (n=75) articles included predominantly white participants. The majority of articles (77.3%, n=89/115) focused exclusively on the risk of AD dementia.", "doc_items_refs": ["#/texts/147", "#/texts/148", "#/texts/149", "#/texts/150", "#/texts/151", "#/texts/152", "#/texts/153", "#/texts/154", "#/texts/155", "#/texts/156", "#/texts/157", "#/texts/158", "#/texts/159", "#/texts/160", "#/texts/161", "#/texts/162", "#/texts/163", "#/texts/164", "#/texts/165", "#/texts/166", "#/texts/167", "#/texts/168", "#/texts/169", "#/texts/170", "#/texts/171", "#/texts/172", "#/texts/173"], "page_nos": [], "uuid": "6bbe8d3e-2dbe-4ff9-a90f-3666e8dbbb35"}
{"doc_id": "2025__Communicating_the_risk_of_dementia_a_scoping_review__W4412582631", "source_path": "<redacted:source_path>", "chunk_id": 7, "source_chunk_idxs": [17, 18], "num_tokens": 332, "text": "Communicating the risk of dementia: a scoping review\nResults\nTypes of risk\n17 articles focused on general risk communication, which included a combination of brain imaging, family history and neuropsychological tests. 41 studies focused on genetic risk communication, of which 85% focused on\nAPOE\nas a genetic marker for AD. A total of 44 studies focused on amyloid biomarkers: 29 on amyloid PET, 1 on CSF biomarkers and 14 on PET, CSF and BBM. No study exclusively investigated BBM risk communication. Four studies compared risk communication between genetic and amyloid biomarkers. Nine articles discussed other forms of risk communication. Four articles discussed the progression of rapid eye movement (REM) sleep behaviour disorder. Four focused on explaining the risk of daily activities and creating tools that aid clinicians. One study developed a risk assessment for poststroke dementia.\n\nCommunicating the risk of dementia: a scoping review\nResults\nPerspectives on risk communication\nRisk disclosure\nMore than 90% of carer-patient dyads with no or MCI (n=51/57) reported wanting to receive their research results, MRI results,\nAPOE\ngenotype and amyloid PET results.\n23\nPatients and carers often emphasised distinguishing risk from diagnosis and asked for detailed risk levels to be communicated.\n24\nClinicians supported disclosing research results, with analysis of current practices showing from 54% (n=21/39) up to 99% (n=159/160) discussing prognosis but rarely mentioning imaging or genotype results.\n25-28\nSome clinicians avoided discussing risk, advising against further biomarker testing.\n29 30", "doc_items_refs": ["#/texts/175", "#/texts/176", "#/texts/177", "#/texts/180", "#/texts/181", "#/texts/182", "#/texts/183", "#/texts/184", "#/texts/185", "#/texts/186", "#/texts/187", "#/texts/188", "#/texts/189"], "page_nos": [], "uuid": "8ad0b35f-6e84-4194-a4f0-cc2b7390874a"}
{"doc_id": "2025__Communicating_the_risk_of_dementia_a_scoping_review__W4412582631", "source_path": "<redacted:source_path>", "chunk_id": 8, "source_chunk_idxs": [19, 20], "num_tokens": 311, "text": "Communicating the risk of dementia: a scoping review\nResults\nPerspectives on risk communication\nRisk disclosure\nGenetic biomarkers\nMore than 80% of cognitively intact or MCI individuals (n=131/164) unaware of their\nAPOE\nstatus wanted to know their genotype.\n31\nAmong 1312 surveyed participants from the general public, 81% of respondents who did not know their\nAPOE\nstatus were 'somewhat' or 'very' interested in learning it.\n32\nIn a hypothetical genetic risk study, interest in disclosure was highest in a 50% risk scenario, compared with 10% scenarios.\n33\nOnly one study found limited interest in finding out one's risk, as out of 251 at-risk individuals contacted, only 21 (8.4%) proceeded with genetic testing.\n34\n\nCommunicating the risk of dementia: a scoping review\nResults\nPerspectives on risk communication\nRisk disclosure\nAmyloid biomarkers\n55 (55.1%, n=119/216) of cognitively normal participants responded that they would be interested in learning their results regardless of treatment availability, whereas 64.8% (n=140/216) would be interested if there was an effective treatment.\n35\nHigher levels of interest were noted among those with a positive family history of AD and with higher subjective perspectives of their AD risk.\n35\nTransparency about research results was the strongest motivator for participation in AD research that involved CSF biomarkers.\n36\nIn practice, 90% of investigators (n=125/139) reported never disclosing amyloid imaging results to MCI participants.\n37", "doc_items_refs": ["#/texts/191", "#/texts/192", "#/texts/193", "#/texts/194", "#/texts/195", "#/texts/196", "#/texts/197", "#/texts/198", "#/texts/199", "#/texts/200", "#/texts/201", "#/texts/202", "#/texts/204", "#/texts/205", "#/texts/206", "#/texts/207", "#/texts/208", "#/texts/209", "#/texts/210", "#/texts/211"], "page_nos": [], "uuid": "128793e9-1c92-42ec-bc99-fc7033b7f784"}
{"doc_id": "2025__Communicating_the_risk_of_dementia_a_scoping_review__W4412582631", "source_path": "<redacted:source_path>", "chunk_id": 9, "source_chunk_idxs": [21, 22], "num_tokens": 366, "text": "Communicating the risk of dementia: a scoping review\nResults\nPerspectives on risk communication\nRisk disclosure\nOther\nUp to 56.7% idiopathic REM sleep disorder patients (n=46/81) felt that they do not need to be asked for their preferences before initiating discussion about prognostic risk.\n38\nParticipants with idiopathic REM sleep behaviour disorder often felt they were not being informed about the possible progression to dementia, with 35.5% (n=11/31) reporting never being informed.\n39\nThe reason behind this may be that REM sleep behaviour disorder is often diagnosed by respiratory physicians rather than clinicians with a special interest in neurodegenerative disorders.\n\nCommunicating the risk of dementia: a scoping review\nResults\nPerspectives on risk communication\nRisk perception\nThe Risk Evaluation and Education for Alzheimer's Disease (\nREVEA\nL) trials demonstrated that mean baseline perception of personal lifetime AD risk was 53%, which decreased to 43% following disclosure of\nAPOE\ngenotype.\n40\nThis differed significantly from the actual mean estimated and communicated by clinicians of 36.8%.\n40\nε4+individuals were more likely than ε4- individuals and controls to report a higher perceived risk compared with their actual risk, although Marteau\net al\nfound no significant difference in perceived risk between ε4+individuals and controls.\n41 42\nBeyond the REVEAL trials, we found sparse literature regarding risk perception. In the context of amyloid biomarkers, disclosure of PET scan results did not significantly influence perceived risk of developing AD.\n43\nIn other studies, while many participants understood their results, uncertainty regarding their risk remained prevalent.\n44\nIn summary, participants were highly interested in their risk of dementia but were often not told about it. Furthermore, many uncertainties remained in cases when they were told, highlighting the need for improved risk disclosure practices.", "doc_items_refs": ["#/texts/213", "#/texts/214", "#/texts/215", "#/texts/216", "#/texts/217", "#/texts/219", "#/texts/220", "#/texts/221", "#/texts/222", "#/texts/223", "#/texts/224", "#/texts/225", "#/texts/226", "#/texts/227", "#/texts/228", "#/texts/229", "#/texts/230", "#/texts/231", "#/texts/232", "#/texts/233", "#/texts/234", "#/texts/235"], "page_nos": [], "uuid": "9d82b72e-1dae-41d1-9544-9b5771d057d6"}
{"doc_id": "2025__Communicating_the_risk_of_dementia_a_scoping_review__W4412582631", "source_path": "<redacted:source_path>", "chunk_id": 10, "source_chunk_idxs": [23, 24, 25], "num_tokens": 402, "text": "Communicating the risk of dementia: a scoping review\nResults\nPsychological effects of risk communication\nGenetic biomarkers\nSeveral studies found that ε4+individuals experienced higher test-related event distress after risk disclosure compared with ε4− individuals.\n42 45 46\nHowever, most studies found no difference in anxiety or depression in ε4+ and ε4− participants postdisclosure.\n47 48\nε4− individuals were more likely to feel relief postdisclosure compared with ε4+ individuals.\n49\nQualitative interviews reported a range of emotional responses, varying from acceptance to severe psychological distress including suicidal ideation.\n50\n\nCommunicating the risk of dementia: a scoping review\nResults\nPsychological effects of risk communication\nAmyloid biomarkers\nSignificantly higher levels of test-related event distress were observed in amyloid-positive individuals and their caregivers in comparison to amyloid-negative, although some evidence shows these differences decrease with time.\n51-54\nThere was no difference in anxiety and depression in amyloid-positive and negative patients postdisclosure.\n46 51 55\nIn a hypothetical disclosure scenario, 40% (n=133/344) of participants anticipated experiencing adverse emotional effects if their biomarker results were found to be high and several participants would consider suicide.\n56\n\nCommunicating the risk of dementia: a scoping review\nResults\nBehavioural effects of risk communication\nGenetic biomarkers\nThe\nREVEAL\ntrials found that the most common self-reported health changes, postdisclosure, included changing medications or diet.\n57 58\nε4+ individuals reported higher rates of taking dietary supplements, considering insurance changes or healthcare proxies.\n59 60\nMore than two-thirds of the public (n=442) would consider making retirement plans and buying long-term insurance and up to 90.5% (n=4036) would consider adopting a healthier lifestyle if they were found at an increased genetic risk of developing dementia.\n33 61\nHowever, several studies have found that people are reluctant to make lifestyle changes.\n47 62", "doc_items_refs": ["#/texts/238", "#/texts/239", "#/texts/240", "#/texts/241", "#/texts/242", "#/texts/243", "#/texts/244", "#/texts/245", "#/texts/247", "#/texts/248", "#/texts/249", "#/texts/250", "#/texts/251", "#/texts/252", "#/texts/255", "#/texts/256", "#/texts/257", "#/texts/258", "#/texts/259", "#/texts/260", "#/texts/261", "#/texts/262", "#/texts/263", "#/texts/264"], "page_nos": [], "uuid": "af00cab4-ae99-4d4c-8cbe-9b816bb355d8"}
{"doc_id": "2025__Communicating_the_risk_of_dementia_a_scoping_review__W4412582631", "source_path": "<redacted:source_path>", "chunk_id": 11, "source_chunk_idxs": [26, 27], "num_tokens": 299, "text": "Communicating the risk of dementia: a scoping review\nResults\nBehavioural effects of risk communication\nAmyloid biomarkers\nPatients with elevated amyloid were found to be more willing to make changes to their exercise, cognitive health and diet compared with non-elevated amyloid.\n63-65\nHowever, Wang\net al\nindicated no statistical changes in self-reported health-related behaviours between amyloid-positive, amyloid-negative and control participants, but found amyloid-negative participants were significantly less likely to consider long-term care insurance.\n66\nIn summary, risk disclosure is associated with increased event distress, but no significant changes to anxiety and depression. Patients at elevated risk reported high willingness and intention to change health and future behaviour but in reality, often found it difficult, leading to no significant differences between groups.\n\nCommunicating the risk of dementia: a scoping review\nResults\nRecall of results\nGenetic biomarker\n6 weeks postdisclosure, 69%-74% of participants were able to recall their genotype and 83% their number of risk-increasing alleles.\n67 68\nParticipants were less likely to recall their numerical risk of AD.\n68\nAPOE\ngenotype was significantly more accurately recalled by ε4+ than ε4- individuals.\n69\nPatients with SCD were found to have lower recall rates of\nAPOE\ngenotypes compared with cognitively intact participants.\n70\nPerception of memory was adversely affected by prior knowledge of ε4+genotype, but this did not affect recall of results.\n71", "doc_items_refs": ["#/texts/266", "#/texts/267", "#/texts/268", "#/texts/269", "#/texts/270", "#/texts/271", "#/texts/272", "#/texts/275", "#/texts/276", "#/texts/277", "#/texts/278", "#/texts/279", "#/texts/280", "#/texts/281", "#/texts/282", "#/texts/283", "#/texts/284", "#/texts/285", "#/texts/286", "#/texts/287"], "page_nos": [], "uuid": "a94ea06e-c881-49d3-a1df-7fb99c293e66"}
{"doc_id": "2025__Communicating_the_risk_of_dementia_a_scoping_review__W4412582631", "source_path": "<redacted:source_path>", "chunk_id": 12, "source_chunk_idxs": [28, 29, 30], "num_tokens": 384, "text": "Communicating the risk of dementia: a scoping review\nResults\nRecall of results\nAmyloid biomarkers\nRecall of results of amyloid scans in patients with dementia, MCI and their care partners was high (&gt;75% correct).\n72 73\nOf those who incorrectly recalled results, it was more common to recall a negative scan as positive for amyloid, and misunderstandings came from confusion about diagnostic terminology.\n\nCommunicating the risk of dementia: a scoping review\nResults\nAdvantages and disadvantages of risk communication\nAdvantages\nFuture planning was one of the most frequently cited benefits across the studies evaluating the advantages and disadvantages of risk communication.\n23 24 74-76\nOther reasons for wanting to know were general curiosity about one's health, engagement in clinical trials,\n23 74 75 77\nand informing others for potential illness.\n31 73\nClinicians viewed returning results to participants as beneficial when there is medically actionable treatment, and perceived life-planning and informing medical decision-making as the key reasons for disclosing risk.\n28 78\n\nCommunicating the risk of dementia: a scoping review\nResults\nAdvantages and disadvantages of risk communication\nDisadvantages\nOne of the most anticipated disadvantages of risk communication was the emotional impact associated with learning about an increased likelihood of developing dementia. This ranged from 'increased anxiety' to a small number of participants anticipating suicide as a result of increased risk.\n23 24 75\nParticipants, despite denying adverse effect on their own mood, worried about the impact on the well-being of their children or spouses.\n76\nOthers feared that knowing they're at higher risk is pointless when there is no treatment available to support them if they develop the disease.\n79\nIn summary, when risk was communicated to participants, they demonstrated a high rate of recall, particularly for amyloid scans, and reported future planning as the most common reason for wanting to know. However, both participants and clinicians were concerned about the psychological effects of risk communication.", "doc_items_refs": ["#/texts/289", "#/texts/290", "#/texts/291", "#/texts/294", "#/texts/295", "#/texts/296", "#/texts/297", "#/texts/298", "#/texts/299", "#/texts/300", "#/texts/301", "#/texts/303", "#/texts/304", "#/texts/305", "#/texts/306", "#/texts/307", "#/texts/308", "#/texts/309"], "page_nos": [], "uuid": "fb99c98a-7abe-4abe-9851-7d5c5805bf7c"}
{"doc_id": "2025__Communicating_the_risk_of_dementia_a_scoping_review__W4412582631", "source_path": "<redacted:source_path>", "chunk_id": 13, "source_chunk_idxs": [31, 32, 33], "num_tokens": 383, "text": "Communicating the risk of dementia: a scoping review\nResults\nDevelopment of tools to aid in risk communication\nLinks to all the publicly available tools and resources are provided in\ntable 1\n.\nTable 1\nView inline • Open as popup Publicly available tools and links to help clinicians in discussing risk and prognosis of different types of dementia\n\nCommunicating the risk of dementia: a scoping review\nResults\nDevelopment of tools to aid in risk communication\nRecommendations\nGenetic biomarkers\nThe Genetic Testing, Counselling and Disclosure Committee developed a guideline on how to disclose research results.\n80\nThe process contains eight different components, highlighting implications and limitations of genetic testing and the importance of regular follow-ups. Whether this is feasible in real-life practice remains a concern, as it would increase the pressure on the hospital systems and would require a dedicated service for ε4+ individuals.\nAlongside guidelines, condensed genetic protocols were assessed against standard protocols.\n48 81 82\nThis included replacing in-person education sessions with mailed brochures. This significantly reduced session times without influencing comprehension of results, anxiety and depression scores. Telephone disclosure was also found to shorten waiting times and visits, without negatively affecting outcomes.\n83\n\nCommunicating the risk of dementia: a scoping review\nResults\nDevelopment of tools to aid in risk communication\nRecommendations\nAmyloid biomarkers\nThe American Federation for Aging Research and Hartford Foundation reviewed guidelines on how to communicate MCI diagnoses and developed recommendations about amyloid imaging.\n84\nThe recommendations included discussing imaging in person, outlining the benefits, risks and uncertainty before proceeding with the scans.\nAdditionally, protocol scripts for amyloid results were developed by several researchers.\n85-87\nRecommendations included predisclosure and postdisclosure counselling, screening for anxiety and depression. Disclosure of risk was best communicated by trained professionals with clear patient-centred explanations using educational materials. Additionally, virtual disclosure of PET imaging was found to not adversely affect outcomes.\n88", "doc_items_refs": ["#/texts/311", "#/texts/312", "#/texts/313", "#/texts/314", "#/texts/315", "#/texts/318", "#/texts/319", "#/texts/320", "#/texts/321", "#/texts/322", "#/texts/323", "#/texts/324", "#/texts/326", "#/texts/327", "#/texts/328", "#/texts/329", "#/texts/330", "#/texts/331", "#/texts/332"], "page_nos": [], "uuid": "c2588dd7-895a-4ceb-904f-1f7ef6f54a4d"}
{"doc_id": "2025__Communicating_the_risk_of_dementia_a_scoping_review__W4412582631", "source_path": "<redacted:source_path>", "chunk_id": 14, "source_chunk_idxs": [34, 35], "num_tokens": 308, "text": "Communicating the risk of dementia: a scoping review\nResults\nDevelopment of tools to aid in risk communication\nEducational materials\nEducational materials to aid clinicians in risk disclosure were evaluated by many researchers.\n89-95\nDiagnostic reports cocreated with patients, which included different visual ways of depicting risk (eg, smileys, icons), future expectations and personal MRI brain imaging, were found useful by the majority of patients and carers.\n89\nPersonal risk profiles alongside advice on how to lower risk, including visual representations of bar charts and thermometers, were found to be engaging by 70.9% of participants.\n90\nAn educational brochure, which outlined information on the uncertainty of prognosis, benefits and disadvantages of receiving results, was developed to help in disclosing 5-year risk of developing AD.\n91\nWeb-based tools for clinicians in memory clinics evaluated preferences for risk communication and tools for shared decision-making.\n92\nResources for patients suffering from PD included an education booklet for patients and families and a toolkit for healthcare professionals to improve conversations about the risk and management of PD dementia.\n93\n\nCommunicating the risk of dementia: a scoping review\nResults\nDevelopment of tools to aid in risk communication\nDiscussion tools\nRisk assessment tool was developed to predict poststroke dementia, which allowed for earlier diagnosis and better preparation for the future.\n96\nSome discussion tools were developed to facilitate identification of risks in dementia care (eg, cooking, medications), receiving positive feedback from healthcare staff, carers and patients.\n97 98\nBack to top", "doc_items_refs": ["#/texts/334", "#/texts/335", "#/texts/336", "#/texts/337", "#/texts/338", "#/texts/339", "#/texts/340", "#/texts/341", "#/texts/342", "#/texts/343", "#/texts/344", "#/texts/345", "#/texts/347", "#/texts/348", "#/texts/349", "#/texts/350", "#/texts/351"], "page_nos": [], "uuid": "5cd014c3-1c3d-46ec-8d1b-0b01a4d1b315"}
{"doc_id": "2025__Communicating_the_risk_of_dementia_a_scoping_review__W4412582631", "source_path": "<redacted:source_path>", "chunk_id": 15, "source_chunk_idxs": [36], "num_tokens": 318, "text": "Communicating the risk of dementia: a scoping review\nDiscussion\nWe identified 115 studies concerning communication of risk in the context of dementia. A scoping review was chosen to map and summarise evidence on the disclosure of risk in dementia, to identify areas of strength and gaps in the literature. We followed a systematic approach for our methodology, ensuring accurate identification of available sources.\nOur main findings were that risk communication is desired by patients and caregivers but is often not communicated in practice. Participants often feared negative effects of risk disclosure, but there is limited evidence to support this as anxiety and depression remained low among participants. Event distress was higher in participants at elevated risk, but some studies showed this diminishes with time. The reasons behind this discrepancy could be that despite fearfulness of an increased risk, having clarity about one's health condition leads to reduced anxiety. Participants showed high willingness to change health-related behaviour and advanced care plans.\nWe identified several resources to help patient and clinician communication. Participants emphasised the need for clear communication, tailored to individual preferences. This is further supported by analysis of communication in disclosure sessions, revealing patient-centred consultations to have higher levels of satisfaction.\n99 100\nA multimodal approach was recommended to improve comprehension of risk by participants. The use of standardised protocols improved the ability of clinicians to communicate risk effectively. Whether including these tools into clinical practice is feasible remains a concern, as many studies mentioned the need for predisclosure screening and regular follow-up, increasing the pressure on hospitals to deliver additional services.", "doc_items_refs": ["#/texts/353", "#/texts/354", "#/texts/355", "#/texts/356", "#/texts/357"], "page_nos": [], "uuid": "f8fa923c-83e5-4efa-8384-5514dc237811"}
{"doc_id": "2025__Communicating_the_risk_of_dementia_a_scoping_review__W4412582631", "source_path": "<redacted:source_path>", "chunk_id": 16, "source_chunk_idxs": [37], "num_tokens": 254, "text": "Communicating the risk of dementia: a scoping review\nDiscussion\nLimitations\nA scoping review approach introduces certain limitations, including the lack of assessment of bias of included studies, specifically qualitative evidence. Without evaluating the effectiveness of interventions, conclusions may be less reliable. As part of our exclusion criteria, we have omitted grey literature, which means that relevant sources of information, including communication tools, may have been excluded.\nA large proportion of the evidence for genetic biomarkers comes from the\nREVEAL\nseries of trials. Despite the fact that these were randomised controlled trials, providing us with replicable and accurate evidence, relying solely on information from one group limits the generalisability of the results.\nWe have identified an apparent gap of studies in people with dementia and people with non-AD dementia. Frontotemporal dementia (FTD) was specifically discussed in three studies, vascular dementia participants were included in three studies, and progression to dementia from REM sleep disorder only in four. No research was identified that communicated genetic risk (eg\n, C9orf72\n) of non-AD dementia such as FTD, Lewy body, Huntington's disease or vascular dementia. This may reflect a lack of research in some areas or a limitation of our scoping review.", "doc_items_refs": ["#/texts/359", "#/texts/360", "#/texts/361", "#/texts/362", "#/texts/363", "#/texts/364", "#/texts/365"], "page_nos": [], "uuid": "7dc70746-277e-4813-91e4-b71a65e41ec1"}
{"doc_id": "2025__Communicating_the_risk_of_dementia_a_scoping_review__W4412582631", "source_path": "<redacted:source_path>", "chunk_id": 17, "source_chunk_idxs": [38, 39, 40], "num_tokens": 448, "text": "Communicating the risk of dementia: a scoping review\nDiscussion\nRecommendations for research\nWe identified a significant gap in the literature regarding communication of risk of progression to individuals with dementia. Most of the patients referred to memory clinics are people with cognitive or behavioural difficulties rather than healthy individuals, yet little research addresses how prognostic information is conveyed to this population. Effective communication of prognosis, such as the risk of emergency psychiatric admission or the development of behavioural and psychological symptoms of dementia, is an important but insufficiently addressed aspect of research in dementia. We also found a significant geographic and demographic imbalance. Many of the studies included white participants with research concentrated in high-income, western countries, particularly the USA.\nFurthermore, there was a significant gap in BBM and CSF communication as well as non-AD dementia. Despite identifying studies on amyloid PET imaging, BBMs offer alternative diagnostic possibilities and educating patients on the novel diagnostic utility of CSF and BBMs may also impact interest in disclosure and understanding of results. Additionally, the identified research almost exclusively focuses on AD dementia (77.3%, n=89/115). Limited research focuses on Lewy body and PD dementia, vascular dementia and FTD. This highlights a critical need for more research in risk communication in non-AD dementia.\nThe scoping review highlights the potential for systematic reviews in the areas of risk perception and recall of results. Enough quantitative evidence has come into view to allow for an analysis of whether individuals accurately recall their risk and whether they align with their risk perceptions. Future research should focus on factors that may contribute to inaccurate risk perceptions, which would allow clinicians to focus more on particular subgroups of patients who need more education.\nBack to top\n\nCommunicating the risk of dementia: a scoping review\nConclusions\nThe need for dementia risk communication has become increasingly evident with the advancement of diagnostic modalities and biomarkers. Patients and their caregivers need to be informed of their prognosis, allowing them to have a better understanding of their health. Disclosure of results by clinicians can be facilitated by using available tools and guidelines on risk communication.\nBack to top\n\nCommunicating the risk of dementia: a scoping review\nConclusions\nSupplementary files\nSupplementary PDF\nBack to top", "doc_items_refs": ["#/texts/367", "#/texts/368", "#/texts/369", "#/texts/370", "#/texts/372", "#/texts/373", "#/texts/375", "#/texts/376"], "page_nos": [], "uuid": "a03f47de-2df6-47b7-b49e-613ab37150f0"}
{"doc_id": "2025__Communicating_the_risk_of_dementia_a_scoping_review__W4412582631", "source_path": "<redacted:source_path>", "chunk_id": 18, "source_chunk_idxs": [41], "num_tokens": 511, "text": "Communicating the risk of dementia: a scoping review\nConclusions\nFootnotes\n- Contributors: MS wrote the protocol, screened articles, extracted the data, synthesised the data and wrote the paper. AASL screened articles. ES helped synthesise the data. DP helped with conceptualisation. LS helped with conceptualisation and methodology. BRU was responsible for the concept of the paper, screened the articles, revised the paper and protocol. All authors were involved in manuscript preparation. BRU is the guarantor of the study.\n- Funding: BRUs post is generously part funded by a donation from Gnodde Goldman Sachs Gives. All research at the Department of Psychiatry in the University of Cambridge is supported by the NIHR Cambridge Biomedical Research Centre (BRC-1215-20014) and NIHR Applied Research Centre.\n- Disclaimer: The views expressed are those of the author(s) and not necessarily those of the NIHR or the Department of Health and Social Care.\n- Map disclaimer: The inclusion of any map (including the depiction of any boundaries therein), or of any geographic or locational reference, does not imply the expression of any opinion whatsoever on the part of BMJ concerning the legal status of any country, territory, jurisdiction or area or of its authorities. Any such expression remains solely that of the relevant source and is not endorsed by BMJ. Maps are provided without any warranty of any kind, either express or implied.\n- Competing interests: No, there are no competing interests.\n- Provenance and peer review: Not commissioned; externally peer reviewed.\n- Supplemental material: This content has been supplied by the author(s). It has not been vetted by BMJ Publishing Group Limited (BMJ) and may not have been peer-reviewed. Any opinions or recommendations discussed are solely those of the author(s) and are not endorsed by BMJ. BMJ disclaims all liability and responsibility arising from any reliance placed on the content. Where the content includes any translated material, BMJ does not warrant the accuracy and reliability of the translations (including but not limited to local regulations, clinical guidelines, terminology, drug names and drug dosages), and is not responsible for any error and/or omissions arising from translation and adaptation or otherwise.\nData availability statement\nAll data relevant to the study are included in the article or uploaded as supplementary information. Not applicable.\nEthics statements\nPatient consent for publication:\nNot applicable.\nEthics approval:", "doc_items_refs": ["#/texts/378", "#/texts/379", "#/texts/380", "#/texts/381", "#/texts/382", "#/texts/383", "#/texts/384", "#/texts/385", "#/texts/386", "#/texts/387", "#/texts/388", "#/texts/389", "#/texts/390"], "page_nos": [], "uuid": "f585740d-145f-4ee6-b40d-3f8e29c19ed6"}
{"doc_id": "2025__Communicating_the_risk_of_dementia_a_scoping_review__W4412582631", "source_path": "<redacted:source_path>", "chunk_id": 19, "source_chunk_idxs": [42], "num_tokens": 59, "text": "Communicating the risk of dementia: a scoping review\nConclusions\nFootnotes\nNot applicable.\nAcknowledgements\nThe research team would like to acknowledge the contributions of Veronica Phillips and Frankie Marsh, the Assistant Librarians at University of Cambridge Medical Library, who have provided valuable advice when choosing the search strategy.\nBack to top", "doc_items_refs": ["#/texts/391", "#/texts/392", "#/texts/393", "#/texts/394"], "page_nos": [], "uuid": "0147234d-911f-40a9-8819-73dc06c7d365"}
{"doc_id": "2025__Communicating_the_risk_of_dementia_a_scoping_review__W4412582631", "source_path": "<redacted:source_path>", "chunk_id": 20, "source_chunk_idxs": [43], "num_tokens": 454, "text": "Communicating the risk of dementia: a scoping review\nConclusions\nReferences\n1. Alzheimer's Association . What is dementia? Alzheimer's association. Available:\nhere\nGoogle Scholar\n2. Image Hyperlink.\n3. Alzheimer's Society . Facts for the media about dementia. 2024 ; Available:\nhere\nGoogle Scholar\n4. Image Hyperlink.\n5. Cappelletti M , Butterworth B , Kopelman M , et al. Numeracy skills in patients with degenerative disorders and focal brain lesions: a neuropsychological investigation. Neuropsychology 2012 ; 26 : 1-19 .\ndoi:10.1037/a0026328 •\nGoogle Scholar\n6. Image Hyperlink.\n7. Pertl M-T , Benke T , Zamarian L , et al. Do patients with mild cognitive impairment understand numerical health information? J Alzheimers Dis 2014 ; 40 : 531-40 .\ndoi:10.3233/JAD-131895 •\nGoogle Scholar\n8. Image Hyperlink.\n9. National institute on aging . Biomarker research. 2024 ; Available:\nhere\nGoogle Scholar\n10. Image Hyperlink.\n11. Hafiz R , Alajlani L , Ali A , et al. The Latest Advances in the Diagnosis and Treatment of Dementia. Cureus 2023 ; 15 .\ndoi:10.7759/cureus.50522 •\nGoogle Scholar\n12. Image Hyperlink.\n13. Yamazaki Y , Zhao N , Caulfield TR , et al. Apolipoprotein E and Alzheimer disease: pathobiology and targeting strategies. Nat Rev Neurol 2019 ; 15 : 501-18 .\ndoi:10.1038/s41582-019-0228-7 •\nGoogle Scholar\n14. Image Hyperlink.\n15. Chapleau M , Iaccarino L , Soleimani-Meigooni D , et al. The Role of Amyloid PET in Imaging Neurodegenerative Disorders: A Review. J Nucl Med 2022 ; 63 : 13S-19S .\ndoi:10.2967/jnumed.121.263195 •\nGoogle Scholar\n16. Image Hyperlink.", "doc_items_refs": ["#/texts/396", "#/texts/397", "#/texts/398", "#/texts/399", "#/texts/400", "#/texts/401", "#/texts/402", "#/texts/403", "#/texts/404", "#/texts/405", "#/texts/406", "#/texts/407", "#/texts/408", "#/texts/409", "#/texts/410", "#/texts/411"], "page_nos": [], "uuid": "c2050368-b037-45f1-aebd-efd6aa0c2709"}
{"doc_id": "2025__Communicating_the_risk_of_dementia_a_scoping_review__W4412582631", "source_path": "<redacted:source_path>", "chunk_id": 21, "source_chunk_idxs": [44], "num_tokens": 509, "text": "Communicating the risk of dementia: a scoping review\nConclusions\nReferences\n17. Guerreiro RJ , Gustafson DR , Hardy J , et al. The genetic architecture of Alzheimer's disease: beyond APP, PSENs and APOE. Neurobiol Aging 2012 ; 33 : 437-56 .\ndoi:10.1016/j.neurobiolaging.2010.03.025 •\nGoogle Scholar\n18. Image Hyperlink.\n19. McKeith IG , Boeve BF , Dickson DW , et al. Diagnosis and management of dementia with Lewy bodies. Neurology (ECronicon) 2017 ; 89 : 88-100 .\ndoi:10.1212/WNL.0000000000004058 •\nGoogle Scholar\n20. Image Hyperlink.\n21. Živanović M , Aracki Trenkić A , Milošević V , et al. The role of magnetic resonance imaging in the diagnosis and prognosis of dementia. Biomol Biomed 2023 ; 23 : 209-24 .\ndoi:10.17305/bjbms.2022.8085 •\nGoogle Scholar\n22. Image Hyperlink.\n23. Guo Y , You J , Zhang Y , et al. Plasma proteomic profiles predict future dementia in healthy adults. Nat Aging 2024 ; 4 : 247-60 .\ndoi:10.1038/s43587-023-00565-0 •\nGoogle Scholar\n24. Image Hyperlink.\n25. Thijssen EH , La Joie R , Strom A , et al. Plasma phosphorylated tau 217 and phosphorylated tau 181 as biomarkers in Alzheimer's disease and frontotemporal lobar degeneration: a retrospective diagnostic performance study. Lancet Neurol 2021 ; 20 : 739-52 .\ndoi:10.1016/S1474-4422(21)00214-3 •\nGoogle Scholar\n26. Image Hyperlink.\n27. Blennow K , Galasko D , Perneczky R , et al. The potential clinical value of plasma biomarkers in Alzheimer's disease. Alzheimer Dementia 2023 ; 19 : 5805-16 .\ndoi:10.1002/alz.13455 •\nGoogle Scholar\n28. Image Hyperlink.\n29. Alzheimer's Society . Blood biomarker challenge to 'revolutionise' dementia diagnosis. 2024 ; Available:\nhere\nGoogle Scholar", "doc_items_refs": ["#/texts/412", "#/texts/413", "#/texts/414", "#/texts/415", "#/texts/416", "#/texts/417", "#/texts/418", "#/texts/419", "#/texts/420", "#/texts/421", "#/texts/422", "#/texts/423", "#/texts/424"], "page_nos": [], "uuid": "4a9973bb-9b57-4499-b020-c4cd6bdf6135"}
{"doc_id": "2025__Communicating_the_risk_of_dementia_a_scoping_review__W4412582631", "source_path": "<redacted:source_path>", "chunk_id": 22, "source_chunk_idxs": [45], "num_tokens": 493, "text": "Communicating the risk of dementia: a scoping review\nConclusions\nReferences\n30. Image Hyperlink.\n31. Bemelmans SASA , Tromp K , Bunnik EM , et al. Psychological, behavioral and social effects of disclosing Alzheimer's disease biomarkers to research participants: a systematic review. Alzheimers Res Ther 2016 ; 8 .\ndoi:10.1186/s13195-016-0212-z •\nGoogle Scholar\n32. Image Hyperlink.\n33. Kim H , Lingler JH . Disclosure of amyloid PET scan results: A systematic review. Prog Mol Biol Transl Sci 2019 ; 165 : 401-14 .\ndoi:10.1016/bs.pmbts.2019.05.002 •\nGoogle Scholar\n34. Image Hyperlink.\n35. de Wilde A , van Buchem MM , Otten RHJ , et al. Disclosure of amyloid positron emission tomography results to individuals without dementia: a systematic review. Alzheimers Res Ther 2018 ; 10 .\ndoi:10.1186/s13195-018-0398-3 •\nGoogle Scholar\n36. Image Hyperlink.\n37. Couch E , Ashford MT , Zhang W , et al. Psychosocial and Behavioral Outcomes for Persons With Cognitive Impairment and Caregivers Following Amyloid-β PET Scan Disclosure: A Systematic Review. Alzheimer Dis Assoc Disord 2023 ; 37 : 246-58 .\ndoi:10.1097/WAD.0000000000000569 •\nGoogle Scholar\n38. Image Hyperlink.\n39. Erickson CM , Chin NA , Johnson SC , et al. Disclosure of preclinical Alzheimer's disease biomarker results in research and clinical settings: Why, how, and what we still need to know. Alz &amp; Dem Diag Ass &amp; Dis Mo 2021 ; 13 .\ndoi:10.1002/dad2.12150 •\nGoogle Scholar\n40. Image Hyperlink.\n41. Munn Z , Peters MDJ , Stern C , et al. Systematic review or scoping review? Guidance for authors when choosing between a systematic or scoping review approach. BMC Med Res Methodol 2018 ; 18 .\ndoi:10.1186/s12874-018-0611-x •\nGoogle Scholar\n42. Image Hyperlink.", "doc_items_refs": ["#/texts/425", "#/texts/426", "#/texts/427", "#/texts/428", "#/texts/429", "#/texts/430", "#/texts/431", "#/texts/432", "#/texts/433", "#/texts/434", "#/texts/435", "#/texts/436", "#/texts/437"], "page_nos": [], "uuid": "bfea9268-2a79-44f8-b674-9388947dd91d"}
{"doc_id": "2025__Communicating_the_risk_of_dementia_a_scoping_review__W4412582631", "source_path": "<redacted:source_path>", "chunk_id": 23, "source_chunk_idxs": [46], "num_tokens": 457, "text": "Communicating the risk of dementia: a scoping review\nConclusions\nReferences\n43. Page MJ , McKenzie JE , Bossuyt PM , et al. The PRISMA 2020 statement: an updated guideline for reporting systematic reviews. BMJ 2021 ; 372 .\ndoi:10.1136/bmj.n71 •\nGoogle Scholar\n44. Image Hyperlink.\n45. Rahman-Filipiak A , Lesniak M , Sadaghiyani S , et al. Perspectives From Black and White Participants and Care Partners on Return of Amyloid and Tau PET Imaging and Other Research Results. Alzheimer Dis Assoc Disord 2023 ; 37 : 274-81 .\ndoi:10.1097/WAD.0000000000000591 •\nGoogle Scholar\n46. Image Hyperlink.\n47. Milne R , Bunnik E , Diaz A , et al. Perspectives on Communicating Biomarker-Based Assessments of Alzheimer's Disease to Cognitively Healthy Individuals. J Alzheimers Dis 2018 ; 62 : 487-98 .\ndoi:10.3233/JAD-170813 •\nGoogle Scholar\n48. Image Hyperlink.\n49. Kostick K , Pereira S , Brannan C , et al. PSYCHIATRIC GENOMICS RESEARCHERS' PERSPECTIVES ON BEST PRACTICES FOR RETURNING RESULTS TO INDIVIDUAL PARTICIPANTS. Eur Neuropsychopharmacol 2019 ; 29 .\ndoi:10.1016/j.euroneuro.2019.07.062 •\nGoogle Scholar\n50. Image Hyperlink.\n51. Dooley J , Bailey C , Xanthopoulou P , et al. Communication and understanding of mild cognitive impairment diagnoses. Int J Geriat Psychiatry 2020 ; 35 : 662-70 .\ndoi:10.1002/gps.5284 •\nGoogle Scholar\n52. Image Hyperlink.\n53. Hendriksen HMA , van Gils AM , van Harten AC , et al. Communication about diagnosis, prognosis, and prevention in the memory clinic: perspectives of European memory clinic professionals. Alz Res Therapy 2023 ; 15 : 131 .\ndoi:10.1186/s13195-023-01276-9 •\nGoogle Scholar\n54. Image Hyperlink.", "doc_items_refs": ["#/texts/438", "#/texts/439", "#/texts/440", "#/texts/441", "#/texts/442", "#/texts/443", "#/texts/444", "#/texts/445", "#/texts/446", "#/texts/447", "#/texts/448", "#/texts/449"], "page_nos": [], "uuid": "630e3d11-a7ba-4509-aed9-d8637b8463a9"}
{"doc_id": "2025__Communicating_the_risk_of_dementia_a_scoping_review__W4412582631", "source_path": "<redacted:source_path>", "chunk_id": 24, "source_chunk_idxs": [47], "num_tokens": 444, "text": "Communicating the risk of dementia: a scoping review\nConclusions\nReferences\n55. Roberts JS , Ferber R , Blacker D , et al. Disclosure of individual research results at federally funded Alzheimer's Disease Research Centers. Alzheimers Dement (N Y) 2021 ; 7 .\ndoi:10.1002/trc2.12213 •\nGoogle Scholar\n56. Image Hyperlink.\n57. Dooley J , Bass N , McCabe R , et al. How do doctors deliver a diagnosis of dementia in memory clinics? Br J Psychiatry 2018 ; 212 : 239-45 .\ndoi:10.1192/bjp.2017.64 •\nGoogle Scholar\n58. Image Hyperlink.\n59. Visser LNC , van Maurik IS , Bouwman FH , et al. Clinicians' communication with patients receiving a MCI diagnosis: The ABIDE project. PLoS ONE 2020 ; 15 .\ndoi:10.1371/journal.pone.0227282 •\nGoogle Scholar\n60. Image Hyperlink.\n61. Ott BR , Pelosi MA , Tremont G , et al. A Survey of Knowledge and Views Concerning Genetic and Amyloid PET Status Disclosure. Alzheimers Dement (N Y) 2016 ; 2 : 23-9 .\ndoi:10.1016/j.trci.2015.12.001 •\nGoogle Scholar\n62. Image Hyperlink.\n63. Ryan MM , Cox CG , Witbracht M , et al. Using Direct-to-Consumer Genetic Testing Results to Accelerate Alzheimer Disease Clinical Trial Recruitment. Alzheimer Dis Assoc Disord 2021 ; 35 : 141-7 .\ndoi:10.1097/WAD.0000000000000421 •\nGoogle Scholar\n64. Image Hyperlink.\n65. Waterink L , Masselink LA , van der Lee SJ , et al. Interest in genetic susceptibility testing and disclosure of AD dementia risk in cognitively normal adults: a survey study. Alz Res Therapy 2024 ; 16 : 1 .\ndoi:10.1186/s13195-023-01364-w •\nGoogle Scholar\n66. Image Hyperlink.", "doc_items_refs": ["#/texts/450", "#/texts/451", "#/texts/452", "#/texts/453", "#/texts/454", "#/texts/455", "#/texts/456", "#/texts/457", "#/texts/458", "#/texts/459", "#/texts/460", "#/texts/461"], "page_nos": [], "uuid": "1893aaa9-626a-4d0a-aa8c-66806c5f972f"}
{"doc_id": "2025__Communicating_the_risk_of_dementia_a_scoping_review__W4412582631", "source_path": "<redacted:source_path>", "chunk_id": 25, "source_chunk_idxs": [48], "num_tokens": 473, "text": "Communicating the risk of dementia: a scoping review\nConclusions\nReferences\n67. Steinbart EJ , Smith CO , Poorkaj P , et al. Impact of DNA testing for early-onset familial Alzheimer disease and frontotemporal dementia. Arch Neurol 2001 ; 58 : 1828-31 .\ndoi:10.1001/archneur.58.11.1828 •\nGoogle Scholar\n68. Image Hyperlink.\n69. Gooblar J , Roe CM , Selsor NJ , et al. Attitudes of Research Participants and the General Public Regarding Disclosure of Alzheimer Disease Research Results. JAMA Neurol 2015 ; 72 : 1484-90 .\ndoi:10.1001/jamaneurol.2015.2875 •\nGoogle Scholar\n70. Image Hyperlink.\n71. Passmore SR , Longhurst C , Gerbitz A , et al. 'I Want to Know Everything': The Return of Research Results and the Importance of Transparency in the Acceptability of Lumbar Punctures for African American Older Adults. J Alzheimers Dis 2023 ; 95 : 663-75 .\ndoi:10.3233/JAD-230275 •\nGoogle Scholar\n72. Image Hyperlink.\n73. Shulman MB , Harkins K , Green RC , et al. Using AD biomarker research results for clinical care: a survey of ADNI investigators. Neurology (ECronicon) 2013 ; 81 : 1114-21 .\ndoi:10.1212/WNL.0b013e3182a55f4a •\nGoogle Scholar\n74. Image Hyperlink.\n75. Gossard TR , Teigen LN , Yoo S , et al. Patient values and preferences regarding prognostic counseling in isolated REM sleep behavior disorder. Sleep 2023 ; 46 .\ndoi:10.1093/sleep/zsac244 •\nGoogle Scholar\n76. Image Hyperlink.\n77. Pérez-Carbonell L , Simonet C , Chohan H , et al. The Views of Patients with Isolated Rapid Eye Movement Sleep Behavior Disorder on Risk Disclosure. Mov Disord 2023 ; 38 : 1089-93 .\ndoi:10.1002/mds.29403 •\nGoogle Scholar\n78. Image Hyperlink.", "doc_items_refs": ["#/texts/462", "#/texts/463", "#/texts/464", "#/texts/465", "#/texts/466", "#/texts/467", "#/texts/468", "#/texts/469", "#/texts/470", "#/texts/471", "#/texts/472", "#/texts/473"], "page_nos": [], "uuid": "e693776d-15f9-4e5d-91c3-7efa90edc520"}
{"doc_id": "2025__Communicating_the_risk_of_dementia_a_scoping_review__W4412582631", "source_path": "<redacted:source_path>", "chunk_id": 26, "source_chunk_idxs": [49], "num_tokens": 499, "text": "Communicating the risk of dementia: a scoping review\nConclusions\nReferences\n79. Linnenbringer E , Roberts JS , Hiraki S , et al. \"I know what you told me, but this is what I think:\" perceived risk of Alzheimer disease among individuals who accurately recall their genetics-based risk estimate. Genet Med 2010 ; 12 : 219-27 .\ndoi:10.1097/GIM.0b013e3181cef9e1 •\nGoogle Scholar\n80. Image Hyperlink.\n81. Marteau TM , Roberts S , LaRusse S , et al. Predictive Genetic Testing for Alzheimer's Disease: Impact upon Risk Perception. Risk Anal 2005 ; 25 : 397-404 .\ndoi:10.1111/j.1539-6924.2005.00598.x •\nGoogle Scholar\n82. Image Hyperlink.\n83. Green RC , Roberts JS , Cupples LA , et al. Disclosure of APOE genotype for risk of Alzheimer's disease. N Engl J Med 2009 ; 361 : 245-54 .\ndoi:10.1056/NEJMoa0809578 •\nGoogle Scholar\n84. Image Hyperlink.\n85. Lim YY , Maruff P , Getter C , et al. Disclosure of positron emission tomography amyloid imaging results: A preliminary study of safety and tolerability. Alzheimers Dement 2016 ; 12 : 454-8 .\ndoi:10.1016/j.jalz.2015.09.005 •\nGoogle Scholar\n86. Image Hyperlink.\n87. Largent EA , Bhardwaj T , Abera M , et al. Disclosing Genetic Risk of Alzheimer's Disease to Cognitively Unimpaired Older Adults: Findings from the Study of Knowledge and Reactions to APOE Testing (SOKRATES II). J Alzheimers Dis 2021 ; 84 : 1015-28 .\ndoi:10.3233/JAD-210675 •\nGoogle Scholar\n88. Image Hyperlink.\n89. Cassidy MR , Roberts JS , Bird TD , et al. Comparing test-specific distress of susceptibility versus deterministic genetic testing for Alzheimer's disease. Alzheimers Dement 2008 ; 4 : 406-13 .\ndoi:10.1016/j.jalz.2008.04.007 •\nGoogle Scholar\n90. Image Hyperlink.", "doc_items_refs": ["#/texts/474", "#/texts/475", "#/texts/476", "#/texts/477", "#/texts/478", "#/texts/479", "#/texts/480", "#/texts/481", "#/texts/482", "#/texts/483", "#/texts/484", "#/texts/485"], "page_nos": [], "uuid": "067f724d-a7ff-4088-8829-8fbc5e92e97b"}
{"doc_id": "2025__Communicating_the_risk_of_dementia_a_scoping_review__W4412582631", "source_path": "<redacted:source_path>", "chunk_id": 27, "source_chunk_idxs": [50], "num_tokens": 468, "text": "Communicating the risk of dementia: a scoping review\nConclusions\nReferences\n91. Wake T , Tabuchi H , Funaki K , et al. Disclosure of Amyloid Status for Risk of Alzheimer Disease to Cognitively Normal Research Participants With Subjective Cognitive Decline: A Longitudinal Study. Am J Alzheimers Dis Other Demen 2020 ; 35 : 1533317520904551 .\ndoi:10.1177/1533317520904551 •\nGoogle Scholar\n92. Image Hyperlink.\n93. Sng WT , Yeo SN , Lin BX , et al. Impacts of apolipoprotein E disclosure on healthy Asian older adults: a cohort study. Int Psychogeriatr 2019 ; 31 : 1499-507 .\ndoi:10.1017/S1041610218002089 •\nGoogle Scholar\n94. Image Hyperlink.\n95. Green RC , Christensen KD , Cupples LA , et al. A randomized noninferiority trial of condensed protocols for genetic risk disclosure of Alzheimer's disease. Alzheimer's &amp; Dementia 2015 ; 11 : 1222-30 .\ndoi:10.1016/j.jalz.2014.10.014 •\nGoogle Scholar\n96. Image Hyperlink.\n97. Romero LJ , Garry PJ , Schuyler M , et al. Emotional responses to APO E genotype disclosure for Alzheimer disease. J Genet Couns 2005 ; 14 : 141-50 .\ndoi:10.1007/s10897-005-4063-1 •\nGoogle Scholar\n98. Image Hyperlink.\n99. Zallen DT . \"Well, good luck with that\": reactions to learning of increased genetic risk for Alzheimer disease. Genet Med 2018 ; 20 : 1462-7 .\ndoi:10.1038/gim.2018.13 •\nGoogle Scholar\n100. Image Hyperlink.\n101. Lingler JH , Sereika SM , Butters MA , et al. A randomized controlled trial of amyloid positron emission tomography results disclosure in mild cognitive impairment. Alzheimers Dement 2020 ; 16 : 1330-7 .\ndoi:10.1002/alz.12129 •\nGoogle Scholar\n102. Image Hyperlink.", "doc_items_refs": ["#/texts/486", "#/texts/487", "#/texts/488", "#/texts/489", "#/texts/490", "#/texts/491", "#/texts/492", "#/texts/493", "#/texts/494", "#/texts/495", "#/texts/496", "#/texts/497"], "page_nos": [], "uuid": "12201998-101f-42e1-93f8-6dd4d3db840c"}
{"doc_id": "2025__Communicating_the_risk_of_dementia_a_scoping_review__W4412582631", "source_path": "<redacted:source_path>", "chunk_id": 28, "source_chunk_idxs": [51], "num_tokens": 465, "text": "Communicating the risk of dementia: a scoping review\nConclusions\nReferences\n103. Caprioglio C , Ribaldi F , Visser LNC , et al. Analysis of Psychological Symptoms Following Disclosure of Amyloid-Positron Emission Tomography Imaging Results to Adults With Subjective Cognitive Decline. JAMA Netw Open 2023 ; 6 .\ndoi:10.1001/jamanetworkopen.2022.50921 •\nGoogle Scholar\n104. Image Hyperlink.\n105. Grill JD , Raman R , Ernstrom K , et al. Immediate Reactions to Alzheimer Biomarker Disclosure in Cognitively Unimpaired Individuals in a Global Truncated Randomized Trial. Neurol Clin Pract 2024 ; 14 .\ndoi:10.1212/CPJ.0000000000200265 •\nGoogle Scholar\n106. Image Hyperlink.\n107. Clark LR , Erickson CM , Chin NA , et al. Psychosocial implications of learning amyloid PET results in an observational cohort. Alzheimers Dement 2024 ; 20 : 6579-89 .\ndoi:10.1002/alz.14153 •\nGoogle Scholar\n108. Image Hyperlink.\n109. Hendriksen HMA , de Rijke TJ , Fruijtier A , et al. Amyloid PET disclosure in subjective cognitive decline: Patient experiences over time. Alzheimers Dement 2024 ; 20 : 6556-65 .\ndoi:10.1002/alz.14148 •\nGoogle Scholar\n110. Image Hyperlink.\n111. Clark LR , Erickson CM , Jonaitis EM , et al. Anticipated reactions to learning Alzheimer's disease biomarker results. Alz Res Therapy 2022 ; 14 : 85 .\ndoi:10.1186/s13195-022-01027-2 •\nGoogle Scholar\n112. Image Hyperlink.\n113. Chao S , Roberts JS , Marteau TM , et al. Health behavior changes after genetic risk assessment for Alzheimer disease: The REVEAL Study. Alzheimer Dis Assoc Disord 2008 ; 22 : 94-7 .\ndoi:10.1097/WAD.0b013e31815a9dcc •\nGoogle Scholar\n114. Image Hyperlink.", "doc_items_refs": ["#/texts/498", "#/texts/499", "#/texts/500", "#/texts/501", "#/texts/502", "#/texts/503", "#/texts/504", "#/texts/505", "#/texts/506", "#/texts/507", "#/texts/508", "#/texts/509"], "page_nos": [], "uuid": "2f03cf87-9365-4050-bdff-3041dcbe02f1"}
{"doc_id": "2025__Communicating_the_risk_of_dementia_a_scoping_review__W4412582631", "source_path": "<redacted:source_path>", "chunk_id": 29, "source_chunk_idxs": [52], "num_tokens": 486, "text": "Communicating the risk of dementia: a scoping review\nConclusions\nReferences\n115. Fanshawe TR , Prevost AT , Roberts JS , et al. Explaining Behavior Change after Genetic Testing: The Problem of Collinearity between Test Results and Risk Estimates. Genet Test 2008 ; 12 : 381-6 .\ndoi:10.1089/gte.2007.0103 •\nGoogle Scholar\n116. Image Hyperlink.\n117. Popescu DL , Lee AK , Arthur E , et al. APOE Genotype Disclosure Influences Decisions About Future Planning but not Adoption of Healthy Lifestyle Changes in Cognitively Unimpaired Individuals. J Geriatr Psychiatry Neurol 2024 ; 37 : 482-95 .\ndoi:10.1177/08919887241237224 •\nGoogle Scholar\n118. Image Hyperlink.\n119. Vernarelli JA , Roberts JS , Hiraki S , et al. Effect of Alzheimer disease genetic risk disclosure on dietary supplement use. Am J Clin Nutr 2010 ; 91 : 1402-7 .\ndoi:10.3945/ajcn.2009.28981 •\nGoogle Scholar\n120. Image Hyperlink.\n121. Caselli RJ , Langbaum J , Marchant GE , et al. Public perceptions of presymptomatic testing for Alzheimer disease. Mayo Clin Proc 2014 ; 89 : 1389-96 .\ndoi:10.1016/j.mayocp.2014.05.016 •\nGoogle Scholar\n122. Image Hyperlink.\n123. Hietaranta-Luoma H-L , Tringham M , Karjalainen H , et al. A long-term follow-up study on disclosing genetic risk information (APOE) to promote healthy lifestyles in Finland. Lifestyle Genom 2019 ; 11 : 147-54 .\ndoi:10.1159/000500199 •\nGoogle Scholar\n124. Image Hyperlink.\n125. Ketchum FB , Erickson CM , Basche KE , et al. Informing Alzheimer's Biomarker Communication: Concerns and Understanding of Cognitively Unimpaired Adults During Amyloid Results Disclosure. J Prev Alzheimers Dis 2024 ; 11 : 1572-80 .\ndoi:10.14283/jpad.2024.151 •\nGoogle Scholar\n126. Image Hyperlink.", "doc_items_refs": ["#/texts/510", "#/texts/511", "#/texts/512", "#/texts/513", "#/texts/514", "#/texts/515", "#/texts/516", "#/texts/517", "#/texts/518", "#/texts/519", "#/texts/520", "#/texts/521"], "page_nos": [], "uuid": "2b26cbf1-72d1-4858-8efb-2e2b5f3c6e41"}
{"doc_id": "2025__Communicating_the_risk_of_dementia_a_scoping_review__W4412582631", "source_path": "<redacted:source_path>", "chunk_id": 30, "source_chunk_idxs": [53], "num_tokens": 483, "text": "Communicating the risk of dementia: a scoping review\nConclusions\nReferences\n127. Largent EA , Harkins K , van Dyck CH , et al. Cognitively unimpaired adults' reactions to disclosure of amyloid PET scan results. PLoS One 2020 ; 15 .\ndoi:10.1371/journal.pone.0229137 •\nGoogle Scholar\n128. Image Hyperlink.\n129. Largent EA , Abera M , Harkins K , et al. Family members' perspectives on learning cognitively unimpaired older adults' amyloid-β PET scan results. J Am Geriatr Soc 2021 ; 69 : 3203-11 .\ndoi:10.1111/jgs.17362 •\nGoogle Scholar\n130. Image Hyperlink.\n131. Wang Y , Ren D , Roberts JS , et al. Value of Knowing: Health-Related Behavior Changes following Amyloid PET Results Disclosure in Mild Cognitive Impairment. J Prev Alzheimers Dis 2024 ; 11 : 958-65 .\ndoi:10.14283/jpad.2024.50 •\nGoogle Scholar\n132. Image Hyperlink.\n133. Eckert SL , Katzen H , Roberts JS , et al. Recall of disclosed apolipoprotein E genotype and lifetime risk estimate for Alzheimer's disease: the REVEAL Study. Genet Med 2006 ; 8 : 746-51 .\ndoi:10.1097/01.gim.0000250197.44245.a3 •\nGoogle Scholar\n134. Image Hyperlink.\n135. Besser AG , Sanderson SC , Roberts JS , et al. Factors affecting recall of different types of personal genetic information about Alzheimer's disease risk: the REVEAL study. Public Health Genomics 2015 ; 18 : 78-86 .\ndoi:10.1159/000368888 •\nGoogle Scholar\n136. Image Hyperlink.\n137. Alber J , Popescu D , Thompson LI , et al. Safety and Tolerability of APOE Genotyping and Disclosure in Cognitively Normal Volunteers From the Butler Alzheimer's Prevention Registry. J Geriatr Psychiatry Neurol 2022 ; 35 : 293-301 .\ndoi:10.1177/0891988721993575 •\nGoogle Scholar\n138. Image Hyperlink.", "doc_items_refs": ["#/texts/522", "#/texts/523", "#/texts/524", "#/texts/525", "#/texts/526", "#/texts/527", "#/texts/528", "#/texts/529", "#/texts/530", "#/texts/531", "#/texts/532", "#/texts/533"], "page_nos": [], "uuid": "4d8c6fb0-290f-4b09-a4b9-3696eb5cb380"}
{"doc_id": "2025__Communicating_the_risk_of_dementia_a_scoping_review__W4412582631", "source_path": "<redacted:source_path>", "chunk_id": 31, "source_chunk_idxs": [54], "num_tokens": 499, "text": "Communicating the risk of dementia: a scoping review\nConclusions\nReferences\n139. Lee AKW , Collier MK , Thompson LI , et al. The Effects of Subjective Cognitive Decline on APOE Genotype Disclosure in the Butler Hospital Alzheimer's Prevention Registry. J Prev Alzheimers Dis 2023 ; 10 : 152-61 .\ndoi:10.14283/jpad.2023.12 •\nGoogle Scholar\n140. Image Hyperlink.\n141. Lineweaver TT , Bondi MW , Galasko D , et al. Effect of knowledge of APOE genotype on subjective and objective memory performance in healthy older adults. Am J Psychiatry 2014 ; 171 : 201-8 .\ndoi:10.1176/appi.ajp.2013.12121590 •\nGoogle Scholar\n142. Image Hyperlink.\n143. James HJ , Van Houtven CH , Lippmann S , et al. How Accurately Do Patients and Their Care Partners Report Results of Amyloid-β PET Scans for Alzheimer's Disease Assessment? J Alzheimers Dis 2020 ; 74 : 625-36 .\ndoi:10.3233/JAD-190922 •\nGoogle Scholar\n144. Image Hyperlink.\n145. Vanderschaeghe G , Schaeverbeke J , Bruffaerts R , et al. Amnestic MCI patients' experiences after disclosure of their amyloid PET result in a research context. Alzheimers Res Ther 2017 ; 9 .\ndoi:10.1186/s13195-017-0321-3 •\nGoogle Scholar\n146. Image Hyperlink.\n147. Lingler JH , Roberts JS , Kim H , et al. Amyloid positron emission tomography candidates may focus more on benefits than risks of results disclosure. Alzheimers Dement (Amst) 2018 ; 10 : 413-20 .\ndoi:10.1016/j.dadm.2018.05.003 •\nGoogle Scholar\n148. Image Hyperlink.\n149. Marcinkowska A , Bogucki A , Kroemeke A , et al. To know or not to know? Opinions of patients with Parkinson's Disease on disclosing risk of phenoconversion in RBD. Neurol Neurochir Pol 2023 ; 57 : 438-43 .\ndoi:10.5603/pjnns.97758 •\nGoogle Scholar\n150. Image Hyperlink.", "doc_items_refs": ["#/texts/534", "#/texts/535", "#/texts/536", "#/texts/537", "#/texts/538", "#/texts/539", "#/texts/540", "#/texts/541", "#/texts/542", "#/texts/543", "#/texts/544", "#/texts/545"], "page_nos": [], "uuid": "f473dbf8-8ff7-425a-a81a-2c8034e63222"}
{"doc_id": "2025__Communicating_the_risk_of_dementia_a_scoping_review__W4412582631", "source_path": "<redacted:source_path>", "chunk_id": 32, "source_chunk_idxs": [55], "num_tokens": 459, "text": "Communicating the risk of dementia: a scoping review\nConclusions\nReferences\n151. Tibben A , Stevens M , de Wert GM , et al. Preparing for presymptomatic DNA testing for early onset Alzheimer's disease/cerebral haemorrhage and hereditary Pick disease. J Med Genet 1997 ; 34 : 63-72 .\ndoi:10.1136/jmg.34.1.63 •\nGoogle Scholar\n152. Image Hyperlink.\n153. Grill JD , Cox CG , Kremen S , et al. Patient and caregiver reactions to clinical amyloid imaging. Alzheimers Dement 2017 ; 13 : 924-32 .\ndoi:10.1016/j.jalz.2017.01.001 •\nGoogle Scholar\n154. Image Hyperlink.\n155. Teigen LN , Sharp RR , Hirsch JR , et al. Specialist approaches to prognostic counseling in isolated REM sleep behavior disorder. Sleep Med 2021 ; 79 : 107-12 .\ndoi:10.1016/j.sleep.2020.12.014 •\nGoogle Scholar\n156. Image Hyperlink.\n157. Gaugler JE , McCarron HR , Mitchell LL , et al. Perceptions of precision medicine among diverse dementia caregivers and professional providers. Alzheimers Dement (N Y) 2019 ; 5 : 468-74 .\ndoi:10.1016/j.trci.2019.07.005 •\nGoogle Scholar\n158. Image Hyperlink.\n159. Langlois CM , Bradbury A , Wood EM , et al. Alzheimer's Prevention Initiative Generation Program: Development of an APOE genetic counseling and disclosure process in the context of clinical trials. Alzheimers Dement (N Y) 2019 ; 5 : 705-16 .\ndoi:10.1016/j.trci.2019.09.013 •\nGoogle Scholar\n160. Image Hyperlink.\n161. Roberts JS , Chen CA , Uhlmann WR , et al. Effectiveness of a condensed protocol for disclosing APOE genotype and providing risk education for Alzheimer disease. Genet Med 2012 ; 14 : 742-8 .\ndoi:10.1038/gim.2012.37 •\nGoogle Scholar\n162. Image Hyperlink.", "doc_items_refs": ["#/texts/546", "#/texts/547", "#/texts/548", "#/texts/549", "#/texts/550", "#/texts/551", "#/texts/552", "#/texts/553", "#/texts/554", "#/texts/555", "#/texts/556", "#/texts/557"], "page_nos": [], "uuid": "24c3abcb-23ab-4bb4-844c-8c093f046c8c"}
{"doc_id": "2025__Communicating_the_risk_of_dementia_a_scoping_review__W4412582631", "source_path": "<redacted:source_path>", "chunk_id": 33, "source_chunk_idxs": [56], "num_tokens": 455, "text": "Communicating the risk of dementia: a scoping review\nConclusions\nReferences\n163. Mega A , Galluzzi S , Bonvicini C , et al. Genetic counselling and testing for inherited dementia: single-centre evaluation of the consensus Italian DIAfN protocol. Alzheimers Res Ther 2020 ; 12 .\ndoi:10.1186/s13195-020-00720-4 •\nGoogle Scholar\n164. Image Hyperlink.\n165. Christensen KD , Uhlmann WR , Roberts JS , et al. A randomized controlled trial of disclosing genetic risk information for Alzheimer disease via telephone. Genet Med 2018 ; 20 : 132-41 .\ndoi:10.1038/gim.2017.103 •\nGoogle Scholar\n166. Image Hyperlink.\n167. Grill JD , Apostolova LG , Bullain S , et al. Communicating mild cognitive impairment diagnoses with and without amyloid imaging. Alzheimers Res Ther 2017 ; 9 .\ndoi:10.1186/s13195-017-0261-y •\nGoogle Scholar\n168. Image Hyperlink.\n169. Lingler JH , Butters MA , Gentry AL , et al. Development of a Standardized Approach to Disclosing Amyloid Imaging Research Results in Mild Cognitive Impairment. JAD 2016 ; 52 : 17-24 .\ndoi:10.3233/JAD-150985 •\nGoogle Scholar\n170. Image Hyperlink.\n171. Harkins K , Sankar P , Sperling R , et al. Development of a process to disclose amyloid imaging results to cognitively normal older adult research participants. Alzheimers Res Ther 2015 ; 7 .\ndoi:10.1186/s13195-015-0112-7 •\nGoogle Scholar\n172. Image Hyperlink.\n173. Erickson CM , Karlawish J , Grill JD , et al. A Pragmatic, Investigator-Driven Process for Disclosure of Amyloid PET Scan Results to ADNI-4 Research Participants. J Prev Alzheimers Dis 2024 ; 11 : 294-302 .\ndoi:10.14283/jpad.2024.33 •\nGoogle Scholar\n174. Image Hyperlink.", "doc_items_refs": ["#/texts/558", "#/texts/559", "#/texts/560", "#/texts/561", "#/texts/562", "#/texts/563", "#/texts/564", "#/texts/565", "#/texts/566", "#/texts/567", "#/texts/568", "#/texts/569"], "page_nos": [], "uuid": "58b7c2b6-febc-4956-8c4f-aa2dd037d0af"}
{"doc_id": "2025__Communicating_the_risk_of_dementia_a_scoping_review__W4412582631", "source_path": "<redacted:source_path>", "chunk_id": 34, "source_chunk_idxs": [57], "num_tokens": 466, "text": "Communicating the risk of dementia: a scoping review\nConclusions\nReferences\n175. Erickson CM , Chin NA , Rosario HL , et al. Feasibility of virtual Alzheimer's biomarker disclosure: Findings from an observational cohort. Alzheimers Dement (N Y) 2023 ; 9 .\ndoi:10.1002/trc2.12413 •\nGoogle Scholar\n176. Image Hyperlink.\n177. van Gils AM , Visser LNC , Hendriksen HMA , et al. Development and design of a diagnostic report to support communication in dementia: Co-creation with patients and care partners. Alzheimers Dement (Amst) 2022 ; 14 .\ndoi:10.1002/dad2.12333 •\nGoogle Scholar\n178. Image Hyperlink.\n179. Choi I , La Monica H , Naismith SL , et al. Communicating Personal Risk Profiles of Alzheimer's Disease to Older Adults: A Pilot Trial. J Prev Alzheimers Dis 2022 ; 9 : 144-50 .\ndoi:10.14283/jpad.2021.34 •\nGoogle Scholar\n180. Image Hyperlink.\n181. Mozersky J , Hartz S , Linnenbringer E , et al. Communicating 5-Year Risk of Alzheimer's Disease Dementia: Development and Evaluation of Materials that Incorporate Multiple Genetic and Biomarker Research Results. J Alzheimers Dis 2021 ; 79 : 559-72 .\ndoi:10.3233/JAD-200993 •\nGoogle Scholar\n182. Image Hyperlink.\n183. van Maurik IS , Visser LN , Pel-Littel RE , et al. Development and Usability of ADappt: Web-Based Tool to Support Clinicians, Patients, and Caregivers in the Diagnosis of Mild Cognitive Impairment and Alzheimer Disease. JMIR Form Res 2019 ; 3 .\ndoi:10.2196/13417 •\nGoogle Scholar\n184. Image Hyperlink.\n185. Dobreva I , Thomas J , Marr A , et al. Improving Conversations about Parkinson's Dementia. Mov Disord Clin Pract 2024 ; 11 : 814-24 .\ndoi:10.1002/mdc3.14054 •\nGoogle Scholar\n186. Image Hyperlink.", "doc_items_refs": ["#/texts/570", "#/texts/571", "#/texts/572", "#/texts/573", "#/texts/574", "#/texts/575", "#/texts/576", "#/texts/577", "#/texts/578", "#/texts/579", "#/texts/580", "#/texts/581"], "page_nos": [], "uuid": "f0fc437a-2371-4e7d-bc5e-4959a9a10879"}
{"doc_id": "2025__Communicating_the_risk_of_dementia_a_scoping_review__W4412582631", "source_path": "<redacted:source_path>", "chunk_id": 35, "source_chunk_idxs": [58], "num_tokens": 502, "text": "Communicating the risk of dementia: a scoping review\nConclusions\nReferences\n187. Schwegler C , Schmitz-Luhn B , Romotzky V , et al. Predementia counseling: informed decision-making and postcounseling reflection. GeroPsych (Bern) 2023 ; 36 : 203-14 .\ndoi:10.1024/1662-9647/a000313 •\nGoogle Scholar\n188. Image Hyperlink.\n189. Ketchum FB , Erickson CM , Basche KE , et al. Informing Disclosure: Efficacy of a Brief Educational Intervention on Research Participants' Knowledge about Alzheimer's Disease Biomarkers. J Alzheimers Dis 2023 ; 96 : 515-22 .\ndoi:10.3233/JAD-230732 •\nGoogle Scholar\n190. Image Hyperlink.\n191. Tang E , Exley C , Price C , et al. The views of public and clinician stakeholders on risk assessment tools for post-stroke dementia: a qualitative study. BMJ Open 2019 ; 9 .\ndoi:10.1136/bmjopen-2018-025586 •\nGoogle Scholar\n192. Image Hyperlink.\n193. Goeman DP , Dickins M , Iliffe S , et al. Development of a discussion tool to enable well-being by providing choices for people with dementia: a qualitative study incorporating codesign and participatory action research. BMJ Open 2017 ; 7 .\ndoi:10.1136/bmjopen-2017-017672 •\nGoogle Scholar\n194. Image Hyperlink.\n195. Meyer C , Dickins M , O'Keefe F , et al. Risk Negotiation With People With Dementia: From Co-designed Paper Version to Implementation Preparation of an Electronic Conversation Tool. Gerontol Geriatr Med 2023 ; 9 : 23337214221149772 .\ndoi:10.1177/23337214221149772 •\nGoogle Scholar\n196. Image Hyperlink.\n197. Guan Y , Roter DL , Erby LH , et al. Communication Predictors of Patient and Companion Satisfaction with Alzheimer's Genetic Risk Disclosure. J Health Commun 2018 ; 23 : 807-14 .\ndoi:10.1080/10810730.2018.1528319 •\nGoogle Scholar\n198. Image Hyperlink.", "doc_items_refs": ["#/texts/582", "#/texts/583", "#/texts/584", "#/texts/585", "#/texts/586", "#/texts/587", "#/texts/588", "#/texts/589", "#/texts/590", "#/texts/591", "#/texts/592", "#/texts/593"], "page_nos": [], "uuid": "fc6104c5-840c-40ff-a09e-38d14f9d9107"}
{"doc_id": "2025__Communicating_the_risk_of_dementia_a_scoping_review__W4412582631", "source_path": "<redacted:source_path>", "chunk_id": 36, "source_chunk_idxs": [59, 60, 61, 62, 63], "num_tokens": 423, "text": "Communicating the risk of dementia: a scoping review\nConclusions\nReferences\n199. Guan Y , Roter DL , Erby LH , et al. Disclosing genetic risk of Alzheimer's disease to cognitively impaired patients and visit companions: Findings from the REVEAL Study. Patient Educ Couns 2017 ; 100 : 927-35 .\ndoi:10.1016/j.pec.2016.12.005 •\nGoogle Scholar\n200. Image Hyperlink.\nBack to top\n\nCommunicating the risk of dementia: a scoping review\nConclusions\nPublication history\n- Received :\n3 April 2025\n- Accepted :\n19 June 2025\n- First published :\n22 July 2025\nBack to top\n\nCommunicating the risk of dementia: a scoping review\nConclusions\nAltmetric\nAltmetric scores reflect online attention articles receive, shown as a central number with coloured threads for each source\n\nCommunicating the risk of dementia: a scoping review\nConclusions\nDimensions\nDimensions shows where and when an article has been cited, helping readers understand its academic influence over time\nBack to top\n\nCommunicating the risk of dementia: a scoping review\nConclusions\nResponses\nCompose a response to this article Back to top\nOverview\n- Abstract\n- Introduction\n- Methods\n- Results\n- Discussion\n- Conclusions\n- References\n- Supplementary files\n- Footnotes\n- Publication history\n- Metrics\n- Responses\nOverview\n- Abstract\n- Introduction\n- Methods\n- Results\n- Discussion\n- Conclusions\n- References\n- Supplementary files\n- Footnotes\n- Publication history\n- Metrics\n- Responses\nCONTENT\n- Latest content\n- Top cited articles\n- Topic Collections\n- Archive\nJOURNAL\n- About\n- Editorial board\n- Editorial policies\n- Sign up for email alerts\nAUTHORS\n- Instructions for authors\n- Submit an article\n- Open Access at BMJ\n- BMJ Author Hub\n- Thank you to our reviewers\nHELP\n- Contact us\n- Reprints\n- Permissions\n- Advertising\n- Feedback form\nWebsite Terms &amp; Conditions\nPrivacy &amp; Cookies\nContact BMJ\nCookie settings\nOnline ISSN: 2632-6140 Copyright © 2025 BMJ Publishing Group Ltd &amp; Australian and New Zealand Association of Neurologists. All rights, including for text and data mining, AI training, and similar technologies, are reserved.", "doc_items_refs": ["#/texts/594", "#/texts/595", "#/texts/596", "#/texts/598", "#/texts/599", "#/texts/600", "#/texts/601", "#/texts/604", "#/texts/606", "#/texts/607", "#/texts/609", "#/texts/610", "#/texts/611", "#/texts/612", "#/texts/613", "#/texts/614", "#/texts/615", "#/texts/616", "#/texts/617", "#/texts/618", "#/texts/619", "#/texts/620", "#/texts/621", "#/texts/622", "#/texts/623", "#/texts/624", "#/texts/625", "#/texts/626", "#/texts/627", "#/texts/628", "#/texts/629", "#/texts/630", "#/texts/631", "#/texts/632", "#/texts/633", "#/texts/634", "#/texts/635", "#/texts/636", "#/texts/637", "#/texts/638", "#/texts/639", "#/texts/640", "#/texts/641", "#/texts/642", "#/texts/643", "#/texts/644", "#/texts/645", "#/texts/646", "#/texts/647", "#/texts/648", "#/texts/649", "#/texts/650", "#/texts/651", "#/texts/652", "#/texts/653", "#/texts/654", "#/texts/655", "#/texts/656", "#/texts/657", "#/texts/658", "#/texts/659", "#/texts/660", "#/texts/661", "#/texts/662"], "page_nos": [], "uuid": "cb328430-85cf-4f09-aff3-b3d27a37535b"}
