{"doc_id": "2025__Neuroimaging_of_affective_symptoms_in_Lewy_body_dementia_A_systematic_review__W4413876650", "source_path": "<redacted:source_path>", "chunk_id": 0, "source_chunk_idxs": [0, 1, 2, 3, 4], "num_tokens": 281, "text": "Neuroimaging of affective symptoms in Lewy body dementia: A systematic review | Research Square\nSign In\nSubmit a Preprint\nCite\nShare\nDownload PDF\nSystematic Review\n\nNeuroimaging of affective symptoms in Lewy body dementia: A systematic review\nNaomi Mullis, Laura M Wright\nThis is a preprint; it has not been peer reviewed by a journal.\nhttps://doi.org/ 10.21203/rs.3.rs-7472898/v1\nThis work is licensed under a CC BY 4.0 License\n\nNeuroimaging of affective symptoms in Lewy body dementia: A systematic review\nStatus:\nPosted\n\nNeuroimaging of affective symptoms in Lewy body dementia: A systematic review\nVersion 1\nposted\nYou are reading this latest preprint version\n\nNeuroimaging of affective symptoms in Lewy body dementia: A systematic review\nBackground\nAffective symptoms, such as depression, anxiety and apathy, are highly prevalent in Lewy body diseases (LBDs), including both Parkinson's disease and dementia with Lewy bodies. Despite their association with cognitive decline, their underlying neuropathological mechanisms, in the context of cognitive impairment, remain poorly understood. This systematic review examines the neural correlates of affective symptoms in cognitively impaired LBD based on anatomical, functional, metabolic and neurotransmitter imaging studies.", "doc_items_refs": ["#/texts/19", "#/texts/20", "#/texts/21", "#/texts/22", "#/texts/23", "#/texts/25", "#/texts/26", "#/texts/27", "#/texts/28", "#/texts/30", "#/texts/32", "#/texts/33", "#/texts/36"], "page_nos": [], "uuid": "002a2ccb-3d06-48e9-8104-21062837d4ef"}
{"doc_id": "2025__Neuroimaging_of_affective_symptoms_in_Lewy_body_dementia_A_systematic_review__W4413876650", "source_path": "<redacted:source_path>", "chunk_id": 1, "source_chunk_idxs": [5, 6, 7, 8], "num_tokens": 344, "text": "Neuroimaging of affective symptoms in Lewy body dementia: A systematic review\nMethods\nLiterature searches conducted using PubMed, PsychINFO and Web of Science, identified eighteen eligible studies, including 785 participants, that included assessments of depression, anxiety or apathy; an acceptable method of neuroimaging; and participants with a diagnosis of LBD and evidence of cognitive impairment. A narrative synthesis of their findings is provided.\n\nNeuroimaging of affective symptoms in Lewy body dementia: A systematic review\nResults\nSignificant heterogeneity in imaging techniques, study protocols and cohort characteristics were identified. Half of the studies did not report significant findings, and only dopaminergic imaging was used by more than one study within the same clinical subgroup. Some evidence highlights involvement of intrinsic brain networks, such as the default mode and salience networks, in affective symptom manifestation. Additionally, two studies found associations between affective symptoms and cholinergic denervation, providing a potential neuropathological connection between neuropsychiatric and cognitive decline in LBD.\n\nNeuroimaging of affective symptoms in Lewy body dementia: A systematic review\nConclusions\nThe paucity of studies, and heterogeneity within them, significantly hinder the development of robust hypotheses regarding the neuropathology of affective symptoms in LBD cognitive impairment. This review therefore emphasises the need for more targeted research to understand these underlying mechanisms to inform future therapeutic strategies.\nNeurology\nPsychiatry\nLewy body dementia\naffective symptoms\nneuroimaging\napathy\ndepression\nanxiety\n\nNeuroimaging of affective symptoms in Lewy body dementia: A systematic review\nFigures\nFigure 1\nFigure 1", "doc_items_refs": ["#/texts/38", "#/texts/40", "#/texts/42", "#/texts/43", "#/texts/44", "#/texts/45", "#/texts/46", "#/texts/47", "#/texts/48", "#/texts/49", "#/texts/50", "#/texts/52", "#/texts/53"], "page_nos": [], "uuid": "a2aa79ca-85d0-4d6b-b005-a40f2f7968e6"}
{"doc_id": "2025__Neuroimaging_of_affective_symptoms_in_Lewy_body_dementia_A_systematic_review__W4413876650", "source_path": "<redacted:source_path>", "chunk_id": 2, "source_chunk_idxs": [9], "num_tokens": 466, "text": "Neuroimaging of affective symptoms in Lewy body dementia: A systematic review\nIntroduction\nLewy body diseases (LBDs), including Parkinson's disease (PD), PD dementia (PDD) and dementia with Lewy bodies (DLB), are the second leading cause of neurodegenerative dementia after Alzheimer's Disease (AD) [ 1 ]. Clinical features of LBDs can include parkinsonian motor symptoms, cognitive decline and neuropsychiatric symptoms such as visual hallucinations, and sleep disorders [ 2 , 3 ]. Alongside core features, LBDs are typically accompanied by a high volume of supportive symptoms that add to clinical complexity. Affective symptoms, namely anxiety, apathy and depression, are common and debilitating supportive features of LBDs [ 4 ]. Such symptoms are highly prevalent in neurodegenerative conditions [ 5 ] and particularly common in PDD and DLB when compared with other dementia subtypes [ 6 - 8 ]. Furthermore, anxiety, apathy and depression in LBD have been identified as some of the primary symptoms associated with reductions in quality of life [ 9 - 13 ] and increases in cognitive decline [ 14 - 19 ], motor symptom severity [ 9 , 20 , 21 ], and caregiver burden [ 22 , 23 ].\nDespite their prevalence, the underlying mechanisms of affective symptoms in LBD remain poorly understood. Moreover, most research examining the neural correlates of neuropsychiatric symptoms in LBD has been conducted primarily in cognitively healthy PD, excluding the cognitively impaired LBD groups that these symptoms most frequently affect [ 24 , 25 ]. This exemption of cognitively impaired cohorts from the literature is of particular significance given the established pathophysiological differences between cognitively healthy PD, at one end of the LBD spectrum, and the dementia syndromes of PDD and DLB at the other, which may include a greater burden of AD co-pathology and a more severe cholinergic degeneration [ 26 - 28 ]. Given the well-established association between affective symptoms and cognitive decline [ 14 - 17 , 19 ], the relative paucity of research in Lewy body dementias (PDD and DLB) represents a distinct gap in the literature.", "doc_items_refs": ["#/texts/55", "#/texts/56"], "page_nos": [], "uuid": "2abc70e7-5af3-455e-b550-a173cf6fef1d"}
{"doc_id": "2025__Neuroimaging_of_affective_symptoms_in_Lewy_body_dementia_A_systematic_review__W4413876650", "source_path": "<redacted:source_path>", "chunk_id": 3, "source_chunk_idxs": [10], "num_tokens": 501, "text": "Neuroimaging of affective symptoms in Lewy body dementia: A systematic review\nIntroduction\nPrevious reviews of neuroimaging studies conducted in cognitively healthy PD have revealed multiple structural and functional brain changes associated with apathy, depression and anxiety [ 24 , 25 , 29 ] and despite a paucity of neuroimaging studies in DLB, neurochemical and neuropathological research has revealed similar associations between affective symptoms and neurotransmission pathways in both PD and DLB [ 30 - 36 ]. In the wider psychiatric literature, affective states related to psychiatric disorders have been postulated to result from specific changes in functional connectivity both within and between intrinsic resting-state networks relating to impairments in neurotransmission, such as those characteristic of LBDs [ 37 ]. Moreover, converging evidence suggesting that certain brain regions, such as the subgenual anterior cingulate cortex, play a significant role in mood disorders [ 38 ], has similarly been reflected in neuroimaging studies of such symptoms in cognitively healthy PD and neuropathological studies of DLB [ 39 - 41 ]. Neural correlates of anxiety and apathy have shown similar convergence across psychiatric and PD literature, suggesting that LBDs may exacerbate mechanisms underlying affective symptoms, resulting in an increased prevalence among these patient groups [ 29 , 42 ]. What remains unclear however, are the specific neuropathological changes contributing to the increased severity and prevalence of affective symptoms in the context of cognitive decline.\nAlthough DLB and PDD are may be considered two clinically distinct entities, the historical debate regarding their nosological distinction is ongoing [ 43 , 44 ]. Both DLB and PDD are underpinned by similar pathophysiological processes [ 45 , 46 ] and clinical profiles [ 3 , 47 ] to the extent that both may be preceded by a prodromal period of mild cognitive impairment (MCI) [ 48 , 49 ]. In clinical practice, a rather arbitrary 'one year rule' defines PDD based on the initial appearance of motor symptoms at least one year prior to cognitive decline, although no symptoms definitively distinguish PDD from DLB at the dementia stages [ 50 ]. The present review therefore examines the PDD and DLB literature in aggregate, including studies of prodromal MCI groups, to synthesise current evidence regarding neural correlates of affective symptoms across the spectrum of Lewy body dementias.", "doc_items_refs": ["#/texts/57", "#/texts/58"], "page_nos": [], "uuid": "fa98dac0-3223-4cab-ad03-89bf342ed491"}
{"doc_id": "2025__Neuroimaging_of_affective_symptoms_in_Lewy_body_dementia_A_systematic_review__W4413876650", "source_path": "<redacted:source_path>", "chunk_id": 4, "source_chunk_idxs": [11, 12], "num_tokens": 352, "text": "Neuroimaging of affective symptoms in Lewy body dementia: A systematic review\nIntroduction\nThe aim of this review is to identify brain regions involved in affective symptoms in Lewy body dementias based on anatomical, functional, metabolic and neurotransmitter imaging studies. Moreover, we aim to provide information on how these neural correlates may differ across symptom type, disease stage and disease subtype. Finally, we aim to inform the methods of prospective neuroimaging studies seeking to investigate the neural basis of affective symptoms in these disease groups.\n\nNeuroimaging of affective symptoms in Lewy body dementia: A systematic review\nMethods\nThe review protocol for the current systematic review was registered in PROSPERO following PRISMA guidelines (PROSPERO ID CRD42024539741) [ 51 ]. The review protocol can be accessed here: https://www.crd.york.ac.uk/PROSPERO/view/CRD42024539741 . Literature searches were conducted in PubMed, PsychINFO and Web of Science Core Collection. The search terms used included terms related to Parkinson's OR Lewy bodies OR synucleinopathies AND cognitive impairment OR cognitive decline OR cognitive complaint OR dementia AND imaging (magnetic resonance imaging, positron emission tomography, single photon emission computed tomography, diffusion tensor imaging etc.) AND apathy OR anxiety OR depression OR affective disorder OR mood disorder. A detailed list of search terms is available in\nTable S1\n. The search was not limited by date so all studies available until the date of the search (15th July 2025) were included. These searches resulted in the identification of 1841 articles.", "doc_items_refs": ["#/texts/59", "#/texts/61", "#/texts/62", "#/texts/63"], "page_nos": [], "uuid": "df5d3beb-eecd-4ca4-88a0-4c1ef7beee80"}
{"doc_id": "2025__Neuroimaging_of_affective_symptoms_in_Lewy_body_dementia_A_systematic_review__W4413876650", "source_path": "<redacted:source_path>", "chunk_id": 5, "source_chunk_idxs": [13], "num_tokens": 394, "text": "Neuroimaging of affective symptoms in Lewy body dementia: A systematic review\nMethods\nFollowing the removal of duplicates, 1315 articles were included in title and abstract screening. Inclusion criteria required that studies must include the following: participants with a diagnosis of LBD (either PD or DLB) with evidence of cognitive impairment; an assessment of anxiety, apathy or depression; any method of neuroimaging with outcomes including grey matter volume, cortical thickness, white matter microstructural integrity, blood-oxygen-level-dependent signal (or network connectivity strength), glucose metabolism or binding-ratio values; a categorical comparison between patients with and without anxiety, apathy or depression on imaging parameters or a correlation of imaging parameters with the severity of the neuropsychiatric symptom as a continuous variable. Exclusion criteria included: foreign language articles for which an English translation was unavailable; review articles reporting no original data; studies focused on diseases other than PD or DLB (including other synucleinopathies); studies that did not include a cognitively impaired participant group or that pooled cognitively unimpaired and impaired groups for imaging analysis; studies that did not utilise standard diagnostic criteria for cognitive impairment or LBD; studies without any assessments of anxiety, apathy or depression; studies without neuroimaging; studies that did not analyse anxiety, apathy or depression in relation to neuroimaging outcomes and studies in which the neuroimaging outcomes were not regionally quantified (e.g., amyloid-positive PET vs amyloid-negative).\nEligibility was determined independently by two researchers (L.W. and N.M.). Any discrepancies were discussed until a consensus could be reached. Following title and abstract screening, 142 articles were sourced for full text screening. Full details of the article screening process can be found in\nFig. 1\n.", "doc_items_refs": ["#/texts/64", "#/texts/65", "#/texts/66", "#/texts/67"], "page_nos": [], "uuid": "f27c2df2-4de7-461f-81db-53158462f115"}
{"doc_id": "2025__Neuroimaging_of_affective_symptoms_in_Lewy_body_dementia_A_systematic_review__W4413876650", "source_path": "<redacted:source_path>", "chunk_id": 6, "source_chunk_idxs": [14, 15], "num_tokens": 505, "text": "Neuroimaging of affective symptoms in Lewy body dementia: A systematic review\nMethods\nData extraction and quality assessment were carried out by two researchers (L.W. and N.M.). A data extraction sheet included manuscript details (authors, title, year of publication and journal), demographic data (sample size, age, gender, disease duration, education, medication, global cognitive function), neuropsychiatric scales and scores and details of neuroimaging (methods, outcome measures and findings). Peak coordinates and effect size measures for regions found to have a significant relationship with affective symptom severity were also collected where possible. Demographic data were recorded in two separate tables for PDD and DLB groups. Similarly, imaging data and results were recorded in two separate tables for PDD and DLB groups.\n\nNeuroimaging of affective symptoms in Lewy body dementia: A systematic review\nResults\nEighteen imaging studies met the inclusion criteria and were included for systematic review. Figure 1 outlines the study selection procedure. Of the studies included, six utilized neurotransmitter/transporter imaging methods [ 36 , 52 - 56 ], four were anatomical MRI studies [ 57 - 60 ], four utilized resting-state functional MRI (fMRI) [ 61 - 64 ], one was a metabolic imaging study [ 65 ], one measured regional cerebral blood flow [ 66 ], one examined amyloid (Aβ) PET [ 67 ] and one utilized diffusion tensor imaging [ 68 ]. Of the studies, seventeen included a measure of depression, eight included a measure of anxiety and seven included a measure of apathy. Combined, the included studies involved 785 participants with Lewy body related cognitive impairment including: DLB or MCI with Lewy bodies (MCI-LB) (n = 492) and PDD or PD related MCI (PD-MCI) (n = 293).\nTables 1\nand\n2\noutline the demographic data of PDD or PD-MCI and DLB or MCI-LB groups, respectively. According to the quality assessment, nine studies received a score of \"good,\" and nine received a score of \"moderate.\" Further information about this quality assessment can be found in the Supplementary Material. Given the limited number of studies and the heterogeneity between them, meta-analysis was not possible and therefore only a narrative synthesis of the results is provided.\n-Please insert Tables 1 and 2 about here-\nAnatomical MRI Studies", "doc_items_refs": ["#/texts/68", "#/texts/70", "#/texts/71", "#/texts/72", "#/texts/73", "#/texts/74", "#/texts/75", "#/texts/76"], "page_nos": [], "uuid": "3a66468f-f368-4d69-af53-8777c455bcbb"}
{"doc_id": "2025__Neuroimaging_of_affective_symptoms_in_Lewy_body_dementia_A_systematic_review__W4413876650", "source_path": "<redacted:source_path>", "chunk_id": 7, "source_chunk_idxs": [16], "num_tokens": 313, "text": "Neuroimaging of affective symptoms in Lewy body dementia: A systematic review\nResults\nTogether, the four anatomical MRI studies comprised 28 participants diagnosed with PD with normal cognition (PD-NC), 77 with PD-MCI, 20 with PDD, 117 with DLB, 119 with AD and 53 healthy controls (HC). Two of the studies, by Chang et al. ([ 58 ] and Querry et al. [ 60 ], were based on 3-T MRI T1-weighted scans. The remaining two, by Jaramillo-Jimenez et al.[ 59 ] and Almeida et al.[ 57 ], were based on 1.5-T MRI T1-weighted scans. Two studies analysed grey matter volume using a region of interest approach [ 57 , 59 ] and two used voxel-based morphometry [ 58 , 60 ]. Chang et al. [ 58 ] additionally implemented a structural covariance analysis to analyse structural connectivity. Three of the four studies assessed depression; two in PDD or PD-MCI groups using the Geriatric Depression Scale (GDS) [ 57 , 58 ] and one in DLB and AD participants using the Mini International Neuropsychiatric Interview (MINI) [ 60 ]. The study by Jaramillo-Jimenez et al. [ 59 ] assessed a range of neuropsychiatric symptoms in participants with AD and DLB, using the 12 items of the Neuropsychiatric Inventory (NPI) [ 69 ].", "doc_items_refs": ["#/texts/77"], "page_nos": [], "uuid": "01da2151-559d-4e78-aa4e-aff190c04363"}
{"doc_id": "2025__Neuroimaging_of_affective_symptoms_in_Lewy_body_dementia_A_systematic_review__W4413876650", "source_path": "<redacted:source_path>", "chunk_id": 8, "source_chunk_idxs": [17], "num_tokens": 401, "text": "Neuroimaging of affective symptoms in Lewy body dementia: A systematic review\nResults\nThe study by Almeida et al. (2003) found no association between caudate volume and depression in their PDD group. In their whole-brain voxel-based morphometry analysis, Chang et al., (2017) found PD-MCI patients with depression to have greater grey matter volume in the right fusiform gyrus, right hippocampus and bilateral superior parietal gyri than those without. In the fronto-insula, however, those with depression had lower grey matter volume. GDS scores were also found to positively correlate with volume in the right fusiform gyrus and the left superior parietal lobe and negatively correlate with volume in the right fronto-insula and the left lingual gyrus. Finally, eight clusters including the left anterior cingulate, left calcarine, left caudate, right hippocampus, right inferior frontal gyrus, left lingual gyrus, left rolandic operculum, and right superior frontal lobe demonstrated stronger structural covariance with the right fronto-insula cortex in the non-depressed than in the depressed PD-MCI group. Results from all studies involving PDD or PD-MCI groups can be found in\nTable 3\n.\nOf the two studies that included DLB groups, the study by Querry et al., (2024) found that DLB patients classified as depressed had lower grey matter volume in right middle frontal and posterior cingulate regions than those without depression [ 60 ]. Whereas, the study by Jaramillo-Jimenez et al. (2021) found no association between amygdala volume and longitudinal development of affective symptoms in DLB. Results for DLB studies are presented in\nTable 4\n.\n-Please insert Tables 3 and 4 about here-\nFunctional MRI Studies", "doc_items_refs": ["#/texts/78", "#/texts/79", "#/texts/80", "#/texts/81", "#/texts/82", "#/texts/83", "#/texts/84", "#/texts/85"], "page_nos": [], "uuid": "c5bccc09-63c5-4252-aeff-62be0c18499b"}
{"doc_id": "2025__Neuroimaging_of_affective_symptoms_in_Lewy_body_dementia_A_systematic_review__W4413876650", "source_path": "<redacted:source_path>", "chunk_id": 9, "source_chunk_idxs": [18], "num_tokens": 198, "text": "Neuroimaging of affective symptoms in Lewy body dementia: A systematic review\nResults\nFour out of the 18 studies examined neuropsychiatric symptoms in LBD using fMRI [ 61 - 64 ].  Three studies included participants with PD-MCI and two included participants with MCI-LB or DLB amounting to a total of 83 PD-MCI, 61 PD-NC, 28 MCI-LB, 66 DLB and 54 HC across studies. All studies utilized a 3T MRI scanner. Wright et al. [ 64 ] utilized the NPI to evaluate apathy and depression (as a composite affective disorder factor) and anxiety. The studies by Xing et al. [ 61 ] and Zhang et al. [ 62 ] used the Hamilton Depression Rating Scale (HAMD) and the Hamilton Anxiety Rating Scale (HAMA) to evaluate depression and anxiety symptoms. The study by Querry et al. [ 63 ] used the MINI to evaluate depression.", "doc_items_refs": ["#/texts/86"], "page_nos": [], "uuid": "63817c33-626b-4bfc-8876-23399af4773f"}
{"doc_id": "2025__Neuroimaging_of_affective_symptoms_in_Lewy_body_dementia_A_systematic_review__W4413876650", "source_path": "<redacted:source_path>", "chunk_id": 10, "source_chunk_idxs": [19], "num_tokens": 501, "text": "Neuroimaging of affective symptoms in Lewy body dementia: A systematic review\nResults\nEach study used slightly different outcome measures. The study by Xing et al. [ 61 ] assessed regional brain activity using regional homogeneity whereas the remaining studies all focused on seed-based functional connectivity indices. Zhang et al. [ 62 ] assessed seed-based connectivity of cholinergic basal forebrain nuclei whereas Querry et al. [ 63 ] and Wright et al. [ 64 ] assessed seed-based connectivity of multiple resting-state networks. While Xing et al.[ 61 ] found no significant associations between regional homogeneity values and either of their neuropsychiatric measures, Zhang et al. [ 62 ] found a significant positive correlation between HAMD scores and functional connectivity between the right nucleus basalis of Meynert and right middle cingulate and paracingulate gyri in PD-MCI. Wright et al. [ 64 ] also found significantly greater connectivity associated with both anxiety and affective disorder (depression and apathy), in PD-MCI, between the precuneus seed of the default mode network (DMN) and the subgenual cingulate, and between the orbitofrontal seed of the limbic network and areas of the DMN including the precuneus and subgenual cingulate. They also found affective disorder and anxiety severity to be associated with weaker connectivity between the limbic orbitofrontal seed and the brainstem and weaker connectivity between the salience network and the subgenual cingulate. No significant correlations were found between symptom severity and functional connectivity in the MCI-LB group, however. In DLB, however, the study by Querry et al. (2025) found significant positive correlations between MINI scores and functional connectivity between both the orbitofrontal cortex and inferior temporal gyrus and areas of the occipital lobe. Conversely, negative correlations were found between the MINI scores and functional connectivity between the inferior frontal cortex and occipital regions. The depressed DLB group were additionally found to have weaker connectivity between the cerebellum and lateral prefrontal cortex and greater connectivity between the lateral parietal cortex and the superior temporal gyrus, although these findings were only demonstrated at an uncorrected threshold.\nNeurotransmitter/Neurotransporter Studies", "doc_items_refs": ["#/texts/87", "#/texts/88"], "page_nos": [], "uuid": "33e52df8-0124-4695-8760-1ca62ccedcc9"}
{"doc_id": "2025__Neuroimaging_of_affective_symptoms_in_Lewy_body_dementia_A_systematic_review__W4413876650", "source_path": "<redacted:source_path>", "chunk_id": 11, "source_chunk_idxs": [20], "num_tokens": 452, "text": "Neuroimaging of affective symptoms in Lewy body dementia: A systematic review\nResults\nNeurotransmitter imaging studies were the most abundant studies included for review. None of the neurotransmitter studies included a cognitively impaired PD group. Three studies involving a total of 71 participants with DLB, 20 with prodromal DLB (MCI-LB) and 10 with AD, investigated dopamine transporter (DAT) striatal binding ratios using\n123\nI-FP-CIT single-photon emission computed tomography (SPECT) [ 36 , 52 , 54 , 55 ] and a further two studies involving a total of 65 DLB patients investigated DAT binding ratios using either\n18\nF-FE-PE2I PET [ 56 ] or\n18\nF-FP-CIT PET [ 55 ]. An additional single study of 11 participants with DLB and 12 HC investigated the density of vesicular acetylcholine transporter (VAchT) binding sites in several regions of interest within cholinergic pathways using\n123\nI-iodobenzovesamicol SPECT [ 53 ]. In five of the six studies, neuropsychiatric symptoms were correlated with DAT binding ratios. In one study, VAchT binding potentials were compared between apathetic and non-apathetic DLB patients. Four studies used the NPI to assess neuropsychiatric symptoms [ 36 , 53 - 55 ], one used the GDS to measure depression [ 56 ], and one used a questionnaire with 12 specific questions corresponding to the non-motor symptoms associated with LBD [ 52 ].\nIn three of the six studies, no associations were found between DAT binding and any neuropsychiatric symptoms [ 52 , 54 ]. In the remaining studies, depression and apathy, as measured by the NPI, were found to be negatively correlated with DAT binding in the caudate [ 36 ] anxiety was found to negatively correlate with DAT binding in the ventral striatum [ 55 ], and VAchT binding potential values in the anterior cingulate were found to be significantly lower in DLB patients with apathy than without [ 53 ].\nOther Imaging Techniques", "doc_items_refs": ["#/texts/89", "#/texts/90", "#/texts/91", "#/texts/92", "#/texts/93", "#/texts/94", "#/texts/95", "#/texts/96", "#/texts/97", "#/texts/98", "#/texts/99"], "page_nos": [], "uuid": "f79cc617-e219-441c-95a0-047530527059"}
{"doc_id": "2025__Neuroimaging_of_affective_symptoms_in_Lewy_body_dementia_A_systematic_review__W4413876650", "source_path": "<redacted:source_path>", "chunk_id": 12, "source_chunk_idxs": [21], "num_tokens": 414, "text": "Neuroimaging of affective symptoms in Lewy body dementia: A systematic review\nResults\nThe remaining studies utilized a range of different techniques to examine neuropsychiatric neural correlates in DLB and PD. A perfusion SPECT study examined regional cerebral blood flow in 95 DLB patients [ 66 ]. An\n18\nFDG-PET study examined glucose metabolism in patients with DLB (n = 28), AD (n = 741) and frontotemporal lobar degeneration (n = 137) [ 65 ]. An\n18\nF-florbetapir PET study examined regional Aβ deposition in 21 patients with PDD, 20 with AD and 9 HC [ 67 ] and a diffusion tensor imaging study examined free water values in the nucleus basalis of Meynert in 59 HC, 57 patients with idiopathic REM sleep behavior disorder, 57 patients with PD-NC, and 64 patients with PD-MCI using a 3T MRI scanner [ 68 ].\nThree of the four studies used correlational methods to determine the relationship between outcome measures and neuropsychiatric symptoms. The study by Murayama et al., [ 66 ] however, compared regional cerebral blood flow between DLB participants with and without depression. The studies used various methods to measure affective symptoms including the NPI, GDS and the State Trait Anxiety Inventory. Murayama et al.[ 66 ] did not explicitly state the specific neuropsychiatric measure used but implied that the presence of depression was determined as part of the clinical diagnostic protocol.\nOf all the studies, only the study by Murayama et al. [ 66 ] found findings of significance. Free-water values, regional Aβ deposition and glucose metabolism were all found not to be associated with affective symptoms in either DLB, PDD or PD-MCI groups. Regional cerebral blood flow however was found to be greater in the angular gyrus and upper precuneus of DLB patients with depression than in those without.", "doc_items_refs": ["#/texts/100", "#/texts/101", "#/texts/102", "#/texts/103", "#/texts/104", "#/texts/105", "#/texts/106"], "page_nos": [], "uuid": "a7ffd230-5a25-4f1f-96f3-3efe7e2f1dab"}
{"doc_id": "2025__Neuroimaging_of_affective_symptoms_in_Lewy_body_dementia_A_systematic_review__W4413876650", "source_path": "<redacted:source_path>", "chunk_id": 13, "source_chunk_idxs": [22], "num_tokens": 284, "text": "Neuroimaging of affective symptoms in Lewy body dementia: A systematic review\nDiscussion\nThis review aimed to elucidate the structural and functional neural correlates of affective symptoms in Lewy body dementias based on anatomical, functional, metabolic and neurotransmitter neuroimaging studies. The overwhelming take-away was the sheer paucity of research in this area. Given the limited data and few studies analyzing the relationship between affective symptoms and imaging metrics as a primary aim, imaging-based signatures of such symptoms in cognitively impaired LBD groups remain elusive and as such our aim to provide details regarding potential differences between disease stages and disease subtypes could only be partially met. Although a handful of studies reported some significant findings, there is little consensus within the currently available literature, highlighting a persisting need for further hypothesis driven research in larger, more diverse cohorts.\nOf the eighteen studies included in the present review, only nine demonstrated a significant association between a given measure of anxiety, apathy or depression and brain structure or function. Most studies (17/18) included a measure of depression with far fewer investigating anxiety or apathy. As such, significant findings were predominantly limited to this symptom, with only two studies highlighting significant findings related to anxiety in cognitively impaired PD or DLB and only two highlighting a significant finding related to apathy in DLB.", "doc_items_refs": ["#/texts/108", "#/texts/109"], "page_nos": [], "uuid": "d30ddceb-cdc1-438f-b052-fc058cee799b"}
{"doc_id": "2025__Neuroimaging_of_affective_symptoms_in_Lewy_body_dementia_A_systematic_review__W4413876650", "source_path": "<redacted:source_path>", "chunk_id": 14, "source_chunk_idxs": [23], "num_tokens": 291, "text": "Neuroimaging of affective symptoms in Lewy body dementia: A systematic review\nDiscussion\nIn cognitively impaired PD groups, only three studies identified significant neural correlates of affective symptom severity, two assessing functional connectivity and one assessing grey matter volume, all of which focused on PD-MCI. The study by Chang et al. [ 58 ] identified multiple regions of both higher and lower grey matter volume in several disparate brain regions among PD-MCI with depression when compared to those without. Although some previous studies have identified positive correlations between depression and volumetric or cortical thickness measures in PD [ 70 , 71 ], such positive associations are at odds with a range of imaging research that has typically highlighted lower grey matter volume within limbic, prefrontal and insular regions, in depressed PD groups [ 25 , 72 ]. Chang et al.'s study further highlighted a possible breakdown in structural covariance within the salience network in the depressed PD-MCI group compared with the non-depressed group. Such findings may align with functional connectivity analyses of major depressive disorder [ 73 ], and even PD-MCI [ 64 ], in which hypoconnectivity of the salience network has been found to relate to depression. However, the reliability of structural covariance metrics remains somewhat contentious [ 74 ] and as such, further research is needed to validate these findings.", "doc_items_refs": ["#/texts/110"], "page_nos": [], "uuid": "5f15f7d0-3e27-40fc-95b1-db21a222b6b0"}
{"doc_id": "2025__Neuroimaging_of_affective_symptoms_in_Lewy_body_dementia_A_systematic_review__W4413876650", "source_path": "<redacted:source_path>", "chunk_id": 15, "source_chunk_idxs": [24], "num_tokens": 495, "text": "Neuroimaging of affective symptoms in Lewy body dementia: A systematic review\nDiscussion\nFunctional imaging studies in cognitively impaired PD groups, however, appear to align more clearly with what has previously been established in cognitively healthy PD and broader models of psychopathology. In Wright et al.'s (2025) fMRI study, positive correlations between both 'affective disorder' and anxiety severity and functional connectivity were identified particularly between the limbic orbitofrontal cortex, subgenual cingulate, and regions of the DMN. Conversely, negative correlations were found between affective symptom severity and connectivity between the orbitofrontal cortex and the brainstem and between the subgenual cingulate and the salience network. In Zhang et al.'s [ 62 ] study, depression severity was additionally found to positively correlate with connectivity of the nucleus basalis of Meynert. Such findings by Wright et al. reflect those of previous research in cognitively healthy PD groups [ 39 , 40 ], and literature from the broader psychiatric field, highlighting the significant involvement of the subgenual cingulate, limbic regions and imbalanced activity across the DMN and salience network in depression and anxiety disorders [ 37 , 38 ]. This contributes towards a hypothesis that aberrant functional network connectivity may be a core underlying mechanism of neuropsychiatric symptoms in PD that is likely heavily influenced by LBD related changes in multiple neurotransmission pathways such as the serotonergic and dopaminergic systems [ 32 , 34 , 35 ]. The findings by Zhang and colleagues further highlight a significant association between depression severity and connectivity between the cholinergic basal forebrain and cingulate cortex, a brain region frequently implicated in PD related affective symptoms [ 40 , 64 , 75 , 76 ]. Earlier reviews of cholinergic deficits in PD have highlighted a potential connection between depression as a risk-factor for cognitive decline in PD and cholinergic dysfunction [ 77 ]. Given both early and recent discoveries suggesting an important role of the cholinergic system in mood regulation [ 78 ], and the increased cholinergic denervation associated with LBD cognitive decline [ 27 ], this finding warrants further investigation as a possible mechanism underlying the observable relationship between cognitive decline and increasing affective symptom severity in LBDs [ 14 - 19 ].", "doc_items_refs": ["#/texts/111"], "page_nos": [], "uuid": "d5c9f1e0-64c9-4f9b-a5bc-f3ccaa3646f0"}
{"doc_id": "2025__Neuroimaging_of_affective_symptoms_in_Lewy_body_dementia_A_systematic_review__W4413876650", "source_path": "<redacted:source_path>", "chunk_id": 16, "source_chunk_idxs": [25], "num_tokens": 484, "text": "Neuroimaging of affective symptoms in Lewy body dementia: A systematic review\nDiscussion\nFar more studies, using a broader variety of techniques, examined affective symptoms in DLB. Of the 11 studies that included a DLB or MCI-LB group, six reported significant findings. Studies in DLB primarily utilized SPECT imaging to assess neurotransmission, with five investigating striatal DAT binding and one investigating the density of VAchT binding within cholinergic pathways. Conversely, none of the studies in cognitively impaired PD groups utilized such neurotransmission imaging techniques, possibly due to a wealth of research already providing evidence for a role of dopaminergic, serotonergic and noradrenergic denervation underlying affective symptoms in cognitively healthy PD [ 79 ]. In contrast with PD research that has shown significant correlations between anxiety, apathy and depression and DAT binding [ 29 , 34 , 80 ], evidence from DLB groups is sparse. Although two of the five DAT imaging studies identified some significant negative correlations between DAT binding in the striatum and either depression, apathy or anxiety in DLB ([ 36 , 55 ], others reported a lack of significant association with any affective symptom [ 52 , 54 , 56 ]. Furthermore, Roselli et al. [ 36 ] demonstrated significant associations between depression and apathy and DAT binding within the caudate but found no association with anxiety. Conversely, Yoo et al. [ 55 ] found only anxiety significantly correlated with DAT binding in the ventral striatum while apathy and depression were not associated with binding in any striatal region. Explanations for such discrepancies may lie in the substantial differences in study methodology, including imaging tracer and technique, diagnostic protocols, region of interest definition, and covariates in the analysis. Regardless, the directionality of results is consistent across both studies, with dopaminergic activity deficits within the striatum relating to manifestations of affective symptoms in DLB. Such findings are supported by neuropathological studies in DLB which have highlighted degeneration of dopaminergic pathways in depressed patients [ 31 , 41 ], as well as neuroimaging studies in both cognitively healthy PD and other psychiatric and neurocognitive disorders [ 29 , 81 - 83 ].", "doc_items_refs": ["#/texts/112"], "page_nos": [], "uuid": "10cbebea-fd21-42d6-8a1e-ed6d5dba986a"}
{"doc_id": "2025__Neuroimaging_of_affective_symptoms_in_Lewy_body_dementia_A_systematic_review__W4413876650", "source_path": "<redacted:source_path>", "chunk_id": 17, "source_chunk_idxs": [26], "num_tokens": 167, "text": "Neuroimaging of affective symptoms in Lewy body dementia: A systematic review\nDiscussion\nAside from DAT-SPECT, Mazère et al.'s SPECT study [ 53 ], investigating VAchT, identified significantly lower VAchT binding within the anterior cingulate cortex in apathetic DLB patients compared with HC, despite no such difference being identified in non-apathetic DLB. Despite the limited sample size of this study, the results align with Zhang et al.'s findings [ 62 ] demonstrating a significant association between depression and functional connectivity deficits between the nucleus basalis of Meynert and cingulate cortex in PD-MCI, further highlighting the cholinergic system as an emerging area of interest regarding the pathophysiology of affective symptoms in cognitively impaired LBD.", "doc_items_refs": ["#/texts/113"], "page_nos": [], "uuid": "f63e757c-3b66-4eb4-8910-32af9f69b1af"}
{"doc_id": "2025__Neuroimaging_of_affective_symptoms_in_Lewy_body_dementia_A_systematic_review__W4413876650", "source_path": "<redacted:source_path>", "chunk_id": 18, "source_chunk_idxs": [27], "num_tokens": 487, "text": "Neuroimaging of affective symptoms in Lewy body dementia: A systematic review\nDiscussion\nOf the four functional imaging studies in DLB or MCI-LB, three reported significant findings. Interestingly, Murayama et al.'s study [ 66 ] identified significantly greater regional cerebral blood flow in areas corresponding to the DMN in depressed DLB participants, aligning with the DMN hyperconnectivity associated with affective disorder scores identified in PD-MCI by Wright et al.[ 64 ]. DMN regions were similarly highlighted by Querry et al.'s (2024) structural study in which depression was found to be negatively associated with grey matter volume within the middle frontal gyrus and precuneus. Such associations between depressive symptoms and DMN alterations are well established in the psychiatric literature and in previous studies in cognitively healthy PD [ 38 - 40 ]. Overactivity of the DMN in relation to negative affective states has been hypothesized to result, in part, from dysfunctional dopaminergic circuits [ 37 ], aligning with the denervation and pathological burden within dopaminergic pathways associated with depression in DLB [ 31 , 41 ]. However, it must be noted in this case that such findings were not corroborated by Gan et al.'s\n18\nFDG-PET study [ 65 ] or either of the two fMRI studies in investigating DLB or MCI-LB [ 63 , 64 ]. Rather, Querry et al.'s functional study [ 63 ] identified a range of both positive and negative associations between functional connectivity and depression in their DLB group that were largely located between the orbitofrontal and inferior temporal cortex and regions of the occipital lobe, with little to no involvement of regions associated with the DMN. Negative correlations were also identified between depression severity and within-network connectivity of the salience network. Although this may align with hypothesized contributions of salience network hypoconnectivity to negative affective states [ 37 ], such findings were only identified at an uncorrected threshold and have yet to be replicated. At present, therefore, little corroboration exists within the literature regarding imaging correlates of affective symptoms in DLB.\nStrengths and Limitations", "doc_items_refs": ["#/texts/114", "#/texts/115", "#/texts/116", "#/texts/117"], "page_nos": [], "uuid": "46c93301-d454-478d-967d-379dcff841d6"}
{"doc_id": "2025__Neuroimaging_of_affective_symptoms_in_Lewy_body_dementia_A_systematic_review__W4413876650", "source_path": "<redacted:source_path>", "chunk_id": 19, "source_chunk_idxs": [28], "num_tokens": 400, "text": "Neuroimaging of affective symptoms in Lewy body dementia: A systematic review\nDiscussion\nThe present review adhered to the PRISMA guidelines for systematic reviews, with a particular strength being the breadth of imaging techniques and symptom measures covered which captures the full spectrum of literature addressing the most common forms of affective symptoms in LBDs. A possible limitation, however, was the decision to exclude electrophysiological techniques, such as electroencephalography and magnetoencephalography, from both the search terms and through screening. The decision to exclude these techniques was made to limit the scope of this review to more easily comparable functional and structural outcome measures. However, such studies may prove beneficial in furthering our understanding of the neural mechanisms underlying affective symptoms in LBDs and as such their exclusion may be considered a limitation.\nOne of the main limiting factors of the studies reviewed is that, except for DAT imaging, none of the imaging approaches utilized had been repeated within the same clinical subgroup across more than a single study, providing no opportunity to assess the replicability of the findings. Half of the studies did not identify any significant findings at all, resulting in little corroborating evidence across the literature. Furthermore, only half of the studies reviewed investigated the relationship between affective symptoms and neuroimaging metrics as a primary aim, meaning that not only were hypotheses not formulated around this specific research question, but many studies excluded participants based on the presence of clinically relevant psychiatric symptoms. Currently, therefore, it is hard to reconcile the multiple apparent inconsistencies across neuroimaging studies of affective symptoms in cognitively impaired LBD, given that the evidence base remains so limited. Furthermore, variations in imaging modalities, analysis techniques, neuropsychiatric measures and other confounding factors make the parsing out of valid and reliable findings from the idiosyncrasies of individual studies and disease cohorts significantly challenging.", "doc_items_refs": ["#/texts/118", "#/texts/119"], "page_nos": [], "uuid": "3072858b-d10f-4998-832b-4ea6d57144ec"}
{"doc_id": "2025__Neuroimaging_of_affective_symptoms_in_Lewy_body_dementia_A_systematic_review__W4413876650", "source_path": "<redacted:source_path>", "chunk_id": 20, "source_chunk_idxs": [29], "num_tokens": 294, "text": "Neuroimaging of affective symptoms in Lewy body dementia: A systematic review\nDiscussion\nA further limitation complicating the investigation of affective symptom neural correlates in Lewy body dementia is the known prevalence of mixed etiologies and co-morbid pathologies that may significantly impact clinical presentations [ 26 - 28 , 84 - 86 ]. Of the studies included, only four included an Aβ biomarker and the vast majority of participants were diagnosed based solely on clinical criteria, limiting the possibility to determine pathology specific contributions to affective symptoms. In AD, tau and Aβ burden have not only been directly associated with affective symptoms [ 87 - 89 ], but additionally impact specific neurotransmission systems, such as cholinergic pathways, that have an established role in affective symptom manifestation [ 27 , 78 , 90 ]. The study by Yoo et al.[ 55 ] further replicates the association between affective symptoms and AD pathology in DLB, finding that DLB participants with a high Aβ load demonstrated greater levels of anxiety and overall neuropsychiatric burden than Aβ-negative participants. Current imaging studies are therefore significantly limited by the relatively few well-characterized, pathologically confirmed study cohorts available, a limitation which may be significantly contributing towards the apparent lack of correspondence between some imaging studies and histopathological findings, particularly in DLB [ 31 , 41 ].", "doc_items_refs": ["#/texts/120"], "page_nos": [], "uuid": "4e698519-9668-4760-8f66-4bf775642a93"}
{"doc_id": "2025__Neuroimaging_of_affective_symptoms_in_Lewy_body_dementia_A_systematic_review__W4413876650", "source_path": "<redacted:source_path>", "chunk_id": 21, "source_chunk_idxs": [30], "num_tokens": 300, "text": "Neuroimaging of affective symptoms in Lewy body dementia: A systematic review\nDiscussion\nFinally, it is well established within the psychiatric literature that symptoms such as depression, apathy and anxiety are not derived from a set of unitary diseases but rather each consist of a broad spectrum of features and characteristics that may be etiologically diverse across individuals [ 91 - 93 ]. It is reasonable to predict, therefore, that the same is likely true of manifestations of affective symptoms in such complex and multifactorial conditions as Lewy body dementia, where a vast range of potential alterations within neurotransmission pathways and brain networks, resultant of either pure or mixed pathologies, may differentially contribute to symptom manifestation in each individual. Such diversity does not only arise from underlying pathology but is further complicated by the significant clinical overlaps not only between affective symptoms themselves but between affective symptoms and other clinical features of LBD such as motor deficits, sleep disturbance and cognitive fluctuations [ 94 - 96 ]. A final substantial limitation of the current literature is therefore the use of a range of heterogeneous affective symptom rating scales, the validity of which have yet to be adequately assessed in the context of Lewy body dementia. The success of future clinical trials will, therefore, largely rely on research that is able to address such complications to establish meaningful neural correlates of symptom manifestations to provide therapeutic targets for symptomatic therapies.", "doc_items_refs": ["#/texts/121"], "page_nos": [], "uuid": "ab125085-442a-43b9-b46e-6f5173b761a6"}
{"doc_id": "2025__Neuroimaging_of_affective_symptoms_in_Lewy_body_dementia_A_systematic_review__W4413876650", "source_path": "<redacted:source_path>", "chunk_id": 22, "source_chunk_idxs": [31, 32], "num_tokens": 342, "text": "Neuroimaging of affective symptoms in Lewy body dementia: A systematic review\nConclusion\nThe findings of this review highlight a substantial gap in the literature that currently significantly limits our pathophysiological understanding of the well-established link between cognitive and neuropsychiatric decline in LBD. Such gaps in knowledge are a considerable hindrance to clinical trials seeking to develop effective interventions for these distressing and quality of life limiting symptoms. Future research should therefore focus on testing well-formulated hypotheses to replicate or extend the findings of earlier imaging studies, with the explicit aim of elucidating neural correlates of affective symptoms in cognitively impaired LBD groups. Optimizing symptom measurement and biomarker characterization of study cohorts may significantly improve future study protocols and consistency across the literature, therefore contributing towards a more robust theoretical basis for future therapeutic targets.\n\nNeuroimaging of affective symptoms in Lewy body dementia: A systematic review\nDeclarations\nCompeting Interests\nThe authors have no competing interests to declare that are relevant to the content of this article.\nFunding\nNM has no financial disclosures. LMW was supported by a bridging grant from ARUK (ARUK-ECRBF2023B-006) as well as being supported by the NIHR Newcastle Biomedical Research Centre.\nData availability\nThe data presented in this article may be provided by the authors upon reasonable request.\nAuthors Contributions\nLMW conceptualised the design and protocol of the review and performed the literature search. Both NM and LMW conducted the screening, data extraction and quality assessment of studies. Both NM and LMW contributed to the writing and editing of the final manuscript.", "doc_items_refs": ["#/texts/123", "#/texts/125", "#/texts/126", "#/texts/127", "#/texts/128", "#/texts/129", "#/texts/130", "#/texts/131", "#/texts/132"], "page_nos": [], "uuid": "86f789c7-9b3f-4446-827e-3029d3ccb9d2"}
{"doc_id": "2025__Neuroimaging_of_affective_symptoms_in_Lewy_body_dementia_A_systematic_review__W4413876650", "source_path": "<redacted:source_path>", "chunk_id": 23, "source_chunk_idxs": [33], "num_tokens": 458, "text": "Neuroimaging of affective symptoms in Lewy body dementia: A systematic review\nReferences\n1. Aarsland D, Rongve A, Piepenstock Nore S, Skogseth R, Skulstad S, Ehrt U et al (2008) Frequency and case identification of dementia with Lewy bodies using the revised consensus criteria. Dement Geriatr Cogn Disord 26(5):445-452. https://doi.org/10.1159/000165917\n2. Emre M, Aarsland D, Brown R, Burn DJ, Duyckaerts C, Mizuno Y et al (2007) Clinical diagnostic criteria for dementia associated with Parkinson's disease. Mov Disord 22(12):1689-1707. https://doi.org/10.1002/mds.21507\n3. McKeith IG, Boeve BF, Dickson DW, Halliday G, Taylor J-P, Weintraub D et al (2017) Diagnosis and management of dementia with Lewy bodies: Fourth consensus report of the DLB Consortium. Neurology 89(1):88-100. https://doi.org/10.1212/WNL.0000000000004058\n4. Ballard C, Aarsland D, Francis P, Corbett A (2013) Neuropsychiatric symptoms in patients with dementias associated with cortical Lewy bodies: pathophysiology, clinical features, and pharmacological management. Drugs Aging 30(8):603-611. https://doi.org/10.1007/s40266-013-0092-x\n5. Lyketsos CG, Lopez O, Jones B, Fitzpatrick AL, Breitner J, DeKosky S (2002) Prevalence of neuropsychiatric symptoms in dementia and mild cognitive impairment: results from the cardiovascular health study. JAMA 288(12):1475-1483. https://doi.org/10.1001/jama.288.12.1475", "doc_items_refs": ["#/texts/134", "#/texts/135", "#/texts/136", "#/texts/137", "#/texts/138"], "page_nos": [], "uuid": "a0a73b4d-4248-4781-a56a-1b19cd144a1f"}
{"doc_id": "2025__Neuroimaging_of_affective_symptoms_in_Lewy_body_dementia_A_systematic_review__W4413876650", "source_path": "<redacted:source_path>", "chunk_id": 24, "source_chunk_idxs": [34], "num_tokens": 468, "text": "Neuroimaging of affective symptoms in Lewy body dementia: A systematic review\nReferences\n6. Donaghy PC, Taylor JP, O'Brien JT, Barnett N, Olsen K, Colloby SJ et al (2018) Neuropsychiatric symptoms and cognitive profile in mild cognitive impairment with Lewy bodies. Psychol Med 48(14):2384-2390. https://doi.org/10.1017/s0033291717003956\n7. Bjoerke-Bertheussen J, Ehrt U, Rongve A, Ballard C, Aarsland D (2012) Neuropsychiatric symptoms in mild dementia with Lewy bodies and Alzheimer's disease. Dement Geriatr Cogn Disord 34(1):1-6. https://doi.org/10.1159/000339590\n8. Donaghy PC, Ciafone J, Durcan R, Hamilton CA, Barker S, Lloyd J et al (2022) Mild cognitive impairment with Lewy bodies: neuropsychiatric supportive symptoms and cognitive profile. Psychol Med 52(6):1147-1155. https://doi.org/10.1017/S0033291720002901\n9. Dissanayaka NN, Sellbach A, Silburn PA, O'Sullivan JD, Marsh R, Mellick GD (2011) Factors associated with depression in Parkinson's disease. J Affect Disord 132(1-2):82-88. https://doi.org/10.1016/j.jad.2011.01.021\n10. Eglit GM, Lopez F, Schiehser DM, Pirogovsky-Turk E, Litvan I, Lessig S et al (2021) Delineation of apathy subgroups in Parkinson's disease: differences in clinical presentation, functional ability, health-related quality of life, and caregiver burden. Mov Disord Clin Pract 8(1):92-99. https://doi.org/10.1002/mdc3.13127", "doc_items_refs": ["#/texts/139", "#/texts/140", "#/texts/141", "#/texts/142", "#/texts/143"], "page_nos": [], "uuid": "3cb43e7d-cad8-4b33-ab98-2bf0a53aac7a"}
{"doc_id": "2025__Neuroimaging_of_affective_symptoms_in_Lewy_body_dementia_A_systematic_review__W4413876650", "source_path": "<redacted:source_path>", "chunk_id": 25, "source_chunk_idxs": [35], "num_tokens": 497, "text": "Neuroimaging of affective symptoms in Lewy body dementia: A systematic review\nReferences\n11. Heimrich KG, Schönenberg A, Mendorf S, Moussaoui J, Prell T (2024) An examination of anxiety and its influence on health-related quality of life in Parkinson's disease using the geriatric anxiety scale: a cross-sectional study. BMC Geriatr 24(1):298. https://doi.org/10.1186/s12877-024-04911-8\n12. Kuhlman GD, Flanigan JL, Sperling SA, Barrett MJ (2019) Predictors of health-related quality of life in Parkinson's disease. Parkinsonism Relat Disord 65:86-90. https://doi.org/10.1016/j.parkreldis.2019.05.009\n13. Van de Beek M, van Steenoven I, van der Zande J, Porcelijn I, Barkhof F, Stam C et al (2021) Characterization of symptoms and determinants of disease burden in dementia with Lewy bodies: DEvELOP design and baseline results. Alzheimers Res Ther 13(1):53. https://doi.org/10.1186/s13195-021-00792-w\n14. Breitve MH, Brønnick K, Chwiszczuk LJ, Hynninen MJ, Aarsland D, Rongve A (2018) Apathy is associated with faster global cognitive decline and early nursing home admission in dementia with Lewy bodies. Alzheimers Res Ther 10(1):83. https://doi.org/10.1186/s13195-018-0416-5\n15. Breitve MH, Hynninen MJ, Brønnick K, Chwiszczuk LJ, Auestad BH, Aarsland D et al (2016) A longitudinal study of anxiety and cognitive decline in dementia with Lewy bodies and Alzheimer's disease. Alzheimers Res Ther 8(1):3. https://doi.org/10.1186/s13195-016-0171-4", "doc_items_refs": ["#/texts/144", "#/texts/145", "#/texts/146", "#/texts/147", "#/texts/148"], "page_nos": [], "uuid": "299a6c07-5727-450d-a34e-3757bb3f4f8e"}
{"doc_id": "2025__Neuroimaging_of_affective_symptoms_in_Lewy_body_dementia_A_systematic_review__W4413876650", "source_path": "<redacted:source_path>", "chunk_id": 26, "source_chunk_idxs": [36], "num_tokens": 453, "text": "Neuroimaging of affective symptoms in Lewy body dementia: A systematic review\nReferences\n16. Dissanayaka NN, Lawson RA, Yarnall AJ, Duncan GW, Breen DP, Khoo TK et al (2017) Anxiety is associated with cognitive impairment in newly-diagnosed Parkinson's disease. Parkinsonism Relat Disord 36:63-68. https://doi.org/10.1016/j.parkreldis.2017.01.001\n17. Wyman-Chick KA, O'Keefe LR, Weintraub D, Armstrong MJ, Rosenbloom M, Martin PK et al (2022) Prodromal dementia with Lewy bodies: evolution of symptoms and predictors of dementia onset. J Geriatr Psychiatry Neurol 35(4):527-534. https://doi.org/10.1177/08919887211023586\n18. Dujardin K, Sockeel P, Delliaux M, Destée A, Defebvre L (2009) Apathy may herald cognitive decline and dementia in Parkinson's disease. Mov Disord 24(16):2391-2397. https://doi.org/10.1002/mds.22843\n19. Jones JD, Kurniadi NE, Kuhn TP, Szymkowicz SM, Bunch J, Rahmani E (2019) Depressive symptoms precede cognitive impairment in de novo Parkinson's disease patients: Analysis of the PPMI cohort. Neuropsychology 33(8):1111. https://doi.org/10.1037/neu0000583\n20. Den Brok MG, van Dalen JW, van Gool WA, van Moll EP, de Bie RM, Richard E (2015) Apathy in Parkinson's disease: a systematic review and meta-analysis. Mov Disord 30(6):759-769. https://doi.org/10.1002/mds.26208", "doc_items_refs": ["#/texts/149", "#/texts/150", "#/texts/151", "#/texts/152", "#/texts/153"], "page_nos": [], "uuid": "245506fb-9bfe-40bb-b995-f83a6dc7f47e"}
{"doc_id": "2025__Neuroimaging_of_affective_symptoms_in_Lewy_body_dementia_A_systematic_review__W4413876650", "source_path": "<redacted:source_path>", "chunk_id": 27, "source_chunk_idxs": [37], "num_tokens": 443, "text": "Neuroimaging of affective symptoms in Lewy body dementia: A systematic review\nReferences\n21. Dissanayaka NN, Sellbach A, Matheson S, O'Sullivan JD, Silburn PA, Byrne GJ et al (2010) Anxiety disorders in Parkinson's disease: prevalence and risk factors. Mov Disord 25(7):838-845. https://doi.org/10.1002/mds.22833\n22. Lee DR, McKeith I, Mosimann U, Ghosh-Nodyal A, Thomas AJ (2013) Examining carer stress in dementia: the role of subtype diagnosis and neuropsychiatric symptoms. Int J Geriatr Psychiatry 28(2):135-141. https://doi.org/10.1002/gps.3799\n23. Liu S, Liu J, Wang X-D, Shi Z, Zhou Y, Li J et al (2018) Caregiver burden, sleep quality, depression, and anxiety in dementia caregivers: a comparison of frontotemporal lobar degeneration, dementia with Lewy bodies, and Alzheimer's disease. Int Psychogeriatr 30(8):1131-1138. https://doi.org/10.1017/S1041610217002630\n24. Alzahrani H, Venneri A (2015) Cognitive and neuroanatomical correlates of neuropsychiatric symptoms in Parkinson's disease: A systematic review. J Neurol Sci 356(1-2):32-44. https://doi.org/10.1016/j.jns.2015.06.037\n25. Wen MC, Chan LL, Tan LC, Tan EK (2016) Depression, anxiety, and apathy in Parkinson's disease: insights from neuroimaging studies. Eur J Neurol 23(6):1001-1019. https://doi.org/10.1111/ene.13002", "doc_items_refs": ["#/texts/154", "#/texts/155", "#/texts/156", "#/texts/157", "#/texts/158"], "page_nos": [], "uuid": "9e3476fc-bac9-454b-9589-273f6e80c64d"}
{"doc_id": "2025__Neuroimaging_of_affective_symptoms_in_Lewy_body_dementia_A_systematic_review__W4413876650", "source_path": "<redacted:source_path>", "chunk_id": 28, "source_chunk_idxs": [38], "num_tokens": 456, "text": "Neuroimaging of affective symptoms in Lewy body dementia: A systematic review\nReferences\n26. Irwin DJ, Grossman M, Weintraub D, Hurtig HI, Duda JE, Xie SX et al (2017) Neuropathological and genetic correlates of survival and dementia onset in synucleinopathies: a retrospective analysis. Lancet Neurol 16(1):55-65. https://doi.org/10.1016/S1474-4422(16)30291-5\n27. Okkels N, Grothe MJ, Taylor J-P, Hasselbalch SG, Fedorova TD, Knudsen K et al (2024) Cholinergic changes in Lewy body disease: implications for presentation, progression and subtypes. Brain 147(7):2308-2324. https://doi.org/10.1093/brain/awae069\n28. Irwin DJ, Hurtig HI (2018) The contribution of tau, amyloid-beta and alpha-synuclein pathology to dementia in Lewy body disorders. J Alzheimers Dis Parkinsonism 8(4):444. https://doi.org/10.4172/2161-0460.1000444\n29. Carey G, Görmezoğlu M, de Jong JJ, Hofman PA, Backes WH, Dujardin K et al (2021) Neuroimaging of anxiety in Parkinson's disease: a systematic review. Mov Disord 36(2):327-339. https://doi.org/10.1002/mds.28404\n30. Sharp SI, Ballard CG, Ziabreva I, Piggott MA, Perry RH, Perry EK et al (2008) Cortical serotonin 1A receptor levels are associated with depression in patients with dementia with Lewy bodies and Parkinson's disease dementia. Dement Geriatr Cogn 26(4):330-338. https://doi.org/10.1159/000161058", "doc_items_refs": ["#/texts/159", "#/texts/160", "#/texts/161", "#/texts/162", "#/texts/163"], "page_nos": [], "uuid": "392fadf6-4f97-4a1d-b67d-12786d149eea"}
{"doc_id": "2025__Neuroimaging_of_affective_symptoms_in_Lewy_body_dementia_A_systematic_review__W4413876650", "source_path": "<redacted:source_path>", "chunk_id": 29, "source_chunk_idxs": [39], "num_tokens": 466, "text": "Neuroimaging of affective symptoms in Lewy body dementia: A systematic review\nReferences\n31. Patterson L, Rushton SP, Attems J, Thomas AJ, Morris CM (2019) Degeneration of dopaminergic circuitry influences depressive symptoms in Lewy body disorders. Brain Pathol 29(4):544-557. https://doi.org/10.1111/bpa.12697\n32. Roselli F, Pisciotta NM, Perneczky R, Pennelli M, Aniello MS, De Caro MF et al (2009) Severity of neuropsychiatric symptoms and dopamine transporter levels in dementia with Lewy bodies: a 123I-FP-CIT SPECT study. Mov Disord 24(14):2097-2103. https://doi.org/10.1002/mds.22702\n33. Fischer NM, Hinkle JT, Perepezko K, Bakker CC, Morris M, Broen MP et al (2021) Brainstem pathologies correlate with depression and psychosis in Parkinson's disease. Am J Geriatr Psychiatry 29(9):958-968. https://doi.org/10.1016/j.jagp.2020.12.009\n34. Bohnen N, Kaufer D, Hendrickson R, Constantine G, Mathis C, Moore R (2007) Cortical cholinergic denervation is associated with depressive symptoms in Parkinson's disease and parkinsonian dementia. J Neurol Neurosurg Psychiatry 78(6):641-643. https://doi.org/10.1016/j.bbr.2009.12.048\n35. Remy P, Doder M, Lees A, Turjanski N, Brooks D (2005) Depression in Parkinson's disease: loss of dopamine and noradrenaline innervation in the limbic system. Brain 128(6):1314-1322. https://doi.org/10.1093/brain/awh445", "doc_items_refs": ["#/texts/164", "#/texts/165", "#/texts/166", "#/texts/167", "#/texts/168"], "page_nos": [], "uuid": "1aa1d1a6-0c0b-4ec3-9986-f94524dd45b9"}
{"doc_id": "2025__Neuroimaging_of_affective_symptoms_in_Lewy_body_dementia_A_systematic_review__W4413876650", "source_path": "<redacted:source_path>", "chunk_id": 30, "source_chunk_idxs": [40], "num_tokens": 428, "text": "Neuroimaging of affective symptoms in Lewy body dementia: A systematic review\nReferences\n36. Maillet A, Krack P, Lhommée E, Météreau E, Klinger H, Favre E et al (2016) The prominent role of serotonergic degeneration in apathy, anxiety and depression in de novo Parkinson's disease. Brain 139(9):2486-2502. https://doi.org/10.1093/brain/aww162\n37. Conio B, Martino M, Magioncalda P, Escelsior A, Inglese M, Amore M et al (2020) Opposite effects of dopamine and serotonin on resting-state networks: review and implications for psychiatric disorders. Mol Psychiatry 25(1):82-93. https://doi.org/10.1038/s41380-019-0406-4\n38. Drevets WC, Savitz J, Trimble M (2008) The subgenual anterior cingulate cortex in mood disorders. CNS Spectr 13(8):663. https://doi.org/10.1017/s1092852900013754\n39. Hu X, Song X, Li E, Liu J, Yuan Y, Liu W et al (2015) Altered resting-state brain activity and connectivity in depressed Parkinson's disease. PLoS ONE 10(7):e0131133. https://doi.org/10.1371/journal.pone.0131133\n40. Dan R, Růžička F, Bezdicek O, Růžička E, Roth J, Vymazal J et al (2017) Separate neural representations of depression, anxiety and apathy in Parkinson's disease. Sci Rep 7(1):12164. https://doi.org/10.1038/s41598-017-12457-6", "doc_items_refs": ["#/texts/169", "#/texts/170", "#/texts/171", "#/texts/172", "#/texts/173"], "page_nos": [], "uuid": "7ac8549b-cae3-4bda-b948-9953e7af4531"}
{"doc_id": "2025__Neuroimaging_of_affective_symptoms_in_Lewy_body_dementia_A_systematic_review__W4413876650", "source_path": "<redacted:source_path>", "chunk_id": 31, "source_chunk_idxs": [41], "num_tokens": 499, "text": "Neuroimaging of affective symptoms in Lewy body dementia: A systematic review\nReferences\n41. Gliaudelytė L, Rushton SP, Berlinguer-Palmini R, Thomas AJ, Morris CM (2025) Dopaminergic changes in the subgenual cingulate cortex in dementia with lewy bodies associates with presence of depression. Transl Psychiatry 15(1):89. https://doi.org/10.1038/s41398-025-03298-3\n42. Pagonabarraga J, Kulisevsky J, Strafella AP, Krack P (2015) Apathy in Parkinson's disease: clinical features, neural substrates, diagnosis, and treatment. Lancet Neurol 14(5):518-531. https://doi.org/10.1016/S1474-4422(15)00019-8\n43. Jellinger KA, Korczyn AD (2018) Are dementia with Lewy bodies and Parkinson's disease dementia the same disease? BMC Med 16(1):34. https://doi.org/10.1186/s12916-018-1016-8\n44. Weintraub D (2023) What's in a name? The time has come to unify Parkinson's disease and dementia with Lewy bodies. Mov Disord 38(11):1977-1981. https://doi.org/10.1002/mds.29590\n45. Power JH, Barnes OL, Chegini F (2017) L ewy Bodies and the Mechanisms of Neuronal Cell Death in Parkinson's Disease and Dementia with Lewy Bodies. Brain Pathol 27(1):3-12. https://doi.org/10.1111/bpa.12344\n46. Spillantini MG, Crowther RA, Jakes R, Hasegawa M, Goedert M (1998) α-Synuclein in filamentous inclusions of Lewy bodies from Parkinson's disease and dementia with Lewy bodies. Proc Natl Acad Sci 95(11):6469-6473. https://doi.org/10.1073/pnas.95.11.6469", "doc_items_refs": ["#/texts/174", "#/texts/175", "#/texts/176", "#/texts/177", "#/texts/178", "#/texts/179"], "page_nos": [], "uuid": "6d290a00-831d-4163-8afb-0ddd0c1a6b33"}
{"doc_id": "2025__Neuroimaging_of_affective_symptoms_in_Lewy_body_dementia_A_systematic_review__W4413876650", "source_path": "<redacted:source_path>", "chunk_id": 32, "source_chunk_idxs": [42], "num_tokens": 507, "text": "Neuroimaging of affective symptoms in Lewy body dementia: A systematic review\nReferences\n47. Postuma RB, Berg D, Stern M, Poewe W, Olanow CW, Oertel W et al (2015) MDS clinical diagnostic criteria for Parkinson's disease. Mov Disord 30(12):1591-1601. https://doi.org/10.1002/mds.26424\n48. Litvan I, Goldman JG, Troster AI, Schmand BA, Weintraub D, Petersen RC et al (2012) Diagnostic criteria for mild cognitive impairment in Parkinson's disease: Movement Disorder Society Task Force guidelines. Mov Disord 27(3):349-356. https://doi.org/10.1002/mds.24893\n49. McKeith IG, Ferman TJ, Thomas AJ, Blanc F, Boeve BF, Fujishiro H et al (2020) Research criteria for the diagnosis of prodromal dementia with Lewy bodies. Neurology 94(17):743-755. https://doi.org/10.1212/WNL.0000000000009323\n50. Goldman JG, Williams-Gray C, Barker RA, Duda JE, Galvin JE (2014) The spectrum of cognitive impairment in Lewy body diseases. Mov Disord 29(5):608-621. https://doi.org/10.1002/mds.25866\n51. Page MJ, McKenzie JE, Bossuyt PM, Boutron I, Hoffmann TC, Mulrow CD et al (2021) The PRISMA 2020 statement: an updated guideline for reporting systematic reviews. BMJ 372. https://doi.org/10.1136/bmj.n71\n52. Kasanuki K, Iseki E, Ota K, Kondo D, Ichimiya Y, Sato K, Arai H (2017) 123I-FP-CIT SPECT findings and its clinical relevance in prodromal dementia with Lewy bodies. Eur J Nucl Med Mol Imaging 44(3):358-365. https://doi.org/10.1007/s00259-016-3466-6", "doc_items_refs": ["#/texts/180", "#/texts/181", "#/texts/182", "#/texts/183", "#/texts/184", "#/texts/185"], "page_nos": [], "uuid": "d91c42a7-b747-4086-a1af-81cbbb255bad"}
{"doc_id": "2025__Neuroimaging_of_affective_symptoms_in_Lewy_body_dementia_A_systematic_review__W4413876650", "source_path": "<redacted:source_path>", "chunk_id": 33, "source_chunk_idxs": [43], "num_tokens": 451, "text": "Neuroimaging of affective symptoms in Lewy body dementia: A systematic review\nReferences\n53. Mazère J, Lamare F, Allard M, Fernandez P, Mayo W (2017) 123I-Iodobenzovesamicol SPECT Imaging of Cholinergic Systems in Dementia with Lewy Bodies. J Nucl Med 58(1):123-128. https://doi.org/10.2967/jnumed.116.176180\n54. Siepel F, Dalen I, Grüner R, Booij J, Brønnick K, Buter T et al (2016) Loss of Dopamine Transporter Binding and Clinical Symptoms in Dementia With Lewy Bodies. Mov Disord 31(1):118-125. https://doi.org/10.1002/mds.26327\n55. Yoo H, Lee S, Chung S, Lee Y, Ye B, Sohn Y et al (2020) Clinical and striatal dopamine transporter predictors of β-amyloid in dementia with Lewy bodies. Neurology 94(13):e1344-e52. https://doi.org/10.1212/WNL.0000000000009168\n56. Sturchio A, Svensson JE, Tiger M, Morén AF, Varrone A, Svenningsson P et al (2025) [18F] FE-PE2I PET is a diagnostic tool in dementia with Lewy bodies. PCN Rep 4(2):e70123. https://doi.org/10.1002/pcn5.70123\n57. Almeida O, Burton E, McKeith I, Gholkar A, Burn D, O'Brien J (2003) MRI study of caudate nucleus volume in Parkinson's disease with and without dementia with Lewy bodies and Alzheimer's disease. Dement Geriatr Cogn Disord 16(2):57-63. https://doi.org/10.1159/000070676", "doc_items_refs": ["#/texts/186", "#/texts/187", "#/texts/188", "#/texts/189", "#/texts/190"], "page_nos": [], "uuid": "0b3fa176-0103-4b57-9691-3ac611f54e70"}
{"doc_id": "2025__Neuroimaging_of_affective_symptoms_in_Lewy_body_dementia_A_systematic_review__W4413876650", "source_path": "<redacted:source_path>", "chunk_id": 34, "source_chunk_idxs": [44], "num_tokens": 452, "text": "Neuroimaging of affective symptoms in Lewy body dementia: A systematic review\nReferences\n58. Chang Y, Lu C, Wu M, Hsu S, Huang C, Chang W et al (2017) Salience Network and Depressive Severities in Parkinson's Disease with Mild Cognitive Impairment: A Structural Covariance Network Analysis. Front Aging Neurosc 9:417. https://doi.org/10.3389/fnagi.2017.00417\n59. Jaramillo-Jimenez A, Giil L, Tovar-Rios D, Borda M, Ferreira D, Brønnick K et al (2021) Association Between Amygdala Volume and Trajectories of Neuropsychiatric Symptoms in Alzheimer's Disease and Dementia With Lewy Bodies. Front Neurol 12:679984. https://doi.org/10.3389/fneur.2021.679984\n60. Querry M, Botzung A, Cretin B, Demuynck C, Muller C, Ravier A et al Neuroanatomical substrates of depression in dementia with Lewy bodies and Alzheimer's disease. GeroScience. 2024:1-20. https://doi.org/10.1007/s11357-024-01190-4\n61. Xing Y, Fu S, Li M, Ma X, Liu M, Liu X et al (2021) Regional neural activity changes in Parkinson's disease-associated mild cognitive impairment and cognitively normal patients. Neuropsychiatr Dis Treat 17. https://doi.org/10.2147/NDT.S323127\n62. Zhang P, Rong S, He C, Li Y, Li X, Chen Z et al (2023) Cortical connectivity of cholinergic basal forebrain in Parkinson's disease with mild cognitive impairment. Quant Imaging Med Surg 13(4):2167-2182. https://doi.org/10.21037/qims-22-582", "doc_items_refs": ["#/texts/191", "#/texts/192", "#/texts/193", "#/texts/194", "#/texts/195"], "page_nos": [], "uuid": "9a03c916-45fd-43a7-a646-394ca5c0a620"}
{"doc_id": "2025__Neuroimaging_of_affective_symptoms_in_Lewy_body_dementia_A_systematic_review__W4413876650", "source_path": "<redacted:source_path>", "chunk_id": 35, "source_chunk_idxs": [45], "num_tokens": 462, "text": "Neuroimaging of affective symptoms in Lewy body dementia: A systematic review\nReferences\n63. Querry M, Botzung A, Sourty M, Chabran E, Sanna L, Loureiro de Sousa P et al (2025) Functional Connectivity Changes Associated With Depression in Dementia With Lewy Bodies. Int J Geriatr Psychiatry 40(3):e70058. https://doi.org/10.1002/gps.70058\n64. Wright LM, Donaghy PC, Burn DJ, Taylor J-P, T O'Brien J, Yarnall AJ et al (2025) Brain network connectivity underlying neuropsychiatric symptoms in prodromal Lewy body dementia. Neurobiol Aging. https://doi.org/10.1016/j.neurobiolaging.2025.04.007\n65. Gan J, Shi Z, Zuo C, Zhao X, Liu S, Chen Y et al (2023) Analysis of positron emission tomography hypometabolic patterns and neuropsychiatric symptoms in patients with dementia syndromes. CNS Neurosci Ther 29(8):2193-2205. https://doi.org/10.1111/cns.14169\n66. Murayama T, Kobayashi S, Ishida T, Utsumi K, Kawanishi C (2022) Associations Between Regional Cerebral Blood Flow and Psychiatric Symptoms in Dementia With Lewy Bodies Without Parkinsonism. Am J Alzheimers Dis Other Deme 37:15333175221075109. https://doi.org/10.1177/15333175221075109\n67. Palermo G, Tommasini L, Aghakhanyan G, Frosini D, Giuntini M, Tognoni G et al (2019) Clinical correlates of cerebral amyloid deposition in Parkinson's disease dementia: Evidence from a PET study. J Alzheimers Dis 70(2):597-609. https://dx.doi.org/10.3233/JAD-190323", "doc_items_refs": ["#/texts/196", "#/texts/197", "#/texts/198", "#/texts/199", "#/texts/200"], "page_nos": [], "uuid": "259c7bd8-184f-41d8-a7ff-533744e30639"}
{"doc_id": "2025__Neuroimaging_of_affective_symptoms_in_Lewy_body_dementia_A_systematic_review__W4413876650", "source_path": "<redacted:source_path>", "chunk_id": 36, "source_chunk_idxs": [46], "num_tokens": 509, "text": "Neuroimaging of affective symptoms in Lewy body dementia: A systematic review\nReferences\n68. Zhang D, Zhou L, Lu C, Feng T, Liu J, Wu T (2024) Free-Water Imaging of the Nucleus Basalis of Meynert in Patients With Idiopathic REM Sleep Behavior Disorder and Parkinson Disease. Neurology 102(7):e209220. https://doi.org/10.1212/WNL.0000000000209220\n69. Cummings JL, Mega M, Gray K, Rosenberg-Thompson S, Carusi DA, Gornbein J (1994) The Neuropsychiatric Inventory: comprehensive assessment of psychopathology in dementia. Neurology 44(12):2308. https://doi.org/10.1212/wnl.44.12.2308\n70. van Mierlo TJ, Chung C, Foncke EM, Berendse HW, van den Heuvel OA (2015) Depressive symptoms in Parkinson's disease are related to decreased hippocampus and amygdala volume. Mov Disord 30(2):245-252. https://doi.org/10.1002/mds.26112\n71. Zanigni S, Sambati L, Evangelisti S, Testa C, Calandra-Buonaura G, Manners DN et al (2017) Precuneal thickness and depression in Parkinson disease. Neurodegener Dis 17(2-3):97-102. https://doi.org/10.1159/000450614\n72. Jellinger KA (2022) The pathobiological basis of depression in Parkinson disease: challenges and outlooks. J Neural Transm 129(12):1397-1418. https://doi.org/10.1007/s00702-022-02559-5\n73. Kaiser RH, Andrews-Hanna JR, Wager TD, Pizzagalli DA (2015) Large-scale network dysfunction in major depressive disorder: a meta-analysis of resting-state functional connectivity. JAMA Psychiatry 72(6):603-611. https://doi.org/10.1001/jamapsychiatry.2015.0071", "doc_items_refs": ["#/texts/201", "#/texts/202", "#/texts/203", "#/texts/204", "#/texts/205", "#/texts/206"], "page_nos": [], "uuid": "17fdb023-3779-4d7b-92ca-7f69f2cc2c81"}
{"doc_id": "2025__Neuroimaging_of_affective_symptoms_in_Lewy_body_dementia_A_systematic_review__W4413876650", "source_path": "<redacted:source_path>", "chunk_id": 37, "source_chunk_idxs": [47], "num_tokens": 457, "text": "Neuroimaging of affective symptoms in Lewy body dementia: A systematic review\nReferences\n74. Carmon J, Heege J, Necus JH, Owen TW, Pipa G, Kaiser M et al (2020) Reliability and comparability of human brain structural covariance networks. NeuroImage 220:117104. https://doi.org/10.1016/j.neuroimage.2020.117104\n75. Lou Y, Huang P, Li D, Cen Z, Wang B, Gao J et al (2015) Altered brain network centrality in depressed Parkinson's disease patients. Mov Disord 30(13):1777-1784. https://doi.org/10.1002/mds.26321\n76. Wei L, Hu X, Zhu Y, Yuan Y, Liu W, Chen H (2017) Aberrant intra-and internetwork functional connectivity in depressed Parkinson's disease. Sci Rep 7(1):2568. https://doi.org/10.1038/s41598-017-02127-y\n77. Bohnen NI, Albin RL (2011) The cholinergic system and Parkinson disease. Behav Brain Res 221(2):564-573. https://doi.org/10.1136/jnnp.2006.100073\n78. Dulawa SC, Janowsky DS (2019) Cholinergic regulation of mood: from basic and clinical studies to emerging therapeutics. Mol Psychiatry 24(5):694-709. https://doi.org/10.1038/s41380-018-0219-x\n79. Prange S, Klinger H, Laurencin C, Danaila T, Thobois S (2022) Depression in patients with Parkinson's disease: current understanding of its neurobiology and implications for treatment. Drugs Aging 39(6):417-439. https://doi.org/10.1007/s40266-022-00942-1", "doc_items_refs": ["#/texts/207", "#/texts/208", "#/texts/209", "#/texts/210", "#/texts/211", "#/texts/212"], "page_nos": [], "uuid": "9327c3d3-5e34-4570-bac2-8333475b6e08"}
{"doc_id": "2025__Neuroimaging_of_affective_symptoms_in_Lewy_body_dementia_A_systematic_review__W4413876650", "source_path": "<redacted:source_path>", "chunk_id": 38, "source_chunk_idxs": [48], "num_tokens": 504, "text": "Neuroimaging of affective symptoms in Lewy body dementia: A systematic review\nReferences\n80. Rektorova I, Biundo R, Marecek R, Weis L, Aarsland D, Antonini A (2014) Grey matter changes in cognitively impaired Parkinson's disease patients. PLoS ONE 9(1):e85595. https://doi.org/10.1371/journal.pone.0085595\n81. Dunlop BW, Nemeroff CB (2007) The role of dopamine in the pathophysiology of depression. Arch Gen Psychiatry 64(3):327-337. https://doi.org/10.1001/archpsyc.64.3.327\n82. Le Heron C, Apps M, Husain M (2018) The anatomy of apathy: a neurocognitive framework for amotivated behaviour. Neuropsychologia 118:54-67. https://doi.org/10.1016/j.neuropsychologia.2017.07.003\n83. Udo N, Hashimoto N, Toyonaga T, Isoyama T, Oyanagi Y, Narita H et al (2020) Apathy in Alzheimer's disease correlates with the dopamine transporter level in the caudate nuclei. Dement Geriatr Cogn Dis Extra 10(2):86-93. https://doi.org/10.1159/000509278\n84. Chatterjee A, Hirsch-Reinshagen V, Moussavi SA, Ducharme B, Mackenzie IR, Hsiung GYR (2021) Clinico-pathological comparison of patients with autopsy-confirmed Alzheimer's disease, dementia with Lewy bodies, and mixed pathology. Alzheimer's Dement: Diagn Assess Dis Monit 13(1):e12189. https://doi.org/10.1002/dad2.12189\n85. Jellinger KA, Attems J (2008) Prevalence and impact of vascular and Alzheimer pathologies in Lewy body disease. Acta Neuropathol 115(4):427-436. https://doi.org/10.1007/s00401-008-0347-5", "doc_items_refs": ["#/texts/213", "#/texts/214", "#/texts/215", "#/texts/216", "#/texts/217", "#/texts/218"], "page_nos": [], "uuid": "868e3a81-ae45-4641-8a17-0b58992af404"}
{"doc_id": "2025__Neuroimaging_of_affective_symptoms_in_Lewy_body_dementia_A_systematic_review__W4413876650", "source_path": "<redacted:source_path>", "chunk_id": 39, "source_chunk_idxs": [49], "num_tokens": 467, "text": "Neuroimaging of affective symptoms in Lewy body dementia: A systematic review\nReferences\n86. Merdes A, Hansen L, Jeste D, Galasko D, Hofstetter C, Ho G et al (2003) Influence of Alzheimer pathology on clinical diagnostic accuracy in dementia with Lewy bodies. Neurology 60(10):1586-1590. https://doi.org/10.1212/01.wnl.0000065889.42856.f2\n87. Babulal GM, Ghoshal N, Head D, Vernon EK, Holtzman DM, Benzinger TL et al (2016) Mood changes in cognitively normal older adults are linked to Alzheimer disease biomarker levels.\nAm J Geriatr Psychiatry\n. ;24(11):1095 - 104. https://doi.org/1095-1104.10.1016/j.jagp.2016.04.004\n88. Krell-Roesch J, Rakusa M, Syrjanen JA, van Harten AC, Lowe VJ, Jack CR Jr et al (2023) Association between CSF biomarkers of Alzheimer's disease and neuropsychiatric symptoms: Mayo Clinic Study of Aging. Alzheimers Dement 19(10):4498-4506. https://doi.org/10.1002/alz.12557\n89. Yasuno F, Minami H, Hattori H, Initiative ADN (2021) Relationship between neuropsychiatric symptoms and Alzheimer's disease pathology: An in vivo positron emission tomography study. Int J Geriatr Psychiatry 36(4):598-605. https://doi.org/10.1002/gps.5459\n90. Hampel H, Mesulam M-M, Cuello AC, Farlow MR, Giacobini E, Grossberg GT et al (2018) The cholinergic system in the pathophysiology and treatment of Alzheimer's disease. Brain 141(7):1917-1933. https://doi.org/10.1093/brain/awy132", "doc_items_refs": ["#/texts/219", "#/texts/220", "#/texts/221", "#/texts/222", "#/texts/223"], "page_nos": [], "uuid": "adde164b-20dd-42b9-9047-26047627f2a0"}
{"doc_id": "2025__Neuroimaging_of_affective_symptoms_in_Lewy_body_dementia_A_systematic_review__W4413876650", "source_path": "<redacted:source_path>", "chunk_id": 40, "source_chunk_idxs": [50], "num_tokens": 477, "text": "Neuroimaging of affective symptoms in Lewy body dementia: A systematic review\nReferences\n91. Buch AM, Liston C (2021) Dissecting diagnostic heterogeneity in depression by integrating neuroimaging and genetics. Neuropsychopharmacology 46(1):156-. https://doi.org/10.1038/s41386-020-00789-3 . 75\n92. Levy R, Dubois B (2006) Apathy and the functional anatomy of the prefrontal cortex-basal ganglia circuits. Cereb Cortex 16(7):916-928. https://doi.org/10.1093/cercor/bhj043\n93. Akiki TJ, Jubeir J, Bertrand C, Tozzi L, Williams LM (2025) Neural circuit basis of pathological anxiety. Nat Rev Neurosci 26(1):5-22. https://doi.org/10.1038/s41583-024-00880-4\n94. Burn DJ, Landau S, Hindle JV, Samuel M, Wilson KC, Hurt CS et al (2012) Parkinson's disease motor subtypes and mood. Mov Disord 27(3):379-386. https://doi.org/10.1002/mds.24041\n95. Elder GJ, Colloby SJ, Lett DJ, O'Brien JT, Anderson KN, Burn DJ et al (2016) Depressive symptoms are associated with daytime sleepiness and subjective sleep quality in dementia with Lewy bodies. Int J Geriatr Psychiatry 31(7):765-770. https://doi.org/10.1002/gps.4389\n96. Therrien S, Turnbull A, Anthony M, Conwell Y, Lin FV (2023) Influence of affective states on informant impression of neuropsychiatric symptoms in people living with MCI. Aging Ment Health 27(11):2128-2133. https://doi.org/10.1080/13607863.2023.2191928", "doc_items_refs": ["#/texts/224", "#/texts/225", "#/texts/226", "#/texts/227", "#/texts/228", "#/texts/229"], "page_nos": [], "uuid": "269246b5-e023-40b0-a1ff-209ddc2bf4a9"}
{"doc_id": "2025__Neuroimaging_of_affective_symptoms_in_Lewy_body_dementia_A_systematic_review__W4413876650", "source_path": "<redacted:source_path>", "chunk_id": 41, "source_chunk_idxs": [51, 52, 53, 54, 55, 56, 57, 58], "num_tokens": 361, "text": "Neuroimaging of affective symptoms in Lewy body dementia: A systematic review\nTables\nTables not available with this version.\n\nNeuroimaging of affective symptoms in Lewy body dementia: A systematic review\nAdditional Declarations\nThe authors declare no competing interests.\n\nNeuroimaging of affective symptoms in Lewy body dementia: A systematic review\nSupplementary Files\n- Supplemetarymaterial.pdf\nCite\nShare\nDownload PDF\n\nNeuroimaging of affective symptoms in Lewy body dementia: A systematic review\nSupplementary Files\nStatus:\nPosted\n\nNeuroimaging of affective symptoms in Lewy body dementia: A systematic review\nSupplementary Files\nVersion 1\nposted\nYou are reading this latest preprint version\nImage Hyperlink.\nResearch Square lets you share your work early, gain feedback from the community, and start making changes to your manuscript prior to peer review in a journal.\nAs a division of Research Square Company, we're committed to making research communication faster, fairer, and more useful. We do this by developing innovative software and high quality services for the global research community. Our growing team is made up of researchers and industry professionals working together to solve the most critical problems facing scientific publishing.\n\nNeuroimaging of affective symptoms in Lewy body dementia: A systematic review\nSupplementary Files\nVersion 1\nAlso discoverable on\nImage Hyperlink.\n\nNeuroimaging of affective symptoms in Lewy body dementia: A systematic review\nSupplementary Files\nVersion 1\nPlatform\nAbout\nOur Team\nIn Review\nEditorial Policies\nAdvisory Board\nHelp Center\n\nNeuroimaging of affective symptoms in Lewy body dementia: A systematic review\nSupplementary Files\nVersion 1\nResources\nAuthor Services\nResearch Quality Evaluation\nAccessibility\nAPI Access\nRSS feed\nManage Cookie Preferences\n© Research Square 2025 | ISSN 2693-5015 (online)\nPrivacy Policy\nTerms of Service\nDo Not Sell My Personal Information", "doc_items_refs": ["#/texts/231", "#/texts/233", "#/texts/235", "#/texts/236", "#/texts/237", "#/texts/238", "#/texts/240", "#/texts/242", "#/texts/243", "#/texts/244", "#/texts/245", "#/texts/246", "#/texts/248", "#/texts/250", "#/texts/251", "#/texts/252", "#/texts/253", "#/texts/254", "#/texts/255", "#/texts/257", "#/texts/258", "#/texts/259", "#/texts/260", "#/texts/261", "#/texts/262", "#/texts/263", "#/texts/264", "#/texts/265", "#/texts/266"], "page_nos": [], "uuid": "eeccc822-6faa-4581-94b8-99f29090c5ac"}
