{"doc_id": "2025__The_frequently_impaired_health_of_leaders_of_nuclear_weapon_states_an_analysis_o__W4412156883", "source_path": "<redacted:source_path>", "chunk_id": 0, "source_chunk_idxs": [0, 1, 2], "num_tokens": 443, "text": "The frequently impaired health of leaders of nuclear weapon states: an analysis of 51 deceased leaders | BMC Research Notes | Full Text\nSkip to main content\nAdvertisement\nSearch\n- Explore journals\n- Get published\n- About BMC\n- My account\nSearch all BMC articles\nSearch\nBMC Research Notes\n- Home\n- About\n- Articles\n- Submission Guidelines\n- Collections\n- Join the Editorial Board\n- Submit manuscript\nThe frequently impaired health of leaders of nuclear weapon states: an analysis of 51 deceased leaders\nDownload PDF\nDownload PDF\n- Research Note\n- Open access\n- Published: 08 July 2025\n\nThe frequently impaired health of leaders of nuclear weapon states: an analysis of 51 deceased leaders\n- Nick Wilson\n1\n,\n- George Thomson\n1\n&amp;\n- Matt Boyd\n2\nBMC Research Notes\nvolume 18\n, Article number: 278 ( 2025 )\nCite this article\n- 1627 Accesses\n- 105 Altmetric\n- Metrics details\nThis article has been\nupdated\n\nThe frequently impaired health of leaders of nuclear weapon states: an analysis of 51 deceased leaders\nAbstract\nThis descriptive study examined biographical data on the health conditions of 51 deceased leaders of the nine nuclear weapon states. It found that eight (17%) died from chronic disease while in office, with a mean of 3.9 health conditions per person (range: 1 to 10). A majority of these eight (62%) had cardiovascular disease and other conditions included personality disorders, depression, substance use disorders, and cognitive decline from multi-infarct dementia. Of the leaders leaving office alive, 15 (38%) were considered to have had health reasons playing a potential role in this departure. This group had a mean of 2.9 health conditions per person (range: 1 to 5), and all plausibly had their performance in office impaired by their health conditions (e.g., via a severe stroke, severe depression, likely personality disorders, mood and anxiety disorders, and substance use disorders). In conclusion, these findings indicate that physical and mental health conditions among leaders of these nuclear weapon states have been common (45% [23/51] of the leaders studied). Given the importance of the decision-making around nuclear weapons by political leaders, further research on this group should be prioritized.\nPeer Review reports", "doc_items_refs": ["#/texts/1", "#/texts/2", "#/texts/3", "#/texts/4", "#/texts/5", "#/texts/6", "#/texts/7", "#/texts/8", "#/texts/9", "#/texts/10", "#/texts/11", "#/texts/12", "#/texts/13", "#/texts/14", "#/texts/15", "#/texts/16", "#/texts/17", "#/texts/18", "#/texts/19", "#/texts/20", "#/texts/21", "#/texts/22", "#/texts/23", "#/texts/25", "#/texts/26", "#/texts/27", "#/texts/28", "#/texts/29", "#/texts/30", "#/texts/31", "#/texts/32", "#/texts/33", "#/texts/34", "#/texts/35", "#/texts/36", "#/texts/38", "#/texts/39"], "page_nos": [], "uuid": "93f4dc21-9335-4de1-8794-fa0bd9e35677"}
{"doc_id": "2025__The_frequently_impaired_health_of_leaders_of_nuclear_weapon_states_an_analysis_o__W4412156883", "source_path": "<redacted:source_path>", "chunk_id": 1, "source_chunk_idxs": [3], "num_tokens": 386, "text": "The frequently impaired health of leaders of nuclear weapon states: an analysis of 51 deceased leaders\nIntroduction\nThe risk of nuclear war may have been increasing in recent years due to growing international instability. In 2022 Russia invaded Ukraine and the Russian leadership has made repeated implied threats around nuclear weapons [\n1\n]. The New START (Strategic Arms Reduction Treaty) treaty looks set to expire in 2026 without replacement [\n2\n], and there is a general lack of meaningful progress with nuclear disarmament [\n3\n]. Some nuclear weapon states (NWS) are expanding their arsenals, including: China [\n4\n], Pakistan [\n5\n], North Korea [\n6\n], and the United Kingdom (UK) [\n7\n]. Furthermore, many NWS have poor track records of international relationships over time, participating in \"nuclear coercion\" on 19 occasions in the period 1946 to 2016 against another state [\n8\n].\nInformed by such issues, a major forecasting study reported a 3-11% chance of a nuclear catastrophe severe enough to kill more than 10% of humans by 2100 [\n9\n]. Nevertheless, this risk might increase further over time if developments in artificial intelligence destabilize nuclear deterrence [\n10\n].\nGood leadership and governance of NWS might be one potential mechanism to reduce such risks of nuclear war. There is evidence that leadership matters, as even when considering the constraints of domestic political institutions and the international system, \"who ends up in office plays a critical role in determining when and why countries go to war\" [\n11\n]. With some NWS, the issue of leadership might be particularly relevant, since the leader can in principle authorize the release of nuclear weapons on their own e.g., the apparent \"nuclear monarchy\" status of the US president [\n12\n]. In Russia, it appears that only two people are, in principle, needed to authorize such a launch [\n13\n].", "doc_items_refs": ["#/texts/41", "#/texts/42", "#/texts/43", "#/texts/44", "#/texts/45", "#/texts/46", "#/texts/47", "#/texts/48", "#/texts/49", "#/texts/50", "#/texts/51", "#/texts/52", "#/texts/53", "#/texts/54", "#/texts/55", "#/texts/56", "#/texts/57", "#/texts/58", "#/texts/59", "#/texts/60", "#/texts/61", "#/texts/62", "#/texts/63", "#/texts/64", "#/texts/65", "#/texts/66", "#/texts/67", "#/texts/68", "#/texts/69"], "page_nos": [], "uuid": "a254e6ee-1b33-47d0-87f1-e47b57c080ac"}
{"doc_id": "2025__The_frequently_impaired_health_of_leaders_of_nuclear_weapon_states_an_analysis_o__W4412156883", "source_path": "<redacted:source_path>", "chunk_id": 2, "source_chunk_idxs": [4], "num_tokens": 491, "text": "The frequently impaired health of leaders of nuclear weapon states: an analysis of 51 deceased leaders\nIntroduction\nPhysical and mental health of leaders\nThe mental and physical health of leaders may impede the decision-making abilities relevant to conflict. A study considered 37 US Presidents and reported that 18 (49%) met criteria suggesting psychiatric disorder: \"depression (24%), anxiety (8%), bipolar disorder (8%), and alcohol abuse/dependence (8%) were the most common. In 10 instances (27%), a disorder was evident during presidential office, which in most cases probably impaired job performance\" [\n14\n]. This pattern of findings is supported by survey evidence for politicians in general that indicates high levels of occupation-related stressors and adverse impacts on mental well-being [\n15\n,\n16\n,\n17\n,\n18\n,\n19\n] (including a 2024 review of 18 publications [\n20\n]). In particular, a study of Members of Parliament in the UK found that they had higher rates of \"common mental health problems\" at a prevalence of 34%, (95% CI: 27-42%) versus 17% (95% CI: 13-21%) in the high-income comparison group [\n19\n].\nOther work has taken a case study approach to the physical and mental health of incumbent leaders and the way that these conditions may have impacted on their performance [\n21\n,\n22\n,\n23\n,\n24\n], (see Supporting Information). A stand out example was the likely poor mental health of Khrushchev (Soviet Union) whose actions precipitated the Cuban Missile Crisis [\n25\n], and provoked the Berlin Crisis [\n26\n], both of which risked triggering a nuclear war. Another was the likely poor mental health of President Richard Nixon (US), who at various times was too intoxicated with alcohol to participate in key decision-making (e.g., during a Middle East crisis where others made a decision to raise the alert status of the US nuclear forces [\n27\n]).\nOverall, however, a recent study concluded that \"the intersection between psychiatry and democratic governance, specifically regarding mental health-related limitations in political leaders, remains largely underexamined\" [\n28\n]. Given this background, in this study we aimed to describe the health status of the leaders of NWS, using a data set of all the deceased leaders of NWS since the date when those states obtained nuclear weapons.", "doc_items_refs": ["#/texts/71", "#/texts/72", "#/texts/73", "#/texts/74", "#/texts/75", "#/texts/76", "#/texts/77", "#/texts/78", "#/texts/79", "#/texts/80", "#/texts/81", "#/texts/82", "#/texts/83", "#/texts/84", "#/texts/85", "#/texts/86", "#/texts/87", "#/texts/88", "#/texts/89", "#/texts/90", "#/texts/91", "#/texts/92", "#/texts/93", "#/texts/94", "#/texts/95", "#/texts/96", "#/texts/97", "#/texts/98", "#/texts/99", "#/texts/100", "#/texts/101", "#/texts/102", "#/texts/103", "#/texts/104", "#/texts/105"], "page_nos": [], "uuid": "75abd901-da07-4136-a3d4-16530e95cbd1"}
{"doc_id": "2025__The_frequently_impaired_health_of_leaders_of_nuclear_weapon_states_an_analysis_o__W4412156883", "source_path": "<redacted:source_path>", "chunk_id": 3, "source_chunk_idxs": [5, 6], "num_tokens": 327, "text": "The frequently impaired health of leaders of nuclear weapon states: an analysis of 51 deceased leaders\nMethods\nSelection of NWS and leaders\nWe included all nine current NWS and treated the Soviet Union and Russia as one continuous entity. The start date for defining a NWS was based on the timing of its first reported nuclear test explosion (see Supporting Information). We selected only deceased leaders for this study since this group typically have more detailed bibliographic data on their health status and there were none of the ethical concerns around describing the health of living leaders. These concerns include basic rights to privacy, the potentially reduced accuracy of any assessments when not involving a clinical consultation by a medical practitioner or clinical psychologist, and the risk of any reported health issues being misused for partisan political purposes.\n\nThe frequently impaired health of leaders of nuclear weapon states: an analysis of 51 deceased leaders\nMethods\nData on, and data sources for, the deceased leaders\nWe aimed to obtain at least one digital biography on each leader to obtain demographic information and reasons for leaving office. The focus on the \"reasons for leaving office\" aspect was because this latter period was typically relatively well documented compared to other times in office. Where digital biographies were not identified, we either obtained a hard copy biography or found information from other published journal articles or books (using PubMed and \"Elicit.org\", see Supporting Information for search terms). Failing those sources, we used media sources (e.g., the New York Times or the BBC). Digital biographies written by scholars (e.g., professors of history) were favored over other biographies (see the Supporting Information).", "doc_items_refs": ["#/texts/108", "#/texts/110"], "page_nos": [], "uuid": "56d153c6-65c6-4e34-803e-52db70afff78"}
{"doc_id": "2025__The_frequently_impaired_health_of_leaders_of_nuclear_weapon_states_an_analysis_o__W4412156883", "source_path": "<redacted:source_path>", "chunk_id": 4, "source_chunk_idxs": [7, 8], "num_tokens": 387, "text": "The frequently impaired health of leaders of nuclear weapon states: an analysis of 51 deceased leaders\nMethods\nData classification\nWe described specific health conditions as \"probable\" when there was some reasonable uncertainty about their occurrence, but where we judged this as more likely than not (i.e., 50% plus probability). Our judgement was informed by author participation in a similar study in New Zealand [\n24\n], and author training and experience (two authors have medical training and the lead author has worked as a medical practitioner in a psychiatric hospital setting). But for less likely health conditions and where there was still some suggestive documentation, we described these as \"possible\". This same \"possible/probable\" approach to classification was also used for assessing the role of health in the reason/s for leaving office where this was not otherwise clear.\nWe were cognizant that not \"every psychiatric diagnosis and disorder-associated symptom necessarily impacts all areas of psychosocial functioning\" and that \"suggesting otherwise perpetuates negative and anachronistic perspectives about mental health\" [\n28\n]. Furthermore, some experienced political leaders may have built up coping measures and ability to delegate to associates so that chronic illness might not significantly impair their leadership functions.\n\nThe frequently impaired health of leaders of nuclear weapon states: an analysis of 51 deceased leaders\nMethods\nAnalyses\nData were collated in an Excel spreadsheet and we conducted basic demographic analyses e.g., age that the leader left office for the last time (i.e., ignoring any earlier terms in office) and timing of death after leaving office. The date on which the data were finalized was 1 January 2024. The reasons for leaving office were analyzed, particularly in terms of the potential role of physical or mental health issues. Statistical analyses were conducted using the software packages EpiInfo (Version 7.2.5.0) and OpenEpi (Version 3).", "doc_items_refs": ["#/texts/112", "#/texts/113", "#/texts/114", "#/texts/115", "#/texts/116", "#/texts/117", "#/texts/119"], "page_nos": [], "uuid": "d71abc8c-f67d-4efa-93ea-5df9ea3dc401"}
{"doc_id": "2025__The_frequently_impaired_health_of_leaders_of_nuclear_weapon_states_an_analysis_o__W4412156883", "source_path": "<redacted:source_path>", "chunk_id": 5, "source_chunk_idxs": [9, 10], "num_tokens": 394, "text": "The frequently impaired health of leaders of nuclear weapon states: an analysis of 51 deceased leaders\nResults\nA total of 51 deceased leaders were identified for the nine NWS for the period since each state first obtained nuclear weapons. The highest number of leaders were for India (\nn\n= 9) and the fewest were for Pakistan and North Korea (both\nn\n= 1). Details on each leader are listed in Supporting Information Table\nS2\n.\nIn terms of background demographics, this group of leaders was dominated by males (94%). The mean age of the leaders of these NWS when leaving office for the last time was 69 years (Table\n1\n), with a maximum of 87 years (Deng, China). A majority of the leaders were aged 65 + years when leaving office (69%) and 29% were aged 75 + years.\n\nThe frequently impaired health of leaders of nuclear weapon states: an analysis of 51 deceased leaders\nResults\nDeath in office and preceding health conditions\nOver a fifth of the leaders (22%, 11/51), died in office. When excluding the three who were assassinated, there were eight deaths from chronic health conditions in office (Table\n1\n; Fig.\n1\n). The mean number of known health conditions for this group was 3.9 per person (SD = 2.8), with Mao having the most at 10 (Table\n2\n). Cardiovascular disease (heart attack or stroke) was the major cause of death for these chronic disease deaths (62%, 5/8; Table\n2\n). Mental health conditions were common and included probable personality disorders (Stalin, Mao and possibly Kim Jong Il), depression (Mao), probable anxiety disorder (Mao), and substance use disorders (Mao, Brezhnev, and possibly Kim Jong Il) (Table\n2\n). Cognitive decline was probable for Stalin and Brezhnev (both with multi-infarct dementia), and possibly also Konstantin Chernenko.\nFig. 1", "doc_items_refs": ["#/texts/121", "#/texts/122", "#/texts/123", "#/texts/124", "#/texts/125", "#/texts/126", "#/texts/127", "#/texts/128", "#/texts/129", "#/texts/130", "#/texts/132", "#/texts/133", "#/texts/134", "#/texts/135", "#/texts/136", "#/texts/137", "#/texts/138", "#/texts/139", "#/texts/140", "#/texts/141", "#/texts/142", "#/texts/143"], "page_nos": [], "uuid": "c25b7b22-9b7b-4fde-9178-64c0454ad670"}
{"doc_id": "2025__The_frequently_impaired_health_of_leaders_of_nuclear_weapon_states_an_analysis_o__W4412156883", "source_path": "<redacted:source_path>", "chunk_id": 6, "source_chunk_idxs": [11], "num_tokens": 485, "text": "The frequently impaired health of leaders of nuclear weapon states: an analysis of 51 deceased leaders\nResults\nHealth-related reasons for leaving office\nThe proportion of leaders leaving office alive with health reasons playing a potential role, was 38% (15/40) (Tables\n1\nand\n3\n; Fig.\n1\n). In three cases the leader was forced out of office, in another three they chose not to re-stand for office, and in nine cases they resigned. There was a slight overall decline over time in the proportion of non-fatal departures from office being related to health (Fig.\n1\n; and extended Mantel-Haenszel chi square for linear trend by decade: 3.86, p-value: 0.0495, 1 degree of freedom). When combined with chronic disease deaths in office, this downward trend in health reasons was only slightly more pronounced (chi square for linear trend: 4.38, p-value: 0.0364, 1 degree of freedom).\nOf these 15 leaders who potentially left office alive for health-related reasons, they had an average of 2.9 conditions per person (SD = 1.2; range: one to five). The most common condition was cardiovascular disease in 60% (9/15; Table\n3\n). Alcohol use disorder was considered potentially present in a third of these leaders (5/15) (with some classified as possible/probable). The same proportion may also have had some form of mood disorder (cyclothymia/bipolar disorder/depression), again with some of these only described as possible/probable. Less common were the possibility of personality disorders (2/15), anxiety disorders (2/15) and substance use disorder (1/15). The most common sensory impairment was partial deafness (20%, 3/15), and there was one leader with \"probable early stage of Alzheimer's disease\" (Harold Wilson).\nWhen considering together those 15 who left office with a possible/probable/actual health condition and those eight who died in office with a chronic disease vs. all the rest, the former had a slightly older mean age at the time of leaving office/dying. That is, 71.6 years vs. 67.6 years, albeit not a statistically significant difference (\np\n= 0.1192 [ANOVA], and excluding those who were assassinated).", "doc_items_refs": ["#/texts/145", "#/texts/146", "#/texts/147", "#/texts/148", "#/texts/149", "#/texts/150", "#/texts/151", "#/texts/152", "#/texts/153", "#/texts/154", "#/texts/155", "#/texts/156", "#/texts/157", "#/texts/158", "#/texts/159"], "page_nos": [], "uuid": "ebddf7e4-cfeb-4ff7-a691-f2c30d5374fa"}
{"doc_id": "2025__The_frequently_impaired_health_of_leaders_of_nuclear_weapon_states_an_analysis_o__W4412156883", "source_path": "<redacted:source_path>", "chunk_id": 7, "source_chunk_idxs": [12, 13], "num_tokens": 241, "text": "The frequently impaired health of leaders of nuclear weapon states: an analysis of 51 deceased leaders\nResults\nDeath shortly after leaving office\nFor those ex-leaders who died outside of office, the mean extra life after leaving office was 17 years (Table\n1\n). But this was as short as seven months in the case of François Mitterrand (France). He died from prostate cancer, a condition that appeared to impair him during his presidency.\n\nThe frequently impaired health of leaders of nuclear weapon states: an analysis of 51 deceased leaders\nDiscussion\nMain findings and interpretation\nDeath in office and preceding health conditions\nDying from chronic disease comprised 17% of departures from office in this study. Death as a cause of departure is a particular concern as it can be politically destabilizing regardless of the political system, and can trigger leadership struggles (e.g., the replacement of various Soviet and Chinese leaders). Death in office from chronic disease can also be associated with months to many years of the leader being health-impaired before death occurs (e.g., indeed, probably all the eight leaders listed in Table\n2\n). The mean number of health conditions in this group was relatively high at 3.9 per person.", "doc_items_refs": ["#/texts/161", "#/texts/162", "#/texts/163", "#/texts/167", "#/texts/168", "#/texts/169"], "page_nos": [], "uuid": "36ae14cd-0d3b-42aa-a852-d68a71c68338"}
{"doc_id": "2025__The_frequently_impaired_health_of_leaders_of_nuclear_weapon_states_an_analysis_o__W4412156883", "source_path": "<redacted:source_path>", "chunk_id": 8, "source_chunk_idxs": [14, 15], "num_tokens": 379, "text": "The frequently impaired health of leaders of nuclear weapon states: an analysis of 51 deceased leaders\nDiscussion\nMain findings and interpretation\nHealth reasons for leaving office\nThis analysis identified that of the leaders leaving office alive, over a third (38%) may have had health reasons that played a role in this departure. This group also had a mean of 2.9 conditions per person. But when considering these and the chronic disease deaths in office, there was a slight downward trend in the proportion of health-related reasons for leaving office (Fig.\n1\n). Such a decline may largely reflect background trends in population-wide improvements in health status as seen for a wider group of leaders in terms of declining cardiovascular disease mortality [\n29\n].\nDespite such a slight downward trend in health reasons for leaving office, the nature of the health issues we identified is still concerning. Indeed, all the 15 leaders listed in Table\n3\ncould plausibly have had their performance in office impaired by their respective health conditions. The degree of impairment might have ranged from relatively mild (for the two with possible anxiety disorders) up to profound, as in the case of Ariel Sharon (a stroke causing a coma) and Menachem Begin (whose depression was so severe he spent his last year as leader isolated in his home; see Supporting Information Table\nS2\n). Also of concern was the presence of leaders with likely personality disorders, mood and anxiety disorders, and substance use disorders (alcohol and other substances) (Table\n3\n).\n\nThe frequently impaired health of leaders of nuclear weapon states: an analysis of 51 deceased leaders\nDiscussion\nStudy strengths and limitations\nA strength of this study is that it is the first (to our knowledge) to systematically study the health status of a cohort of leaders of NWS. The study was also able to extensively use digital biographies upon which key word searches could be conducted. However, there remain multiple important limitations as detailed below:", "doc_items_refs": ["#/texts/171", "#/texts/172", "#/texts/173", "#/texts/174", "#/texts/175", "#/texts/176", "#/texts/177", "#/texts/178", "#/texts/179", "#/texts/180", "#/texts/181", "#/texts/182", "#/texts/184"], "page_nos": [], "uuid": "00551141-b8d6-4ae6-bfa6-7b9e9feb6d6e"}
{"doc_id": "2025__The_frequently_impaired_health_of_leaders_of_nuclear_weapon_states_an_analysis_o__W4412156883", "source_path": "<redacted:source_path>", "chunk_id": 9, "source_chunk_idxs": [16], "num_tokens": 366, "text": "The frequently impaired health of leaders of nuclear weapon states: an analysis of 51 deceased leaders\nDiscussion\nStudy strengths and limitations\nMissing data\nThere is likely to have been important data on health issues around the time of the leader leaving office that was missing from some of the examined sources. This may have particularly been a problem for the autocracies where health information on the leadership has typically been more closely guarded (e.g., China and North Korea). But more generally there was typically far more detail in the often multiple English-language biographies of leaders of the US, UK, Soviet Union/Russia and Israel, than for leaders of China, India, Pakistan, and North Korea. Nevertheless, even autocracies have difficulty avoiding a sick leader making occasional public appearances (where they can be seen by foreign observers).\nThere may also have been occasions where health information about these leaders has still been obscured. Afterall, there are at least nine US presidents for which important health information has been withheld from the public [\n30\n]. This includes three in the dataset of this study i.e.: \"Eisenhower's doctor initially described his heart attack in 1955 as 'a digestive upset.' John F. Kennedy's aides lied about his Addison's disease. Ronald Reagan's administration hid the extent of his injuries after he was shot in 1981 and the signs of his dementia in later years\" [\n30\n]. To this list can be added the non-disclosure of health issues involving: Truman's possible heart disease [\n31\n], Nixon's misuse of alcohol [\n27\n], Churchill's stroke in 1953 [\n32\n], Mitterrand's cancer [\n21\n], Pompidou's cancer [\n22\n], and Golda Meir's cancer [\n33\n].", "doc_items_refs": ["#/texts/186", "#/texts/187", "#/texts/188", "#/texts/189", "#/texts/190", "#/texts/191", "#/texts/192", "#/texts/193", "#/texts/194", "#/texts/195", "#/texts/196", "#/texts/197", "#/texts/198", "#/texts/199", "#/texts/200", "#/texts/201", "#/texts/202", "#/texts/203"], "page_nos": [], "uuid": "b20da3e0-498f-47fb-bd54-c1fd60f43d03"}
{"doc_id": "2025__The_frequently_impaired_health_of_leaders_of_nuclear_weapon_states_an_analysis_o__W4412156883", "source_path": "<redacted:source_path>", "chunk_id": 10, "source_chunk_idxs": [17, 18], "num_tokens": 346, "text": "The frequently impaired health of leaders of nuclear weapon states: an analysis of 51 deceased leaders\nDiscussion\nStudy strengths and limitations\nData quality\nIn a few cases, the start and end dates of some leadership periods was imprecise due to political power maneuverings (see Supporting Information Table\nS2\nfor details). While we used qualifiers (such as \"possible\" or \"probable\") for some of the potential health reasons for a leader leaving office and for the conditions themselves, these assessments were sometimes based on relatively sparse and inconclusive information. For example, Truman's \"possible\" anxiety disorder (Table\n2\n) was largely based on comments by his wife on his headaches and on his self-reported sleeping difficulties (Supporting Information Table\nS2\n). Similarly, there is uncertainty around Kim Jong Il having a \"possible\" personality disorder. This has been argued for by the psychiatrist Jerrold Post and others have noted he was \"intensely paranoid\" [\n34\n], while the author Breen disagrees and believes his behavior was congruent with the cultural context of North Korea [\n35\n] (see Supporting Information Table\nS3\n).\n\nThe frequently impaired health of leaders of nuclear weapon states: an analysis of 51 deceased leaders\nDiscussion\nStudy strengths and limitations\nNot considering health issues that did not relate to leaving office\nIn the analysis of reasons for leaving office, we did not consider the health issues where these did not relate to leaving office - since such information would generally have been even harder to comprehensively obtain (especially for leaders of autocracies). However, we recognize this is a gap that could be the subject of future research. Examples of where such conditions are likely, or certainly, to have impeded a leader's performance include:", "doc_items_refs": ["#/texts/205", "#/texts/206", "#/texts/207", "#/texts/208", "#/texts/209", "#/texts/210", "#/texts/211", "#/texts/212", "#/texts/213", "#/texts/214", "#/texts/215", "#/texts/216", "#/texts/217", "#/texts/219"], "page_nos": [], "uuid": "0055badf-aef5-4c42-a8b1-c051b43217a5"}
{"doc_id": "2025__The_frequently_impaired_health_of_leaders_of_nuclear_weapon_states_an_analysis_o__W4412156883", "source_path": "<redacted:source_path>", "chunk_id": 11, "source_chunk_idxs": [19], "num_tokens": 429, "text": "The frequently impaired health of leaders of nuclear weapon states: an analysis of 51 deceased leaders\nDiscussion\nStudy strengths and limitations\nNot considering health issues that did not relate to leaving office\n- Dwight Eisenhower (US) - despite finishing as leader when his term limit was reached, he had multiple conditions during his presidency e.g., a heart attack, surgery for a bowel obstruction and a stroke [\n36\n]. In the 11 months after his September 1955 heart attack, it was reported that he was \"incapacitated for six of them\" [\n36\n].\n- John F. Kennedy (US) - who had poor health in his first two years in office (i.e., from Addison's disease [see above], back pain, and misuse of anabolic steroids and amphetamines) [\n21\n,\n23\n]. This period covered his authorization of the Bay of Pigs fiasco and his poor performance at a Vienna Summit with Soviet leader Khrushchev [\n21\n].\n- François Mitterrand (France) - despite finishing when at the conclusion of his term limit, he had unofficially been impaired by cancer for some time and died just months after leaving office (Table\n1\n). E.g., his personal doctor in late 1994 stated that he \"had concluded that the President was no longer capable of carrying out his duties\" [\n21\n].\n- Ronald Reagan (US) - despite finishing when his term limit ended, he may have been impaired in the last part of his presidency with early dementia [\n37\n,\n38\n,\n39\n]. (The under-appreciated severity of his gunshot injuries is also relevant - as mentioned above.)\n- Atal Bihari Vajpayee (India) - despite finishing when he lost an election, he had a range of health conditions during his leadership. These including apparent memory loss, periods of confusion and periods of \"indecipherable ramblings\" [\n40\n]. His poor health meant he came to \"heavily depend on a handful of people, physically and otherwise. And that led to things going out of control...\" [\n41\n].", "doc_items_refs": ["#/texts/220", "#/texts/221", "#/texts/222", "#/texts/223", "#/texts/224"], "page_nos": [], "uuid": "89ab2422-d60e-477f-9974-5fcb703d364a"}
{"doc_id": "2025__The_frequently_impaired_health_of_leaders_of_nuclear_weapon_states_an_analysis_o__W4412156883", "source_path": "<redacted:source_path>", "chunk_id": 12, "source_chunk_idxs": [20], "num_tokens": 463, "text": "The frequently impaired health of leaders of nuclear weapon states: an analysis of 51 deceased leaders\nDiscussion\nStudy strengths and limitations\nPossible future research and policy responses\nGiven the above limitations, there appears to be considerable scope for further historical research on the physical and mental health of this cohort of leaders of NWS, including during their whole time in office and potentially earlier in their careers. The research agenda should also be expanded to include former leaders of NWS who are still alive (\nn\n= 29 as of 1 January 2024) and the nine incumbent leaders. While there are difficulties with such data on living people (given the privacy and secrecy issues), further research could clarify what aspects of this information is in the public interest and the appropriate ethical safeguards required.\nIn terms of other research techniques, lexical analysis of the word use of leaders over time is one promising method in detecting early dementia, as per the published research on Reagan [\n37\n], and Harold Wilson [\n42\n]. Another approach to understanding a leader applied an \"operational code scheme\" to a corpus of over one million words spoken by President Vladimir Putin across his time in office [\n43\n]. Studying the public utterances and behavior patterns of politicians can also be used to potentially inform leader health and personality issues (e.g., as used in the US context [\n44\n,\n45\n,\n46\n]). Artificial intelligence (AI) tools could potentially facilitate such analyses and consider a wide range of data sources including the \"leader's published writings, interviews, social media activity, speeches, videos, media appears and interviews with the leader's intimates, contacts, colleagues...\" [\n47\n].\nStudying any associations between leader health and nuclear weapon related decision-making is important but difficult, given the complexities around the role of the leader and defining nuclear weapon-related crises e.g., the six \"borderline\" cases in a list of 19 documented nuclear crises [\n8\n]. Potential other data sources relating to leader decision-making could include data around diplomatic initiatives (both peaceful and aggressive), non-nuclear crises, and changes in militarism metrics [\n48\n]. Declassified meeting minutes and personal notes, along with interviews of key informants who worked with the leader could all be used to study decision-making.", "doc_items_refs": ["#/texts/226", "#/texts/227", "#/texts/228", "#/texts/229", "#/texts/230", "#/texts/231", "#/texts/232", "#/texts/233", "#/texts/234", "#/texts/235", "#/texts/236", "#/texts/237", "#/texts/238", "#/texts/239", "#/texts/240", "#/texts/241", "#/texts/242", "#/texts/243", "#/texts/244", "#/texts/245", "#/texts/246", "#/texts/247", "#/texts/248"], "page_nos": [], "uuid": "23252c6b-099c-4424-8b4b-eb4263cc1bf2"}
{"doc_id": "2025__The_frequently_impaired_health_of_leaders_of_nuclear_weapon_states_an_analysis_o__W4412156883", "source_path": "<redacted:source_path>", "chunk_id": 13, "source_chunk_idxs": [21, 22, 23], "num_tokens": 383, "text": "The frequently impaired health of leaders of nuclear weapon states: an analysis of 51 deceased leaders\nDiscussion\nStudy strengths and limitations\nPossible future research and policy responses\nTo reduce the risk of impaired leaders contributing to nuclear war, potential contextual measures include removing nuclear weapons from high alert status, adopting no first use policies, having multiple people being required to authorise any weapons launch, and progressing nuclear disarmament treaties. Concerning the actual leaders, potential options for the less autocratic and more open states are to have term limits for the leader (which are not currently used in all NWS), and to have recall systems (where voters can petition for a politician to be recalled). A more rigorous measure might be to require medical and psychological assessments by a politically independent expert panel both before and during office [\n21\n,\n49\n] (although some argue against this approach [\n50\n]). Maintaining a strong media with investigative journalists can also help expose impairment in leaders and expose attempts by their enablers to hide any such impairments. Determining the optimal mix of such approaches to dealing with impaired leaders will require an interdisciplinary approach. As Smith et al. argue, it \"may involve additional exchanges between policymakers, alongside interdisciplinary dialogues between psychiatrists, psychologists, legal scholars, and political actors\" [\n28\n]. Finally, at the individual political leader level, there are a range of proposals for how improved system design could reduce stress on politicians and better address their mental health needs [\n15\n,\n18\n].\n\nThe frequently impaired health of leaders of nuclear weapon states: an analysis of 51 deceased leaders\nData availability\nAll data generated or analyzed during this study are included in this published article and its supporting information files.\n\nThe frequently impaired health of leaders of nuclear weapon states: an analysis of 51 deceased leaders\nChange history\n- 02 August 2025 The original online version of this article was revised: The hyperlinks for the two supplementary files' link were inadvertently interchanged.", "doc_items_refs": ["#/texts/249", "#/texts/250", "#/texts/251", "#/texts/252", "#/texts/253", "#/texts/254", "#/texts/255", "#/texts/256", "#/texts/257", "#/texts/258", "#/texts/259", "#/texts/260", "#/texts/261", "#/texts/263", "#/texts/265"], "page_nos": [], "uuid": "0ae849f9-1ef5-4e5a-8e24-749282d7591c"}
{"doc_id": "2025__The_frequently_impaired_health_of_leaders_of_nuclear_weapon_states_an_analysis_o__W4412156883", "source_path": "<redacted:source_path>", "chunk_id": 14, "source_chunk_idxs": [24], "num_tokens": 379, "text": "The frequently impaired health of leaders of nuclear weapon states: an analysis of 51 deceased leaders\nReferences\n1. Mecklin J. A time of unprecedented danger: it is 90 seconds to midnight. 2023 doomsday clock statement. Bull At Sci. 2023.\nhttps://storage.pardot.com/878782/1674512728rAkm0Vt3/2023\\_doomsday\\_clock\\_statement.pdf\n2. Sanger D. Putin's move on Nuclear Treaty may signal end to formal arms control. NY Times. 2023; (21 February).\nhttps://www.nytimes.com/2023/2002/2021/world/europe/putin-new-start-treaty.amp.html\n3. Diaz-Maurin F. The 2022 nuclear year in review: A global nuclear order in shambles. Bull At Sci. 2022.\n4. Kristensen HM, Korda M, Johns E, Knight M. Chinese nuclear weapons, 2024. Bull At Sci. 2024;80(1):49-72.\nArticle\nGoogle Scholar\n5. Kristensen HM, Korda M, Johns E. Pakistan nuclear weapons, 2023. Bull At Sci. 2023;79(5):329-345.\n6. Kristensen HM, Korda M, Johns E, Knight M. North Korean nuclear weapons, 2024. Bull At Sci. 2024;80(4):251-71.\nArticle\nGoogle Scholar\n7. Kristensen HM, Korda M. United Kingdom nuclear weapons, 2021. Bull At Sci. 2021;77(3):153-158.\n8. Sechser TS, Fuhrmann M. Nuclear weapons and coercive diplomacy. Cambridge University Press (Kindle edition); 2017.", "doc_items_refs": ["#/texts/267", "#/texts/268", "#/texts/269", "#/texts/270", "#/texts/271", "#/texts/272", "#/texts/273", "#/texts/274"], "page_nos": [], "uuid": "9e3c96ee-1ef8-4253-8543-c0de4882a40e"}
{"doc_id": "2025__The_frequently_impaired_health_of_leaders_of_nuclear_weapon_states_an_analysis_o__W4412156883", "source_path": "<redacted:source_path>", "chunk_id": 15, "source_chunk_idxs": [25], "num_tokens": 476, "text": "The frequently impaired health of leaders of nuclear weapon states: an analysis of 51 deceased leaders\nReferences\n9. Karger E, Rosenberg J, Jacobs Z, Hickman M, Hadshar R, Gamin K, Smith T, Williams B, McCaslin T, Tetlock P. Forecasting existential risks: evidence from a long-run forecasting tournament (FRI Working Paper #1). Forecasting Research Institute; 2023.\nhttps://static1.squarespace.com/static/635693acf15a3e2a14a56a4a/t/64abffe3f024747dd0e38d71/1688993798938/XPT.pdf\n10. Johnson J. AI and the bomb: nuclear strategy and risk in the digital age. Oxford University Press; 2023.\n11. Horowitz MC, Stam AC, Ellis CM. Why leaders fight. Cambridge University Press; 2015.\n12. Hennigan W, Weinberger J. The United States is living under a nuclear monarchy. N Y Times. 2024;(19 March).\nhttps://www.nytimes.com/2024/2003/2019/opinion/nuclear-sole-authority.html?searchResultPosition=2021\n13. Ven Bruusgaard K. How Russia decides to go nuclear. Deciphering the way Moscow handles its ultimate weapon. Foreign Aff. 2023;6 (6 February).\n14. Davidson JR, Connor KM, Swartz M. Mental illness in US Presidents between 1776 and 1974: a review of biographical sources. J Nerv Ment Dis. 2006;194(1):47-51.\nArticle\nPubMed\nGoogle Scholar\n15. Weinberg A. The mental well-being of politicians. In: Weinberg A, editor. Psychology of democracy: Of the people, by the people, for the people. Cambridge: Cambridge University Press; 2022. p. 146-170.\nhttps://www.cambridge.org/core/books/abs/psychology-of-democracy/mental-wellbeing-of-politicians/859C25447ACEADCBE56E0878C7457BCA", "doc_items_refs": ["#/texts/275", "#/texts/276", "#/texts/277", "#/texts/278", "#/texts/279", "#/texts/280", "#/texts/281"], "page_nos": [], "uuid": "7aa84220-921f-45d3-9648-64911f407d96"}
{"doc_id": "2025__The_frequently_impaired_health_of_leaders_of_nuclear_weapon_states_an_analysis_o__W4412156883", "source_path": "<redacted:source_path>", "chunk_id": 16, "source_chunk_idxs": [26], "num_tokens": 501, "text": "The frequently impaired health of leaders of nuclear weapon states: an analysis of 51 deceased leaders\nReferences\n16. Weinberg A, Cooper CL. Stress among national politicians elected to Parliament for the first time. Stress Health. 2003;19(2):111-7.\nArticle\nGoogle Scholar\n17. Weinberg A, Cooper CL, Weinberg A. Workload, stress and family life in British members of Parliament and the psychological impact of reforms to their working hours. Stress Med. 1999;15(2):79-87.\nArticle\nGoogle Scholar\n18. Apolitical Foundation. Mere mortals: the state of politicians' mental wellbeing and why it matters. Apolitical Foundation. 2023.\nhttps://www.betterpolitics.foundation/report/mere-mortals%3A-the-state-of-politicians%27-mental-wellbeing-and-why-it-matters\n19. Poulter D, Votruba N, Bakolis I, Debell F, Das-Munshi J, Thornicroft G. Mental health of UK members of Parliament in the House of C ommons: a cross-sectional survey. BMJ Open. 2019;9(7):e027892.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n20. Smith A, Hachen S, Weinberg A, Falkai P, Guttormsen S, Liebrenz M. The weight of office? A scoping review of mental health issues and risk factors in elected politicians across democratic societies. Int J Soc Psychiatry. 2024:00207640241291523.\n21. Owen D. Sickness and in power: illness in heads of government, military and business leaders since 1900. Methuen; 2016.\n22. Post JM, Robins RS. When illness strikes the leader: the dilemma of the captive king. Yale University Press; 1995.\n23. Ghaemi N. A first-rate madness: uncovering the links between leadership and mental illness. Penguin Publishing Group (Kindle edition); 2012.\n24. Horrocks J, Thomson G, Wilson N. Case studies of health-impaired prime ministers in Aotearoa New Zealand. N Z Med J. 2025;139(1612):92-9.\nGoogle Scholar\n25. Hastings M. Abyss. The Cuban Missile Crisis 1962. William Collins (Kindle edition); 2022.", "doc_items_refs": ["#/texts/282", "#/texts/283", "#/texts/284", "#/texts/285", "#/texts/286", "#/texts/287", "#/texts/288", "#/texts/289", "#/texts/290", "#/texts/291"], "page_nos": [], "uuid": "e31f39bb-c991-4c43-8be4-a66c56f0ac3d"}
{"doc_id": "2025__The_frequently_impaired_health_of_leaders_of_nuclear_weapon_states_an_analysis_o__W4412156883", "source_path": "<redacted:source_path>", "chunk_id": 17, "source_chunk_idxs": [27], "num_tokens": 481, "text": "The frequently impaired health of leaders of nuclear weapon states: an analysis of 51 deceased leaders\nReferences\n26. Taubman W. Khrushchev: the man and his era. WW Norton &amp; Company; 2003.\n27. Weiner T. One man against the world: the tragedy of Richard Nixon. Macmillan; 2015.\n28. Smith A, Theil S, Hart S, Liebrenz M. Mental health-related limitations and political leadership in Germany: a multidisciplinary analysis of legal, psychiatric, and ethical frameworks. Int J Law Psychiatry. 2023;89:101908.\nArticle\nPubMed\nGoogle Scholar\n29. Girardi AM, Pyenson LR, Morris J, Brickfield FX. Impact of coronary heart disease on world leaders. Ann Intern Med. 2001;134(4):287-90.\nArticle\nCAS\nPubMed\nGoogle Scholar\n30. Leonhardt D, Philbrick IP. Presidential medical secrets. N Y Times. 2024;(11 July).\nhttps://www.nytimes.com/2024/07/11/briefing/president-biden-age-election.html?smid=nytcore-ios-share&amp;referringSource=articleShare\n31. Huget J. The secret heart of Harry Truman: diary reveals diagnosis of 'cardiac asthma': hushed-up then, obscure still. Washington Post. 2003;(21 July). /.\nhttps://www.washingtonpost.com/archive/lifestyle/wellness/2003/07/22/the-secret-heart-of-harry-truman/1aea4663-ab69-49d5-ae5b-ed60ae4195b3\n32. Roberts A. Churchill: walking with destiny. Penguin (Kindle edition); 2018.\n33. Burkett E. Golda. HarperCollins e-books; 2008.\n34. Fifield A. The great successor: the secret rise and rule of Kim Jong Un. John Murray (Kindle edition); 2019.\n35. Breen M. Kim Jong-Il, revised and updated. Wiley (Kindle edition); 2012.\n36. Hitchcock WI. The age of Eisenhower: America and the world in the 1950s. Simon and Schuster; 2018.", "doc_items_refs": ["#/texts/292", "#/texts/293", "#/texts/294", "#/texts/295", "#/texts/296", "#/texts/297", "#/texts/298", "#/texts/299", "#/texts/300", "#/texts/301", "#/texts/302"], "page_nos": [], "uuid": "22882b91-d2dc-4f96-80a2-0e1b3fd3cfa0"}
{"doc_id": "2025__The_frequently_impaired_health_of_leaders_of_nuclear_weapon_states_an_analysis_o__W4412156883", "source_path": "<redacted:source_path>", "chunk_id": 18, "source_chunk_idxs": [28], "num_tokens": 446, "text": "The frequently impaired health of leaders of nuclear weapon states: an analysis of 51 deceased leaders\nReferences\n37. Berisha V, Wang S, LaCross A, Liss J. Tracking discourse complexity preceding Alzheimer's disease diagnosis: a case study comparing the press conferences of presidents Ronald Reagan and George Herbert Walker Bush. J Alzheimers Dis. 2015;45(3):959-63.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n38. Brands HW. Reagan: the life. Anchor; 2016.\n39. Corn D. How close did Lesley Stahl come to reporting Reagan had Alzheimer's while in office?? Very close. Mother Jones. 2011;(20 January).\nhttps://www.motherjones.com/politics/2011/01/reagan-alzheimers-family-feud-lesley-stahl/\n40. Perry A. Asleep at the wheel? Time. 2002;(10 June).\nhttps://content.time.com/time/subscriber/article/0,33009,260747,00.html\n41. Ullekh N. The untold Vajpayee: politician and paradox. Random House India (Kindle edition); 2018.\n42. Garrard P. Cognitive archaeology: uses, methods, and results. J Neurolinguistics. 2009;22(3):250-65.\nArticle\nGoogle Scholar\n43. Dyson S, Parent M. The operational code approach to profiling political leaders: understanding Vladimir Putin. Intell Natl Secur. 2018;33(1):84-100.\nArticle\nGoogle Scholar\n44. Lee BX. The dangerous case of Donald Trump: 37 psychiatrists and mental health experts assess a President - updated and expanded with new essays. St. Martin's Publishing Group (Kindle edition); 2019.\n45. McWhorter J. What a linguist hears when Biden speaks. N Y Times. 2024;(11 July).\nhttps://www.nytimes.com/2024/07/11/opinion/biden-speaking-linguist.html?searchResultPosition=1", "doc_items_refs": ["#/texts/303", "#/texts/304", "#/texts/305", "#/texts/306", "#/texts/307", "#/texts/308", "#/texts/309", "#/texts/310", "#/texts/311"], "page_nos": [], "uuid": "1db76b46-0498-44cc-874e-27a7e8425c13"}
{"doc_id": "2025__The_frequently_impaired_health_of_leaders_of_nuclear_weapon_states_an_analysis_o__W4412156883", "source_path": "<redacted:source_path>", "chunk_id": 19, "source_chunk_idxs": [29], "num_tokens": 289, "text": "The frequently impaired health of leaders of nuclear weapon states: an analysis of 51 deceased leaders\nReferences\n46. Baker P, Freedman D. Trump's speeches, increasingly angry and rambling, reignite the question of age. N Y Times. 2024;(6 October).\nhttps://www.nytimes.com/2024/10/06/us/politics/trump-speeches-age-cognitive-decline.html?smid=nytcore-ios-share&amp;referringSource=articleShare\n47. Dekleva K. Leadership analysis and political psychology in the 21st century. J Am Acad Psychiatry Law. 2018;46(3):359-63.\nPubMed\nGoogle Scholar\n48. Zafirovski M. Indicators of militarism and democracy in comparative context: how militaristic tendencies influence democratic processes in OECD countries 2010-2016. Soc Indic Res. 2020;147:159-202.\nArticle\nGoogle Scholar\n49. Carter J. Presidential disability and the Twenty-Fifth Amendment: a President's perspective. JAMA. 1994;272(21):1698-1698.\nArticle\nCAS\nPubMed\nGoogle Scholar\n50. Gilbert RE. Coping with presidential disability: the proposal for a standing medical commission. Politics Life Sci. 2003;22(1):2-13.\nArticle\nPubMed\nGoogle Scholar\nDownload references", "doc_items_refs": ["#/texts/312", "#/texts/313", "#/texts/314", "#/texts/315", "#/texts/316", "#/texts/317"], "page_nos": [], "uuid": "02ebc9cb-4028-48e3-ba6c-5fb0eee32a65"}
{"doc_id": "2025__The_frequently_impaired_health_of_leaders_of_nuclear_weapon_states_an_analysis_o__W4412156883", "source_path": "<redacted:source_path>", "chunk_id": 20, "source_chunk_idxs": [30, 31, 32, 33, 34], "num_tokens": 276, "text": "The frequently impaired health of leaders of nuclear weapon states: an analysis of 51 deceased leaders\nFunding\nNil.\n\nThe frequently impaired health of leaders of nuclear weapon states: an analysis of 51 deceased leaders\nAuthor information\nAuthors and Affiliations\n1. University of Otago Wellington, Mein St, Newtown, Wellington, New Zealand Nick Wilson &amp; George Thomson\n2. Adapt Research Ltd, 14 Broadway Rd, Reefton, New Zealand Matt Boyd\nAuthors\n1. Nick Wilson\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n2. George Thomson\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n3. Matt Boyd\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n\nThe frequently impaired health of leaders of nuclear weapon states: an analysis of 51 deceased leaders\nAuthor information\nContributions\nN.W. developed the study idea, with study design input from G.T. and M.B. Data collection, analysis and writing of the first draft was by N.W. All authors contributed to revising drafts and reviewed the final manuscript.\n\nThe frequently impaired health of leaders of nuclear weapon states: an analysis of 51 deceased leaders\nAuthor information\nCorresponding author\nCorrespondence to\nNick Wilson\n.\n\nThe frequently impaired health of leaders of nuclear weapon states: an analysis of 51 deceased leaders\nEthics declarations\nEthics approval\nApproval for this study was provided through the ethics approval process of the University of Otago (Category B, 21 September 2022).", "doc_items_refs": ["#/texts/319", "#/texts/322", "#/texts/323", "#/texts/324", "#/texts/325", "#/texts/326", "#/texts/327", "#/texts/329", "#/texts/331", "#/texts/332", "#/texts/333", "#/texts/336"], "page_nos": [], "uuid": "4963c470-0452-4988-9eff-4b26b1f498f1"}
{"doc_id": "2025__The_frequently_impaired_health_of_leaders_of_nuclear_weapon_states_an_analysis_o__W4412156883", "source_path": "<redacted:source_path>", "chunk_id": 21, "source_chunk_idxs": [35, 36, 37, 38, 39, 40], "num_tokens": 423, "text": "The frequently impaired health of leaders of nuclear weapon states: an analysis of 51 deceased leaders\nEthics declarations\nConsent to participate\nNot applicable (all leaders deceased with all data utilized being already published and in the public domain).\n\nThe frequently impaired health of leaders of nuclear weapon states: an analysis of 51 deceased leaders\nEthics declarations\nConsent for publication\nNot applicable (all leaders deceased with all data utilized being already published and in the public domain).\n\nThe frequently impaired health of leaders of nuclear weapon states: an analysis of 51 deceased leaders\nEthics declarations\nCompeting interests\nThe authors declare no competing interests.\n\nThe frequently impaired health of leaders of nuclear weapon states: an analysis of 51 deceased leaders\nAdditional information\nPublisher's note\nSpringer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations.\n\nThe frequently impaired health of leaders of nuclear weapon states: an analysis of 51 deceased leaders\nElectronic supplementary material\nBelow is the link to the electronic supplementary material.\n\nThe frequently impaired health of leaders of nuclear weapon states: an analysis of 51 deceased leaders\nRights and permissions\nOpen Access\nThis article is licensed under a Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International License, which permits any non-commercial use, sharing, distribution and reproduction in any medium or format, as long as you give appropriate credit to the original author(s) and the source, provide a link to the Creative Commons licence, and indicate if you modified the licensed material. You do not have permission under this licence to share adapted material derived from this article or parts of it. The images or other third party material in this article are included in the article's Creative Commons licence, unless indicated otherwise in a credit line to the material. If material is not included in the article's Creative Commons licence and your intended use is not permitted by statutory regulation or exceeds the permitted use, you will need to obtain permission directly from the copyright holder. To view a copy of this licence, visit\nhttp://creativecommons.org/licenses/by-nc-nd/4.0/\n.\nReprints and permissions", "doc_items_refs": ["#/texts/338", "#/texts/340", "#/texts/342", "#/texts/345", "#/texts/347", "#/texts/351", "#/texts/352", "#/texts/353", "#/texts/354", "#/texts/355"], "page_nos": [], "uuid": "9871665f-4315-4a29-b99c-63db0bc0b07c"}
{"doc_id": "2025__The_frequently_impaired_health_of_leaders_of_nuclear_weapon_states_an_analysis_o__W4412156883", "source_path": "<redacted:source_path>", "chunk_id": 22, "source_chunk_idxs": [41, 42, 43, 44], "num_tokens": 261, "text": "The frequently impaired health of leaders of nuclear weapon states: an analysis of 51 deceased leaders\nAbout this article\nCite this article\nWilson, N., Thomson, G. &amp; Boyd, M. The frequently impaired health of leaders of nuclear weapon states: an analysis of 51 deceased leaders.\nBMC Res Notes\n18\n, 278 (2025). https://doi.org/10.1186/s13104-025-07351-8\nDownload citation\n- Received : 14 December 2024\n- Accepted : 01 July 2025\n- Published : 08 July 2025\n- DOI : https://doi.org/10.1186/s13104-025-07351-8\n\nThe frequently impaired health of leaders of nuclear weapon states: an analysis of 51 deceased leaders\nAbout this article\nKeywords\n- Mental health\n- Physical health\n- Politicians\n- Leaders\n- Nuclear weapon states\n- Nuclear war\nDownload PDF\nAdvertisement\n\nThe frequently impaired health of leaders of nuclear weapon states: an analysis of 51 deceased leaders\nAbout this article\nKeywords\nBMC Research Notes\nISSN: 1756-0500\n\nThe frequently impaired health of leaders of nuclear weapon states: an analysis of 51 deceased leaders\nAbout this article\nKeywords\nContact us\n- General enquiries:\njournalsubmissions@springernature.com", "doc_items_refs": ["#/texts/358", "#/texts/359", "#/texts/360", "#/texts/361", "#/texts/362", "#/texts/363", "#/texts/364", "#/texts/365", "#/texts/366", "#/texts/368", "#/texts/369", "#/texts/370", "#/texts/371", "#/texts/372", "#/texts/373", "#/texts/374", "#/texts/375", "#/texts/377", "#/texts/379"], "page_nos": [], "uuid": "295482a9-71a8-413a-bda9-a35be31aa431"}
