{"doc_id": "2025__An_innovative_health_systems_approach_to_support_early_detection_of_cognitive_im__W4413790860", "source_path": "<redacted:source_path>", "chunk_id": 0, "source_chunk_idxs": [0, 1, 2], "num_tokens": 367, "text": "An innovative health systems approach to support early detection of cognitive impairment in primary care - the brain health navigator | BMC Primary Care | Full Text\nSkip to main content\nAdvertisement\nSearch\n- Explore journals\n- Get published\n- About BMC\n- My account\nSearch all BMC articles\nSearch\nBMC Primary Care\n- Home\n- About\n- Articles\n- Submission Guidelines\n- Join the board\n- Collections\n- Submit manuscript\nAn innovative health systems approach to support early detection of cognitive impairment in primary care - the brain health navigator\nDownload PDF\nDownload PDF\n- Research\n- Open access\n- Published: 28 August 2025\n\nAn innovative health systems approach to support early detection of cognitive impairment in primary care - the brain health navigator\n- Jared R. Brosch\n1\n,\n- Diana Summanwar\n6\n,\n- Nicole R. Fowler\n2\n,\n3\n,\n4\n,\n- Dustin B. Hammers\n1\n,\n- Anthony J. Perkins\n5\n,\n- Anna Higbie\n3\n,\n4\n,\n- Kristen Swartzell\n6\n&amp;\n- ...\n- Deanna R. Willis\n6\nShow authors\nBMC Primary Care\nvolume 26\n, Article number: 271 ( 2025 )\nCite this article\n- 8726 Accesses\n- Metrics details\n\nAn innovative health systems approach to support early detection of cognitive impairment in primary care - the brain health navigator\nAbstract\nBackground\nPatients and providers experience barriers to early detection of mild cognitive impairment (MCI) and dementia. We developed a new primary care-based role, the Brain Health Navigator (BHN), who is trained to assess patients for cognitive impairment, identify addressable causes, suggest appropriate diagnostic testing, connect patients to resources, and assist patients in accessing disease-modifying treatments and dementia care management. This study describes the BHN role, the feasibility of implementing the BHN in Primary Care (PC) clinics, and the initial patients' outcomes for those who saw the BHN.", "doc_items_refs": ["#/texts/1", "#/texts/2", "#/texts/3", "#/texts/4", "#/texts/5", "#/texts/6", "#/texts/7", "#/texts/8", "#/texts/9", "#/texts/10", "#/texts/11", "#/texts/12", "#/texts/13", "#/texts/14", "#/texts/15", "#/texts/16", "#/texts/17", "#/texts/18", "#/texts/19", "#/texts/20", "#/texts/21", "#/texts/22", "#/texts/23", "#/texts/25", "#/texts/26", "#/texts/27", "#/texts/28", "#/texts/29", "#/texts/30", "#/texts/31", "#/texts/32", "#/texts/33", "#/texts/34", "#/texts/35", "#/texts/36", "#/texts/37", "#/texts/38", "#/texts/39", "#/texts/40", "#/texts/43"], "page_nos": [], "uuid": "a8755a8a-00bc-476c-80c5-0b8c6ff143bf"}
{"doc_id": "2025__An_innovative_health_systems_approach_to_support_early_detection_of_cognitive_im__W4413790860", "source_path": "<redacted:source_path>", "chunk_id": 1, "source_chunk_idxs": [3, 4, 5, 6], "num_tokens": 434, "text": "An innovative health systems approach to support early detection of cognitive impairment in primary care - the brain health navigator\nAbstract\nMethods\nPatients ≥65 years were screened with a Digital Cognitive Assessment (DCA) in seven PC clinics from June 1, 2022, to May 31, 2023. Patients who scored likely cognitively impaired or borderline for impairment were eligible for referral to the BHN. Clinics and providers could determine if referrals were automatic or on a patient-by-patient basis. The BHN encounter included a comprehensive assessment of standardized tools and suggested laboratory and imaging studies to facilitate the diagnostic process and connect patients to resources, care and treatment, and research opportunities.\n\nAn innovative health systems approach to support early detection of cognitive impairment in primary care - the brain health navigator\nAbstract\nResults\n466 of 861 patients with likely impaired or borderline impaired DCA results were referred to the BHN.More patients with likely impaired scores (62.7%) were referred to the BHN compared to those with borderline scores (47.6%). Of the 466 referred patients, 28.9% with likely impaired scores and 23.5% with borderline scores completed a BHN visit. Patients who were seen by the BHN had a significantly higher likelihood of receiving a new diagnosis of MCI than patients who did not see the BHN and were more likely to have orders for diagnostic tests, such as vitamin B12 thyroid function and Magnetic Resonance Imaging of the head and neck. Referrals to both neurology and neuropsychology were significantly more common among patients who completed the BHN visit.\n\nAn innovative health systems approach to support early detection of cognitive impairment in primary care - the brain health navigator\nAbstract\nConclusions\nA BHN enhances follow-up care and monitoring for patients with abnormal cognitive screening tests. A BHN visit increases the rate of evidence-based diagnostic evaluation for MCI and dementia in PC.\n\nAn innovative health systems approach to support early detection of cognitive impairment in primary care - the brain health navigator\nAbstract\nTrial Registration\nThis study was designated as exempt by the Indiana University Institutional Review Board (#15281).\nPeer Review reports", "doc_items_refs": ["#/texts/45", "#/texts/47", "#/texts/49", "#/texts/51", "#/texts/52"], "page_nos": [], "uuid": "43eae209-6421-4b67-b5b8-bcca9d10bc84"}
{"doc_id": "2025__An_innovative_health_systems_approach_to_support_early_detection_of_cognitive_im__W4413790860", "source_path": "<redacted:source_path>", "chunk_id": 2, "source_chunk_idxs": [7], "num_tokens": 394, "text": "An innovative health systems approach to support early detection of cognitive impairment in primary care - the brain health navigator\nBackground\nIn the United States, Medicare Annual Wellness Visits (AWVs) are often cited as a mechanism to increase early detection of Alzheimer's Disease and related dementias in primary care [\n1\n]. A key component of AWVs is the detection of cognitive impairment through clinician observation, family-reported observations, or the use of brief cognitive assessment tools [\n2\n]. However, the uptake and effectiveness of the AWV has been limited due to underutilization, lack of a recommended cognitive assessment tool, and lack of follow up of abnormal cognitive assessments [\n3\n,\n4\n,\n5\n,\n6\n,\n7\n].\nOne of the most cited barriers to early detection of Alzheimer's Disease and Related Dementias (ADRD) in primary care is the lack of a structured process for diagnostic follow-up when a patient screens as cognitively impaired or presents with subjective cognitive complaints. This is compounded for primary care providers by barriers such as limited time, access to informants who know the patient well, and a lack of comfort or confidence in talking about cognition alone or within the context of other chronic conditions [\n8\n,\n9\n]. From the perspective of the patient, barriers to early detection include lack of knowledge about the differences between symptoms of early dementia versus normal aging [\n6\n,\n7\n], stigma around dementia and fear of potential loss of autonomy, and uncertainty about navigating the healthcare system following an abnormal cognitive screening. These barriers create gaps for patients that lead to underdiagnosis, delayed diagnoses, reduced access to treatment, decreased involvement in clinical research, worse behavioral and psychological symptoms of dementia, and poor management of comorbidities [\n10\n,\n11\n]. As a result, patients with dementia frequently have higher healthcare utilization and worse health outcomes, which may lead to an increased burden and higher stress of family caregivers [\n12\n,\n13\n].", "doc_items_refs": ["#/texts/54", "#/texts/55", "#/texts/56", "#/texts/57", "#/texts/58", "#/texts/59", "#/texts/60", "#/texts/61", "#/texts/62", "#/texts/63", "#/texts/64", "#/texts/65", "#/texts/66", "#/texts/67", "#/texts/68", "#/texts/69", "#/texts/70", "#/texts/71", "#/texts/72", "#/texts/73", "#/texts/74", "#/texts/75", "#/texts/76", "#/texts/77", "#/texts/78", "#/texts/79", "#/texts/80", "#/texts/81", "#/texts/82", "#/texts/83", "#/texts/84", "#/texts/85"], "page_nos": [], "uuid": "cbb6fb55-c0b1-4a3b-8995-9da7425cd5d8"}
{"doc_id": "2025__An_innovative_health_systems_approach_to_support_early_detection_of_cognitive_im__W4413790860", "source_path": "<redacted:source_path>", "chunk_id": 3, "source_chunk_idxs": [8], "num_tokens": 381, "text": "An innovative health systems approach to support early detection of cognitive impairment in primary care - the brain health navigator\nBackground\nIn other models for detecting disease, processes for assisting patients to navigate the complex interface between primary care and specialty care have been shown to have positive patient and provider outcomes. For example, in cancer care, nurse navigators have been shown to successfully increase patient rates of adherence to follow-up care after an abnormal screening, increase patient satisfaction, and decrease anxiety [\n2\n,\n14\n,\n15\n,\n16\n,\n17\n]. Patient navigation in primary care emerged in the 1990 s and has grown as a method to facilitate access to care, bridge gaps in care for complex patients caused by healthcare fragmentation, assist in coordinating care across the healthcare system continuum, and connect patients and their families and caregivers to community resources [\n18\n]. Nurse navigator models in primary care have been shown to reduce barriers to specialty care for patients with chronic diseases, have high provider and patient satisfaction [\n19\n], and significantly improve adherence to recommended care [\n20\n].\nThe recommended evaluation following a positive screening test for cognitive impairment in primary care [\n21\n] has many of the complex elements that are ideal for care navigation. For example, further initial workup may include a detailed review of comorbidities, reconciliation and review of prescription and over-the-counter medications, screening for depression, identification of laboratory abnormalities, an assessment of structural brain changes such as vascular disease, stroke, or atrophy, and patient education. Increasing the reliability and effectiveness of a primary care-based diagnostic evaluation process through the use of care navigation has the potential to improve the diagnostic journey for patients and providers and by facilitating appropriate referrals and lessening primary care provider burden for supporting post-diagnosis care. Additionally, a brain health care navigator in primary care could help to ensure access to dementia treatments and care management for the right patients at the right time.", "doc_items_refs": ["#/texts/86", "#/texts/87", "#/texts/88", "#/texts/89", "#/texts/90", "#/texts/91", "#/texts/92", "#/texts/93", "#/texts/94", "#/texts/95", "#/texts/96", "#/texts/97", "#/texts/98", "#/texts/99", "#/texts/100", "#/texts/101", "#/texts/102", "#/texts/103", "#/texts/104", "#/texts/105"], "page_nos": [], "uuid": "7f2b2157-5255-4052-a946-d53320c1cc30"}
{"doc_id": "2025__An_innovative_health_systems_approach_to_support_early_detection_of_cognitive_im__W4413790860", "source_path": "<redacted:source_path>", "chunk_id": 4, "source_chunk_idxs": [9], "num_tokens": 474, "text": "An innovative health systems approach to support early detection of cognitive impairment in primary care - the brain health navigator\nBackground\nNew disease-modifying treatments for Alzheimer's Disease (AD), specifically monoclonal antibodies targeting amyloid beta, are intended for individuals in the earliest stages of disease, primarily individuals who complete most activities independently. In the Phase 3 clinical trial for lecanemab, approximately 62% of treated individuals had Mild Cognitive Impairment (MCI) [\n22\n]. Therefore, it has been suggested that the ideal candidates for anti-amyloid drugs are individuals who are able to perform activities of daily life without assistance and may appear cognitively normal during casual encounters, including with physicians at routine office visits. Timely diagnosis of and consultation for patients who are optimal for treatment is low [\n20\n]. The majority of new AD treatments are intended for early symptomatic and MCI stages, indicating a clear trend in the future direction of AD management toward early detection and intervention. This further highlights the need for improving and enhancing primary care pathways for detection and patient care.\nBiomarkers for diagnosing AD are becoming more important in the context of AD care and treatment. Prevention studies are treating individuals who have biomarker evidence of disease even before cognitive changes become apparent which some postulate may be the ideal time to treat AD [\n23\n,\n24\n]. Blood-based biomarkers are increasingly available, and future diagnostic pathways will likely be facilitated by primary care, creating the need for primary care-based shared decision-making, patient education, and counseling based on biomarker testing and other results [\n25\n].\nAdding the volume and complexity of these tasks to primary care practices is challenging. In the U.S. healthcare system, identified gaps exist in primary care provider (PCP) knowledge and comfort with diagnosing cognitive impairment, primary care-based management of dementia and related conditions, and PCPs' belief in the effectiveness of therapeutic options [\n26\n,\n27\n,\n28\n] Health system structures including insufficient time, inadequate support resources, and lack of reimbursable billing options are cited as significant additional constraints by PCPs [\n29\n]. Collaborative models of dementia care have been explored, developed, and validated over the years to address and overcome barriers, providing system approaches that have improved care where these models are feasible [\n30\n,\n31\n,\n32\n].", "doc_items_refs": ["#/texts/106", "#/texts/107", "#/texts/108", "#/texts/109", "#/texts/110", "#/texts/111", "#/texts/112", "#/texts/113", "#/texts/114", "#/texts/115", "#/texts/116", "#/texts/117", "#/texts/118", "#/texts/119", "#/texts/120", "#/texts/121", "#/texts/122", "#/texts/123", "#/texts/124", "#/texts/125", "#/texts/126", "#/texts/127", "#/texts/128", "#/texts/129", "#/texts/130", "#/texts/131", "#/texts/132"], "page_nos": [], "uuid": "e2b0514a-b011-49b3-afd4-73a19cd92b4e"}
{"doc_id": "2025__An_innovative_health_systems_approach_to_support_early_detection_of_cognitive_im__W4413790860", "source_path": "<redacted:source_path>", "chunk_id": 5, "source_chunk_idxs": [10], "num_tokens": 265, "text": "An innovative health systems approach to support early detection of cognitive impairment in primary care - the brain health navigator\nBackground\nInadequate representation of people from racial and ethnic minorities in AD clinical trials has been identified as a significant concern among the scientific community. Recruitment for brain health research from primary care practices has been identified as a potential opportunity [\n33\n] particularly since older adults seeking primary care tend to be representative of the community [\n34\n]. However, lack of connections between primary care practices and AD research opportunities has historically been a barrier to leveraging this potential [\n35\n].\nGiven the numerous challenges facing patients experiencing cognitive decline and PCPs diagnosing dementia, we developed and implemented a patient care nurse (registered nurse) navigator-the Brain Health Navigator (BHN)-as support for the primary care team in the management of care for persons following an abnormal screening test. The role of the BHN was designed to assess cognitive impairment, facilitate the characterization of potential addressable causes, connect patients and their caregivers with community and research resources, and streamline entry to the clinical treatment pathway when needed. The purpose of this study is to demonstrate the feasibility of implementing a primary care-based BHN to improve the reliability and effectiveness of the diagnostic assessment process in primary care of patients who screen borderline for cognitive impairment or likely cognitively impaired.", "doc_items_refs": ["#/texts/133", "#/texts/134", "#/texts/135", "#/texts/136", "#/texts/137", "#/texts/138", "#/texts/139", "#/texts/140"], "page_nos": [], "uuid": "a38bfc16-cdb1-4143-8273-afa1804c641f"}
{"doc_id": "2025__An_innovative_health_systems_approach_to_support_early_detection_of_cognitive_im__W4413790860", "source_path": "<redacted:source_path>", "chunk_id": 6, "source_chunk_idxs": [11], "num_tokens": 400, "text": "An innovative health systems approach to support early detection of cognitive impairment in primary care - the brain health navigator\nMethods\nThe Indiana University (IU) and IU Health flagship site of the Davos Alzheimer's Collaborative Healthcare System Preparedness Early Detection Program integrated the Linus Health Core Cognitive Evaluation Digital Cognitive Assessments (DCA) into seven IU Health primary care clinics in the greater Indianapolis area to screen patients 65 years and older who arrived for a primary care visit [\n36\n,\n37\n,\n38\n]. Under a waiver of consent and authorization for this pragmatic project, clinical data were collected for routine primary care for 12 months pre- and 90 days post-index DCA and 90 days post BHN visit. Screening results were presented to the patient's primary care provider with a report that used a stop-light system: green, yellow, or red indicated\nunimpaired\n,\nborderline for impairment\n, or\nlikely cognitively impaired\nrespectively [\n39\n]. During the one-year project period from June 1, 2022, to May 31, 2023, patients who completed at least one DCA with a result with a borderline or likely impaired result were eligible for referral to the BHN. Referrals to the BHN were at the discretion of the PCP. Providers had the option to refer individual patients at the time of visit (individual-based referral), review a list of patients with borderline or likely impaired results and refer patients from the list, or opt to automatically refer patients with either or both borderline or likely impaired screen (rule-based referrals). The method of provider referral was tracked for each referred patient. Based on implementation of the DCA in the practices, no patients with unimpaired results were referred to the BHN. Providers who chose not to have a DCA result-based rule referring patients to the BHN were able to send patients to the BHN on a patient-by-patient basis.", "doc_items_refs": ["#/texts/142", "#/texts/143", "#/texts/144", "#/texts/145", "#/texts/146", "#/texts/147", "#/texts/148", "#/texts/149", "#/texts/150", "#/texts/151", "#/texts/152", "#/texts/153", "#/texts/154", "#/texts/155", "#/texts/156"], "page_nos": [], "uuid": "f99ea6d6-a243-4413-9955-e38235733436"}
{"doc_id": "2025__An_innovative_health_systems_approach_to_support_early_detection_of_cognitive_im__W4413790860", "source_path": "<redacted:source_path>", "chunk_id": 7, "source_chunk_idxs": [12], "num_tokens": 239, "text": "An innovative health systems approach to support early detection of cognitive impairment in primary care - the brain health navigator\nMethods\nDue to the pragmatic nature of this study, capacity for contacting and seeing patients referred to the BHN was limited in the early part of the study period as the position was being developed and implemented. To the greatest extent possible, efforts were made to reach out to all previously referred patients throughout the study period while maintaining outreach and capacity to recently referred patients. Referred patients were sent an introductory letter or message in the Electronic Health Record (EHR) patient portal asking them to call and schedule an appointment, followed by three phone call attempts by the BHN. Patients remained under the care of their PCP even if they were referred to or seen by the BHN at any point. BHN visits were conducted in the patient's primary care clinic or in another participating primary care clinic if the location and schedule was more convenient. At the time of scheduling, patients were encouraged by the scheduler to bring a family member or a care partner to the BHN appointment. The same process was used for patients referred individually by their provider and patients referred based on a provider referral rule.", "doc_items_refs": ["#/texts/157"], "page_nos": [], "uuid": "41ff3cce-5d7a-4512-8c98-e80c703cf107"}
{"doc_id": "2025__An_innovative_health_systems_approach_to_support_early_detection_of_cognitive_im__W4413790860", "source_path": "<redacted:source_path>", "chunk_id": 8, "source_chunk_idxs": [13], "num_tokens": 464, "text": "An innovative health systems approach to support early detection of cognitive impairment in primary care - the brain health navigator\nMethods\nPrior to the BHN visit, the BHN reviewed the patients' EHR for all comorbidities, and medications and previous brain related testing, labs, and primary care notes. During the BHN visit, they reviewed the patients' DCA results with them and answered their questions about the test results. Additional data collection at the visit included a Montreal Cognitive Assessment (MoCA) [\n40\n] to further characterize the patient's cognitive status. The BHN evaluated addressable causes of cognitive impairment using a variety of structured assessment tools. The Patient Health Questionnaire-9 (PHQ-9) [\n41\n] and Generalized Anxiety Disorder-7 (GAD-7) [\n42\n] were used to assess depression and anxiety. Vascular risk was assessed with the Atherosclerotic Cardiovascular Disease risk score (ASCVD) [\n43\n]. After a complete medication reconciliation of prescription and over-the-counter medications, an Anticholinergic Burden Scale (ACBS) [\n44\n] was used to calculate the anticholinergic burden. Any medication that contributed to an elevated anticholinergic burden was highlighted in a communication to the PCP. Following the visit, the BHN reviewed the patient's EHR again and proposed additional laboratory tests or brain imaging to the PCP based on the assessed findings from the evaluation for addressable causes. Order proposals included tests such as vitamin B12 level, thyroid stimulating hormone (TSH), radiologic brain imaging, and, when indicated by an elevated sleep apnea screening score [\n45\n], a sleep study.\nAt the following visit, the BHN provided education on community resources, based on a repository assembled by a social worker and a registered nurse, including local and national resources (e.g., Alzheimer's Association) and a list of local dementia caregiver support groups. The BHN also initiated and engaged in discussions with each patient and their care partner about establishing power of attorney, elder care law services, and connecting patients with home and community-based services such as area agencies on aging, as appropriate. Both electronic and paper-based resources were provided to patients and care partners during the BHN visit.", "doc_items_refs": ["#/texts/158", "#/texts/159", "#/texts/160", "#/texts/161", "#/texts/162", "#/texts/163", "#/texts/164", "#/texts/165", "#/texts/166", "#/texts/167", "#/texts/168", "#/texts/169", "#/texts/170", "#/texts/171"], "page_nos": [], "uuid": "c8dae852-43d4-47b4-b83b-3d213f536e91"}
{"doc_id": "2025__An_innovative_health_systems_approach_to_support_early_detection_of_cognitive_im__W4413790860", "source_path": "<redacted:source_path>", "chunk_id": 9, "source_chunk_idxs": [14], "num_tokens": 470, "text": "An innovative health systems approach to support early detection of cognitive impairment in primary care - the brain health navigator\nMethods\nPatients referred to the BHN were ultimately triaged into categories based on the results of their workup: those with cognitive symptoms from potentially reversible or intervenable causes, those with complex medical conditions likely to require more comprehensive testing and care, and those with suspected neurodegenerative diseases. When appropriate, the BHN proposed laboratory, imaging, and referral orders for specialists to the PCP. Expedited referral workflows were developed and implemented with neurology, geriatrics, social work, and other specialists. This referral process did not differentiate referral options by level of cognitive impairment.\nAs part of the BHN protocol, patients were offered to participate in research opportunities through either a handoff to a clinical research coordinator or to a research recruitment registry, depending upon their interest and eligibility. As part of an embedded pilot research study, which was approved by the Institutional Review Board and will be reported separately, the BHN offered patients the opportunity to undergo blood-based biomarker testing to assist in their diagnostic process and have their results disclosed to them. A board-certified behavioral neurologist (first author JRB) provided a one-hour educational video to train PCPs on biomarker disclosure.\nPatient demographic data, comorbidities, medications, referrals to specialists, diagnostic testing for cognitive impairment, cognitive assessment scores, new diagnoses of MCI or ADRD, and referrals to dementia-related clinical trials were collected at the time of DCA screen [\n37\n], at the BHN visit, and 90 days post the BHN visit from each patient's electronic health record. Patients who screened borderline or likely impaired were analyzed, respectively, by those who had versus did not have a BHN referral from their PCP and also by those who were referred and had versus did not have a BHN visit. All referrals to the BHN were tracked by source and date. The Area of Deprivation Index (ADI) [\n46\n] and Charlson comorbidity index [\n47\n] were calculated to further characterize the cohort of patients with abnormal screenings and to determine if disparities existed in referrals or outcomes.", "doc_items_refs": ["#/texts/172", "#/texts/173", "#/texts/174", "#/texts/175", "#/texts/176", "#/texts/177", "#/texts/178", "#/texts/179", "#/texts/180"], "page_nos": [], "uuid": "7cd1ebea-5c32-4c76-ba00-ece44be6e877"}
{"doc_id": "2025__An_innovative_health_systems_approach_to_support_early_detection_of_cognitive_im__W4413790860", "source_path": "<redacted:source_path>", "chunk_id": 10, "source_chunk_idxs": [15], "num_tokens": 265, "text": "An innovative health systems approach to support early detection of cognitive impairment in primary care - the brain health navigator\nMethods\nStatistical analysis\nTwo-sample T-tests or Wilcoxon rank-sum test were performed to compare whether patients differed by referral status on demographic and clinical characteristics. Fisher's exact tests were used for categorical variables. Similar analyses were conducted for the following comparisons: referred patients seen by the BHN versus referred patients not seen by the BHN; likely impaired patients versus borderline patients; and outcomes by referred patients seen by the BHN versus referred patients not seen by the BHN.\nDue to differences in patient panel characteristics at each of the seven clinics, clinic-adjusted p-values were calculated for differences in patient characteristics. Both overall and clinic-adjusted p-values are presented when a material difference between overall and clinic-adjusted values are present. When no material difference is present, clinic-adjusted values are presented.\nBecause DCA screening rates at each of the seven clinics varied, the relationship between screening rate and referral rate at each clinic was explored. The effect of a scheduling-induced lag time between the DCA index visit and the BHN index visit was explored. The relationship of race and ethnicity and acceptance of research referral was explored.\nAll analyses were performed using SAS v9.4.", "doc_items_refs": ["#/texts/182", "#/texts/183", "#/texts/184", "#/texts/185"], "page_nos": [], "uuid": "655c598e-19b6-4a60-98ec-4e7f92cfe15b"}
{"doc_id": "2025__An_innovative_health_systems_approach_to_support_early_detection_of_cognitive_im__W4413790860", "source_path": "<redacted:source_path>", "chunk_id": 11, "source_chunk_idxs": [16], "num_tokens": 488, "text": "An innovative health systems approach to support early detection of cognitive impairment in primary care - the brain health navigator\nResults\nA total of 861 patients who were screened from June 1, 2022, to May 31, 2023, screened likely impaired or borderline impaired on the DCA. Of those, 236 (27.4%) screened likely impaired and 625 (72.6%) screened borderline impairment. A total of 446 (51.8%) patients (148 likely impaired and 298 borderline) were referred to the BHN. Table\n1\npresents demographic and clinical characteristics by BHN referral status. Unadjusted results show that referred patients were more like to screen likely impaired (vs. borderline) (\np\np\n= 0.01), had less years of education (\np\np\np\np\n= 0.03) and hyperlipidemia (\np\nOne of the seven clinics elected to send all patients at the practice with a borderline or likely impaired DCA screening to the BHN. The six other clinics chose to have individual provider-based decisions about rule-based referrals to the BHN. Fourteen of 42 (33.3%) providers at those clinics chose to refer patients to the BHN with a likely impaired DCA result based on a rule. Eleven of 42 (26.2%) providers at the individual provider decision clinics decided to additionally refer patients with a borderline DCA result to the BHN based on a rule. All remaining providers at the six clinics made referrals without a rule on a patient-by-patient basis. Table\n2\npresents the breakdown of rule-based versus individual provider-based referrals to the BHN.\nOf the 446 patients referred to the BHN, a total of 100 (22.4%) had a BHN visit. Reasons for patients not seen by the BHN include patient declined (\nn\n= 133, 29.8%), BHN was unable to contact patient (\nn\n= 160, 35.9%), and patient was not able to be approached (\nn\n= 53, 11.9%). Comparisons of those patients who had a BHN visit versus those who did not are presented in Table\n3\n. In unadjusted analyses, patients seen by the BHN were more likely to have a diagnosis of Chronic Obstructive Pulmonary Disease (COPD) (\np\np\np", "doc_items_refs": ["#/texts/187", "#/texts/188", "#/texts/189", "#/texts/190", "#/texts/192", "#/texts/193", "#/texts/194", "#/texts/196", "#/texts/198", "#/texts/200", "#/texts/201", "#/texts/202", "#/texts/204", "#/texts/205", "#/texts/206", "#/texts/207", "#/texts/208", "#/texts/209", "#/texts/210", "#/texts/211", "#/texts/212", "#/texts/213", "#/texts/214", "#/texts/215", "#/texts/216", "#/texts/218", "#/texts/220"], "page_nos": [], "uuid": "e22759c8-9986-48d0-8ebf-aa975768ab70"}
{"doc_id": "2025__An_innovative_health_systems_approach_to_support_early_detection_of_cognitive_im__W4413790860", "source_path": "<redacted:source_path>", "chunk_id": 12, "source_chunk_idxs": [17], "num_tokens": 333, "text": "An innovative health systems approach to support early detection of cognitive impairment in primary care - the brain health navigator\nResults\nAmong the patients who screened likely impaired and borderline on the DCA, Table\n4\nshows clinic adjusted differences in outcomes for the patients who had a BHN visit versus those who did not (both not referred and referred but not seen). The BHN intervention led to several statistically significant outcomes. Patients who were seen by the BHN had a significantly higher likelihood of receiving a new diagnosis of MCI than patients who did not see the BHN (5.0% vs. 1.3%,\np\np\np\np\n= 0.001). Magnetic Resonance Imaging (MRI) orders were higher among those seen by the BHN (25.0% vs. 3.4%,\np\nRegarding the BHN impact on research referrals, there was no difference in acceptance of a referral to research based on race (Asian 66.7%\nn\n= 2 vs. Black of African American 46.3%\nn\n= 19 vs. White 37.5%\nn\n= 21,\np\n= 0.48) or ethnicity (Hispanic or Latino 75.0%\nn\n= 3 vs. Not Hispanic or Latino 40.6%\nn\n= 39,\np\n= 0.31). Results not shown. Patients who were seen by the BHN were significantly more likely to consent to AD blood-based biomarker testing and results disclosure compared to those patients who were not referred and to those who were referred but did not have a BHN visit (1.2% vs. 2.9% vs. 11.0%\np\n5\n.", "doc_items_refs": ["#/texts/222", "#/texts/223", "#/texts/224", "#/texts/225", "#/texts/227", "#/texts/229", "#/texts/231", "#/texts/232", "#/texts/233", "#/texts/235", "#/texts/236", "#/texts/237", "#/texts/238", "#/texts/239", "#/texts/240", "#/texts/241", "#/texts/242", "#/texts/243", "#/texts/244", "#/texts/245", "#/texts/246", "#/texts/247", "#/texts/248", "#/texts/249", "#/texts/250", "#/texts/252", "#/texts/253"], "page_nos": [], "uuid": "83ed6633-2f95-40d4-bb61-4b09e799f46e"}
{"doc_id": "2025__An_innovative_health_systems_approach_to_support_early_detection_of_cognitive_im__W4413790860", "source_path": "<redacted:source_path>", "chunk_id": 13, "source_chunk_idxs": [18], "num_tokens": 426, "text": "An innovative health systems approach to support early detection of cognitive impairment in primary care - the brain health navigator\nDISCUSSION\nEnhanced primary care evaluation\nTo our knowledge, this is the first use of a nurse navigator in primary care to support the care of patients with identified cognitive impairment. We believe this model could have an important impact on early identification of patients with cognitive impairment and streamline referral and treatment pathways, which will contribute to better health outcomes, improve healthcare utilization, and reduce burden on PCPs.\nAs a member of the primary care team, the BHN provides more comprehensive assessments, connection to resources, and care navigation for patients with cognitive concerns and borderline or likely impaired cognitive screening results. By executing more comprehensive initial cognitive assessments, by reviewing all prescription and over-the-counter medications/supplements, and evaluating for addressable co-morbid medical and mental health conditions, the BHN helps identify contributing or alternate causes for cognitive impairment. For appropriate patients, the BHN proposes additional workup to the primary care providers, such as brain imaging to assess for vascular burden and atrophy patterns, laboratory workup, and in appropriate cases, biomarker assessments using blood-based biomarkers, allowing the PCP to have oversight of the care process, but reducing the direct burden of that process on the PCP. Referrals to both neurology and neuropsychology being significantly more common in patients who saw the BHN suggests enhanced follow-up care and monitoring in the BHN group. In addition, the BHN can focus on the detailed assessment of cognitive-related conditions and testing, allowing the PCP to continue to address and manage other concurrent conditions.\nThus, in this analysis, engaging with the BHN led to statistically significant improvements in care for patients. These findings are important because they address important gaps in the current rates of diagnosis and follow-up care of patients with MCI and dementia [\n48\n]. The BHN role parallels other nurse navigators in primary care, particularly those helping to manage chronic medical conditions, where the appropriate information and support significantly impact patient care [\n49\n].", "doc_items_refs": ["#/texts/256", "#/texts/257", "#/texts/258", "#/texts/259", "#/texts/260", "#/texts/261", "#/texts/262"], "page_nos": [], "uuid": "5f51dccf-5bbe-4fab-8644-6133a0e83fd6"}
{"doc_id": "2025__An_innovative_health_systems_approach_to_support_early_detection_of_cognitive_im__W4413790860", "source_path": "<redacted:source_path>", "chunk_id": 14, "source_chunk_idxs": [19], "num_tokens": 507, "text": "An innovative health systems approach to support early detection of cognitive impairment in primary care - the brain health navigator\nDISCUSSION\nEnhanced specialty care connection\nIn the initial development and implementation of the BHN role, the BHN workflow did not differentiate follow-up or referral testing options for patients with possible neurodegenerative disorders based on their level of cognitive impairment, which is consistent with our finding that the rate of referrals for patients with borderline impairment and likely cognitive impairment were not statistically different from one another. Since the end of the study period, we have evolved the BHN workflow with a goal to improve patient navigation so that the most appropriate patients are referred to the most appropriate specialists or enhanced care pathway for their level of impairment and/or care needs. Thus, we believe the BHN role continues to hold promise for more appropriate referrals and partially mitigate exacerbation of the bottlenecks in specialty referrals.\nAt the time of the initiation of this study, no Federal Drug Administration (FDA)-approved disease-modifying treatments for AD was widely available. Therefore, when designing the BHN role and their triage function, patients suspected of having AD were referred to neurology, while those with significant vascular risk and comorbidities were referred to geriatrics or, if the patient preferred, back to primary care. Our updated practice allows the BHN to determine if a patient may be eligible for disease-modifying treatments (based on an agreed-upon checklist) and to refer them directly to a neurology treatment nurse coordinator instead of to the neurology referral pool, which further expedites patients' access to disease-modifying medications. The BHN's close collaboration with the neurology treatment team enhances the pathway process, as the BHN is familiar with treatment requirements, including contraindicated medications and relevant medical conditions.\nWhile we were unable to measure the appointment lag of referrals in this study due to the limited follow up period, we believe that the BHN's involvement can accelerate the diagnostic process, as BHN visits are available much sooner than traditional PCP referrals to neurology and geriatrics in our system. Subsequently, the warm hand off to the neurology treatment team for patients who had been thoroughly assessed by the BHN, are interested in treatment evaluation, and meet key treatment inclusion and exclusion criteria, allow patients to have faster evaluation of their appropriateness for disease modifying therapies.", "doc_items_refs": ["#/texts/264", "#/texts/265", "#/texts/266"], "page_nos": [], "uuid": "308f8849-f212-4b89-9e06-d4371ccc12dc"}
{"doc_id": "2025__An_innovative_health_systems_approach_to_support_early_detection_of_cognitive_im__W4413790860", "source_path": "<redacted:source_path>", "chunk_id": 15, "source_chunk_idxs": [20], "num_tokens": 330, "text": "An innovative health systems approach to support early detection of cognitive impairment in primary care - the brain health navigator\nDISCUSSION\nEnhanced specialty care connection\nIn published literature reporting additional analysis of the disease-modifying treatment donanemab, treatment was found to be more effective in earlier disease-stage individuals, making early identification and early referral a key component of treatment success [\n50\n]. In appropriate patients, the BHN also follows up on imaging results and may potentially suggest screening or definitive biomarker assessments. The embedded blood-based biomarker pilot research study holds promise for the feasibility of the BHN offering blood-based biomarker tests and interpretation as part of the cognitive impairment assessment. In our model, the BHN disclosed biomarker results to patients and families with careful consideration, following extensive training on the nuances and the potential psychological impact of these discussions. Our finding that patients who saw the BHN were more likely to have a blood-based biomarker performed indicates that the BHN may play an important role in facilitating the use of blood-based biomarkers in primary care. More research is needed in this area.\nWe found that primary care patients at an older age were more likely statistically to have likely impaired DCA screening results, suggesting that routine longitudinal primary care-based screening may be helpful in identifying MCI earlier than in current healthcare systems models. Patients referred to the BHN were younger, further suggesting that routine screening in primary care may be successful at improving rates of early detection and follow-up when combined with a primary care-based BHN visit for navigating next steps. Further research is needed in this area.", "doc_items_refs": ["#/texts/267", "#/texts/268", "#/texts/269", "#/texts/270"], "page_nos": [], "uuid": "08c69c30-e70d-4fef-8b27-b1465031df28"}
{"doc_id": "2025__An_innovative_health_systems_approach_to_support_early_detection_of_cognitive_im__W4413790860", "source_path": "<redacted:source_path>", "chunk_id": 16, "source_chunk_idxs": [21], "num_tokens": 464, "text": "An innovative health systems approach to support early detection of cognitive impairment in primary care - the brain health navigator\nDISCUSSION\nConnection to community resources and research\nIn addition to the triage and referral processes, the BHN often served as a patient's initial point of contact for connection to community organizations and social work services, which hold potential to have an impact on reduction of caregiver stress and burnout. Advance care planning discussions like the ones initiated by the BHN at an early stage have been shown to improve outcomes in patients and families living with dementia, ultimately leading to improved patient autonomy in decision-making and reductions in healthcare utilization [\n51\n].\nIn our study, the large clinic with standardized screening practices and rule-based referrals had the greatest number of patients screened and referred to the BHN. This clinic had the highest rates of barriers to social determinants of health, suggesting that clinic factors could have contributed to the trend toward significance of ADI for those screened as likely cognitively impaired. However, previous literature has demonstrated higher rates of abnormal cognitive assessments in patients with low socioeconomic status [\n52\n]. Furthermore, in our study, the trend toward significance of the ADI with those who screened likely cognitively impaired demonstrates the importance of community resource referral as a key function for the BHN. These factors highlight the need for further research on the role of primary care in addressing health disparities of early detection and treatment.\nWe demonstrated that over 40% of patients with borderline impairment or likely cognitive impairment were willing to accept a referral for research, including 46% of Black or African American patients who saw the BHN. This finding supports previous literature suggesting that primary care-based recruitment for AD clinical trials has potential to enhance clinical trial diversity and that when given the opportunity to participate equitably, disparities in AD research participation may be significantly reduced.\nAlthough a relatively small number of people participated in a research sub-study to collect blood-based biomarkers, a significantly higher percentage of patients volunteered to consent when they interacted with the BHN. We believe that this data demonstrates the BHN playing a crucial role in engaging patients in a primary care setting in neurologic research, which may be beneficial in improving the representation of people from racial and ethnic minorities in AD clinical trials.", "doc_items_refs": ["#/texts/272", "#/texts/273", "#/texts/274", "#/texts/275", "#/texts/276", "#/texts/277", "#/texts/278", "#/texts/279"], "page_nos": [], "uuid": "663c1e00-5caf-417d-ad20-454bbc7a920b"}
{"doc_id": "2025__An_innovative_health_systems_approach_to_support_early_detection_of_cognitive_im__W4413790860", "source_path": "<redacted:source_path>", "chunk_id": 17, "source_chunk_idxs": [22, 23], "num_tokens": 444, "text": "An innovative health systems approach to support early detection of cognitive impairment in primary care - the brain health navigator\nDISCUSSION\nConnection to community resources and research\nOur finding that 43% of real-world primary care patients with borderline and likely cognitively impaired screenings who saw the BHN were interested in research referrals offers potential insight into the promise of pathways from primary care early detection into clinical trials as a mechanism to enhance diversity of dementia-related clinical trials. Additionally, it demonstrates the BHN role as successful in connecting patients with opportunities that are appropriate to their individual health and goals, as well as connecting historically fragmented pieces of the AD research community. Primary care's contributions to AD team science hold the promise of yielding greater societal benefits.\n\nAn innovative health systems approach to support early detection of cognitive impairment in primary care - the brain health navigator\nDISCUSSION\nBilling and revenue\nAlthough the BHN model confers a cost to the healthcare system, its potential benefits in reducing the burden of other healthcare providers and accelerating patient triage and workup are critical in managing patients who may be candidates for disease-modifying therapies. While financial data on the cost of the BHN is not clearly understood, BHN billing may be possible using appropriate documentation. The Current Procedural Terminology (CPT) Evaluation and Management billing code 99211 can be used for billing outpatient nurse encounters, but the services provided by the BHN far exceed the typical services provided under this billing code. However, in our clinic with the current infrastructure, the services provided by the BHN meet the Center for Medicare and Medicaid Services Chronic Care Management service requirements [\n53\n]. These more comprehensive codes better account for the services provided by the BHN particularly in patients who require multiple encounters for diagnostics, connection with community-based services, and workup for disease modifying treatments. Although these codes are unlikely able to fully fund the service, they can offset cost substantially depending on patient volumes. Further policy-based recognition of this role and additional funding mechanisms could support broader implementation. Anecdotal feedback from BHN nurses within our healthcare system has been overwhelmingly positive, with high job-satisfaction, which is consistent with other primary care-based nurse navigation models [\n19\n].", "doc_items_refs": ["#/texts/280", "#/texts/282", "#/texts/283", "#/texts/284", "#/texts/285", "#/texts/286"], "page_nos": [], "uuid": "693633aa-76cf-41bf-8f03-69dc88536ce5"}
{"doc_id": "2025__An_innovative_health_systems_approach_to_support_early_detection_of_cognitive_im__W4413790860", "source_path": "<redacted:source_path>", "chunk_id": 18, "source_chunk_idxs": [24, 25], "num_tokens": 501, "text": "An innovative health systems approach to support early detection of cognitive impairment in primary care - the brain health navigator\nDISCUSSION\nLimitations\nSeveral limitations to this study should be noted, including the lack of financial data and survey results related to biomarkers and patient satisfaction, which may impact the generalizability and conclusions of our findings.\n\nAn innovative health systems approach to support early detection of cognitive impairment in primary care - the brain health navigator\nDISCUSSION\nLimited rates of patient completion of BHN appointments\nAnother limitation to our study is that the number of patients who ultimately saw the BHN during the study period was relatively low. In this study, the BHN was only able to conduct a visit with 22.8% of referred patients. This was partially due to the delays in establishing the role and development of the approach. The majority of patients did not respond to the BHN contacts, with a maximum of three attempts made per subject. Approximately one-third of patients declined the BHN visit. Patient refusal to see the BHN may result from stigma related to concerns over brain health or denial of symptoms, and discerning these two is an aim for future research. It is worth noting that the BHN role was not established and implemented at the same time as the DCA screening in primary care, leading to substantial gaps in the lag time from DCA screening to BHN outreach and appointments for some patients.\nWe evaluated two factors retrospectively to better understand the low BHN completion rate: the type of referral and timing to first contact. We found that patients who were individually referred by their PCP were more likely to complete a BHN appointment. This suggests that providers likely conveyed their perceived value of the BHN referral during their encounter with the patient. Our opinion is that more immediate emphasis on BHN follow-up by the provider and timeliness of the referral to the BHN after DCA screening may play a role in the rate at which patients see the BHN. We hypothesize that more rapid contact by the BHN would lower rates of patients declining to see the BHN [\n54\n]. While our data analysis did not show significance in a retrospective analysis, further research on this factor is warranted, as this type of practice leads to better visit adherence in the experience of the authors and in previously published work [\n55\n]. With that in mind, our updated workflows are designed with a goal of scheduling a BHN appointment on the same day the DCA is completed.", "doc_items_refs": ["#/texts/288", "#/texts/290", "#/texts/291", "#/texts/292", "#/texts/293", "#/texts/294", "#/texts/295"], "page_nos": [], "uuid": "27227549-8a46-4187-ada3-e123b440387f"}
{"doc_id": "2025__An_innovative_health_systems_approach_to_support_early_detection_of_cognitive_im__W4413790860", "source_path": "<redacted:source_path>", "chunk_id": 19, "source_chunk_idxs": [26, 27, 28], "num_tokens": 379, "text": "An innovative health systems approach to support early detection of cognitive impairment in primary care - the brain health navigator\nConclusions\nAs a member of the primary care team, the BHN can reduce burden from the PCP by providing more comprehensive assessments, patient education, and care navigation for patients with cognitive concerns and borderline or abnormal cognitive screening results. The BHN role leads to higher completion of appropriate medical evaluation of addressable causes of cognitive impairment, which can include blood biomarkers, and more frequent assignment of a diagnosis, enhancing the success of early diagnosis to treatment clinical pathways. The BHN may also play an important role in connection with clinical research. Future research is needed to understand how the BHN role can be integrated and sustained in different systems.\n\nAn innovative health systems approach to support early detection of cognitive impairment in primary care - the brain health navigator\nData availability\nThe data for this article are not a publicly available dataset. The datasets used and/or analyzed during the current study are available from the corresponding author on reasonable request.\n\nAn innovative health systems approach to support early detection of cognitive impairment in primary care - the brain health navigator\nAbbreviations\nACBS:\nAnticholinergic Burden Scale\nAD:\nAlzheimer's Disease\nADI:\nArea Deprivation Index\nASCVD:\nAtherosclerotic Cardiovascular Disease\nAWV:\nAnnual Wellness Visit\nBHN:\nBrain Health Navigator\nCOPD:\nChronic Obstructive Pulmonary Disease\nCPT:\nCurrent Procedural Terminology\nDCA:\nDigital Cognitive Assessment\nEHR:\nElectronic Health Record\nFDA:\nUnited States Federal Drug Administration\nGAD-7:\nGeneralized Anxiety Disorder-7\nMCI:\nMild Cognitive Impairment\nMoCA:\nMontreal Cognitive Assessment\nMRI:\nMagnetic Resonance Imaging\nn:\nNumber\nPCP:\nPrimary Care Provider\nPHQ-9:\nPatient Health Questionnaire-9\nSAS:\npreviously Statistical Analysis System, no longer considered an abbreviation\nSD:\nStandard Deviation\nTSH:\nThyroid Stimulating Hormone\n%:\nPercent", "doc_items_refs": ["#/texts/297", "#/texts/299", "#/texts/301", "#/texts/302", "#/texts/303", "#/texts/304", "#/texts/305", "#/texts/306", "#/texts/307", "#/texts/308", "#/texts/309", "#/texts/310", "#/texts/311", "#/texts/312", "#/texts/313", "#/texts/314", "#/texts/315", "#/texts/316", "#/texts/317", "#/texts/318", "#/texts/319", "#/texts/320", "#/texts/321", "#/texts/322", "#/texts/323", "#/texts/324", "#/texts/325", "#/texts/326", "#/texts/327", "#/texts/328", "#/texts/329", "#/texts/330", "#/texts/331", "#/texts/332", "#/texts/333", "#/texts/334", "#/texts/335", "#/texts/336", "#/texts/337", "#/texts/338", "#/texts/339", "#/texts/340", "#/texts/341", "#/texts/342", "#/texts/343", "#/texts/344"], "page_nos": [], "uuid": "1b07210c-d59f-41bf-abf7-d7563006b5ea"}
{"doc_id": "2025__An_innovative_health_systems_approach_to_support_early_detection_of_cognitive_im__W4413790860", "source_path": "<redacted:source_path>", "chunk_id": 20, "source_chunk_idxs": [29], "num_tokens": 444, "text": "An innovative health systems approach to support early detection of cognitive impairment in primary care - the brain health navigator\nReferences\n1. Tzeng HM, Raji MA, Shan Y, Cram P, Kuo YF. Annual wellness visits and early dementia diagnosis among medicare beneficiaries. JAMA Netw Open. 2024;7(10):e2437247.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n2. CMS. Medicare Wellness Visits: Centers for Medicare and Medicaid Services. 2023 [Available from:\nhttps://www.cms.gov/Outreach-and-Education/Medicare-Learning-Network-MLN/MLNProducts/preventive-services/medicare-wellness-visits.html\n3. Fowler NR, Campbell NL, Pohl GM, Munsie LM, Kirson NY, Desai U, et al. One-Year effect of the medicare annual wellness visit on detection of cognitive impairment: A cohort study. J Am Geriatr Soc. 2018;66(5):969-75.\nArticle\nPubMed\nGoogle Scholar\n4. Lind KE, Hildreth K, Lindrooth R, Morrato E, Crane LA, Perraillon MC. The effect of direct cognitive assessment in the medicare annual wellness visit on dementia diagnosis rates. Health Serv Res. 2021;56(2):193-203.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n5. Thunell JA, Jacobson M, Joe EB, Zissimopoulos JM. Medicare's annual wellness visit and diagnoses of dementias and cognitive impairment. Alzheimers Dement (Amst). 2022;14(1):e12357.\nArticle\nPubMed\nGoogle Scholar\n6. Bernier PJ, Gourdeau C, Carmichael PH, Beauchemin JP, Verreault R, Bouchard RW, et al. Validation and diagnostic accuracy of predictive curves for age-associated longitudinal cognitive decline in older adults. CMAJ. 2017;189(48):E1472-80.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/346", "#/texts/347", "#/texts/348", "#/texts/349", "#/texts/350", "#/texts/351"], "page_nos": [], "uuid": "7ead81cd-2120-477b-b1b9-690911180da9"}
{"doc_id": "2025__An_innovative_health_systems_approach_to_support_early_detection_of_cognitive_im__W4413790860", "source_path": "<redacted:source_path>", "chunk_id": 21, "source_chunk_idxs": [30], "num_tokens": 463, "text": "An innovative health systems approach to support early detection of cognitive impairment in primary care - the brain health navigator\nReferences\n7. Bernier PJ, Gourdeau C, Carmichael PH, Beauchemin JP, Voyer P, Hudon C, et al. It's all about cognitive trajectory: accuracy of the cognitive charts-MoCA in normal aging, MCI, and dementia. J Am Geriatr Soc. 2023;71(1):214-20.\nArticle\nPubMed\nGoogle Scholar\n8. Mansfield E, Noble N, Sanson-Fisher R, Mazza D, Bryant J. Primary care physicians' perceived barriers to optimal dementia care: A systematic review. Gerontologist. 2019;59(6):e697-708.\nArticle\nPubMed\nGoogle Scholar\n9. Sabbagh MN, Boada M, Borson S, Chilukuri M, Dubois B, Ingram J, et al. Early detection of mild cognitive impairment (MCI) in primary care. J Prev Alzheimers Dis. 2020;7(3):165-70.\nArticle\nCAS\nPubMed\nGoogle Scholar\n10. Lang L, Clifford A, Wei L, Zhang D, Leung D, Augustine G, et al. Prevalence and determinants of undetected dementia in the community: a systematic literature review and a meta-analysis. BMJ Open. 2017;7(2):e011146.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n11. White L, Ingraham B, Larson E, Fishman P, Park S, Coe NB. Observational study of patient characteristics associated with a timely diagnosis of dementia and mild cognitive impairment without dementia. J Gen Intern Med. 2022;37(12):2957-65.\nArticle\nPubMed\nGoogle Scholar\n12. Bandini JI, Schulson LB, Ahluwalia SC, Harrison J, Chen EK, Lai JS, et al. Patient, family caregiver, and provider perceptions on Self-Assessment screening for cognitive impairment in primary care: findings from a qualitative study. Gerontol Geriatr Med. 2022;8:23337214221131403.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/352", "#/texts/353", "#/texts/354", "#/texts/355", "#/texts/356", "#/texts/357"], "page_nos": [], "uuid": "1260eeda-3823-4cde-a190-3243ce029da7"}
{"doc_id": "2025__An_innovative_health_systems_approach_to_support_early_detection_of_cognitive_im__W4413790860", "source_path": "<redacted:source_path>", "chunk_id": 22, "source_chunk_idxs": [31], "num_tokens": 501, "text": "An innovative health systems approach to support early detection of cognitive impairment in primary care - the brain health navigator\nReferences\n13. Zaslavsky O, Yu O, Walker RL, Crane PK, Gray SL, Sadak T, et al. Incident dementia, glycated hemoglobin (HbA1c) levels, and potentially preventable hospitalizations in people aged 65 and older with diabetes. J Gerontol Biol Sci Med Sci. 2021;76(11):2054-61.\nArticle\nGoogle Scholar\n14. Lasser KE, Murillo J, Medlin E, Lisboa S, Valley-Shah L, Fletcher RH, et al. A multilevel intervention to promote colorectal cancer screening among community health center patients: results of a pilot study. BMC Fam Pract. 2009;10:37.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n15. Palmieri F, DePeri E, Mincey B, Smith J, Wen L, Chewar D, Abaya R, Colon-Otero G, Perez Edith. editors. Comprehensive diagnostic program for medically underserved women with abnormal breast screening evaluations in an urban population. Mayo Clinic Proceedings; 2009;84:317-22.\nhttps://doi.org/10.1016/S0025-6196(11)60539-9\n.\n16. Campbell C, Craig J, Eggert J, Bailey-DortonC. Implementing and measuring the impact of patient navigation at a comprehensive communitycancer center. Oncol Nurs Forum. 2010;37(1):61-8.\nhttps://doi.org/10.1188/10.ONF.61-68\n. PMID:20044340.\n17. Ferrante JM, Chen PH, Kim S. The effect of patient navigation on time to diagnosis, anxiety, and satisfaction in urban minority women with abnormal mammograms: a randomized controlled trial. J Urban Health. 2008;85(1):114-24.\nArticle\nPubMed\nGoogle Scholar\n18. Carter N, Valaitis RK, Lam A, Feather J, Nicholl J, Cleghorn L. Navigation delivery models and roles of navigators in primary care: a scoping literature review. BMC Health Serv Res. 2018;18(1):96.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/358", "#/texts/359", "#/texts/360", "#/texts/361", "#/texts/362", "#/texts/363"], "page_nos": [], "uuid": "7a265e68-cd07-4a0a-b38f-fbe1c7e48979"}
{"doc_id": "2025__An_innovative_health_systems_approach_to_support_early_detection_of_cognitive_im__W4413790860", "source_path": "<redacted:source_path>", "chunk_id": 23, "source_chunk_idxs": [32], "num_tokens": 430, "text": "An innovative health systems approach to support early detection of cognitive impairment in primary care - the brain health navigator\nReferences\n19. McMurray A, Ward L, Johnston K, Yang L, Connor M. The primary health care nurse of the future: preliminary evaluation of the nurse navigator role in integrated care. Collegian. 2018;25(5):517-24.\nArticle\nGoogle Scholar\n20. Ali-Faisal SF, Colella TJ, Medina-Jaudes N, Benz Scott L. The effectiveness of patient navigation to improve healthcare utilization outcomes: A meta-analysis of randomized controlled trials. Patient Educ Couns. 2017;100(3):436-48.\nArticle\nPubMed\nGoogle Scholar\n21. Falk N, Cole A, Meredith TJ. Evaluation of suspected dementia. Am Fam Physician. 2018;97(6):398-405.\nPubMed\nGoogle Scholar\n22. Van Dyck CH, Swanson CJ, Aisen P, Bateman RJ, Chen C, Gee M, et al. Lecanemab in early Alzheimer's disease. N Engl J Med. 2023;388(1):9-21.\nArticle\nPubMed\nGoogle Scholar\n23. AHEAD 3-45 Study. A Study to Evaluate Efficacy and Safety of Treatment With Lecanemab in Participants With Preclinical Alzheimer's Disease and Elevated Amyloid and Also in Participants With Early Preclinical Alzheimer's Disease and Intermediate Amyloid. [Internet]. Eisai, Inc. 2020 [cited 18-Nov-2024]. Available from:\nhttps://www.clinicaltrials.gov/study/NCT04468659\n24. A Donanemab (LY3002813.) Study in Participants With Preclinical Alzheimer's Disease (TRAILBLAZER-ALZ 3) [Internet]. Eli Lily and Company. 2021 [cited 19-Nov-2024]. Available from:\nhttps://clinicaltrials.gov/study/NCT05026866", "doc_items_refs": ["#/texts/364", "#/texts/365", "#/texts/366", "#/texts/367", "#/texts/368", "#/texts/369"], "page_nos": [], "uuid": "0d1dec51-7f4a-459b-93b7-200d807a832c"}
{"doc_id": "2025__An_innovative_health_systems_approach_to_support_early_detection_of_cognitive_im__W4413790860", "source_path": "<redacted:source_path>", "chunk_id": 24, "source_chunk_idxs": [33], "num_tokens": 507, "text": "An innovative health systems approach to support early detection of cognitive impairment in primary care - the brain health navigator\nReferences\n25. Angioni D, Delrieu J, Hansson O, Fillit H, Aisen P, Cummings J, et al. Blood biomarkers from research use to clinical practice: what must be done? A report from the EU/US CTAD task force. J Prev Alzheimer's Disease. 2022;9(4):569-79.\nArticle\nCAS\nGoogle Scholar\n26. de Levante Raphael D. The knowledge and attitudes of primary care and the barriers to early detection and diagnosis of alzheimer's disease. Med (Kaunas). 2022;58(7):906.\nGoogle Scholar\n27. Stewart TV, Loskutova N, Galliher JM, Warshaw GA, Coombs LJ, Staton EW, et al. Practice patterns, beliefs, and perceived barriers to care regarding dementia: a report from the American academy of family physicians (AAFP) National research network. J Am Board Fam Med. 2014;27(2):275-83.\nArticle\nPubMed\nGoogle Scholar\n28. Boustani M, Peterson B, Hanson L, Harris R, Lohr KN. Screening for dementia in primary care: a summary of the evidence for the US preventive services task force. Ann Intern Med. 2003;138(11):927-37.\nArticle\nPubMed\nGoogle Scholar\n29. Aminzadeh F, Molnar FJ, Dalziel WB, Ayotte D. A review of barriers and enablers to diagnosis and management of persons with dementia in primary care. Can Geriatr J. 2012;15(3):85-94.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n30. Callahan CM, Boustani MA, Weiner M, Beck RA, Livin LR, Kellams JJ, et al. Implementing dementia care models in primary care settings: the aging brain care medical home. Aging Ment Health. 2011;15(1):5-12.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n31. Heintz H, Monette P, Epstein-Lubow G, Smith L, Rowlett S, Forester BP. Emerging collaborative care models for dementia care in the primary care setting: A narrative review. Am J Geriatr Psychiatry. 2020;28(3):320-30.\nArticle\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/370", "#/texts/371", "#/texts/372", "#/texts/373", "#/texts/374", "#/texts/375", "#/texts/376"], "page_nos": [], "uuid": "2be7689b-06ca-4cc7-8ea5-35a4d7654d3e"}
{"doc_id": "2025__An_innovative_health_systems_approach_to_support_early_detection_of_cognitive_im__W4413790860", "source_path": "<redacted:source_path>", "chunk_id": 25, "source_chunk_idxs": [34], "num_tokens": 445, "text": "An innovative health systems approach to support early detection of cognitive impairment in primary care - the brain health navigator\nReferences\n32. Joshi P, Anderson A, Nisson L, Gopalakrishna G. Innovative and collaborative care models in dementia. Am J Geriatric Psychiatry. 2023;31(3):S22.\nArticle\nGoogle Scholar\n33. Langbaum JB, Zissimopoulos J, Au R, Bose N, Edgar CJ, Ehrenberg E, et al. Recommendations to address key recruitment challenges of alzheimer's disease clinical trials. Alzheimers Dement. 2023;19(2):696-707.\nArticle\nPubMed\nGoogle Scholar\n34. Levine DM, Linder JA, Landon BE. Characteristics of Americans with primary care and changes over time, 2002-2015. JAMA Intern Med. 2020;180(3):463-6.\nArticle\nPubMed\nGoogle Scholar\n35. Indorewalla KK, O'Connor MK, Budson AE, Guess DiTerlizzi C, Jackson J. Modifiable barriers for recruitment and retention of older adults participants from underrepresented minorities in alzheimer's disease research. J Alzheimers Dis. 2021;80(3):927-40.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n36. The Davos Alzheimer's Collaborative System Preparedness Early Detection Blueprint. Davos Alzheimer's Collaborative; [Available from:\nhttps://www.dacblueprint.org/\n37. Fowler NR, Hammers DB, Perkins AJ, Summanwar D, Higbie A, Swartzell K, et al. Feasibility and acceptability of implementing a digital cognitive assessment for alzheimer disease and related dementias in primary care. Ann Fam Med. 2025;23(3):191-8.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n38. Summanwar D, Fowler NR, Hammers DB, Perkins AJ, Brosch JR, Willis DR. Agile implementation of a digital cognitive assessment for dementia in primary care. Ann Fam Med. 2025;23(3):199-206.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/377", "#/texts/378", "#/texts/379", "#/texts/380", "#/texts/381", "#/texts/382", "#/texts/383"], "page_nos": [], "uuid": "0d91f10a-47b5-4003-a18e-0e5b5335e04f"}
{"doc_id": "2025__An_innovative_health_systems_approach_to_support_early_detection_of_cognitive_im__W4413790860", "source_path": "<redacted:source_path>", "chunk_id": 26, "source_chunk_idxs": [35], "num_tokens": 511, "text": "An innovative health systems approach to support early detection of cognitive impairment in primary care - the brain health navigator\nReferences\n39. Libon DJ, Matusz EF, Cosentino S, Price CC, Swenson R, Vermeulen M, et al. Using digital assessment technology to detect neuropsychological problems in primary care settings. Front Psychol. 2023;14:1280593.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n40. Nasreddine ZS, Phillips NA, Bedirian V, Charbonneau S, Whitehead V, Collin I, et al. The Montreal cognitive assessment, moca: a brief screening tool for mild cognitive impairment. J Am Geriatr Soc. 2005;53(4):695-9.\nArticle\nPubMed\nGoogle Scholar\n41. Kroenke K, Spitzer RL, Williams JB. The PHQ-9: validity of a brief depression severity measure. J Gen Intern Med. 2001;16(9):606-13.\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n42. Spitzer RL, Kroenke K, Williams JB, Lowe B. A brief measure for assessing generalized anxiety disorder: the GAD-7. Arch Intern Med. 2006;166(10):1092-7.\nArticle\nPubMed\nGoogle Scholar\n43. Goff DC Jr, Lloyd-Jones DM, Bennett G, Coady S, D'agostino RB, Gibbons R, et al. 2013 ACC/AHA guideline on the assessment of cardiovascular risk: a report of the American college of cardiology/american heart association task force on practice guidelines. Circulation. 2014;129(25suppl2):S49-73.\nPubMed\nGoogle Scholar\n44. Boustani M, Campbell N, Munger S, Maidment I, Fox C. Impact of anticholinergics on the aging brain: a review and practical application. Aging Health. 2008;4(3):311-20.\nArticle\nCAS\nGoogle Scholar\n45. Chen L, Pivetta B, Nagappa M, Saripella A, Islam S, Englesakis M, et al. Validation of the STOP-Bang questionnaire for screening of obstructive sleep apnea in the general population and commercial drivers: a systematic review and meta-analysis. Sleep Breath. 2021;25(4):1741-51.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/384", "#/texts/385", "#/texts/386", "#/texts/387", "#/texts/388", "#/texts/389", "#/texts/390"], "page_nos": [], "uuid": "c7cc21b5-ad9c-40e4-abab-81ef5c90a00f"}
{"doc_id": "2025__An_innovative_health_systems_approach_to_support_early_detection_of_cognitive_im__W4413790860", "source_path": "<redacted:source_path>", "chunk_id": 27, "source_chunk_idxs": [36], "num_tokens": 465, "text": "An innovative health systems approach to support early detection of cognitive impairment in primary care - the brain health navigator\nReferences\n46. Kind AJ, Buckingham WR. Making neighborhood-disadvantage metrics accessible-the neighborhood atlas. N Engl J Med. 2018;378(26):2456.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n47. Charlson ME, Pompei P, Ales KL, MacKenzie CR. A new method of classifying prognostic comorbidity in longitudinal studies: development and validation. J Chronic Dis. 1987;40(5):373-83.\nArticle\nCAS\nPubMed\nGoogle Scholar\n48. Newton C, Jung J, Kleinsmann MS, Clarkson PJ. Designing healthcare systems for earlier diagnosis and prevention of dementia. Proceedings of the Design Society. 2024;4:1637-46.\nArticle\nGoogle Scholar\n49. Dufour E, Bolduc J, Leclerc-Loiselle J, Charette M, Dufour I, Roy D, et al. Examining nursing processes in primary care settings using the chronic care model: an umbrella review. BMC Prim Care. 2023;24(1):176.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n50. Sims JR, Zimmer JA, Evans CD, Lu M, Ardayfio P, Sparks J, et al. Donanemab in early symptomatic alzheimer disease: the TRAILBLAZER-ALZ 2 randomized clinical trial. JAMA. 2023;330(6):512-27.\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n51. Wendrich-van Dael A, Bunn F, Lynch J, Pivodic L, Van den Block L, Goodman C. Advance care planning for people living with dementia: an umbrella review of effectiveness and experiences. Int J Nurs Stud. 2020;107:103576.\nArticle\nPubMed\nGoogle Scholar\n52. Yaffe K, Falvey C, Harris TB, Newman A, Satterfield S, Koster A, et al. Effect of socioeconomic disparities on incidence of dementia among biracial older adults: prospective study. BMJ. 2013;347:f7051.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/391", "#/texts/392", "#/texts/393", "#/texts/394", "#/texts/395", "#/texts/396", "#/texts/397"], "page_nos": [], "uuid": "9f76eccb-9d07-4f5e-a625-05024d103822"}
{"doc_id": "2025__An_innovative_health_systems_approach_to_support_early_detection_of_cognitive_im__W4413790860", "source_path": "<redacted:source_path>", "chunk_id": 28, "source_chunk_idxs": [37, 38, 39], "num_tokens": 332, "text": "An innovative health systems approach to support early detection of cognitive impairment in primary care - the brain health navigator\nReferences\n53. CMS. Chronic Care Management Services. Centers for Medicare and Medicaid Services; 2024 [Available from:\nhttps://www.cms.gov/outreach-and-education/medicare-learning-network-mln/mlnproducts/downloads/chroniccaremanagement.pdf\n54. Jones VF, Sisson B, Kurbasic M, Thomas A, Badgett JT. Subspecialist referrals in an academic, pediatric setting: rationale, rates, and compliance. Am J Manag Care. 1997;3(9):1307-11.\nCAS\nPubMed\nGoogle Scholar\n55. Norris JB, Kumar C, Chand S, Moskowitz H, Shade SA, Willis DR. An empirical investigation into factors affecting patient cancellations and no-shows at outpatient clinics. Decis Support Syst. 2014;57:428-43.\nArticle\nGoogle Scholar\nDownload references\n\nAn innovative health systems approach to support early detection of cognitive impairment in primary care - the brain health navigator\nAcknowledgements\nThe authors would like to acknowledge Meredith Tobar, RN and the clinic and research staff who assisted in developing and implementing this work. The authors would like to acknowledge Dr. Melanie Steiner for her assistance in reviewing the final manuscript.\n\nAn innovative health systems approach to support early detection of cognitive impairment in primary care - the brain health navigator\nFunding\nThis research was supported by the Davos Alzheimer's Collaborative Healthcare System Preparedness Program, Linus Health, and C2N Diagnostics.", "doc_items_refs": ["#/texts/398", "#/texts/399", "#/texts/400", "#/texts/401", "#/texts/403", "#/texts/405"], "page_nos": [], "uuid": "0f806ac8-6aff-4e82-9e1c-86b2a9b5952d"}
{"doc_id": "2025__An_innovative_health_systems_approach_to_support_early_detection_of_cognitive_im__W4413790860", "source_path": "<redacted:source_path>", "chunk_id": 29, "source_chunk_idxs": [40], "num_tokens": 366, "text": "An innovative health systems approach to support early detection of cognitive impairment in primary care - the brain health navigator\nAuthor information\nAuthors and Affiliations\n1. Department of Neurology, Indiana University School of Medicine, 355 West 16th Street, STE 4700, Indianapolis, IN, 46202, USA Jared R. Brosch &amp; Dustin B. Hammers\n2. Department of Medicine, Indiana University School of Medicine, Indianapolis, IN, 46202, USA Nicole R. Fowler\n3. Indiana University Center for Aging Research, Indianapolis, IN, 46202, USA Nicole R. Fowler &amp; Anna Higbie\n4. Regenstrief Institute, Inc, Indianapolis, IN, 46202, USA Nicole R. Fowler &amp; Anna Higbie\n5. Department of Biostatistics and Health Data Science, Indiana University School of Medicine, Indianapolis, IN, 46202, USA Anthony J. Perkins\n6. Department of Family Medicine, Indiana University School of Medicine, Indianapolis, IN, 46202, USA Diana Summanwar, Kristen Swartzell &amp; Deanna R. Willis\nAuthors\n1. Jared R. Brosch\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n2. Diana Summanwar\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n3. Nicole R. Fowler\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n4. Dustin B. Hammers\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n5. Anthony J. Perkins\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n6. Anna Higbie\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n7. Kristen Swartzell\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n8. Deanna R. Willis\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/408", "#/texts/409", "#/texts/410", "#/texts/411", "#/texts/412", "#/texts/413", "#/texts/414", "#/texts/415", "#/texts/416", "#/texts/417", "#/texts/418", "#/texts/419", "#/texts/420", "#/texts/421", "#/texts/422"], "page_nos": [], "uuid": "97dfa20b-5d68-48dc-b360-ad6e47158770"}
{"doc_id": "2025__An_innovative_health_systems_approach_to_support_early_detection_of_cognitive_im__W4413790860", "source_path": "<redacted:source_path>", "chunk_id": 30, "source_chunk_idxs": [41, 42, 43, 44], "num_tokens": 274, "text": "An innovative health systems approach to support early detection of cognitive impairment in primary care - the brain health navigator\nAuthor information\nContributions\nJB: development, implementation, manuscript preparation, writing, and editing. NRF and DRW: development, implementation, data management, manuscript writing and editing. DBH, DS, KS: development, implementation, manuscript writing, and editing. AJP: data management, analysis, manuscript writing, and editing. APH: data management, manuscript writing, and editing.\n\nAn innovative health systems approach to support early detection of cognitive impairment in primary care - the brain health navigator\nAuthor information\nCorresponding author\nCorrespondence to\nJared R. Brosch\n.\n\nAn innovative health systems approach to support early detection of cognitive impairment in primary care - the brain health navigator\nEthics declarations\nEthics approval and consent to participate\nExemption from ethics approval and waiver of informed consent to participate granted: The ethics committee of Indiana University Institutional Review Human Subjects Review Office\nwaived the need for ethics approval and the need to obtain consent for the collection\n,\nevaluation\n,\nanalysis and publication of the anonymized data for this non-interventional\n,\nquality improvement study.\n(Application 15281). This study has been performed in accordance with the Declaration of Helsinki.\n\nAn innovative health systems approach to support early detection of cognitive impairment in primary care - the brain health navigator\nEthics declarations\nConsent for publication\nNot applicable.", "doc_items_refs": ["#/texts/424", "#/texts/426", "#/texts/427", "#/texts/428", "#/texts/431", "#/texts/432", "#/texts/433", "#/texts/434", "#/texts/435", "#/texts/436", "#/texts/437", "#/texts/438", "#/texts/439", "#/texts/441"], "page_nos": [], "uuid": "b2f8aa06-c36e-42ba-9c85-fc811ca36208"}
{"doc_id": "2025__An_innovative_health_systems_approach_to_support_early_detection_of_cognitive_im__W4413790860", "source_path": "<redacted:source_path>", "chunk_id": 31, "source_chunk_idxs": [45, 46, 47], "num_tokens": 316, "text": "An innovative health systems approach to support early detection of cognitive impairment in primary care - the brain health navigator\nEthics declarations\nCompeting interests\nThe authors declare no competing interests.\n\nAn innovative health systems approach to support early detection of cognitive impairment in primary care - the brain health navigator\nAdditional information\nPublisher's Note\nSpringer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations.\n\nAn innovative health systems approach to support early detection of cognitive impairment in primary care - the brain health navigator\nRights and permissions\nOpen Access\nThis article is licensed under a Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International License, which permits any non-commercial use, sharing, distribution and reproduction in any medium or format, as long as you give appropriate credit to the original author(s) and the source, provide a link to the Creative Commons licence, and indicate if you modified the licensed material. You do not have permission under this licence to share adapted material derived from this article or parts of it. The images or other third party material in this article are included in the article's Creative Commons licence, unless indicated otherwise in a credit line to the material. If material is not included in the article's Creative Commons licence and your intended use is not permitted by statutory regulation or exceeds the permitted use, you will need to obtain permission directly from the copyright holder. To view a copy of this licence, visit\nhttp://creativecommons.org/licenses/by-nc-nd/4.0/\n.\nReprints and permissions", "doc_items_refs": ["#/texts/443", "#/texts/446", "#/texts/448", "#/texts/449", "#/texts/450", "#/texts/451", "#/texts/452"], "page_nos": [], "uuid": "1d05b5d4-f90e-46c1-80f5-96a8f6da914a"}
{"doc_id": "2025__An_innovative_health_systems_approach_to_support_early_detection_of_cognitive_im__W4413790860", "source_path": "<redacted:source_path>", "chunk_id": 32, "source_chunk_idxs": [48, 49, 50, 51], "num_tokens": 304, "text": "An innovative health systems approach to support early detection of cognitive impairment in primary care - the brain health navigator\nAbout this article\nCite this article\nBrosch, J.R., Summanwar, D., Fowler, N.R.\net al.\nAn innovative health systems approach to support early detection of cognitive impairment in primary care - the brain health navigator.\nBMC Prim. Care\n26\n, 271 (2025). https://doi.org/10.1186/s12875-025-02977-w\nDownload citation\n- Received : 28 November 2024\n- Accepted : 31 July 2025\n- Published : 28 August 2025\n- DOI : https://doi.org/10.1186/s12875-025-02977-w\n\nAn innovative health systems approach to support early detection of cognitive impairment in primary care - the brain health navigator\nAbout this article\nKeywords\n- Alzheimer's disease\n- Dementia\n- Nurse navigator\n- Cognitive screening\n- Screening\n- Mild cognitive impairment\n- Digital cognitive assessment\n- Primary care\n- Screening\n- Disclosure of diagnosis\nDownload PDF\nAdvertisement\n\nAn innovative health systems approach to support early detection of cognitive impairment in primary care - the brain health navigator\nAbout this article\nKeywords\nBMC Primary Care\nISSN: 2731-4553\n\nAn innovative health systems approach to support early detection of cognitive impairment in primary care - the brain health navigator\nAbout this article\nKeywords\nContact us\n- General enquiries:\njournalsubmissions@springernature.com", "doc_items_refs": ["#/texts/455", "#/texts/456", "#/texts/457", "#/texts/458", "#/texts/459", "#/texts/460", "#/texts/461", "#/texts/462", "#/texts/463", "#/texts/464", "#/texts/465", "#/texts/467", "#/texts/468", "#/texts/469", "#/texts/470", "#/texts/471", "#/texts/472", "#/texts/473", "#/texts/474", "#/texts/475", "#/texts/476", "#/texts/477", "#/texts/478", "#/texts/480", "#/texts/482"], "page_nos": [], "uuid": "ef8aadc4-c10f-45f2-991f-b62e6596c481"}
