{"doc_id": "2025__Contribution_and_legacy_a_qualitative_study_of_older_peoples_attitudes_about_sha__W4410898545", "source_path": "<redacted:source_path>", "chunk_id": 0, "source_chunk_idxs": [0, 1], "num_tokens": 423, "text": "Contribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand | BMC Medical Ethics | Full Text\nSkip to main content\nAdvertisement\nSearch\n- Explore journals\n- Get published\n- About BMC\n- My account\nSearch all BMC articles\nSearch\nBMC Medical Ethics\n- Home\n- About\n- Articles\n- Submission Guidelines\n- Join the board\n- Collections\n- Submit manuscript\nContribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand\nDownload PDF\nDownload PDF\n- Research\n- Open access\n- Published: 30 May 2025\n\nContribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand\n- Engelina Groenewald\nORCID: orcid.org/0000-0002-1412-2370\n1\n,\n- Jasmine Appleton\n2\n,\n3\n,\n- Brendan Hallam\nORCID: orcid.org/0000-0001-5520-2636\n3\n,\n- Cristian Gonzalez-Prieto\nORCID: orcid.org/0000-0002-1567-9488\n4\n,\n- Susan Yates\nORCID: orcid.org/0000-0001-7551-5517\n1\n,\n- Daniel Wilson\nORCID: orcid.org/0000-0002-3593-6234\n4\n,\n- Gillian Dobbie\nORCID: orcid.org/0000-0001-7245-0367\n4\n,\n- Rosie Dobson\nORCID: orcid.org/0000-0003-0122-1000\n5\n&amp;\n- ...\n- Sarah Cullum\nORCID: orcid.org/0000-0003-0785-9101\n1\nShow authors\nBMC Medical Ethics\nvolume 26\n, Article number: 70 ( 2025 )\nCite this article\n- 780 Accesses\n- 5 Altmetric\n- Metrics details", "doc_items_refs": ["#/texts/1", "#/texts/2", "#/texts/3", "#/texts/4", "#/texts/5", "#/texts/6", "#/texts/7", "#/texts/8", "#/texts/9", "#/texts/10", "#/texts/11", "#/texts/12", "#/texts/13", "#/texts/14", "#/texts/15", "#/texts/16", "#/texts/17", "#/texts/18", "#/texts/19", "#/texts/20", "#/texts/21", "#/texts/22", "#/texts/23", "#/texts/25", "#/texts/26", "#/texts/27", "#/texts/28", "#/texts/29", "#/texts/30", "#/texts/31", "#/texts/32", "#/texts/33", "#/texts/34", "#/texts/35", "#/texts/36", "#/texts/37", "#/texts/38", "#/texts/39", "#/texts/40", "#/texts/41", "#/texts/42"], "page_nos": [], "uuid": "0cb21c1d-ba70-4f64-9f50-e38c4f95a369"}
{"doc_id": "2025__Contribution_and_legacy_a_qualitative_study_of_older_peoples_attitudes_about_sha__W4410898545", "source_path": "<redacted:source_path>", "chunk_id": 1, "source_chunk_idxs": [2, 3, 4], "num_tokens": 411, "text": "Contribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand\nAbstract\nBackground\nOlder adults, especially those with dementia, are often excluded from health research due to physical and medical comorbidities, and the assumption that those with cognitive impairment won't be able to consent. Using routinely collected data for research purposes is a way to include older people in research, and therefore the benefits of research. However, very little research has been done to examine the attitudes of older people towards sharing their routinely collected health data for research purposes.\n\nContribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand\nAbstract\nMethod\nTwenty-eight semi-structured interviews were conducted with older health service users in the Counties Manukau health district of Auckland, New Zealand. The interviews explored participants' views around the use of de-identified health data for health service improvement and health services research. Data were analysed using thematic analysis.\n\nContribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand\nAbstract\nResults\nThemes identified were: 1) Benefits: participants believed that there were benefits to sharing their health data such as helping others, improving health services, advancing scientific knowledge, and giving back to the health system; sharing health data was also seen as a reflection of good character, and people felt that their pre-existing views about whether they wished to share health data should be respected even if they were no longer able to consent. 2) Concerns: participants had concerns about sharing data with private companies, the use of inaccurate data, and the potential personal and societal consequences of sharing health data. 3) Expectations: participants encouraged collaboration between institutions in New Zealand, but expected data privacy to be maintained, processes to be transparent and cultural values around data to be respected; there was an expectation those sharing health data (patients or institutions) should benefit from any private sector gains.", "doc_items_refs": ["#/texts/45", "#/texts/47", "#/texts/49"], "page_nos": [], "uuid": "b7259da3-e745-4066-ba62-8bc14e040ffe"}
{"doc_id": "2025__Contribution_and_legacy_a_qualitative_study_of_older_peoples_attitudes_about_sha__W4410898545", "source_path": "<redacted:source_path>", "chunk_id": 2, "source_chunk_idxs": [5, 6], "num_tokens": 136, "text": "Contribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand\nAbstract\nConclusion\nOlder people in our study were supportive of sharing their deidentified health data for research purposes provided that the research would benefit others, now and in the future. This provides more confidence in the use routinely collected health data of older people for research, provided that researchers handle data in a respectful way and use it to benefit communities while avoiding potential harms.\n\nContribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand\nAbstract\nTrial Registration\nNA.\nPeer Review reports", "doc_items_refs": ["#/texts/51", "#/texts/53", "#/texts/54"], "page_nos": [], "uuid": "f5f20a5a-e822-49d2-a568-d8a85a6e3b95"}
{"doc_id": "2025__Contribution_and_legacy_a_qualitative_study_of_older_peoples_attitudes_about_sha__W4410898545", "source_path": "<redacted:source_path>", "chunk_id": 3, "source_chunk_idxs": [7], "num_tokens": 394, "text": "Contribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand\nBackground\nOlder adults, especially those with dementia, are often excluded from health research. There are multiple reasons for this, including arbitrary age cut-offs, medical comorbidities as exclusion criteria, and the perception that older people may not have capacity to consent or that they will not wish to participate in research [\n1\n].\nAn alternative to actively recruiting participants for research is using routinely collected health data for health research. This helps to reduce selection bias by including older people, thus making the findings more generalizable to this group and allowing them to benefit from the generated research evidence. Some argue that not using routinely collected health data potentially causes harm due to the consequent lack of robust evidence for benefit or harm in people who are unable to participate in traditional research. This further perpetuates the impact of ageism, stigma and discrimination [\n2\n,\n3\n]. Using routinely collected health data may also be more inclusive for those with cognitive impairment who are often excluded from traditional research projects due to researchers' assumptions about capacity to consent [\n1\n].\nUsing routinely collected health data for research in older adults has many potential applications such as falls prevention [\n1\n], and the prevention and management of chronic diseases [\n4\n]. In the area of dementia, routinely collected health data could be used to help improve early diagnosis, identify biomarkers, prevent decline in brain health, and monitor progression of dementia [\n5\n,\n6\n,\n7\n].\nThe utilisation of administrative data is increasing rapidly due to the explosion of artificial intelligence (AI) and is likely to be a cost-effective approach research tool for epidemiology and dementia prevention studies. The development of AI in health care [\n8\n] and the future applications of this technology are anticipated to particularly benefit older people as they are the highest users of healthcare services [\n9\n].", "doc_items_refs": ["#/texts/56", "#/texts/57", "#/texts/58", "#/texts/59", "#/texts/60", "#/texts/61", "#/texts/62", "#/texts/63", "#/texts/64", "#/texts/65", "#/texts/66", "#/texts/67", "#/texts/68", "#/texts/69", "#/texts/70", "#/texts/71", "#/texts/72", "#/texts/73", "#/texts/74", "#/texts/75", "#/texts/76", "#/texts/77", "#/texts/78", "#/texts/79", "#/texts/80", "#/texts/81"], "page_nos": [], "uuid": "9dadec4a-1eb4-4e99-9660-8b5f9a566882"}
{"doc_id": "2025__Contribution_and_legacy_a_qualitative_study_of_older_peoples_attitudes_about_sha__W4410898545", "source_path": "<redacted:source_path>", "chunk_id": 4, "source_chunk_idxs": [8], "num_tokens": 498, "text": "Contribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand\nBackground\nDespite the apparent advantages of using deidentified routine data, there is a prevailing perception that data belong to individuals, and we therefore need to understand how people feel about the use of their health data for research purposes. Surveys exploring people's attitudes and perceptions regarding this issue [\n9\n,\n10\n] have shown that people are generally positive about the use of their data for research, but oppose the idea of their data being shared with private companies [\n11\n,\n12\n,\n13\n,\n14\n]. Qualitative research studies have used one-to-one interviews and focus groups to examine these issues in greater depth, exploring patients' attitudes towards the sharing of routinely collected health data. Several studies [\n2\n,\n15\n,\n16\n] reported that participants were generally positive towards data sharing due to its potential benefits for patients, the health community, and health services research. However, patients were concerned about confidentiality and potential misuse of their health data, for example, to discriminate or restrict their access to specific health services, and also potential discrimination by insurance companies.\nVery few studies have explored older people's attitudes and preferences around sharing their routinely collected health data for research purposes, especially in the context of brain health. One survey conducted in the United Kingdom reported that, of the whole population surveyed, people in the age group aged 75 + were the most willing to share their health data [\n13\n]. Another survey of older adults attending senior centres in South Korea, showed that older adults were willing to share health data with families and hospitals but less willing to share with researchers and device developers [\n4\n]. An online survey of older outpatients in New Zealand specifically addressed the issues of cognitive decline and dementia and found that patients supported the use of their data provided that the population would benefit from its use [\n17\n].\nWhilst these survey results are important, the findings need to be investigated in more depth to understand the nuances, especially for the population at higher risk of dementia due to their age. To our knowledge there have been no qualitative research studies using one-to-one interviews or focus groups that specifically recruited older people to explore their attitudes about sharing their health data. The aim of this study was therefore to explore older people's attitudes and preferences about sharing their routinely collected health data for research purposes, especially in the context of brain health.", "doc_items_refs": ["#/texts/82", "#/texts/83", "#/texts/84", "#/texts/85", "#/texts/86", "#/texts/87", "#/texts/88", "#/texts/89", "#/texts/90", "#/texts/91", "#/texts/92", "#/texts/93", "#/texts/94", "#/texts/95", "#/texts/96", "#/texts/97", "#/texts/98", "#/texts/99", "#/texts/100", "#/texts/101", "#/texts/102", "#/texts/103", "#/texts/104", "#/texts/105", "#/texts/106", "#/texts/107", "#/texts/108"], "page_nos": [], "uuid": "5f9d67be-de24-4829-889e-5d98d2e8b6fa"}
{"doc_id": "2025__Contribution_and_legacy_a_qualitative_study_of_older_peoples_attitudes_about_sha__W4410898545", "source_path": "<redacted:source_path>", "chunk_id": 5, "source_chunk_idxs": [9, 10], "num_tokens": 390, "text": "Contribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand\nMethods\nPopulation and setting\nThe study took place in Te Whatu Ora Counties Manukau, a health district in Auckland, New Zealand, with a highly diverse population including Māori, Pacific Island, Asian and European peoples. The sample was ascertained from a subsample of service users who responded to a prior online survey which sought to gain an understanding of the attitudes of older people about the management of their health information [\n17\n]. The survey was distributed by email to people who met the following inclusion criteria: [\n1\n] currently resident in New Zealand [\n2\n] aged 55 years or older, and [\n3\n] currently using health services in Te Whatu Ora Counties Manukau. All 326 service users who participated in the online survey were asked if they would be willing to be contacted for a further face-to-face interview to obtain more in-depth knowledge about the attitudes and preferences around the use of their health information, and 84 people agreed to be contacted.\n\nContribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand\nMethods\nProcedures\nWe contacted the survey participants with correct contact details and asked them whether they were still interested in participating in an online interview to be conducted in English, and 28 participants agreed. Semi-structured in-depth interviews were conducted by a trained female research assistant (JA) using the Zoom video conferencing platform. We had originally planned to conduct face-to-face meetings but were unable to do this due to policy around COVID-19 restrictions at the time. Interviews were audio-recorded, and transcribed using a package for automatic speech recognition called Whisper, developed in Python [\n18\n]. Whisper was chosen for confidentiality reasons, as it does not connect to other servers online.", "doc_items_refs": ["#/texts/111", "#/texts/112", "#/texts/113", "#/texts/114", "#/texts/115", "#/texts/116", "#/texts/117", "#/texts/118", "#/texts/119", "#/texts/121", "#/texts/122", "#/texts/123"], "page_nos": [], "uuid": "a8a294ac-66d8-45a5-8db5-c373b1e9e7c1"}
{"doc_id": "2025__Contribution_and_legacy_a_qualitative_study_of_older_peoples_attitudes_about_sha__W4410898545", "source_path": "<redacted:source_path>", "chunk_id": 6, "source_chunk_idxs": [11, 12], "num_tokens": 470, "text": "Contribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand\nMethods\nInterview guide\nThe research assistant (JA) used a case scenario to guide the interview. The scenario was based on a previous more generic case scenario developed by one of the authors (RD) for a similar study in younger adults [\n2\n]. Our case scenario explored topics around the use of de-identified health data for health service improvement and health services research, but with a specific focus on brain health and dementia. The topics included sharing data with academic partners local and overseas, linkage with other health data (e.g., utilisation of healthcare resources, mortality data); allowing private companies to use the data in order to develop new medical equipment (possibly for profit); and using data from people who are unable to consent (such as those who have developed severe dementia or have died). Participants were encouraged to ask questions and discuss each step of the scenario so that they fully understood the issues. The topic guide can be found in Additional File\n1\n.\n\nContribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand\nMethods\nAnalysis\nThe qualitative study used an inductive approach. Transcripts were analysed by two of the authors (BH and LG) using thematic analysis. The phases outlined by Braun and Clarke [\n19\n] were used for analysis. Thematic analysis was chosen as a method to analyse the data, as it enabled the investigators to understand the motivation for participants' attitudes towards sharing health data, and the meaning those attitudes had for them. The two team members familiarized themselves with the data, documented initial ideas and themes, and then started data coding across the whole dataset. The case scenario questions helped shape how data was collected, but the researchers didn't use those questions as a predetermined coding framework for their analysis. The initial codes were collated into potential themes and were cross-checked with coded extracts and the data set. The two researchers (BH and LG) had regular meetings where themes were reviewed, defined and named to produce the report. After the themes were identified, the researchers went back to the transcripts to find exemplars.", "doc_items_refs": ["#/texts/125", "#/texts/126", "#/texts/127", "#/texts/128", "#/texts/129", "#/texts/131", "#/texts/132", "#/texts/133"], "page_nos": [], "uuid": "18dfd1a2-538f-4f6d-a5e1-6791f5911846"}
{"doc_id": "2025__Contribution_and_legacy_a_qualitative_study_of_older_peoples_attitudes_about_sha__W4410898545", "source_path": "<redacted:source_path>", "chunk_id": 7, "source_chunk_idxs": [13, 14, 15], "num_tokens": 442, "text": "Contribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand\nMethods\nEthics\nEthical approval for this study was obtained from the Auckland Health Research Ethics Committee, reference number AH22266 on 18 October 2021.\n\nContribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand\nResults\nSample characteristics\nOnline interviews were conducted with the 28 participants who agreed to take part in the study. Most (26/28) of the participants were aged 65+, the remaining two were 57 and 60 years old. Ages ranged between 57 and 90, with an average age of 74 years. Of the 28 participants, 25 were of European ethnicity, one participant was Māori, one was Fijian Indian, and one did not disclose ethnicity. Nineteen participants were female and seven were male. Six participants stated that they had personal experience of living with or caring for a person who had been diagnosed with dementia.\n\nContribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand\nResults\nThematic analysis\nParticipants were generally positive about their routinely collected deidentified health data being used for research purposes. They perceived many benefits to sharing their health data such as helping others, improving health services, advancing scientific knowledge, and giving back to the health system. They felt that sharing their data was a reflection of good character, and that people's pre-existing views about whether they wished to share health data should be heard and respected, including if they were no longer able to consent.\nThey also voiced the concerns they had, such as sharing data with private companies, sharing inaccurate data, and the potential personal and societal consequences of sharing health data.\nParticipants had strong opinions on how research should be conducted, including an expectation that institutions in New Zealand should collaborate to get better results. They expected data privacy to be maintained and processes to be transparent. Some felt that patients and/or institutions should benefit from any private sector gains, and that cultural beliefs should be respected.\nThe main themes and subthemes are illustrated in Fig.\n1\n.\nFig. 1", "doc_items_refs": ["#/texts/135", "#/texts/138", "#/texts/140", "#/texts/141", "#/texts/142", "#/texts/143", "#/texts/144", "#/texts/145", "#/texts/146"], "page_nos": [], "uuid": "238f9ec9-5c34-481b-887a-2d8312a62c44"}
{"doc_id": "2025__Contribution_and_legacy_a_qualitative_study_of_older_peoples_attitudes_about_sha__W4410898545", "source_path": "<redacted:source_path>", "chunk_id": 8, "source_chunk_idxs": [16], "num_tokens": 180, "text": "Contribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand\nResults\nBenefits to using routinely collected health data for research\nParticipants were willing to share their health data for research purposes if there was a perceived benefit to doing this in order to help others, for themselves, and to improve health services. It was also seen as a way to give back to health services that had served them over their lifetime.\nParticipants wanted to aid, assist and support others by sharing their data. \"Others\" refer to people in general, but also specific groups such as students or researchers, and even institutions like the hospital. The idea of helping the health system by \"giving back\" was included in this subtheme, as participants were the recipients of help and support from the hospital, and therefore wanted to provide aid to the health system in return.", "doc_items_refs": ["#/texts/148", "#/texts/149"], "page_nos": [], "uuid": "a9861f89-a302-4815-9e98-7dcfb765e376"}
{"doc_id": "2025__Contribution_and_legacy_a_qualitative_study_of_older_peoples_attitudes_about_sha__W4410898545", "source_path": "<redacted:source_path>", "chunk_id": 9, "source_chunk_idxs": [17], "num_tokens": 394, "text": "Contribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand\nResults\nHelping other people\nThe foremost reason for being willing to share data was the potential to offer help to others, in particular people living in the local community.\nI don't have any difficulties with that (sharing health data) because if I can help other people\n,\nI love to do that [Participant 21]\n.\nI'd be very happy (to share health data). I think anything that can help is wonderful. [Participant 13]\nI'm okay with it being used for research because it's only going to help people...possibly not myself\n,\nbut certainly other people. So why not? [Participant 26]\nIn addition to helping other people now, participants also saw sharing of their health data as a way to help other people in the future. One participant used migraine as an example and said that he would be more than willing to share his health data if it could help one of his children in the future. Another pointed out that increasing prevalence of dementia was likely to have a major impact on the health system, so obtaining knowledge now would benefit those in the future.\nMy understanding of what I have read: in the next\n,\nI forgot how many years but it's not that long\n,\none in three people are going to end up with dementia. If you know those statistics are correct\n,\nwell\n,\nthat's a major. It's a major on the health system. It's a major on families. It's a major on doctors\n,\neverything. So there's got to be a reason why more people are getting dementia. It's going to be one in three. You know\n,\nthat's really high. So what is the core of it? Yeah. Combining information from all parts is again beneficial on the long run\n,\nI think. [Participant 18]", "doc_items_refs": ["#/texts/151", "#/texts/152", "#/texts/153", "#/texts/154", "#/texts/155", "#/texts/156", "#/texts/157", "#/texts/158", "#/texts/159", "#/texts/160", "#/texts/161", "#/texts/162", "#/texts/163", "#/texts/164", "#/texts/165", "#/texts/166", "#/texts/167", "#/texts/168", "#/texts/169", "#/texts/170", "#/texts/171", "#/texts/172", "#/texts/173", "#/texts/174", "#/texts/175"], "page_nos": [], "uuid": "5efad2f3-5d9b-4ea9-a461-0780271a2d4d"}
{"doc_id": "2025__Contribution_and_legacy_a_qualitative_study_of_older_peoples_attitudes_about_sha__W4410898545", "source_path": "<redacted:source_path>", "chunk_id": 10, "source_chunk_idxs": [18, 19], "num_tokens": 296, "text": "Contribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand\nResults\nHelping researchers and students\nParticipants also wanted to share their health data to help researchers and young scientists, as well as training of medical students and other health care professionals in New Zealand.\nThat would be fine [sharing health data] as there would be a general benefit for the researchers. [Participant 8]\nWell\n,\nI have a daughter who works in the pharmaceutical industry [...] providing work for New Zealand trained young scientists too. [Participant 6]\nI think it comes down to training doctors in hospitals. [...] And that\n,\nin the long run\n,\ncan cut down waiting times and visits to the hospital. [Participant 18]\nI mean\n,\nit's a learning facility and most public hospitals are\n,\n...you know\n,\nevery little bit helps\n,\ndoesn't it? [Participant 10]\n\nContribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand\nResults\nGiving back to the health system\nSome participants perceived sharing data as a way to \"give back\" for health services that they received throughout their lives.\nFor me doing this is a way of maybe, in some way, paying back for all the help and all the consideration I've had, especially from people and medics at (the) hospital. [Participant 5]", "doc_items_refs": ["#/texts/177", "#/texts/178", "#/texts/179", "#/texts/180", "#/texts/181", "#/texts/182", "#/texts/183", "#/texts/184", "#/texts/185", "#/texts/186", "#/texts/187", "#/texts/188", "#/texts/189", "#/texts/190", "#/texts/191", "#/texts/192", "#/texts/193", "#/texts/194", "#/texts/195", "#/texts/197", "#/texts/198"], "page_nos": [], "uuid": "aaa5276c-d464-4cbc-9287-42c421596036"}
{"doc_id": "2025__Contribution_and_legacy_a_qualitative_study_of_older_peoples_attitudes_about_sha__W4410898545", "source_path": "<redacted:source_path>", "chunk_id": 11, "source_chunk_idxs": [20, 21], "num_tokens": 431, "text": "Contribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand\nResults\nLeaving a legacy\nParticipants perceived their health data as a reflection of their life experiences and personal history, and wanted the collection of these experiences (data) to help others and \"do good\", and leave a legacy, even after they died.\nI'm very happy for whatever life experience that I've had\n,\na bit of negative or positive\n,\nto be used. [...] you know\n,\nthat was painful at the time\n,\nbut it could be used to help somebody - hallelujah\n,\nyou know\n,\nthat's fantastic! [Participant 23]\nWell\n,\nI'm 88\n,\nand so I've not got many years left in my life\n,\nbut [...] you've got to store this information. It's not dead. The patient's not dead. It's a person. [Participant 22]\n\nContribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand\nResults\nGood character\nThe character trait of being caring and helpful was the reason given for why participants were willing to share their own health data. This was also the reason they would wish their data to be used after they were no longer able to consent (either due to dementia or death) so that they might continue to benefit others. Participants also felt that the health information of a family member who had developed dementia should be used if that family member had a caring personality and previously wished to help others.\nMy mother developed it (dementia). And she always\n,\nalways said\n,\n\"I'm going to donate my brain to science. If someone can learn from it\n,\nthat's great'\" [Participant 10]\n.\nI personally can't [see a problem with sharing my data] because, as you can see, I'm very open. Yeah, and I'm a health professional myself [...] For me the thought that it may help someone is fantastic. [Participant 23]", "doc_items_refs": ["#/texts/200", "#/texts/201", "#/texts/202", "#/texts/203", "#/texts/204", "#/texts/205", "#/texts/206", "#/texts/207", "#/texts/208", "#/texts/209", "#/texts/210", "#/texts/211", "#/texts/212", "#/texts/213", "#/texts/214", "#/texts/215", "#/texts/216", "#/texts/217", "#/texts/218", "#/texts/219", "#/texts/220", "#/texts/222", "#/texts/223", "#/texts/224", "#/texts/225", "#/texts/226", "#/texts/227", "#/texts/228", "#/texts/229", "#/texts/230", "#/texts/231"], "page_nos": [], "uuid": "7660d613-0ca5-4b4a-a150-a3733de14143"}
{"doc_id": "2025__Contribution_and_legacy_a_qualitative_study_of_older_peoples_attitudes_about_sha__W4410898545", "source_path": "<redacted:source_path>", "chunk_id": 12, "source_chunk_idxs": [22, 23], "num_tokens": 324, "text": "Contribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand\nResults\nImprove health services\nParticipants wanted to make systems better and be part of the advancement of systems by sharing their health data. Such systems included the health system, the body of scientific knowledge and the development of new medical treatments. Participants felt that data-driven health services research could cut down hospital visits, improve the way health professionals diagnose illness and lead to more efficiency in the health system.\nAny way that can be helpful for health services I think is great\n.\n[Participant 16]\nIt [sharing confidential health data] could make the link\n,\nfor better medicine or better care\n,\nor actions to improve the patient. [Participant 19]\nIt [linking de-identified data with future events] speaks for and promotes efficiency. Yeah. And like a streamlined sort of healthcare system really. [Participant 26]\n\nContribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand\nResults\nAdvance scientific knowledge\nParticipants wanted their health data to contribute to research and lead to the improvement and advancement of scientific knowledge.\nWithout research we don't go forward. [Participant 18]\nAny research is good research. I think provided it's the appropriate medical research as I'd be comfortable with that [sharing health data] [Participant 25]\n.\nI think that would be very helpful [linking de-identified information with future events]. Everything that's gone before ends up with what you've got now. [Participant 23]", "doc_items_refs": ["#/texts/233", "#/texts/234", "#/texts/235", "#/texts/236", "#/texts/237", "#/texts/238", "#/texts/239", "#/texts/240", "#/texts/241", "#/texts/242", "#/texts/244", "#/texts/245", "#/texts/246", "#/texts/247", "#/texts/248"], "page_nos": [], "uuid": "cff39210-e833-4306-a798-dbb9b1d54c3e"}
{"doc_id": "2025__Contribution_and_legacy_a_qualitative_study_of_older_peoples_attitudes_about_sha__W4410898545", "source_path": "<redacted:source_path>", "chunk_id": 13, "source_chunk_idxs": [24, 25], "num_tokens": 234, "text": "Contribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand\nResults\nImproving treatments\nParticipants felt that sharing their health data for research could lead to improvement in treatments and specifically the development of medicines.\nAgain\n,\nanything that can improve medicine in any regard is a good idea. That's\n,\nyou know\n,\nhow do medicines probably develop over the centuries as it goes? [Participant 19]\nIf it is for the purpose of finding out information that will benefit somebody or help to make a new drug or whatever\n,\nthen I don't have a problem with that [...] I'm happy with that as long as it is to do with improving one's quality of life\n,\nor medication. [Participant 3]\n\nContribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand\nConcerns\nDespite the perceived benefits, participants also had strong concerns about the sharing of their health data. They were apprehensive about sharing data with private companies, sharing inaccurate information, and the personal consequences as well as potential societal consequences.", "doc_items_refs": ["#/texts/250", "#/texts/251", "#/texts/252", "#/texts/253", "#/texts/254", "#/texts/255", "#/texts/256", "#/texts/257", "#/texts/258", "#/texts/259", "#/texts/260", "#/texts/261", "#/texts/262", "#/texts/264"], "page_nos": [], "uuid": "2ca4c832-3f4b-40c6-91e3-4ffa62210752"}
{"doc_id": "2025__Contribution_and_legacy_a_qualitative_study_of_older_peoples_attitudes_about_sha__W4410898545", "source_path": "<redacted:source_path>", "chunk_id": 14, "source_chunk_idxs": [26], "num_tokens": 504, "text": "Contribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand\nConcerns\nSharing data with private companies: private companies are not trustworthy as custodians of health data\nParticipants were worried that monetary profit and societal benefit may be mutually exclusive, and therefore did not trust private companies to manage health data. A pervasive theme was the skepticism of how private companies would use health data. Participants were concerned about the intentions of private companies and were worried that their data would be used for the \"wrong intentions\": monetary profit and not the benefit of society.\nI don't trust private companies. I think they'd be using it for profit... Even the big companies make me a little weary. It's more ethical. You get information on my health\n,\nit doesn't really matter\n,\nbut it's an ethical thing. So think about it: they're using this to make money. [Participant 7].\nI'm just thinking\n,\nwell\n,\nif they're trying to get profits\n,\nwhat are they doing with the profits... bump their money up? [Participant 9]\nI wouldn't be so happy about that [sharing data with private companies]. The first thing that runs from my mind is\n,\nwhen it's for profit\n,\nsometimes money can take away from the whole idea of giving a true perspective. It's just that if it's money\n,\nto do with money\n,\nmaybe it's the intentions. It's only about the intentions about if they're doing it for money. [Participant 3]\nIt's basically the thing of it being used to make a company money rather than being used to help other people. [Participant 5]\nEven though some participants were strongly opposed to their health data being used for profit, others were strongly supportive of the idea. These participants felt that private companies could use their data for the benefit of society, and specifically to develop new drugs.\nThat's just the world\n,\nisn't it? If there's a company out there\n,\nthey want to make a profit. And if they are making a profit\n,\nit makes their product better\n,\nI would say. That's just how industry works. [Participant 23]\nIt comes down to efforts to help the patients in the future. And companies are there always there to make profits. The most profitable companies in the world are pharmaceutical companies. [Participant 19]", "doc_items_refs": ["#/texts/266", "#/texts/267", "#/texts/268", "#/texts/269", "#/texts/270", "#/texts/271", "#/texts/272", "#/texts/273", "#/texts/274", "#/texts/275", "#/texts/276", "#/texts/277", "#/texts/278", "#/texts/279", "#/texts/280", "#/texts/281", "#/texts/282", "#/texts/283", "#/texts/284", "#/texts/285", "#/texts/286", "#/texts/287", "#/texts/288", "#/texts/289", "#/texts/290", "#/texts/291", "#/texts/292", "#/texts/293", "#/texts/294", "#/texts/295", "#/texts/296", "#/texts/297", "#/texts/298", "#/texts/299"], "page_nos": [], "uuid": "c03a8fa3-4deb-489f-843b-074d97934e0e"}
{"doc_id": "2025__Contribution_and_legacy_a_qualitative_study_of_older_peoples_attitudes_about_sha__W4410898545", "source_path": "<redacted:source_path>", "chunk_id": 15, "source_chunk_idxs": [27, 28, 29], "num_tokens": 405, "text": "Contribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand\nConcerns\nSharing data with private companies: private companies are not trustworthy as custodians of health data\nNo\n,\nthat's fine because if they're using it to make a good drug or something then\n,\nand it's like make a profit out of it\n,\nthat's normal society. [Participant 8]\nA private company has got more time and resources to put into studies\n,\nI suppose. [Participant 10]\n\nContribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand\nConcerns\nInaccurate information: if health data is inaccurate, it will lead to wrong conclusions\nParticipants were concerned that the data may be incorrect, and that if such data is shared for research purposes, researchers will come to invalid conclusions.\nHospitals don't tend to get the information correct. [...] It's like when I was in (the) hospital\n,\nI was taken on by ambulance. And they said\n,\n'are you a smoker?' I said no. And then I read in the discharge reports that I was a smoker. [...] When people are gathering information like that\n,\nthey see a report that says she was a smoker. [...] So the information has to be correct. Because it goes to people like you. And they're going to say\n,\n\"oh well\n,\nshe did smoke\". And that's not an accurate result to the research you're doing. [Participant 18]\n\nContribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand\nConcerns\nConsequences: sharing health data may have harmful consequences for individuals and society\nParticipants were worried that sharing health data may have harmful consequences for the individual whose data is being used, and for society as a whole.", "doc_items_refs": ["#/texts/300", "#/texts/301", "#/texts/302", "#/texts/303", "#/texts/304", "#/texts/305", "#/texts/306", "#/texts/307", "#/texts/308", "#/texts/309", "#/texts/311", "#/texts/312", "#/texts/313", "#/texts/314", "#/texts/315", "#/texts/316", "#/texts/317", "#/texts/318", "#/texts/319", "#/texts/320", "#/texts/321", "#/texts/322", "#/texts/324"], "page_nos": [], "uuid": "6c204abb-d6a2-457d-b152-a6bbd24055d7"}
{"doc_id": "2025__Contribution_and_legacy_a_qualitative_study_of_older_peoples_attitudes_about_sha__W4410898545", "source_path": "<redacted:source_path>", "chunk_id": 16, "source_chunk_idxs": [30], "num_tokens": 258, "text": "Contribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand\nConcerns\nConsequences: sharing health data may have harmful consequences for individuals and society\nPersonal consequences\nSome were worried about personal implications of sharing their data, such as insurance companies getting hold of the data, or losing their driver's licence.\nIt actually happened to me that my driving license was taken off me [...] That's just an example. If insurance companies go to that\n,\nthey might say \"you're not getting insurance [...]\n,\nyou've been classified as a drunk driver\". [Participant 4]\nI worry about the ethics of how will it be used in the future and how will that information\n,\nyeah\n,\naffect insurance and all those other things quite ethically...then the people should know about it more. And then it will be a problem. [Participant 11]\nParticipants were also concerned about being financially exploited if their private information was shared with private companies.\nI wouldn't know if I'd be very keen on that... yeah\n,\nnow when they sell your\n,\nlike say your telephone number\n,\nto these scam people\n,\nthat's the biggest problem. [Participant 2]", "doc_items_refs": ["#/texts/326", "#/texts/327", "#/texts/328", "#/texts/329", "#/texts/330", "#/texts/331", "#/texts/332", "#/texts/333", "#/texts/334", "#/texts/335", "#/texts/336", "#/texts/337", "#/texts/338", "#/texts/339", "#/texts/340", "#/texts/341", "#/texts/342", "#/texts/343", "#/texts/344", "#/texts/345", "#/texts/346"], "page_nos": [], "uuid": "a1ec1d9b-4640-4211-a1c1-ddd56b735f79"}
{"doc_id": "2025__Contribution_and_legacy_a_qualitative_study_of_older_peoples_attitudes_about_sha__W4410898545", "source_path": "<redacted:source_path>", "chunk_id": 17, "source_chunk_idxs": [31, 32, 33], "num_tokens": 381, "text": "Contribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand\nConcerns\nConsequences: sharing health data may have harmful consequences for individuals and society\nConsequences for society\nSome were concerned about the impacts of data sharing on society, such as data being used by governments to control people or even to support warfare.\nResearch is often used for warfare and controlling people. And I wouldn't want that\n,\nbut then how can you stop it? That's not a reason not to advance scientifically. [Participant 14]\n\nContribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand\nExpectations\nParticipants had strong expectations on how their health data should be used for research, including collaboration to advance scientific knowledge, and data being used in a safe way.\n\nContribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand\nExpectations\nCollaboration: collaboration between institutions could solve problems in society\nParticipants were of the opinion that research collaboration between institutions should be strongly encouraged, as it could have many potential benefits and lead to solutions for society as a whole.\nWhen people work together\n,\nI think it would be easier for people to find possible questions. Because you've got more than one set of advice\n,\nand everybody's sharing ideas and having input into it. In that case\n,\nsomeone could come up with a solution rather than being in a small pool of people. [Participant 18]\nThe bigger the group\n,\nthe more accurate the result will be. [Participant 19]\nSome participants used the response to the COVID-19 pandemic as an example.\nThis is what happened when we had COVID\n,\nthat there was a collaborative work together. Look\n,\nlook\n,\nwe've got fantastic vaccines. [Participant 23]", "doc_items_refs": ["#/texts/348", "#/texts/349", "#/texts/350", "#/texts/351", "#/texts/353", "#/texts/355", "#/texts/356", "#/texts/357", "#/texts/358", "#/texts/359", "#/texts/360", "#/texts/361", "#/texts/362", "#/texts/363", "#/texts/364", "#/texts/365", "#/texts/366", "#/texts/367", "#/texts/368", "#/texts/369", "#/texts/370", "#/texts/371", "#/texts/372", "#/texts/373"], "page_nos": [], "uuid": "9b9d2d51-54fb-415a-a313-218afa4e57d2"}
{"doc_id": "2025__Contribution_and_legacy_a_qualitative_study_of_older_peoples_attitudes_about_sha__W4410898545", "source_path": "<redacted:source_path>", "chunk_id": 18, "source_chunk_idxs": [34, 35], "num_tokens": 252, "text": "Contribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand\nExpectations\nResearch conduct: research conduct should adhere to ethical principles\nParticipants had expectations regarding how research should be conducted when using health data. They expected research to be conducted ethically, by adhering to principles such as privacy, transparency and informed consent.\n\nContribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand\nExpectations\nResearch conduct: research conduct should adhere to ethical principles\nPrivacy\nThe main expectation was privacy, and that patients should not be identified at any point.\nAs long as they don't know who I personally am or where I live\n,\nthat's fine. [Participant 2]\nI wouldn't have a problem with it as long as there were no details of myself involved at all. [Participant 18]\nWell\n,\nmy information is now completely unknown to anybody who's using it as to who I am\n,\nso that's fine. [Participant 8]\nAs long as my privacy is not in danger. I think you said earlier that it will not be known to other people from where this information has been derived. [Participant 1]", "doc_items_refs": ["#/texts/375", "#/texts/377", "#/texts/378", "#/texts/379", "#/texts/380", "#/texts/381", "#/texts/382", "#/texts/383", "#/texts/384", "#/texts/385", "#/texts/386", "#/texts/387"], "page_nos": [], "uuid": "f8229ebc-41e2-4c86-bcad-96ac1a511447"}
{"doc_id": "2025__Contribution_and_legacy_a_qualitative_study_of_older_peoples_attitudes_about_sha__W4410898545", "source_path": "<redacted:source_path>", "chunk_id": 19, "source_chunk_idxs": [36], "num_tokens": 333, "text": "Contribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand\nExpectations\nResearch conduct: research conduct should adhere to ethical principles\nConsent\nA few participants wanted their consent to be requested before their routinely collected data were linked with other data for research purposes.\nIt would be nice to get the consent from the person because obviously they're going in with the person's details. So contact the person and say\n,\nthis is what we're doing. Do you mind if we have consent to your information? Even though down the track you may be de-identified. But still contact the person and say\n,\nthis is what we're doing. [Participant 18]\nI think it comes down to the same thing again. If you're going to do that\n,\njust ask for consent\n,\njust say\n,\nthis is what we're doing for. How do you feel? Yeah. Again\n,\nit has a lot of benefits...Yeah. Just a courtesy call to say\n,\nthis is what we're doing. How do you\n,\nyou know\n,\nwe understand you've done research in the past. So how do you feel about\n,\nyou know\n,\nthis is what we're going to do. How do you feel about it? And would you\n,\nwe have me to give consent first and we can all together? Yeah. Just basically like what you've done in this interview [Participant 18]\n.\nOthers felt that individual consent was not required (and would be logistically difficult) but they did want to be informed if their health data were likely to be used for research.", "doc_items_refs": ["#/texts/389", "#/texts/390", "#/texts/391", "#/texts/392", "#/texts/393", "#/texts/394", "#/texts/395", "#/texts/396", "#/texts/397", "#/texts/398", "#/texts/399", "#/texts/400", "#/texts/401", "#/texts/402", "#/texts/403", "#/texts/404", "#/texts/405", "#/texts/406", "#/texts/407", "#/texts/408", "#/texts/409", "#/texts/410", "#/texts/411", "#/texts/412", "#/texts/413", "#/texts/414", "#/texts/415", "#/texts/416", "#/texts/417"], "page_nos": [], "uuid": "ba6d54c8-f42b-4a3f-90af-1d119cda9328"}
{"doc_id": "2025__Contribution_and_legacy_a_qualitative_study_of_older_peoples_attitudes_about_sha__W4410898545", "source_path": "<redacted:source_path>", "chunk_id": 20, "source_chunk_idxs": [37, 38], "num_tokens": 438, "text": "Contribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand\nExpectations\nResearch conduct: research conduct should adhere to ethical principles\nTransparency\nTransparency on what happened to routinely collected health data that was to be used for health research was important for participants.\nIf you feel like there's a huge transparency around it\n,\nI think you may get public buy-in. That we're all working to the same good. I mean\n,\nthat might again\n,\nas I said\n,\nmight be people who were opt out. I mean\n,\nthat we need to have transparency around that\". [Participant 23]\n\nContribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand\nExpectations\nMutual benefit: research should benefit the patients and the institutions that shared health data\nThere was an expectation that those who use the health data show respect to patients and the institutions that shared the data with them. There was also an expectation that, if the data were shared with private companies or internationally, that the patient group, the hospital and/or the country (New Zealand) would receive some benefit from the research in return, especially if there was monetary gain.\nAs long as New Zealand got some benefit back from the research...You know\n,\nyou don't want to be doing all the work and then half being hijacked from offshore. I don't know if that makes sort of sense\n,\nbut yeah\n,\nI'd expect New Zealand to get benefit out of any research like that...that's been shared. [Participant 19]\nThere's a lot of people\n,\nbut if the hospital or the\n,\nyou know\n,\ncould make a deal with them (private companies): if you've used the research\n,\nplease give us a discount or something. It would go a long way to... You know\n,\nif there was something where they could make a discount. So many patients could get the benefit of the research or you know\n,\nmaybe somewhere they could work out. So many patients a year for free or whatever. [Participant 4]", "doc_items_refs": ["#/texts/419", "#/texts/420", "#/texts/421", "#/texts/422", "#/texts/423", "#/texts/424", "#/texts/425", "#/texts/426", "#/texts/427", "#/texts/428", "#/texts/429", "#/texts/430", "#/texts/432", "#/texts/433", "#/texts/434", "#/texts/435", "#/texts/436", "#/texts/437", "#/texts/438", "#/texts/439", "#/texts/440", "#/texts/441", "#/texts/442", "#/texts/443", "#/texts/444", "#/texts/445", "#/texts/446", "#/texts/447", "#/texts/448", "#/texts/449", "#/texts/450", "#/texts/451", "#/texts/452"], "page_nos": [], "uuid": "d31e01ae-8efb-402e-8eb5-775fb7c8cd42"}
{"doc_id": "2025__Contribution_and_legacy_a_qualitative_study_of_older_peoples_attitudes_about_sha__W4410898545", "source_path": "<redacted:source_path>", "chunk_id": 21, "source_chunk_idxs": [39], "num_tokens": 186, "text": "Contribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand\nExpectations\nCultural respect: health data should be used in a way that respects cultural values\nParticipants felt that data should be used in a culturally respectful way. Many participants wanted research to be done in a way that was respectful to Indigenous culture in New Zealand. Even though only one of the participants was Māori, there was strong support for Tikanga/ doing research in a way that is appropriate to Māori cultural practices.\nI think actually\n,\nespecially for our tangata whenua\n1\n,\nthey might have a problem with that (using data after someone's death). Because their remains are tapu\n2\n.\nSo maybe that is something that should be considered [...]. You see\n,\nI'm okay with that. But other cultures may not be okay with that. [Participant 23]", "doc_items_refs": ["#/texts/454", "#/texts/455", "#/texts/456", "#/texts/457", "#/texts/458", "#/texts/459", "#/texts/460", "#/texts/461", "#/texts/462", "#/texts/463", "#/texts/464", "#/texts/465"], "page_nos": [], "uuid": "56dd3c74-e055-4386-900d-d30f23d4c9fb"}
{"doc_id": "2025__Contribution_and_legacy_a_qualitative_study_of_older_peoples_attitudes_about_sha__W4410898545", "source_path": "<redacted:source_path>", "chunk_id": 22, "source_chunk_idxs": [40], "num_tokens": 336, "text": "Contribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand\nDiscussion\nOlder patients based in the Counties Manukau district of New Zealand were mostly comfortable with their routinely collected health data being used for health research that would benefit their communities, now and in future. Our study demonstrated that older people were strongly supportive of their health data being continued to be used for research if they developed dementia (and were no longer able to consent) or after they had died. Participants felt that people's previous wishes should be taken into account when deciding whether to include them in research. They said that if people had been willing to help people throughout their lives, it should be assumed that they were also willing to help people even if they had developed dementia (unless they expressly disagreed) and this includes taking part in research. There was a common theme of wanting to give back to the health system for the care they received. The main reasons given were to be able to continue to contribute towards their communities, perhaps reflecting their life stage and experience with the health system.\nParticipants had strong expectations around the sharing of health data such as deidentification, transparency of processes, privacy and using data in an ethically responsible way. Most strongly supported sharing of deidentified data and collaborative research between health services and academic institutions, however many had a sense of distrust around sharing health data with private companies. A specific consequence that was feared by older adults in our study, was that sharing health data could lead to their driver's license being taken away, perhaps not surprising in this age group and in participants who are knowledgeable about dementia.", "doc_items_refs": ["#/texts/467", "#/texts/468"], "page_nos": [], "uuid": "29c912f5-6333-4195-88bd-14f45994e003"}
{"doc_id": "2025__Contribution_and_legacy_a_qualitative_study_of_older_peoples_attitudes_about_sha__W4410898545", "source_path": "<redacted:source_path>", "chunk_id": 23, "source_chunk_idxs": [41], "num_tokens": 476, "text": "Contribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand\nDiscussion\nTo our knowledge this is the first study to use qualitative research methods to explore older people's perceptions about sharing of health data. We asked specific questions that prompted people to think about the topics relating to dementia and use of data after death which revealed strong opinions about respecting people's prior wishes enabling them to continue to contribute to their communities. The responses are rooted in local cultural expectations and are thus an important resource for New Zealanders who may prefer that research is carried out in their own communities rather than depending on the results of research carried out in other populations. The responses reflect those of New Zealanders of mostly European ancestry, so cannot necessarily be generalised to other ethnicities within New Zealand, nor to people living elsewhere. However the attitudes of older patients in New Zealand around sharing routinely collected health data were similar to attitudes expressed by people living in other countries [\n11\n,\n14\n,\n16\n], as well as younger New Zealanders, in that participants were mostly positive about the use of their data for research, but opposed the idea of their data being shared with private companies, and feared potential discrimination on the basis of their health data [\n2\n,\n15\n,\n16\n].\nIn our study there was strong support for multi-institution sharing of data to facilitate new discoveries. This finding may have been influenced by the New Zealand experience of the COVID-19 pandemic, where people were very aware of how collaboration led to the discovery of vaccines as well as new variants of the virus. However, the COVID-19 pandemic also made people more aware of how their health data were used by governments to help control disease [\n2\n,\n13\n] by controlling the behaviour of the population. Attitudes have changed towards this aspect of disease control and may therefore be the reason for some participants' concerns about the potential impact on society. Participants in our study were also strongly supportive of their data being used for educational purposes and for young researchers to thrive, however some previous qualitative studies have reported participants being opposed to sharing their health data merely to benefit individual researchers or help advance their careers [\n15\n]. This finding may be reflective of the life stage of our participants especially as some mentioned that their children or grandchildren were researchers or students.", "doc_items_refs": ["#/texts/469", "#/texts/470", "#/texts/471", "#/texts/472", "#/texts/473", "#/texts/474", "#/texts/475", "#/texts/476", "#/texts/477", "#/texts/478", "#/texts/479", "#/texts/480", "#/texts/481", "#/texts/482", "#/texts/483", "#/texts/484", "#/texts/485", "#/texts/486", "#/texts/487", "#/texts/488"], "page_nos": [], "uuid": "0d8b000f-17b3-4569-aee8-7fbf34b7aa05"}
{"doc_id": "2025__Contribution_and_legacy_a_qualitative_study_of_older_peoples_attitudes_about_sha__W4410898545", "source_path": "<redacted:source_path>", "chunk_id": 24, "source_chunk_idxs": [42], "num_tokens": 284, "text": "Contribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand\nDiscussion\nSome participants in our study had the expectation that consent should be asked before using routinely collected data for research purposes, although mostly as a \"courtesy\" rather than an absolute prerequisite. Very few, if any, participants were aware that, alongside other consent procedures on admission to hospital, they also give consent for their data to be used in research and quality improvement projects to improve the health of the local population and local health services. Participants in other studies [\n15\n] recognized that the requirement of consent may lead to selection bias and low participation rates. The participants in our study may therefore simply need more information about the consent and research process. We have also identified a need to provide more information to patients about how their data might contribute to improvement of health services and population health outcomes, and to feedback to communities how their data has helped others.\nDespite the fact that the majority of our participants were of New Zealand European ethnicity, one of the prominent themes in our study was the consideration for other cultures, specifically Māori culture, and awareness of using data in a culturally respectful way. There was a comparable finding in a study of younger New Zealanders [\n2\n] where participants were concerned that if data were shared with international institutions, the overseas researchers may not have a sufficient understanding of Māori culture.", "doc_items_refs": ["#/texts/489", "#/texts/490", "#/texts/491", "#/texts/492", "#/texts/493", "#/texts/494"], "page_nos": [], "uuid": "eb34484a-ce19-4936-8f87-e46bffe4dec9"}
{"doc_id": "2025__Contribution_and_legacy_a_qualitative_study_of_older_peoples_attitudes_about_sha__W4410898545", "source_path": "<redacted:source_path>", "chunk_id": 25, "source_chunk_idxs": [43], "num_tokens": 285, "text": "Contribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand\nDiscussion\nOur study was limited by the high possibility of selection bias. Participants were recruited by asking people who took part in an online survey about whether they would be willing to take part in a one-to-one online interview conducted in English. Recruiting therefore happened from a cohort of people who can be expected to have a relatively high digital literacy. Moreover, interviews were conducted over Zoom, which excluded participants who did not have the hardware, software, or internet connection to participate in such a study. Participants may have found the presented case scenario and accompanying questions challenging to understand, despite the interviewer encouraging opportunities for clarification and discussion. The fact that the majority understood the scenario may corroborate the suggestion that this is a high health literacy sample. The interviews were conducted in English which may have excluded many older non-Europeans who were not comfortable being interviewed in English. In other qualitative research conducted in the same geographic area we found that 80% of Pacific and Asian participants preferred to be interviewed in their native language [\n20\n]. Most Māori participants expressed a preference for face-to-face interviews (which are being arranged as part of a future project). This demonstrates the need for more culturally responsive research into the views of other cultures on the sharing of health data.", "doc_items_refs": ["#/texts/495", "#/texts/496", "#/texts/497"], "page_nos": [], "uuid": "65187447-2bae-41df-8d12-9f41a13aeb7d"}
{"doc_id": "2025__Contribution_and_legacy_a_qualitative_study_of_older_peoples_attitudes_about_sha__W4410898545", "source_path": "<redacted:source_path>", "chunk_id": 26, "source_chunk_idxs": [44], "num_tokens": 452, "text": "Contribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand\nDiscussion\nAnother limitation was the case scenario itself. The case scenario was chosen to prompt older participants to discuss their thoughts on sharing routinely collected data. However, the case scenario may have overstated the potential benefits and underestimated the risks associated with data sharing; for example, the risk of re-identification was not specifically mentioned. The questions also did not differentiate between different types of data that participants may be willing to share (for example cognitive versus physical data) and did not capture the complexity of the debate surrounding the early detection and disclosure of dementia risk. These are all important issues as it is likely that, with over 50% of dementia currently unidentified [\n21\n], there is increasing enthusiasm to use routinely collected health data to \"case-find\" dementia. The ethical implications of using health data for dementia case-finding must be addressed [\n22\n]. The psychological harm of detecting dementia in a person who did not ask for the assessment might outweigh the benefit of identifying previously undiagnosed dementia [\n23\n]. People may not wish to know if they are at risk of a currently untreatable disease, but others may feel that earlier diagnosis gives a person time to plan for the future. These issues are complex, but the use of artificial intelligence with health data is accelerating fast, so it is important that patients and the public are involved in these discussions.\nOur participants reinforced the need for governance around data sharing. When routinely collected health data are shared with private companies, this should be done in an ethically responsible way. This becomes pertinent, both now and in future, with the development of Artificial Intelligence (AI). AI could have many potential benefits, especially for the elderly who could benefit from improvements in healthcare. However, it should be developed for the welfare of society, and ethical principles such as transparency, beneficence and privacy should therefore be embedded in its development [\n8\n,\n24\n]. This highlights the urgent need for consensus guidelines and legal frameworks to protect health data but also enable its use in a way that can eventually benefit the health system, patients, and society in general.", "doc_items_refs": ["#/texts/498", "#/texts/499", "#/texts/500", "#/texts/501", "#/texts/502", "#/texts/503", "#/texts/504", "#/texts/505", "#/texts/506", "#/texts/507", "#/texts/508", "#/texts/509"], "page_nos": [], "uuid": "64a9f92c-01bd-4ba2-a451-dfe2cf9decd0"}
{"doc_id": "2025__Contribution_and_legacy_a_qualitative_study_of_older_peoples_attitudes_about_sha__W4410898545", "source_path": "<redacted:source_path>", "chunk_id": 27, "source_chunk_idxs": [45, 46], "num_tokens": 231, "text": "Contribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand\nConclusion\nThe use of older people's routinely collected health data for health research may lead to potential benefits for this age group. Older people in our study were supportive of sharing their health data for research purposes provided that the research would benefit others, now and in the future. They expressed a desire to be included and to continue contributing to society as they get older and also after they have died. However, they expressed concerns about the consequences of sharing data, and they had strong expectations on how the data should be used in an ethical and responsible manner. The research highlights the obligation of researchers to handle data in a culturally respectful way and to use it to benefit communities while avoiding potential harms.\n\nContribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand\nData availability\nThe datasets generated and/or analysed during the current study are not publicly available due high risk of participants identification but are available from the corresponding author on reasonable request.", "doc_items_refs": ["#/texts/511", "#/texts/513"], "page_nos": [], "uuid": "e0e6a225-ad19-49ce-a8c0-e5016763c67c"}
{"doc_id": "2025__Contribution_and_legacy_a_qualitative_study_of_older_peoples_attitudes_about_sha__W4410898545", "source_path": "<redacted:source_path>", "chunk_id": 28, "source_chunk_idxs": [47], "num_tokens": 470, "text": "Contribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand\nReferences\n1. Daniels H, Hollinghurst J, Fry R, Clegg A, Hillcoat-Nallétamby S, Nikolova S, et al. The value of routinely collected data in evaluating home assessment and modification interventions to prevent falls in older people: systematic literature review. JMIR Aging. 2021;4(2):e24728.\nArticle\nGoogle Scholar\n2. Dobson R, Wihongi H, Whittaker R. Exploring patient perspectives on the secondary use of their personal health information: an interview study. BMC Med Inf Decis Mak. 2023;23(1):1-14.\nGoogle Scholar\n3. Jones KH, Laurie G, Stevens L, Dobbs C, Ford DV, Lea N. The other side of the coin: harm due to the non-use of health-related data. Int J Med Inf. 2017;97:43-51.\nArticle\nGoogle Scholar\n4. Kim TK, Choi M. Older adults' willingness to share their personal and health information when adopting healthcare technology and services. Int J Med Inf. 2019;126:86-94.\nArticle\nGoogle Scholar\n5. Jammeh EA, Camille BC, Stephen WP, Escudero J, Anastasiou A, Zhao P et al. Machine-learning based identification of undiagnosed dementia in primary care: a feasibility study. BJGP Open. 2018;2(2).\n6. Kumar S, Oh I, Schindler S, Lai AM, Payne PR, Gupta A. Machine learning for modeling the progression of alzheimer disease dementia using clinical data: a systematic literature review. JAMIA Open. 2021;4(3):ooab052.\nArticle\nGoogle Scholar\n7. Livingston G, Sommerlad A, Orgeta V, Costafreda SG, Huntley J, Ames D, et al. Dementia prevention, intervention, and care. Lancet. 2017;390(10113):2673-734.\nArticle\nGoogle Scholar\n8. World Health Organization. others. Ethics and governance of artificial intelligence for health: WHO guidance. 2021.", "doc_items_refs": ["#/texts/515", "#/texts/516", "#/texts/517", "#/texts/518", "#/texts/519", "#/texts/520", "#/texts/521", "#/texts/522"], "page_nos": [], "uuid": "1cab8d74-24c3-4325-bbdb-89e53aaf8a7f"}
{"doc_id": "2025__Contribution_and_legacy_a_qualitative_study_of_older_peoples_attitudes_about_sha__W4410898545", "source_path": "<redacted:source_path>", "chunk_id": 29, "source_chunk_idxs": [48], "num_tokens": 443, "text": "Contribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand\nReferences\n9. Beusink M, Koetsveld F, van Scheijen S, Janssen T, Buiter M, Schmidt MK, et al. Health research with data in a time of privacy: which information do patients want?? J Empir Res Hum Res Ethics. 2023;18(4):304-16.\nArticle\nGoogle Scholar\n10. Kirkham E, Lawrie S, Crompton C, Iveson M, Jenkins N, Goerdten J, et al. Experience of clinical services shapes attitudes to mental health data sharing: findings from a UK-wide survey. BMC Public Health. 2022;22(1):1-12.\nArticle\nGoogle Scholar\n11. Colombo C, Roberto A, Krleza-Jeric K, Parmelli E, Banzi R. Sharing individual participant data from clinical studies: a cross-sectional online survey among Italian patient and citizen groups. BMJ Open. 2019;9(2):e024863.\nArticle\nGoogle Scholar\n12. Dobson R, Whittaker R, Wihongi H, Andrew P, Armstrong D, Bartholomew K, et al. Patient perspectives on the use of health information. N Z Med J. 2021;134(1547):48-62.\nGoogle Scholar\n13. Jones LA, Nelder JR, Fryer JM, Alsop PH, Geary MR, Prince M, et al. Public opinion on sharing data from health services for clinical and research purposes without explicit consent: an anonymous online survey in the UK. BMJ Open. 2022;12(4):e057579.\nArticle\nGoogle Scholar\n14. McCormick N, Hamilton CB, Koehn CL, English K, Stordy A, Li LC. Canadians' views on the use of routinely collected data in health research: a patient-oriented cross-sectional survey. Can Med Assoc Open Access J. 2019;7(2):E203-9.\nGoogle Scholar", "doc_items_refs": ["#/texts/523", "#/texts/524", "#/texts/525", "#/texts/526", "#/texts/527", "#/texts/528"], "page_nos": [], "uuid": "2cd9de37-3742-4432-bfc3-4ed22f42ab86"}
{"doc_id": "2025__Contribution_and_legacy_a_qualitative_study_of_older_peoples_attitudes_about_sha__W4410898545", "source_path": "<redacted:source_path>", "chunk_id": 30, "source_chunk_idxs": [49], "num_tokens": 467, "text": "Contribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand\nReferences\n15. Aitken M, de Jorre S, Pagliari J, Jepson C, Cunningham-Burley R. Public responses to the sharing and linkage of health data for research purposes: a systematic review and thematic synthesis of qualitative studies. BMC Med Ethics. 2016;17:1-24.\nArticle\nGoogle Scholar\n16. Howe N, Giles E, Newbury-Birch D, McColl E. Systematic review of participants' attitudes towards data sharing: a thematic synthesis. J Health Serv Res Policy. 2018;23(2):123-33.\nArticle\nGoogle Scholar\n17. Gonzalez-Prieto C, Wilson D, Dobbie G, Rivera-Rodriguez C, Yates S, Rai-Bala R, et al. Exploring older peoples' attitudes and preferences around the use of their healthcare information. N Z Med J Online. 2023;136(1582):64-7.\nGoogle Scholar\n18. Radford A, Kim JW, Xu T, Brockman G, McLeavey C, Sutskever I. Robust speech recognition via large-scale weak supervision. In: International Conference on Machine Learning. PMLR; 2023. pp. 28492-518.\n19. Braun V, Clarke V. Using thematic analysis in psychology. Qual Res Psychol. 2006;3(2):77-101.\nArticle\nGoogle Scholar\n20. Martinez-Ruiz A, Yates S, Cheung G, Cullum S, Dudley M, Krishnamurthi R et al. Living with dementia in Aotearoa (LiDiA): A feasibility study for a dementia prevalence study in Māori and Non-Māori living in new Zealand. Dementia. 2023;14713012231173012.\n21. Lang L, Clifford A, Wei L, et al. Prevalence and determinants of undetected dementia in the community: a systematic literature review and a meta-analysis. BMJ Open. 2017;7:e011146.\nhttps://doi.org/10.1136/bmjopen-2016-011146\n.\nArticle\nGoogle Scholar", "doc_items_refs": ["#/texts/529", "#/texts/530", "#/texts/531", "#/texts/532", "#/texts/533", "#/texts/534", "#/texts/535"], "page_nos": [], "uuid": "14e46b59-8cdf-4178-8feb-ea8c2d53e5e8"}
{"doc_id": "2025__Contribution_and_legacy_a_qualitative_study_of_older_peoples_attitudes_about_sha__W4410898545", "source_path": "<redacted:source_path>", "chunk_id": 31, "source_chunk_idxs": [50, 51, 52], "num_tokens": 356, "text": "Contribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand\nReferences\n22. Ford E, Milne R, Curlewis K. Ethical issues when using digital biomarkers and artificial intelligence for the early detection of dementia. WIREs Data Min Knowl Discov. 2023;13:e1492.\nhttps://doi.org/10.1002/widm.1492\n.\nArticle\nGoogle Scholar\n23. Brayne C, Kelly S. Against the stream: early diagnosis of dementia, is it so desirable? BJPsych Bull. 2019;43:123-5.\nhttps://doi.org/10.1192/bjb.2018.107\n.\nArticle\nGoogle Scholar\n24. McLennan S, Fiske A, Tigard D, Müller R, Haddadin S, Buyx A. Embedded ethics: a proposal for integrating ethics into the development of medical AI. BMC Med Ethics. 2022;23(1):6.\nArticle\nGoogle Scholar\nDownload references\n\nContribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand\nAcknowledgements\nThe authors acknowledge the service users of Te Whatu Ora Counties Manukau memory service who participated in this study, in addition to Tara Sani and Reshmi Rai-Bala who supported the administration of the study.\n\nContribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand\nFunding\nHealth Research Council New Zealand through the Health Sector Research Collaboration Grant (Te Whatu Ora Counties Manukau) HRC#20/1182.", "doc_items_refs": ["#/texts/536", "#/texts/537", "#/texts/538", "#/texts/539", "#/texts/541", "#/texts/543"], "page_nos": [], "uuid": "3fc3c589-1d06-418e-8243-e164a8001ae6"}
{"doc_id": "2025__Contribution_and_legacy_a_qualitative_study_of_older_peoples_attitudes_about_sha__W4410898545", "source_path": "<redacted:source_path>", "chunk_id": 32, "source_chunk_idxs": [53], "num_tokens": 297, "text": "Contribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand\nAuthor information\nAuthors and Affiliations\n1. Department of Psychological Medicine, University of Auckland, Auckland, New Zealand Engelina Groenewald, Susan Yates &amp; Sarah Cullum\n2. Otago Medical School, University of Otago, Dunedin, New Zealand Jasmine Appleton\n3. Dementia Auckland, Auckland, New Zealand Jasmine Appleton &amp; Brendan Hallam\n4. School of Computer Science, University of Auckland, Auckland, New Zealand Cristian Gonzalez-Prieto, Daniel Wilson &amp; Gillian Dobbie\n5. School of Population Health, University of Auckland, Auckland, New Zealand Rosie Dobson\nAuthors\n1. Engelina Groenewald\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n2. Jasmine Appleton\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n3. Brendan Hallam\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n4. Cristian Gonzalez-Prieto\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n5. Susan Yates\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n6. Daniel Wilson\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n7. Gillian Dobbie\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n8. Rosie Dobson\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n9. Sarah Cullum\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/546", "#/texts/547", "#/texts/548", "#/texts/549", "#/texts/550", "#/texts/551", "#/texts/552", "#/texts/553", "#/texts/554", "#/texts/555", "#/texts/556", "#/texts/557", "#/texts/558", "#/texts/559", "#/texts/560"], "page_nos": [], "uuid": "445c07e5-cd07-42ae-8b8d-54b6ba47e27b"}
{"doc_id": "2025__Contribution_and_legacy_a_qualitative_study_of_older_peoples_attitudes_about_sha__W4410898545", "source_path": "<redacted:source_path>", "chunk_id": 33, "source_chunk_idxs": [54, 55, 56], "num_tokens": 366, "text": "Contribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand\nAuthor information\nContributions\nEG carried out the thematic analysis and wrote the first and subsequent drafts of the paper, JA interviewed the participants, BH carried out the second thematic analysis, CGP produced transcriptions and prepared the manuscript for submission, SY co-designed the study and supervised the interviews, DW and GD co-designed the study and supervised the transcription program, RD co-designed the study, SC co-designed the study, supervised the interviews and the thematic analysis. All authors participated in the review and writing of the manuscript and approved the publication.\n\nContribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand\nAuthor information\nCorresponding author\nCorrespondence to\nSarah Cullum\n.\n\nContribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand\nEthics declarations\nEthics approval and consent to participate\nEthical approval for this study was obtained from the Auckland Health Research Ethics Committee, reference number AH22266, on 18 October 2021. Due to COVID restrictions within Aotearoa New Zealand at that time, the Auckland Health Research Ethics Committee provided ethical approval for informed verbal consent by amendment approved on 14 September 2022. Verbal informed consent was recorded as part of the video call interview. Before the interviews, participants were provided with the study information sheet (via email or post), which outlined the study's objectives, potential risks, and information handling. During the video call interviews, the information sheet was further reviewed, and any questions were answered before verbal consent was obtained. All methods and procedures were carried out in accordance with relevant guidelines and regulations.", "doc_items_refs": ["#/texts/562", "#/texts/564", "#/texts/565", "#/texts/566", "#/texts/569"], "page_nos": [], "uuid": "e7f3424d-9afe-4477-af14-5865ca0719c0"}
{"doc_id": "2025__Contribution_and_legacy_a_qualitative_study_of_older_peoples_attitudes_about_sha__W4410898545", "source_path": "<redacted:source_path>", "chunk_id": 34, "source_chunk_idxs": [57, 58, 59, 60, 61, 62], "num_tokens": 456, "text": "Contribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand\nEthics declarations\nConsent for publication\nNot applicable.\n\nContribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand\nEthics declarations\nCompeting interests\nThe authors declare no competing interests.\n\nContribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand\nAdditional information\nPublisher's note\nSpringer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations.\n\nContribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand\nElectronic supplementary material\nBelow is the link to the electronic supplementary material.\n\nContribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand\nElectronic supplementary material\n12910_2025_1212_MOESM1_ESM.docx\nAdditional\\_file\\_1: Title of data: Individual Interview Scenario. Description of data: Topic guide for the semi-structured interview.\n\nContribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand\nRights and permissions\nOpen Access\nThis article is licensed under a Creative Commons Attribution 4.0 International License, which permits use, sharing, adaptation, distribution and reproduction in any medium or format, as long as you give appropriate credit to the original author(s) and the source, provide a link to the Creative Commons licence, and indicate if changes were made. The images or other third party material in this article are included in the article's Creative Commons licence, unless indicated otherwise in a credit line to the material. If material is not included in the article's Creative Commons licence and your intended use is not permitted by statutory regulation or exceeds the permitted use, you will need to obtain permission directly from the copyright holder. To view a copy of this licence, visit\nhttp://creativecommons.org/licenses/by/4.0/\n.\nReprints and permissions", "doc_items_refs": ["#/texts/571", "#/texts/573", "#/texts/576", "#/texts/578", "#/texts/580", "#/texts/582", "#/texts/583", "#/texts/584", "#/texts/585", "#/texts/586"], "page_nos": [], "uuid": "4cef6000-2303-45f9-aa92-f6bf126b8238"}
{"doc_id": "2025__Contribution_and_legacy_a_qualitative_study_of_older_peoples_attitudes_about_sha__W4410898545", "source_path": "<redacted:source_path>", "chunk_id": 35, "source_chunk_idxs": [63, 64, 65, 66], "num_tokens": 321, "text": "Contribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand\nAbout this article\nCite this article\nGroenewald, E., Appleton, J., Hallam, B.\net al.\nContribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand.\nBMC Med Ethics\n26\n, 70 (2025). https://doi.org/10.1186/s12910-025-01212-6\nDownload citation\n- Received : 27 November 2023\n- Accepted : 15 April 2025\n- Published : 30 May 2025\n- DOI : https://doi.org/10.1186/s12910-025-01212-6\n\nContribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand\nAbout this article\nKeywords\n- Ethics\n- Routinely collected health data\n- Health information\n- Data sharing\n- Consumer perspectives\nDownload PDF\nAdvertisement\n\nContribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand\nAbout this article\nKeywords\nBMC Medical Ethics\nISSN: 1472-6939\n\nContribution and legacy: a qualitative study of older people's attitudes about sharing their routinely collected health data for research purposes in New Zealand\nAbout this article\nKeywords\nContact us\n- General enquiries:\njournalsubmissions@springernature.com", "doc_items_refs": ["#/texts/589", "#/texts/590", "#/texts/591", "#/texts/592", "#/texts/593", "#/texts/594", "#/texts/595", "#/texts/596", "#/texts/597", "#/texts/598", "#/texts/599", "#/texts/601", "#/texts/602", "#/texts/603", "#/texts/604", "#/texts/605", "#/texts/606", "#/texts/607", "#/texts/609", "#/texts/611"], "page_nos": [], "uuid": "082ff820-4147-4ae5-b9dc-825bb7cf967f"}
