{"doc_id": "2025__Apraxic_deficits_predict_general_cognitive_impairment_in_patients_with_biomarker__W4414497753", "source_path": "<redacted:source_path>", "chunk_id": 0, "source_chunk_idxs": [0, 1, 2], "num_tokens": 378, "text": "ORIGINAL COMMUNICATION\n&lt;!-- image --&gt;\n\nApraxic deficits predict general cognitive impairment in patients with biomarker-verified Alzheimer's pathology\nClaudia C. Schmidt 1 · Michella M. Bardakan 1 · Elena Jaeger 2 · Nils Richter 1,3 · Gérard N. Bischof 2 · Kathrin Giehl 2,4 · Oezguer A. Onur 1,3 · Frank Jessen 5 · Gereon R. Fink 1,3 · Alexander Drzezga 2,4,6 · Peter H. Weiss 1,3\nReceived: 28 January 2025 / Revised: 8 September 2025 / Accepted: 14 September 2025 © The Author(s) 2025\n\nAbstract\nApraxia represents a core feature of Alzheimer's disease (AD), a neurodegenerative disorder characterised by the accumulation of β -amyloid plaques and tau deposition. However, systematic descriptions of apraxic deficits in AD patients remain scarce. Here, we comprehensively investigate apraxia profiles and their link with cognitive impairment in patients with biomarker-verified Alzheimer's pathology. We characterised the frequency and patterns of apraxic deficits in patients with biomarker-verified Alzheimer's pathology using a battery of standardised apraxia tests. Demographic variables and apraxia scores were related to patients' general cognitive impairment using hierarchical regression analysis. Apraxic deficits were found in 67% of patients with biomarker-verified Alzheimer's pathology ( n = 63). Patients with Alzheimer's pathology were more impaired in imitating finger gestures (than hand gestures: 89.2% vs. 80.0%, p\nKeywords Limb apraxia · Gesture imitation · Pantomime · Mini-Mental State Examination (MMSE) · Alzheimer's disease", "doc_items_refs": ["#/pictures/0", "#/texts/3", "#/texts/4", "#/texts/6", "#/texts/7"], "page_nos": [1], "uuid": "5e74ea7a-226a-4ac7-9e41-d3ae0c7fc7bc"}
{"doc_id": "2025__Apraxic_deficits_predict_general_cognitive_impairment_in_patients_with_biomarker__W4414497753", "source_path": "<redacted:source_path>", "chunk_id": 1, "source_chunk_idxs": [3], "num_tokens": 398, "text": "Introduction\n- B Claudia C. Schmidt c.schmidt@fz-juelich.de\n- 1 Cognitive Neuroscience, Institute of Neurosciences and Medicine (INM-3), Forschungszentrum Jülich, Jülich, Germany\n- 2 Department of Nuclear Medicine, Faculty of Medicine, University Hospital Cologne, University of Cologne, Cologne, Germany\n- 3 Department of Neurology, Faculty of Medicine, University Hospital Cologne, University of Cologne, Cologne, Germany\n- 4 Molecular Organisation of the Brain, Institute of Neurosciences and Medicine (INM-2), Forschungszentrum Jülich, Jülich, Germany\n- 5 Department of Psychiatry and Psychotherapy, Faculty of Medicine, University Hospital Cologne, University of Cologne, Cologne, Germany\n- 6 German Centre for Neurodegenerative Diseases (DZNE), Bonn-Cologne, Bonn, Germany\nAlzheimer's disease (AD) is a neurodegenerative disorder characterised by a progressive decline in cognitive functions, particularly episodic memory [1]. Importantly, current diagnostic criteria for AD mark the presence of atypical, nonamnestic neuropsychological symptoms [2]. Among these, apraxia represents a critical cognitive phenotype that warrants further investigation [3] since it impacts the activities of daily living: Apraxia impairs cognitive-motor functions, including gesture imitation, pantomiming object use, and actual object use, and cannot be (solely) attributed to basic motor deficits [4]. Apraxic deficits constitute a core feature of AD that increases in severity [5] as AD progresses. Likewise, the prevalence of apraxic deficits increases from around 30% in mild cases of AD to 90% in severe stages of the disease [3, 6].\nNotably, the presence of (limb) apraxia has been shown to distinguish between AD and frontotemporal dementia [7],", "doc_items_refs": ["#/texts/9", "#/texts/10", "#/texts/11", "#/texts/12", "#/texts/13", "#/texts/14", "#/texts/15", "#/texts/16", "#/texts/17"], "page_nos": [1], "uuid": "00638e1a-3779-4241-b56a-f2c6fb5f9de5"}
{"doc_id": "2025__Apraxic_deficits_predict_general_cognitive_impairment_in_patients_with_biomarker__W4414497753", "source_path": "<redacted:source_path>", "chunk_id": 2, "source_chunk_idxs": [4], "num_tokens": 344, "text": "Introduction\nsubcortical vascular dementia, and mild cognitive impairment (MCI) [8]. Already in the early stages of AD, apraxia supports the differential diagnosis of Alzheimer's dementia from other dementia subtypes, as AD patients present with distinctive clinical patterns of apraxic deficits [9-11]. In particular, patients with AD exhibited pronounced deficits in imitating hand and finger gestures, whereas patients with frontotemporal dementia showed specific impairments in imitating bucco-facial gestures [9, 10]. In patients with frontotemporal dementia, the AD apraxia profile (i.e. more severe deficits in limb apraxia compared to bucco-facial apraxia) was associated with cerebrospinal fluid (CSF)based biomarkers indicative of additional AD pathology [12].\nDespite the documented importance of apraxic deficits in AD, systematic investigations on the frequency and patterns of apraxic deficits in AD remain scarce, particularly in patients with biomarker-verified Alzheimer's pathology. According to the current diagnostic criteria of the National Institute on Aging and the Alzheimer's Association (NIADA) [2], the diagnosis of AD includes specific neuropathological markers, namely amyloidβ (A+) and (phosphorylated) tau (T+), which can be detected in the CSF or in the brain by positron emission tomography (PET) [13]. This biomarker-based definition of AD is considered crucial for reliably distinguishing between AD and other neurodegenerative diseases that can lead to dementia [14].", "doc_items_refs": ["#/texts/21", "#/texts/22"], "page_nos": [1], "uuid": "ed48d179-6b47-45b8-8b74-6ef91b17d37b"}
{"doc_id": "2025__Apraxic_deficits_predict_general_cognitive_impairment_in_patients_with_biomarker__W4414497753", "source_path": "<redacted:source_path>", "chunk_id": 3, "source_chunk_idxs": [5], "num_tokens": 400, "text": "Introduction\nIn the present study, we comprehensively characterised apraxia in a well-defined sample of patients with Alzheimer's pathology confirmed by CSF- or PET-derived biomarkers (i.e. amyloidβ (A+) and tau (T+)). To this end, we investigated the frequency and severity of apraxic deficits and their relationship to the patient's cognitive status. Moreover, we probed the presence of differential patterns of praxis deficits (i.e. apraxia profiles) in the patients with Alzheimer's pathology, while controlling for general cognitive deficits. Building on previous studies showing more pronounced deficits in imitating limb gestures than facial gestures in AD patients [9], we further explored putative differential impairments in imitating hand versus finger gestures in patients with biomarker-verified Alzheimer's pathology. Neuropsychological studies in stroke patients have shown that patients with unilateral right hemisphere damage were impaired specifically in the imitation of finger gestures (compared to healthy control subjects). In contrast, patients with unilateral left hemisphere strokes had similar deficits in imitating finger gestures as patients with right hemisphere strokes, but suffered from additional deficits in imitating hand gestures [15]. Since AD pathology typically occurs bilaterally, we hypothesised that the patients with Alzheimer's pathology would be more impaired in imitating finger gestures than hand gestures. We also hypothesised that patients with Alzheimer's pathology would perform worse in\nimitating complex movements compared to single gestures. Besides, we tested whether the effect of movement complexity is modulated by the effector performing the movements (i.e. hand vs. finger). Finally, by investigating whether apraxic deficits predict general cognitive impairment, this study provided insights into the potential predictive value of praxis performance (or deficits thereof) for cognitive functioning in patients with biomarker-verified Alzheimer's pathology.", "doc_items_refs": ["#/texts/23", "#/texts/27"], "page_nos": [1], "uuid": "2d89eeea-8ae2-422f-97ff-0afefc5eee17"}
{"doc_id": "2025__Apraxic_deficits_predict_general_cognitive_impairment_in_patients_with_biomarker__W4414497753", "source_path": "<redacted:source_path>", "chunk_id": 4, "source_chunk_idxs": [6], "num_tokens": 230, "text": "Patient sample\nOne hundred twenty-three patients with clinically suspected AD were recruited from the Centre for Memory Disorders (ZfG; 'Zentrum für Gedächtnisstörungen') of the departments of Neurology and Psychiatry at the University Hospital Cologne. Patients were included in the study if they were at least 50 years old, met the NIA-AA criteria for the diagnosis of Alzheimer's clinical syndrome [2, 16], and had biomarker-confirmed amyloid and tau pathology based on CSF and/or PET imaging according to current diagnostic guidelines [14]. Patients were excluded if they (i) were clinically diagnosed with dementia other than of the Alzheimer's disease type, (ii) suffered from other conditions potentially responsible for cognitive decline or motor deficits (e.g. cerebrovascular disorders, Parkinson's disease, multiple sclerosis), (iii) showed visual or auditory deficits interfering with neuropsychological testing, or (iv) were unable to give informed consent.\nAll patients provided written informed consent before the study. The local ethics committee approved the study.", "doc_items_refs": ["#/texts/30", "#/texts/31"], "page_nos": [1], "uuid": "7f2f09a4-7335-4e1d-8267-516a7be14e2c"}
{"doc_id": "2025__Apraxic_deficits_predict_general_cognitive_impairment_in_patients_with_biomarker__W4414497753", "source_path": "<redacted:source_path>", "chunk_id": 5, "source_chunk_idxs": [7], "num_tokens": 338, "text": "Determination of CSF and PET biomarker status\nPatients' CSF was analysed for AD biomarkers, i.e. pathologically decreased CSF β-amyloid 42 [A β$\\_{42}$] levels or decreased A β$\\_{42}$/A β$\\_{40}$ ratio [A+] and pathologically increased CSF phosphorylated tau levels [T+] [14]. CSF concentrations of β-amyloid 42 levels [A β$\\_{42}$], β-amyloid 40 levels [A β$\\_{40}$], and phosphorylated tau [p-tau] were quantified using the ELISA assay (Euroimmun) or Elecsys assay (Roche). The following thresholds were used to determine positivity on A β$\\_{42}$ or A β$\\_{42}$/A β$\\_{40}$ ratio, and p-tau levels: Euroimmun : A β$\\_{42}$\nPatients' PET scans were rated for cerebral AD pathology, i.e. as amyloid- or tau-positive. Amyloid or tau PET imaging was performed using the following tracers: amyloid\nPET : [$^{18}$F]Florbetaben or [$^{11}$C]PiB; tau PET : [$^{18}$F]PI-2620 or [$^{18}$F]AV-1451.", "doc_items_refs": ["#/texts/33", "#/texts/34", "#/texts/38"], "page_nos": [1], "uuid": "ceaca65a-b59e-4298-9e0a-081fefaa899c"}
{"doc_id": "2025__Apraxic_deficits_predict_general_cognitive_impairment_in_patients_with_biomarker__W4414497753", "source_path": "<redacted:source_path>", "chunk_id": 6, "source_chunk_idxs": [8], "num_tokens": 304, "text": "Clinical and apraxia assessment\nAll patients underwent a detailed clinical work-up at the outpatient memory clinic of the University Hospital Cologne (i.e. Centre for Memory Disorders (ZfG; 'Zentrum für Gedächtnisstörungen')). The diagnosis of AD with MCI or dementia was based on a comprehensive neurological examination, including medical history, cerebral imaging, and blood tests. The latter were also used to rule out reversible causes of dementia. In addition, all patients underwent a thorough neuropsychological assessment by a neurologist, psychiatrist, or psychologist experienced in the diagnosis and treatment of neurodegenerative diseases.\nThe patients' overall cognitive status was assessed using the German version of the Mini-Mental State Examination (MMSE) [17] that evaluates impairments in general cognitive functions, including orientation, attention, working memory, language, and delayed recall [18].\nAs apraxia represents a multi-componental syndrome comprising different impaired motor-cognitive processes [19], patients' praxis functions were assessed using the following established apraxia tests: the Cologne Apraxia Screening (Kölner Apraxie Screening, KAS) [20], the Dementia Apraxia Test (DATE) [10], the imitation tests by Goldenberg [15], a modified version of the De Renzi test for imitation [21], and a modified version of the De Renzi test for actual object use [22].", "doc_items_refs": ["#/texts/40", "#/texts/41", "#/texts/42"], "page_nos": [1], "uuid": "83840982-1f46-4465-8eb5-1011c74258ca"}
{"doc_id": "2025__Apraxic_deficits_predict_general_cognitive_impairment_in_patients_with_biomarker__W4414497753", "source_path": "<redacted:source_path>", "chunk_id": 7, "source_chunk_idxs": [9], "num_tokens": 448, "text": "Clinical and apraxia assessment\nThe KAS is a standardised, validated diagnostic instrument initially designed to screen for apraxia in stroke patients [20]. It has also been effectively used to diagnose apraxia in mild dementia [23]. It comprises two subtests to assess pantomime of object use and two subtests to assess gesture imitation. In the pantomime subtests, patients are shown photographs of everyday objects and asked to demonstrate their typical use involving bucco-facial movements (5 items; e.g. pantomiming the use of a toothbrush) and arm/ hand movements only (5 items; e.g. pantomiming the use of scissors). In the imitation subtests, patients are presented with photographs showing a woman performing five buccofacial gestures (e.g. sticking out her tongue) and five arm/ hand gestures (e.g. making the stop sign with her hand) and asked to reproduce these gestures. The maximum total KAS score is 80 points (40 points for the pantomime test and 40 points for the imitation test); a score of 76 points or less indicates apraxia [20].\nThe DATE is a validated clinical screening instrument for praxis impairments in neurodegenerative diseases [10]. It consists of five subtests, two assessing limb apraxia and three assessing bucco-facial apraxia. For limb apraxia, the imitation of hand and finger postures (8 items) and\npantomiming of object use (2 items) are tested. For buccofacial apraxia, the subtests assess imitation of facial postures (6 items), production of emblematic bucco-facial postures upon verbal command (2 items; e.g. \"show me how you clear your throat\"), and repetition of pseudowords to test for apraxic speech (2 items). The maximum total DATE score is 60 points (30 points for limb apraxia and 30 points for bucco-facial apraxia); a score below 46 points suggests apraxia [10].", "doc_items_refs": ["#/texts/43", "#/texts/44", "#/texts/45"], "page_nos": [1], "uuid": "9fb3d8ad-68f4-473d-b3a9-af1850ef5025"}
{"doc_id": "2025__Apraxic_deficits_predict_general_cognitive_impairment_in_patients_with_biomarker__W4414497753", "source_path": "<redacted:source_path>", "chunk_id": 8, "source_chunk_idxs": [10], "num_tokens": 236, "text": "Clinical and apraxia assessment\nThe Goldenberg imitation tests assess the imitation of hand positions (10 items) and finger configurations (10 items) demonstrated by the examiner. Each imitation test has a maximum score of 20 points, with a score below 18 points in the hand imitation test and below 17 points in the finger imitation test marking apraxic imitation deficits [15].\nThe De Renzi test for imitation comprises four subtests assessing the imitation of single (static) hand postures (6 items) and finger configurations (6 items), as well as complex sequences of hand (6 items) and finger movements (6 items). The maximum test score is 72 points (18 points for each subtest), with a score below 53 points indicating apraxia [21].\nThe De Renzi test for actual object use assesses the use of single objects (5 items) and tool-object pairs (2 items), with scores below 30 points (out of a maximum of 32 points) revealing apraxia [22].\nRaw scores of the apraxia tests were converted into percentages of the maximum score to account for the different score ranges.", "doc_items_refs": ["#/texts/46", "#/texts/47", "#/texts/48", "#/texts/49"], "page_nos": [1], "uuid": "30af2fe8-19be-48ac-953d-f18fc5b6857a"}
{"doc_id": "2025__Apraxic_deficits_predict_general_cognitive_impairment_in_patients_with_biomarker__W4414497753", "source_path": "<redacted:source_path>", "chunk_id": 9, "source_chunk_idxs": [11], "num_tokens": 316, "text": "Statistical analysis\nWe performed statistical analyses using IBM SPSS Statistics (Statistical Package for the Social Sciences, version 28). For each patient, we calculated an overall apraxia severity index based on the number of impaired apraxia tests, which categorised patients into groups with no apraxia (0 tests impaired), mild apraxia (1-2 tests impaired), moderate apraxia (3-4 tests impaired), or severe apraxia (5-6 tests impaired). Nonparametric Spearman correlation analyses examined the relationship between the severity of apraxia and demographic factors (age, years of education) and cognitive impairment (indexed by the MMSE score).\nTo test for a difference in imitating hand and finger gestures independent of the patients' general cognitive status, we analysed the mean imitation performance (in %) in the Goldenberg imitation tests in a mixed model analysis of covariance (ANCOVA) with effector (hand and finger) as within-subject factor and the MMSE scores as a covariate to control for general cognitive impairment. Besides, we explored putative differences in imitating single versus complex hand and finger movements (in %) in the De Renzi imitation test using an ANCOVA with effector (hand and finger)\nand complexity (single and complex) as within-subject factors. We included the patients' MMSE score as a covariate to control for general cognitive impairment. A significant interaction was assessed post hoc by simple main effects controlling for general cognitive impairment.", "doc_items_refs": ["#/texts/51", "#/texts/52", "#/texts/58"], "page_nos": [1], "uuid": "e8d55ed4-81eb-4b55-9288-f6417c6390d7"}
{"doc_id": "2025__Apraxic_deficits_predict_general_cognitive_impairment_in_patients_with_biomarker__W4414497753", "source_path": "<redacted:source_path>", "chunk_id": 10, "source_chunk_idxs": [12], "num_tokens": 306, "text": "Statistical analysis\nTo investigate whether demographic factors (i.e. age or years of education) or praxis performance can explain variance in cognitive impairment in patients with Alzheimer's pathology, we computed a hierarchical linear regression analysis. This analysis defined two models with the MMSE score as the dependent variable. The first-level model included age and years of education as predictive variables. In the second-level model, we added simultaneously the scores (in %) in the two KAS subtests of pantomiming object use and imitating gestures, the two DATE subtests for limb and bucco-facial apraxia, the difference score between the imitation of hand positions and finger configurations in the Goldenberg imitation tests, and an interaction score for the differential performance in imitating single versus complex hand and finger gestures in the De Renzi imitation test to the regression model. We did not include the De Renzi test for actual object use in the regression analysis as it was the least sensitive apraxia test in our cohort of patients with Alzheimer's pathology. We estimated the two models' fit by calculating the Akaika Information Criterion (AIC), a goodness of fit measure that corrects for model complexity by penalising increasing numbers of predictors [24]. We used the AICs to compare both levels of the regression model and to verify that a larger number of predictors did not merely drive the increase in predictive power of the second-level model.\nWe set a significance level of p", "doc_items_refs": ["#/texts/59", "#/texts/60"], "page_nos": [1], "uuid": "f89daf59-ce00-4351-895e-0a16da141d7e"}
{"doc_id": "2025__Apraxic_deficits_predict_general_cognitive_impairment_in_patients_with_biomarker__W4414497753", "source_path": "<redacted:source_path>", "chunk_id": 11, "source_chunk_idxs": [13], "num_tokens": 411, "text": "Patient sample characteristics\nThe current study included 63 patients (29 women) with biomarker-confirmed Alzheimer's pathology based on at least one of the two diagnostic modalities, CSF or PET imaging, i.e. abnormal amyloid-β (A+) and tau protein levels (T+) [14]. Alzheimer's pathology (A+/T+) was confirmed in 28 patients by CSF, in 20 patients by CSF and tau PET, and in 10 patients by (amyloid and tau) PET. In the remaining patients, Alzheimer's pathology was confirmed by variable combinations of CSF and PET imaging. Please refer to the Suppl. Table for an overview of amyloid and tau abnormalities for each patient included in the study. The group of patients had a mean age of 70.1 years (standard deviation [SD] = 9.9, range 50-87) and a mean education level of 14.7 years (SD = 3.4, range 8-21).\nBased on the NIA-AA criteria [2, 16], 40 patients (63%) were clinically diagnosed with mild cognitive impairment (MCI), 22 patients (35%) with mild dementia, and one patient with moderate dementia. All patients showed impairments in episodic memory, i.e. suffered from an amnestic variant of AD. All patients with dementia and 28 of the patients with MCI were impaired in at least one other cognitive domain besides episodic memory. In the remaining 12 MCI patients, impairment of episodic memory predominated (see Suppl. Table for an overview of the clinical diagnosis in the patients with Alzheimer's pathology).\nThe mean MMSE score of the patient group was 22.5 points (SD = 5.4, range 10-30). Note that 29% of the patients ( n = 18) had a normal MMSE score ( ≥ 27/30 points) despite positive AD biomarkers.", "doc_items_refs": ["#/texts/63", "#/texts/65", "#/texts/66"], "page_nos": [1], "uuid": "ce80d633-6992-4ee4-ad23-85b85dc33b9f"}
{"doc_id": "2025__Apraxic_deficits_predict_general_cognitive_impairment_in_patients_with_biomarker__W4414497753", "source_path": "<redacted:source_path>", "chunk_id": 12, "source_chunk_idxs": [14], "num_tokens": 265, "text": "Frequency and severity of apraxic deficits\nIn the current sample of patients with biomarker-verified Alzheimer's pathology, 67% ( n = 42/63) were apraxic in at least one apraxia test (see Table 1 for an overview of the patients' performance on the different apraxia tests). Of those, 48% ( n = 20) had mild apraxia, 21% ( n = 9) had moderate apraxia, and 31% ( n = 13) suffered from severe apraxia. The KAS and DATE were the most sensitive tests for detecting apraxia in 59% ( n = 37) and 37% ( n = 23) of the patients with Alzheimer's pathology, respectively. In contrast, the De Renzi test for actual object use showed the lowest sensitivity, detecting apraxic deficits in only 6% ( n = 4) of the patients.\nAs the KAS was initially developed to assess apraxic deficits in left hemisphere stroke patients [20], we evaluated its relationship to the DATE, a validated test for the diagnosis of apraxia in various forms of dementia [10]. The KAS total score showed a strong positive correlation with the DATE total score ( ρ = 0.718, p", "doc_items_refs": ["#/texts/68", "#/texts/69"], "page_nos": [1], "uuid": "ae5d83d6-f087-4f80-a901-9ae16151597c"}
{"doc_id": "2025__Apraxic_deficits_predict_general_cognitive_impairment_in_patients_with_biomarker__W4414497753", "source_path": "<redacted:source_path>", "chunk_id": 13, "source_chunk_idxs": [15], "num_tokens": 469, "text": "Relationship between apraxia and general cognitive impairment\nThe severity of apraxia (indexed by the number of impaired apraxia tests) correlated significantly with the severity of cognitive impairment (assessed by the MMSE) in the\nTable 1 Praxis assessments in patients with biomarker-verified Alzheimer's pathology ( n = 63)\n\n| Apraxia test                          | Praxis performance (in %)   | Cut-off scores   | Number of patients impaired   |\n|---------------------------------------|-----------------------------|------------------|-------------------------------|\n| KAS (total score)                     | 88.6 ± 14.7 (25-100)        | ≤ 95%            | 37                            |\n| DATE (total score) #                  | 76.8 ± 19.1 (15.8-100)      | ≤ 75%            | 23                            |\n| Goldenberg finger imitation test      | 80.0 ± 22.4 (0-100)         | < 85%<fcel>      |                               |\n| Goldenberg hand imitation test        | 89.2 ± 14.7 (20-100)        | < 90%<fcel>      |                               |\n| De Renzi test for imitation #         | 81.6 ± 16.9 (8.3-100)       | < 72.2%<fcel>    |                               |\n| De Renzi test for actual object use # | 97.4 ± 9.3 (31.3-100)       | ≤ 94%            | 4                             |\nThe mean ± standard deviation and range (in parentheses) are given. All apraxia scores were converted into percentages of the maximum score for comparability\n$^{#}$n = 62\nDATE Dementia Apraxia Test; KAS Kölner (Cologne) Apraxia Screening\npatients with Alzheimer's pathology ( ρ = -0.59, p", "doc_items_refs": ["#/texts/71", "#/texts/75", "#/tables/0", "#/texts/76", "#/texts/77", "#/texts/78", "#/texts/79"], "page_nos": [1], "uuid": "63e69299-b9e2-4673-9ded-653d79144736"}
{"doc_id": "2025__Apraxic_deficits_predict_general_cognitive_impairment_in_patients_with_biomarker__W4414497753", "source_path": "<redacted:source_path>", "chunk_id": 14, "source_chunk_idxs": [16, 17], "num_tokens": 420, "text": "Relationship between apraxia and general cognitive impairment\nNotably, there were no significant correlations between apraxia severity and age ( ρ = 0.07, p = 0.590) or years of education ( ρ = 0.04, p = 0.751) in the current sample of patients with Alzheimer's pathology.\n\nApraxia profiles (controlled for general cognitive impairment)\nThe ANCOVA testing for a difference in performance in imitating hand and finger gestures revealed a significant main effect of effector , even after controlling for general cognitive\nFigure caption: Fig. 1 Differential patterns of apraxic imitation deficits in patients with biomarker-verified Alzheimer's pathology. a Patients with Alzheimer's pathology ( n = 63) showed significantly worse performance in imitating finger configurations compared to hand postures in the imitation tests by Goldenberg, even after controlling for general cognitive impairment (assessed by the MMSE). b Patients with\nimpairment ( F$\\_{(1,61)}$ = 40.49, p\nThe ANCOVA that tested for a difference in the imitation of single versus complex hand and finger gestures in De Renzi's imitation test (while controlling for general cognitive impairment) showed a significant main effect of complexity ( F$\\_{(1,60)}$ = 13.27, p\nFigure caption: Goldenberg's imitation tests\nAlzheimer's pathology ( n = 62) imitated complex hand movements worse than single hand movements, while there was no significant difference in imitating single and complex finger gestures in the De Renzi imitation test after controlling for general cognitive impairment (assessed by the MMSE). MMSE Mini-Mental State Examination. Error bars indicate the standard error of the mean (S.E.M.)\nno significant difference in imitating single and complex finger gestures ( F$\\_{(1,60)}$ = 0.24, p = 0.625; 82.4% vs. 72.2%; Fig. 1b) after controlling for general cognitive impairment.", "doc_items_refs": ["#/texts/80", "#/texts/82", "#/pictures/1", "#/texts/84", "#/texts/85", "#/pictures/2", "#/texts/87", "#/texts/93"], "page_nos": [1], "uuid": "3b8e6956-9682-42e2-aa5f-4cf2aaa0cd23"}
{"doc_id": "2025__Apraxic_deficits_predict_general_cognitive_impairment_in_patients_with_biomarker__W4414497753", "source_path": "<redacted:source_path>", "chunk_id": 15, "source_chunk_idxs": [18], "num_tokens": 135, "text": "Predicting general cognitive impairment by apraxic deficits\nThe hierarchical regression analysis revealed that a model including age and years of education did not explain the variance in general cognitive impairment among patients with Alzheimer's pathology (adjusted R$^{2}$ = 0.02, F$\\_{(2,59)}$ = 0.51, p = 0.606). The predictive value of the model improved significantly when scores of the apraxia assessments were added to age and educational years (adjusted R$^{2}$ = 0.59, F$\\_{(8,53)}$ = 12.13, p", "doc_items_refs": ["#/texts/95"], "page_nos": [1], "uuid": "324c6c39-7cd2-4ac7-9d7b-1492f6e7f7b0"}
{"doc_id": "2025__Apraxic_deficits_predict_general_cognitive_impairment_in_patients_with_biomarker__W4414497753", "source_path": "<redacted:source_path>", "chunk_id": 16, "source_chunk_idxs": [19], "num_tokens": 394, "text": "Discussion\nThis study investigated the frequency and patterns of apraxic deficits and their association with cognitive impairment in 63 patients with biomarker-verified Alzheimer's pathology, i.e. patients with abnormal amyloid-β and tau protein levels (A+/T+) in the CSF or PET imaging. Considering diverse praxis functions, our study revealed a high prevalence of apraxia: 67% of the patients showed apraxic deficits in at least one apraxia test, and about half of the patients even suffered from moderate to severe apraxia. This finding suggests that apraxia is common already in the mild (to moderate) stages of AD, as most of the current patients presented with MCI or mild dementia. In line with previous reports [25], apraxia severity was related to the severity of general cognitive impairment.\nAs hypothesised, patients with Alzheimer's pathology showed greater impairment in imitating finger configurations compared to hand positions, independent of general cognitive deficits. This finding is consistent with previous neuropsychological studies in stroke patients with apraxia, reporting dissociations between the imitation of hand and\nfinger gestures [26, 27], suggesting different underlying cognitive processes. It has been proposed that imitating hand gestures primarily relies on the processing of spatial relationships between different body parts. In contrast, imitating finger gestures puts higher demands on visuo-spatial control for perceptual discrimination between relatively uniform elements of the body (i.e. fingers) [19, 28]. In line with this, deficits in imitating finger gestures were associated with visuo-constructive deficits in a previous study of patients with dementia [29]. Moreover, poorer performance when imitating finger configurations (compared to hand positions) has often been found in patients with right hemisphere stroke [30], probably due to deficits in visuo-spatial processing [31-33].", "doc_items_refs": ["#/texts/97", "#/texts/98", "#/texts/100"], "page_nos": [1], "uuid": "1d862da2-e872-4995-a381-ac4bb1e9b762"}
{"doc_id": "2025__Apraxic_deficits_predict_general_cognitive_impairment_in_patients_with_biomarker__W4414497753", "source_path": "<redacted:source_path>", "chunk_id": 17, "source_chunk_idxs": [20], "num_tokens": 413, "text": "Discussion\nOur study also revealed that the effector performing the gesture (i.e. hand vs. finger) modulated the effect of movement complexity (i.e. worse performance in imitating complex movements compared to single gestures): patients with Alzheimer's pathology were more impaired in imitating complex compared to single hand movements. In contrast, the difference in imitation performance between complex and single finger movements was less pronounced and no longer statistically significant when controlling for general cognitive impairment. Thus, complex hand movements (as opposed to single hand movements) showed enhanced sensitivity in detecting imitation deficits in patients with Alzheimer's pathology. The results complement previous studies, which showed marked difficulties in imitating spatially complex (bimanual) or sequential movements in patients with AD [29, 34].\nFinally, our study showed that praxis performance, but not age or years of education, predicted general cognitive impairment in patients with biomarker-verified Alzheimer's pathology. A regression model with age and educational years explained only 2% of the variance in general cognitive deficits. Adding apraxia scores improved the model to about 60% explained variance, which represented a statistically significant increase in predictive power. The finding that performance in the KAS subtest of pantomiming object use and the DATE subtest for limb apraxia (involving imitation of hand and finger gestures and pantomime of object use) were independent predictors of general cognitive functioning supports and extends the relevance of limb apraxia as a marker of cognitive impairment in patients with Alzheimer's pathology, as implicated by several previous studies in patients with mild-to-moderate AD [10, 11, 35]. It further demonstrates that deficits in pantomiming object use are a significant predictor of general cognitive impairment. It has been proposed that several cognitive mechanisms underlie the pantomime of object use, including semantic knowledge about tool function, sensorimotor knowledge about tool manipulation, and mechanical knowledge for technical reasoning about object use [36]. Both semantic knowledge", "doc_items_refs": ["#/texts/101", "#/texts/102"], "page_nos": [1], "uuid": "ee7832d7-62f4-4923-958f-b324b5a63c80"}
{"doc_id": "2025__Apraxic_deficits_predict_general_cognitive_impairment_in_patients_with_biomarker__W4414497753", "source_path": "<redacted:source_path>", "chunk_id": 18, "source_chunk_idxs": [21], "num_tokens": 319, "text": "Discussion\nand manipulation knowledge appear to be impaired even in mild stages of AD [3], likely reflecting their dependence on temporal and parietal lobe structures, which are affected by neurodegeneration early in the course of AD [37, 38]. Consistent with this, grey matter atrophy in the middle temporal gyrus and angular gyrus has been found to be associated with deficits in pantomiming object use in the early stages of AD [23]. Moreover, tau aggregation in temporal, parietal, and occipital regions has recently been associated with apraxic deficits in patients with biomarker-confirmed diagnosis of AD [39]. Accordingly, our data suggest that impaired praxis performance may serve not only as a predictor of general cognitive impairment but also as an (early) behavioural marker of Alzheimer's pathology.\nIn conclusion, the present study established that in patients with biomarker-verified Alzheimer's pathology apraxic deficits are common even at mild (to moderate) disease stages and show distinct patterns in different praxis domains. The apraxic deficits explained variance in the patients' general cognitive impairment, emphasising the relevance of apraxia in AD. Our results warrant further investigation into the role of apraxia as a potential behavioural marker of Alzheimer's pathology at early stages of AD.\nSupplementary Information The online version contains supplementary material available at https://doi.org/10.1007/s00415-025-13401-9.", "doc_items_refs": ["#/texts/105", "#/texts/106", "#/texts/107"], "page_nos": [1], "uuid": "0bb5bd39-ab32-4504-b2be-2e034e718c20"}
{"doc_id": "2025__Apraxic_deficits_predict_general_cognitive_impairment_in_patients_with_biomarker__W4414497753", "source_path": "<redacted:source_path>", "chunk_id": 19, "source_chunk_idxs": [22], "num_tokens": 366, "text": "Discussion\nAuthor contributions Conceptualisation was performed by Claudia C. Schmidt, Alexander Drzgega, Peter H. Weiss; methodology by Claudia C. Schmidt; formal analysis and investigation by Claudia C. Schmidt, Elena Jaeger, Nils Richter, Geuez A. Onur, Frank Jessen; writingoriginal draft preparation by Claudia C. Schmidt, Michella M. Bardakan; writing-review and editing by Elena Jaeger, Nils Richter, Gérard N. Bischof, Kathrin Giehl, Oezguer A. Onur, Frank Jessen, Gereon R. Fink, Alexander Drzgeza, Peter H. Weiss; funding acquisition by Oezguer A. Onur, Gereon R. Fink, Alexander Drzgeza, Peter H. Weiss; resources by Gereon R. Fink, Peter H. Weiss; supervision by Alexander Drzgeza, Peter H. Weiss; project administration by Gereon R. Fink, Alexander Drzgeza, Peter H. Weiss.\nFunding Open Access funding enabled and organized by Projekt DEAL. This study was funded by the Deutsche Forschungsgemeinschaft (DFG, German Research Foundation) - SFB 1451 - Project-ID 431549029. GRF and OAO gratefully acknowledge additional support from the Marga and Walter Boll-Stiftung. Open access publication funded by the Deutsche Forschungsgemeinschaft (DFG, German Research Foundation) - 491111487.\nData availability The data supporting this study's findings are not publicly available due to the ethical consensus on data protection approved by the local ethics committee and signed by the patients. The authors may provide the data upon reasonable request.", "doc_items_refs": ["#/texts/108", "#/texts/109", "#/texts/110"], "page_nos": [1], "uuid": "5cdb2174-df3b-4865-bf70-9bee78ca35b8"}
{"doc_id": "2025__Apraxic_deficits_predict_general_cognitive_impairment_in_patients_with_biomarker__W4414497753", "source_path": "<redacted:source_path>", "chunk_id": 20, "source_chunk_idxs": [23], "num_tokens": 231, "text": "Declarations\nConflicts of interest The authors have no relevant financial or nonfinancial interests to disclose.\nEthical approval This study was performed following the Declaration of Helsinki. The Ethics Committee of the University of Cologne approved the study.\nConsent to participate Informed consent was obtained from all individual participants included in the study.\nOpen Access This article is licensed under a Creative Commons Attribution 4.0 International License, which permits use, sharing, adaptation, distribution and reproduction in any medium or format, as long as you give appropriate credit to the original author(s) and the source, provide a link to the Creative Commons licence, and indicate if changes were made. The images or other third party material in this article are included in the article's Creative Commons licence, unless indicated otherwise in a credit line to the material. If material is not included in the article's Creative Commons licence and your intended use is not permitted by statutory regulation or exceeds the permitted use, you will need to obtain permission directly from the copyright holder. To view a copy of this licence, visit http://creativecommons.org/licenses/by/4.0/.", "doc_items_refs": ["#/texts/112", "#/texts/115", "#/texts/116", "#/texts/117"], "page_nos": [1], "uuid": "2e5352fd-b117-4de2-94c7-bbd4c49e650f"}
{"doc_id": "2025__Apraxic_deficits_predict_general_cognitive_impairment_in_patients_with_biomarker__W4414497753", "source_path": "<redacted:source_path>", "chunk_id": 21, "source_chunk_idxs": [24], "num_tokens": 508, "text": "References\n- 1. Ballard C, Gauthier S, Corbett A, Brayne C, Aarsland D, Jones E (2011) Alzheimer's disease. Lancet 377:1019-1031. https://doi. org/10.1016/S0140-6736(10)61349-9\n- 2. McKhann GM, Knopman DS, Chertkow H et al (2011) The diagnosis of dementia due to Alzheimer's disease: recommendations from the National Institute on Aging-Alzheimer's Association workgroups on diagnostic guidelines for Alzheimer's disease. Alzheimers Dement 7:263-269. https://doi.org/10.1016/j.jalz. 2011.03.005\n- 3. McKhann GM, Knopman DS, Chertkow H et al (2011) The diagnosis of dementia due to Alzheimer's disease: recommendations from the National Institute on Aging-Alzheimer's Association workgroups on diagnostic guidelines for Alzheimer's disease. Alzheimers Dement 7:263-269. https://doi.org/10.1016/j.jalz. 2011.03.005\n- 3. Lesourd M, Le Gall D, Baumard J, Croisile B, Jarry C, Osiurak F (2013) Apraxia and Alzheimer's disease: review and perspectives. Neuropsychol Rev 23:234-256. https://doi.org/10.1007/ s11065-013-9235-4\n- 5. Parakh R, Roy EA, Koo E, Black SE (2004) Pantomime and imitation of limb gestures in relation to the severity of Alzheimer's disease. Brain Cogn 55:272-274. https://doi.org/10.1016/j.bandc. 2004.02.049\n- 4. Cubelli R (2017) Definition: apraxia. Cortex 39:227. https://doi. org/10.1016/j.cortex.2017.03.012\n- 6. Stamenova V, Roy EA, Black SE (2014) A model-based approach to limb apraxia in Alzheimer's disease. J Neuropsychol 8:246268. https://doi.org/10.1111/jnp.12023", "doc_items_refs": ["#/texts/119", "#/texts/120", "#/texts/121", "#/texts/122", "#/texts/123", "#/texts/124", "#/texts/125"], "page_nos": [], "uuid": "6c46db17-7cdf-4a2f-8999-74f3465124de"}
{"doc_id": "2025__Apraxic_deficits_predict_general_cognitive_impairment_in_patients_with_biomarker__W4414497753", "source_path": "<redacted:source_path>", "chunk_id": 22, "source_chunk_idxs": [25], "num_tokens": 414, "text": "References\n- 7. Ahmed S, Baker I, Thompson S, Husain M, Butler CR (2016) Utility of testing for apraxia and associated features in dementia. J Neurol Neurosurg Psychiatry 87:1158-1162. https://doi.org/10. 1136/jnnp-2015-312945\n- 8. Ahmed S, Baker I, Thompson S, Husain M, Butler CR (2016) Utility of testing for apraxia and associated features in dementia. J Neurol Neurosurg Psychiatry 87:1158-1162. https://doi.org/10.\n- 8. Ozkan S, Adapinar DO, Elmacati N, Arslantas D (2013) Apraxia for differentiating Alzheimer's disease from subcortical vascular dementia and mild cognitive impairment. Neuropsychiatr Dis Treat 9:947-951. https://doi.org/10.2147/NDT.S47879\n- 10. Johnen A, Frommeyer J, Modes F, Wiendl H, Dunning T, Lohmann H (2016) Dementia apraxia test (DATE): a brief tool to differentiate behavioral variant frontotemporal dementia from Alzheimer's dementia based on apraxia profiles. J Alzheimers Dis 49:593-605. https://doi.org/10.3233/JAD-150447\n- 9. Johnen A, Tokaj A, Kirschner A, Wiendl H, Lueg G, Duning T, Lohmann H (2015) Apraxia profile differentiates behavioural variant frontotemporal from Alzheimer's dementia in mild disease stages. J Neurol Neurosurg Psychiatry 86:809-815. https://doi. org/10.1136/jnnp-2014-308773", "doc_items_refs": ["#/texts/126", "#/texts/127", "#/texts/128", "#/texts/129", "#/texts/130"], "page_nos": [], "uuid": "fe800764-1eb4-49db-b999-d042e9c93d9d"}
{"doc_id": "2025__Apraxic_deficits_predict_general_cognitive_impairment_in_patients_with_biomarker__W4414497753", "source_path": "<redacted:source_path>", "chunk_id": 23, "source_chunk_idxs": [26], "num_tokens": 477, "text": "References\n- 11. Johnen A, Reul S, Wiendl H, Meuth SG, Duning T (2018) Apraxia profiles-a single cognitive marker to discriminate all variants of frontotemporal lobar degeneration and Alzheimer's disease. Alzheimers Dement (Amst) 10:363-371. https://doi.org/10.1016/j. dadm.2018.04.002\n- 12. Pawlowski M, Joksch V, Wiendl H, Meuth SG, Duning T, Johnen A (2019) Apraxia screening predicts Alzheimer pathology in frontotemporal dementia. J Neurol Neurosurg Psychiatry 90:562-569. https://doi.org/10.1136/jnnp-2018-318470\n- 13. Dubois B, Feldman HH, Jacova C et al (2014) Advancing research diagnostic criteria for Alzheimer's disease: the IWG-2 criteria. Lancet Neurol 13:614-629. https://doi.org/10.1016/S14744422(14)70090-0\n- 14. Jack CR, Bennett DA, Blennow K et al (2018) NIA-AA research framework: toward a biological definition of Alzheimer's disease. Alzheimers Dement 14:535-562. https://doi.org/10.1016/j.jalz. 2018.02.018\n- 15. Goldenberg G (1996) Defective imitation of gestures in patients with damage in the left or right hemispheres. J Neurol Neurosurg Psychiatry 61:176-180. https://doi.org/10.1136/jnnp.61.2.176\n- 16. Albert MS, DeKosky ST, Dickson D et al (2011) The diagnosis of mild cognitive impairment due to Alzheimer's disease: recommendations from the National Institute on Aging-Alzheimer's Association workgroups on diagnostic guidelines for Alzheimer's disease. Alzheimers Dement 7:270-279. https://doi.org/10.1016/j. jalz.2011.03.008", "doc_items_refs": ["#/texts/136", "#/texts/137", "#/texts/138", "#/texts/139", "#/texts/140", "#/texts/141"], "page_nos": [], "uuid": "95e65923-9701-48e1-998e-bccf6ce5c38c"}
{"doc_id": "2025__Apraxic_deficits_predict_general_cognitive_impairment_in_patients_with_biomarker__W4414497753", "source_path": "<redacted:source_path>", "chunk_id": 24, "source_chunk_idxs": [27], "num_tokens": 507, "text": "References\n- 17. Kessler J, Denzler P, Markowitsch HJ (1990) Mini-Mental-StatusTest (MMSE). Deutsche Fassung. Hogrefe Testzentrale, Göttingen\n- 18. Folstein MF, Folstein SE, McHugh PR (1975) \"Mini-mental state\": a practical method for grading the cognitive state of patients for the clinician J. Psychiatr Res 12:189-198. https://doi. org/10.1016/0022-3956(75)90026-6\n- 19. Schmidt CC, Achilles EIS, Fink GR, Weiss PH (2022) Distinct cognitive components and their neural substrates underlying praxis and language deficits following left hemisphere stroke. Cortex 146:200-215. https://doi.org/10.1016/j.cortex.2021.11.004\n- 20. Weiss PH, Kalbe E, Kessler J, Fink GR (2013) Kölner Apraxie Screening. Hogrefe, Göttingen\n- 21. De Renzi E, Motti F, Nichelli P (1980) Imitating gestures: a quantitative approach to ideomotor apraxia. Arch Neurol 37:6-10. https://doi.org/10.1001/archneur.1980.00500500036003\n- 22. De Renzi E, Piczuro A, Vignola LO (1968) Ideational apraxia: a quantitative study. Neuropsychologia 6:41-52. https://doi.org/ 10.1016/0028-3932(68)90037-7\n- 23. Johnen A, Brandstetter L, Kärgel C, Wiendl H, Lohmann H, Dunning T (2016) Shared neural correlates of limb apraxia in early stages of Alzheimer's dementia and behavioural variant frontotemporal dementia. Cortex 84:1-14. https://doi.org/10.1016/j. cortex.2016.08.009\n- 24. Akaike H (1974) A new look at the statistical model identification. IEEE Trans Automat Control 19:716-723. https://doi.org/ 10.1109/TAC.1974.110705", "doc_items_refs": ["#/texts/142", "#/texts/143", "#/texts/144", "#/texts/145", "#/texts/146", "#/texts/147", "#/texts/148", "#/texts/149"], "page_nos": [], "uuid": "8734154e-635d-44de-8c69-715fe602de5d"}
{"doc_id": "2025__Apraxic_deficits_predict_general_cognitive_impairment_in_patients_with_biomarker__W4414497753", "source_path": "<redacted:source_path>", "chunk_id": 25, "source_chunk_idxs": [28], "num_tokens": 168, "text": "References\n- 25. Vakila E, Jehkonen M (2023) Apraxia and dementia severity in Alzheimer's disease: a systematic review. J Clin Exp Neuropsychol 45:84-103. https://doi.org/10.1080/13803395.2023.2199971\n- 26. Tessari A, Mengotti P, Faccioli L, Tuozzi G, Boscarato TM, Rumiati RI (2021) Effect of body-part specificity and meaning in gesture imitation in left hemisphere stroke patients. Neuropsychologia 151:107720. https://doi.org/10.1016/j.neuropsychologia. 2020.107720", "doc_items_refs": ["#/texts/150", "#/texts/151"], "page_nos": [], "uuid": "92b905fd-299e-4ddc-875b-6f433369f567"}
{"doc_id": "2025__Apraxic_deficits_predict_general_cognitive_impairment_in_patients_with_biomarker__W4414497753", "source_path": "<redacted:source_path>", "chunk_id": 26, "source_chunk_idxs": [29], "num_tokens": 511, "text": "References\n- 27. Goldenberg G, Karnath H-O (2006) The neural basis of imitation is body part specific. J Neurosci 26:6282-6287. https://doi.org/ 10.1523/JNEUROSCI.0638-06.2006\n- 28. Goldenberg G (2001) Imitation and matching of hand and finger postures. Neuroimage 14:S132-136. https://doi.org/10.1006/nimg. 2001.0820\n- 29. Baumard J, Lesourd M, Remigereau C, Laurent L, Jarry C, Etch-arry-Bouyx F, Chauviré V, Osiurak F, Le Gall D (2022) Meaning imitation in neurodegenerative diseases: effects of body part, bimanual imitation, asymmetry, and body midline crossing. Cogn Neuropsychol 39:227-248. https://doi.org/10.1080/02643 294.2022.2164487\n- 30. Latarnik S, Wirth K, Held A, Kalbe E, Kessler J, Saliger J, Karbe H, Fink GR, Weiss PH (2020) Prevalence and characteristics of apraxic deficits after left and right hemisphere stroke. Fortschr Neurol Psychiatr 88:232-240. https://doi.org/10. 1055/a-1082-6501\n- 31. Goldenberg G, Münsinger U, Karnath H-O (2009) Severity of neglect predicts accuracy of imitation in patients with right hemisphere lesions. Neuropsychologia 47:2948-2952. https://doi.org/ 10.1016/j.neuropsychologia.2009.06.024\n- 32. Dressing A, Martin M, Beume L-A, Kuemmerer D, Urbach H, Kaller CP, Weiller C, Rijntes J (2020) The correlation between apraxia and neglect in the right hemisphere: a voxel-based lesionsymptom mapping study in 138 acute stroke patients. Cortex 132:166-179. https://doi.org/10.1016/j.cortex.2020.07.017", "doc_items_refs": ["#/texts/153", "#/texts/154", "#/texts/155", "#/texts/156", "#/texts/157", "#/texts/158"], "page_nos": [], "uuid": "ea65aba4-a753-4a18-aa91-dea07013e3c7"}
{"doc_id": "2025__Apraxic_deficits_predict_general_cognitive_impairment_in_patients_with_biomarker__W4414497753", "source_path": "<redacted:source_path>", "chunk_id": 27, "source_chunk_idxs": [30], "num_tokens": 486, "text": "References\n- 33. Ubben SD, Fink GR, Kaesberg S, Kalbe E, Kessler J, Vossel S, Weiss PH (2020) Deficient allo-centric visuospatial processing contributes to apraxic deficits in sub-acute right hemisphere stroke. J Neuropsychol 14:242-259. https://doi.org/10.1111/jnp. 12191\n- 34. Crutch SJ, Rossor MN, Warrington EK (2007) The quantitative assessment of apraxic deficits in Alzheimer's disease. Cortex 43:976-986. https://doi.org/10.1016/S0010-9452(08)70695-6\n- 35. Yliranta A, Nuora J, Karjalainen V, Almasalo R, Jehkonen M (2023) The dementia apraxia test can detect early-onset Alzheimer's disease. Neuropsychology 37:44-51. https://doi.org/10. 1037/neu0000873\n- 36. Lesourd M, Baumard J, Jarry C et al (2017) Rethinking the cognitive mechanisms underlying pantomime of tool use: evidence from Alzheimer's disease and semantic dementia. J Int Neuropsychol 23:128-138. https://doi.org/10.1017/S1355617716000618\n- 37. Whitwell J (2010) Progression of athrophy in Alzheimer's disease and related disorders. Neurotox Res 18:339-346. https://doi.org/ 10.1007/s12640-010-9175-1\n- 38. Bischof GN, Jaeger E, Giehl K, Honig MC, Initiative AsDN, Weiss PH, Drzzega A (2024) Affection of motor network regions by tau pathology across the Alzheimer's disease spectrum. eNeuro 11:ENEURO.0242-0223.2023. https://doi.org/10.1523/ENEURO. 0242-23.2023", "doc_items_refs": ["#/texts/159", "#/texts/160", "#/texts/161", "#/texts/162", "#/texts/163", "#/texts/164"], "page_nos": [], "uuid": "4c1ed030-88bc-43a2-90a3-231547665e81"}
{"doc_id": "2025__Apraxic_deficits_predict_general_cognitive_impairment_in_patients_with_biomarker__W4414497753", "source_path": "<redacted:source_path>", "chunk_id": 28, "source_chunk_idxs": [31], "num_tokens": 100, "text": "References\n- 39. Bischof GN, Jaeger E, Giehl K, Jessen F, Onur OA, O'Bryant S, Kara E, Weiss PH, Drzzega A (2024) Cortial tau aggregation patterns associated with apraxia in patients with Alzheimer disease. Neurology 103:e210062. https://doi.org/10.1212/WNL. 0000000000210062", "doc_items_refs": ["#/texts/165"], "page_nos": [], "uuid": "5d3edc41-70a7-45b8-90d4-c19dc50cab14"}
