{"doc_id": "2025__Anticholinergic_Burden_and_Its_Association_with_Hospitalisation_Risk_and_Causes___W4414468114", "source_path": "<redacted:source_path>", "chunk_id": 0, "source_chunk_idxs": [0, 1, 2, 3, 4, 5, 6], "num_tokens": 343, "text": "Anticholinergic burden and its association with hospitalisation risk a | CIA\nJavascript is currently disabled in your browser. Several features of\nthis site will not function whilst javascript is disabled.\n- Journals\n- Why Publish With Us?\n- Editorial Policies\n- Author Guidelines\n- Peer Review Guidelines\n- Open Outlook\n- Hot topics\n- Podcasts\n- Reprints\n- Submit New Manuscript\nMenu\n- About\n- Contact\n- Sustainability\n- Press Center\n- Testimonials\n- Favored Author Program\n- Permissions\n- Pre-Submission\n- Reprints\n- Login\n- Image Hyperlink.\nAdvanced search\nOpen access to scientific and medical research\n- Journals\n- Why publish with us?\n- Editorial Policies\n- Author Information\n- Peer Review Guidelines\n- Open Outlook\n- Hot topics\n- Podcasts\n\nAnticholinergic burden and its association with hospitalisation risk a | CIA\n1 0 6 4 1 9\nPapers Published\nSubmit new manuscript\nLogin to view existing manuscript status\nSign up for journal alerts\n\nAnticholinergic burden and its association with hospitalisation risk a | CIA\nAbout Dove Press\nOpen access peer-reviewed scientific and medical journals.\nLearn more\n\nAnticholinergic burden and its association with hospitalisation risk a | CIA\nOpen Access\nPromo\nDove Medical Press is a member of the OAI.\nLearn more\n\nAnticholinergic burden and its association with hospitalisation risk a | CIA\nReprints\nBulk reprints for the pharmaceutical industry.\nLearn more\n\nAnticholinergic burden and its association with hospitalisation risk a | CIA\nFavored Authors\nWe offer real benefits to our authors, including fast-track processing of papers.\nLearn more\n\nAnticholinergic burden and its association with hospitalisation risk a | CIA\nFavored Authors\nSocial Media\nLive Support Chat\nBack to\nJournals\n»\nClinical Interventions in Aging\n»\nVolume 20\nListen\nOriginal Research", "doc_items_refs": ["#/texts/1", "#/texts/2", "#/texts/3", "#/texts/4", "#/texts/5", "#/texts/6", "#/texts/7", "#/texts/8", "#/texts/9", "#/texts/10", "#/texts/11", "#/texts/12", "#/texts/13", "#/texts/14", "#/texts/15", "#/texts/16", "#/texts/17", "#/texts/18", "#/texts/19", "#/texts/20", "#/texts/21", "#/texts/22", "#/texts/23", "#/texts/24", "#/texts/25", "#/texts/26", "#/texts/27", "#/texts/28", "#/texts/29", "#/texts/30", "#/texts/31", "#/texts/32", "#/texts/33", "#/texts/34", "#/texts/36", "#/texts/37", "#/texts/38", "#/texts/39", "#/texts/41", "#/texts/42", "#/texts/44", "#/texts/45", "#/texts/46", "#/texts/48", "#/texts/49", "#/texts/51", "#/texts/52", "#/texts/54", "#/texts/55", "#/texts/56", "#/texts/57", "#/texts/58", "#/texts/59", "#/texts/60", "#/texts/61", "#/texts/62"], "page_nos": [], "uuid": "1c72e547-0abc-4cd0-a7b6-a57c3e84aed7"}
{"doc_id": "2025__Anticholinergic_Burden_and_Its_Association_with_Hospitalisation_Risk_and_Causes___W4414468114", "source_path": "<redacted:source_path>", "chunk_id": 1, "source_chunk_idxs": [7], "num_tokens": 480, "text": "Anticholinergic Burden and Its Association with Hospitalisation Risk and Causes of Admission in Older Adults with Mild Cognitive Impairment or Dementia\n- Fulltext\n- Metrics\n- Get Permission\n- Cite this article\nAuthors\nRahoo R\n,\nLiau ZY\n,\nLow MJ\n,\nKamaruzzaman SB\n,\nFrancis B\n,\nKhor HM\nReceived\n3 June 2025\nAccepted for publication\n11 September 2025\nPublished\n25 September 2025\nVolume 2025:20                                Pages 1661-1670\nDOI\nhttps://doi.org/10.2147/CIA.S541108\nChecked for plagiarism\nYes\nReview by\nSingle anonymous peer review\nPeer reviewer comments\n2\nEditor who approved publication:\nDr Maddalena Illario\nDownload Article [PDF]\nRenuka Rahoo,\n1\nZhen Yi Liau,\n2\nMin-Jie Low,\n2\nShahrul Bahyah Kamaruzzaman,\n1\nBenedict Francis,\n3\nHui Min Khor\n1 1\nDepartment of Medicine, Faculty of Medicine, Universiti Malaya, Kuala Lumpur, Malaysia;\n2\nDepartment of Internal Medicine, Ng Teng Fong General Hospital Singapore, Jurong East, Singapore;\n3\nDepartment of Psychological Medicine, Faculty of Medicine, Universiti Malaya, Kuala Lumpur, Malaysia Correspondence: Hui Min Khor, Department of Medicine, Faculty of Medicine, Universiti Malaya, Kuala Lumpur, Malaysia, Email\n[email protected]\nBackground:\nOlder adults with cognitive impairment are vulnerable to the adverse effects of cumulative use of medications with anticholinergic properties. However, existing research on hospitalisation risk in this population remains limited and often lacks focus on the specific causes of admission. This study aims to investigate the role of anticholinergic burden and its association with hospitalisation risk and reasons for admission among older adults with mild cognitive impairment or dementia.\nMethods:\nThis retrospective study included older adults with mild cognitive impairment or dementia attending the memory clinic between January to December 2022. Collected data from the electronic medical records includes sociodemographic information, comorbidities, cognitive and functional assessment, neuropsychiatric symptoms, and medication history. Anticholinergic burden was assessed using the Anticholinergic Cognitive Burden (ACB) score. Cox proportional hazard analysis was performed to assess the association between ACB scores and hospitalisation risk. The underlying causes of hospital admissions were compared across the different ACB score groups.\nResults:", "doc_items_refs": ["#/texts/64", "#/texts/65", "#/texts/66", "#/texts/67", "#/texts/68", "#/texts/69", "#/texts/70", "#/texts/71", "#/texts/72", "#/texts/73", "#/texts/74", "#/texts/75", "#/texts/76", "#/texts/77", "#/texts/78", "#/texts/79", "#/texts/80", "#/texts/81", "#/texts/82", "#/texts/83", "#/texts/84", "#/texts/85", "#/texts/86", "#/texts/87", "#/texts/88", "#/texts/89", "#/texts/90", "#/texts/91", "#/texts/92", "#/texts/93", "#/texts/94", "#/texts/95", "#/texts/96", "#/texts/97", "#/texts/98", "#/texts/99", "#/texts/100", "#/texts/101", "#/texts/102", "#/texts/103", "#/texts/104", "#/texts/105", "#/texts/106", "#/texts/107", "#/texts/108", "#/texts/109", "#/texts/110", "#/texts/111", "#/texts/112", "#/texts/113", "#/texts/114", "#/texts/115", "#/texts/116", "#/texts/117", "#/texts/118", "#/texts/119", "#/texts/120"], "page_nos": [], "uuid": "790da723-1937-4ae7-99ad-65782764b092"}
{"doc_id": "2025__Anticholinergic_Burden_and_Its_Association_with_Hospitalisation_Risk_and_Causes___W4414468114", "source_path": "<redacted:source_path>", "chunk_id": 2, "source_chunk_idxs": [8], "num_tokens": 334, "text": "Anticholinergic Burden and Its Association with Hospitalisation Risk and Causes of Admission in Older Adults with Mild Cognitive Impairment or Dementia\nA total of 657 older adults were included in the analysis, with a mean age of 80.66 (SD 7.39) years. Anticholinergic medication use was seen in 35.5%, with a mean ACB score of 0.8 (SD 1.3). Higher ACB scores were associated with nursing home residency, presence of neuropsychiatric symptom, poorer cognitive and physical function, and a greater number of prescribed medications compared to those with no anticholinergic burden. Older adults with ACB scores of 1- 2 had an increased risk of hospitalisation (Hazard Ratio(HR)=1.84,95% CI:1.17- 2.90) in univariate analysis, but this association was diminished after adjusting for confounders. The most common reasons for hospital admission were pneumonia (5.7%), acute kidney injury (3.8%), delirium (2.6%) and falls (2.6%). Notably, individuals hospitalised for serious adverse cardiovascular events or infected pressure ulcers had significantly higher ACB scores.\nConclusion:\nOne-third of older adults with mild cognitive impairment or dementia use anticholinergic medications, potentially worsening health outcomes. These findings underscore the importance of regular medication review and deprescribing strategies to minimise anticholinergic burden in this vulnerable population.\nKeywords:\nanticholinergic burden, mild cognitive impairment, dementia, hospitalisation, admission", "doc_items_refs": ["#/texts/121", "#/texts/122", "#/texts/123", "#/texts/124", "#/texts/125"], "page_nos": [], "uuid": "02ea22ad-fcd4-4330-ac46-36f1325d9f20"}
{"doc_id": "2025__Anticholinergic_Burden_and_Its_Association_with_Hospitalisation_Risk_and_Causes___W4414468114", "source_path": "<redacted:source_path>", "chunk_id": 3, "source_chunk_idxs": [9], "num_tokens": 440, "text": "Anticholinergic Burden and Its Association with Hospitalisation Risk and Causes of Admission in Older Adults with Mild Cognitive Impairment or Dementia\nIntroduction\nDementia and mild cognitive impairment (MCI) impose significant public health challenges, as the progression of the disease leads to greater dependency, increased caregiver burden, and escalating healthcare costs.\n1\nCognitive decline is associated with the presence of neuropsychiatric symptoms, such as agitation, hallucinations, and sleep disturbances, affecting up to 90% of individuals with dementia.\n2\nThe management of neuropsychiatric symptoms is highly challenging. In severe cases, healthcare professionals adopt the use of central nervous system active medication such as antipsychotics with anticholinergic properties if nonpharmacologic management is insufficient. Their widespread use raises concerns about cumulative anticholinergic burden in individuals with cognitive impairment. Although these medications are intended to alleviate symptoms such as agitation or hallucinations, their anticholinergic effects may paradoxically worsen cognitive and neuropsychiatric symptoms by further impairing the cholinergic pathway.\n3\nThis unintended consequence underscores the importance of evaluating anticholinergic burden in this vulnerable population.\nThe use of anticholinergic medication is prevalent among older adults with MCI or dementia, with rates ranging from 44.7% to 68.0% in the memory clinic populations.\n4\n,\n5\nA recent report by Cross et al highlighted that older adults with dementia residing in nursing homes across Asia Pacific and European countries are often prescribed strong anticholinergic medication with a high anticholinergic burden.\n6\nFrail individuals with cognitive impairment were commonly prescribed antipsychotics and antidepressants.\nAnticholinergic burden, the cumulative effect of taking multiple medications with anticholinergic properties, has been associated with worsening cognitive decline, impaired physical performance, prolonged hospitalisation, and increased mortality in older adults with dementia.\n7\nThe EPIC Norfolk longitudinal study has shown that high anticholinergic burden is linked to elevated risk of cardiovascular disease and stroke in community-dwelling older adults.\n8\n,\n9\nHowever, only a few studies have explored this risk in cognitively impaired populations.", "doc_items_refs": ["#/texts/127", "#/texts/128", "#/texts/129", "#/texts/130", "#/texts/131", "#/texts/132", "#/texts/133", "#/texts/134", "#/texts/135", "#/texts/136", "#/texts/137", "#/texts/138", "#/texts/139", "#/texts/140", "#/texts/141", "#/texts/142", "#/texts/143", "#/texts/144", "#/texts/145", "#/texts/146", "#/texts/147"], "page_nos": [], "uuid": "b0c6f66f-67ba-4354-b50d-dcf59ee2e908"}
{"doc_id": "2025__Anticholinergic_Burden_and_Its_Association_with_Hospitalisation_Risk_and_Causes___W4414468114", "source_path": "<redacted:source_path>", "chunk_id": 4, "source_chunk_idxs": [10], "num_tokens": 441, "text": "Anticholinergic Burden and Its Association with Hospitalisation Risk and Causes of Admission in Older Adults with Mild Cognitive Impairment or Dementia\nIntroduction\nAnticholinergic burden has also been associated with increased rates of delirium and falls, both of which are common reasons for hospital admission. Hospitalisation presents substantial risk for older adults with dementia, including dehydration, malnutrition, hospital-acquired infections, and worsening of neuropsychiatric symptoms, which can complicate clinical care.\n10\nFurthermore, older adults with dementia tend to be discharged from the hospital with a higher anticholinergic burden compared to their admission.\n11\nAlthough anticholinergic use has been associated with negative health outcomes, the extent to which ACB contributes to hospitalisation risk remains unclear, especially when accounting for potential confounders such as multimorbidity, frailty, and functional impairment. A deeper understanding of this association can guide deprescribing efforts and ultimately reduce preventable hospitalisations in this vulnerable population.\nPrescribing anticholinergic medication in older adults is considered potentially inappropriate, with assessment tools such as the Screening Tool of Older Person's Prescriptions and the American Geriatric Society Beers Criteria recommending avoidance or deprescribing of these medications, particularly in those with cognitively impairment.\n12\n,\n13\nDespite these recommendations, inappropriate prescribing remains widespread. In the Asia Pacific region, especially Southeast Asia, several systemic barriers such as limited awareness, insufficient geriatric training, and fragmented dementia care infrastructure contribute to suboptimal prescribing practices.\n14\n,\n15\nTo our knowledge, there are currently no standardized deprescribing interventions targeting anticholinergic medications in Southeast Asia, including Malaysia, for cognitively impaired older adults. In contrast, several international initiatives provide structured deprescribing guidance, including the NSW Therapeutic Advisory Group deprescribing tools and Primary Health Tasmania deprescribing resources.\n16\nThese gaps underscore the urgent need for locally relevant data to guide safer prescribing practices, support the development of region-specific guidelines, and improve dementia care across the region.", "doc_items_refs": ["#/texts/148", "#/texts/149", "#/texts/150", "#/texts/151", "#/texts/152", "#/texts/153", "#/texts/154", "#/texts/155", "#/texts/156", "#/texts/157", "#/texts/158", "#/texts/159", "#/texts/160", "#/texts/161", "#/texts/162", "#/texts/163"], "page_nos": [], "uuid": "382f9500-9b3a-4ae7-b4be-16d97bc4410e"}
{"doc_id": "2025__Anticholinergic_Burden_and_Its_Association_with_Hospitalisation_Risk_and_Causes___W4414468114", "source_path": "<redacted:source_path>", "chunk_id": 5, "source_chunk_idxs": [11], "num_tokens": 151, "text": "Anticholinergic Burden and Its Association with Hospitalisation Risk and Causes of Admission in Older Adults with Mild Cognitive Impairment or Dementia\nIntroduction\nThis study aims to explore the anticholinergic burden in older adults with MCI or dementia and its association with the risk of hospitalisation and reasons for admission. The primary outcome is to determine whether higher anticholinergic burden increases the risk of hospitalisation, while the secondary outcome examines the relationship between anticholinergic burden with specific causes of admission. By elucidating these associations, this study contributes to the growing body of evidence on medication safety in older adults with MCI or dementia and highlights the need for strategies to minimize inappropriate prescribing and reduce hospital admissions related to anticholinergic burden.", "doc_items_refs": ["#/texts/164"], "page_nos": [], "uuid": "a817c70a-3a1f-49bc-b2a4-c73e23f2383c"}
{"doc_id": "2025__Anticholinergic_Burden_and_Its_Association_with_Hospitalisation_Risk_and_Causes___W4414468114", "source_path": "<redacted:source_path>", "chunk_id": 6, "source_chunk_idxs": [12], "num_tokens": 363, "text": "Anticholinergic Burden and Its Association with Hospitalisation Risk and Causes of Admission in Older Adults with Mild Cognitive Impairment or Dementia\nMethodology\nStudy Design, Setting, and Population\nThis retrospective cohort study reviewed electronic medical records (EMR) of older adults who attended the memory clinic at a tertiary hospital between 01-01-2022 and 31-12-2022. The first outpatient visit to the memory clinic during this period was designated as the index visit, during which data collection was conducted. Subsequently, older adults who met the inclusion criteria were prospectively monitored for hospitalisation records until 23-07-2023.\nThe memory clinic is a specialised clinic led by geriatricians, which receives referrals for assessing and treating cognitive impairment in older adults. The diagnosis of MCI and dementia was made by geriatricians based on the fifth edition of the Diagnostic and Statistical Manual of Mental Disorders (DSM-5) criteria for minor and major neurocognitive disorders. The study included consecutive older adults aged 60 years and above with MCI or dementia who attended the memory clinic. Exclusion criteria included older adults with pseudodementia, those who do not have a formal diagnosis of dementia, and those who do not have any prescribed medications.\nThis study adhered to the guidelines and regulations outlined by the Strengthening the Reporting of Observational Studies in Epidemiology (STROBE) framework and the principles of the Declaration of Helsinki. The study received ethical approval from the University Malaya Medical Research Ethics Committee (MREC), MREC ID No: 202346-12342. A waiver of informed consent was granted by the committee as the study involved retrospective review of routinely collected data from electronic medical records, with all data anonymised prior to analysis to ensure confidentiality.", "doc_items_refs": ["#/texts/167", "#/texts/168", "#/texts/169"], "page_nos": [], "uuid": "248c1a83-c761-4703-90a0-8b2ac9696130"}
{"doc_id": "2025__Anticholinergic_Burden_and_Its_Association_with_Hospitalisation_Risk_and_Causes___W4414468114", "source_path": "<redacted:source_path>", "chunk_id": 7, "source_chunk_idxs": [13, 14], "num_tokens": 319, "text": "Anticholinergic Burden and Its Association with Hospitalisation Risk and Causes of Admission in Older Adults with Mild Cognitive Impairment or Dementia\nMethodology\nData Collection\nThe EMR of all eligible older adults were examined to obtain information on sociodemographic details including age, ethnicity, and residential status. Clinical details of comorbidities such as diabetes mellitus, ischaemic heart disease, chronic lung disease, chronic kidney disease, stroke, and malignancy were reported based on physician-diagnosed conditions. These comorbid conditions were chosen based on the prevalence of premature mortality among older adults in Malaysia.\n17\nThe functional status of older adults was identified using the Katz Barthel index, measuring independence in daily activities including personal hygiene, dressing, toileting, transferring, continence, and eating. Scores range from 0 to 12, with higher scores indicating greater independence.\n18\nLawton's Instrumental Activities of Daily Living were used to assess independent living skills covering eight domains of function: using the telephone, shopping, preparing meals, housekeeping, laundry, using transportation, and managing medications and finances.\n19\nThe score ranges from 0, indicating low function and dependency, to 16, indicating high function and independence.\n\nAnticholinergic Burden and Its Association with Hospitalisation Risk and Causes of Admission in Older Adults with Mild Cognitive Impairment or Dementia\nMethodology\nCognitive Assessment\nThe severity of cognitive impairment was documented based on Mini Mental State Examination (MMSE) score. The different subtypes of dementia were not recorded as the study aims to analyse the risk of anticholinergic burden with all-cause dementia.", "doc_items_refs": ["#/texts/171", "#/texts/172", "#/texts/173", "#/texts/174", "#/texts/175", "#/texts/176", "#/texts/177", "#/texts/179"], "page_nos": [], "uuid": "b0c7e418-8489-402d-b612-5e86adbf56f7"}
{"doc_id": "2025__Anticholinergic_Burden_and_Its_Association_with_Hospitalisation_Risk_and_Causes___W4414468114", "source_path": "<redacted:source_path>", "chunk_id": 8, "source_chunk_idxs": [15], "num_tokens": 301, "text": "Anticholinergic Burden and Its Association with Hospitalisation Risk and Causes of Admission in Older Adults with Mild Cognitive Impairment or Dementia\nMethodology\nNeuropsychiatric Symptoms\nThe presence of neuropsychiatric symptoms was assessed based on the clinical observation and caregiver-reported symptoms such as the presence of delusion, hallucination, agitation, irritability, anxiety, depression, disinhibition, apathy, sleep disruption, and motor disturbances, as documented in the electronic medical records. A symptom was counted as present if it was recorded in the EMR during the index visit, when data were collected. Each symptom was considered as occurring once per visit, regardless of the number of times it was mentioned in the EMR. Neuropsychiatric symptoms of dementia frequently occur together and may have similar aetiology. Hence, examining groups of symptoms rather than individual symptoms has been suggested by the European Alzheimer's Disease Consortium to target effective interventional strategies for groups of symptoms. In this study, neuropsychiatric symptoms were categorised into three clusters for analysis: hyperactivity symptoms (disinhibition, irritability, agitation, and anger), psychosis symptoms (hallucinations, apprehension, elation/euphoria, delusions, and emotional distress), and physical behaviour symptoms (appetite and eating irregularities, apathy, aberrant motor behaviour, sleep, and night-time behaviour disturbances).\n20", "doc_items_refs": ["#/texts/181", "#/texts/182"], "page_nos": [], "uuid": "0a4e517a-5dbc-45f4-8df7-5da8f7812cf3"}
{"doc_id": "2025__Anticholinergic_Burden_and_Its_Association_with_Hospitalisation_Risk_and_Causes___W4414468114", "source_path": "<redacted:source_path>", "chunk_id": 9, "source_chunk_idxs": [16, 17], "num_tokens": 340, "text": "Anticholinergic Burden and Its Association with Hospitalisation Risk and Causes of Admission in Older Adults with Mild Cognitive Impairment or Dementia\nMethodology\nMedication History\nMedication history was collected from the hospital's electronic prescription records, which include the dose, frequency, and duration of each medication prescribed by the physician following the index clinic visit. Temporary medications (prescribed for less than 2 weeks) for acute conditions, traditional medicine, and over-the-counter (OTC) medications were excluded from the analysis. Traditional medicine was excluded due to its diverse range of herbal remedies and variable formulations. OTC medications were excluded primarily because they are often inconsistently documented in the EMR, as they are typically self-administered without healthcare supervision. Additionally, OTC medications are usually intended for short-term symptom relief, which may not be accurately reflected in medical records.\n\nAnticholinergic Burden and Its Association with Hospitalisation Risk and Causes of Admission in Older Adults with Mild Cognitive Impairment or Dementia\nMethodology\nAnticholinergic Burden\nThe cumulative anticholinergic burden was determined using the Anticholinergic Cognitive Burden (ACB) Scale. Each medication was evaluated for anticholinergic activity, with a score of 0 for no anticholinergic effects, 1 for possible action, and 2 or 3 for definite anticholinergic effects.\n21\nThe total score per patient was calculated, and higher ACB scores indicated greater anticholinergic exposure. The participants were classified into three groups according to their ACB score: 0 (no anticholinergic burden), 1-2 (low anticholinergic burden), and ≥3 (high anticholinergic burden) for the analysis.", "doc_items_refs": ["#/texts/184", "#/texts/186", "#/texts/187", "#/texts/188"], "page_nos": [], "uuid": "ea7c10e6-7ddd-47f0-9abf-8d8ffb01c12d"}
{"doc_id": "2025__Anticholinergic_Burden_and_Its_Association_with_Hospitalisation_Risk_and_Causes___W4414468114", "source_path": "<redacted:source_path>", "chunk_id": 10, "source_chunk_idxs": [18, 19, 20], "num_tokens": 423, "text": "Anticholinergic Burden and Its Association with Hospitalisation Risk and Causes of Admission in Older Adults with Mild Cognitive Impairment or Dementia\nMethodology\nOutcome Measure\nHospitalisation data were collected by reviewing the EMR for inpatient admissions occurring between January 2022 and 23rd July 2023. The first hospital admission following the index visit was recorded, and reasons for hospitalisation were classified according to the International Classification of Diseases, 10\nth\nRevision (ICD-10). To ensure clinical relevance, only hospitalisation causes with 4 or more cases were included in the analysis.\n\nAnticholinergic Burden and Its Association with Hospitalisation Risk and Causes of Admission in Older Adults with Mild Cognitive Impairment or Dementia\nMethodology\nSample Size\nThe sample size calculation for this study was performed using the OpenEpi software, which determined that a minimum of 384 older adults was required, with a confidence level of 95% and a margin of error set at 5%. To account for an attrition rate of 10% due to potential incomplete or missing medication history from the electronic medical records, a total of 422 participants would be required for the study.\n\nAnticholinergic Burden and Its Association with Hospitalisation Risk and Causes of Admission in Older Adults with Mild Cognitive Impairment or Dementia\nMethodology\nStatistical Analysis\nData were analysed using the SPSS Statistical Package for Social Science (SPSS) version 22.0 (IBMTM, USA). Descriptive statistics were reported, with parametric data expressed as mean with standard deviation (SD) and non-parametric continuous data as median with inter-quartile ranges (IQR). Categorical data were presented as frequencies with percentages in parentheses and compared using the chi-squared test. The Kruskal-Wallis test was used to compare the differences between ACB scores of 0, 1-2, and ≥3. Cox regression analysis was performed to examine the association between ACB scores and the risk of hospitalisation. The association between ACB score groups and reasons for hospitalisation was analysed using the chi-square test. A probability value of less than 0.05 was considered statistically significant.", "doc_items_refs": ["#/texts/190", "#/texts/191", "#/texts/192", "#/texts/194", "#/texts/196"], "page_nos": [], "uuid": "91beaee5-de85-4587-9355-bf65a285f0ff"}
{"doc_id": "2025__Anticholinergic_Burden_and_Its_Association_with_Hospitalisation_Risk_and_Causes___W4414468114", "source_path": "<redacted:source_path>", "chunk_id": 11, "source_chunk_idxs": [21], "num_tokens": 459, "text": "Anticholinergic Burden and Its Association with Hospitalisation Risk and Causes of Admission in Older Adults with Mild Cognitive Impairment or Dementia\nResults\nA total of 692 older adults attended the memory clinic between January and December 2022. Of these, 657 were included in the analysis of anticholinergic burden (\nFigure 1\n). Among those included, 577 (87.8%) were diagnosed with dementia and 80 (12.2%) had MCI. The mean age of all older adults was 80.66 (SD 7.39) years, and the majority were living in their own homes (\nTable 1\n). The median number of prescribed medications was 6 (IQR 4-8), with a mean ACB score of 0.8 (SD 1.3). ACB scores of 0, 1-2, and ≥ 3 were observed in 424 (64.5%), 114 (17.4%), and 119 (18.1%) older adults, respectively. Those with higher ACB scores were more likely to be nursing home residents, had a higher percentage of neuropsychiatric symptoms, lower MMSE scores, and lower functional status compared to those with an ACB score of 0. Ethnicity, the presence of chronic lung disease, and the number of prescribed medications varied across ACB score groups.\nTable 1\nBaseline Characteristics of Older Adults According to the Anticholinergic Burden Score Groups\nFigure 1\nStudy flow chart.\nImage Hyperlink.\nImage Hyperlink.\nThe medications contributing to the ACB burden were primarily quetiapine (12.7%), followed by prednisolone, loratadine, and metoprolol (each contributing 3.7%), and frusemide (3.4%), as shown in\nTable 2\n. The study identified 93 older adults (14.2%) with a co-prescription of a cholinesterase inhibitor and an anticholinergic medication. The predominant combinations were donepezil and quetiapine (21.9%), followed by rivastigmine and quetiapine (17.7%).\nTable 2\nList of Medications and Percentage of Usage within Each Anticholinergic Cognitive Burden Groups\nImage Hyperlink.", "doc_items_refs": ["#/texts/198", "#/texts/199", "#/texts/200", "#/texts/201", "#/texts/202", "#/texts/203", "#/texts/204", "#/texts/205", "#/texts/206", "#/texts/207", "#/texts/208", "#/texts/209", "#/texts/210", "#/texts/211", "#/texts/212", "#/texts/213", "#/texts/214"], "page_nos": [], "uuid": "21039c26-9aaa-40b5-b996-11a8d02a8089"}
{"doc_id": "2025__Anticholinergic_Burden_and_Its_Association_with_Hospitalisation_Risk_and_Causes___W4414468114", "source_path": "<redacted:source_path>", "chunk_id": 12, "source_chunk_idxs": [22], "num_tokens": 487, "text": "Anticholinergic Burden and Its Association with Hospitalisation Risk and Causes of Admission in Older Adults with Mild Cognitive Impairment or Dementia\nResults\nHospitalisation was documented in 114 older adults (17.4%) over a median follow-up period of 43 (IQR 32-55) weeks. The median time to hospitalisation from the index clinic visit was 22 (IQR 12-29) weeks. Unadjusted Cox regression identified anticholinergic exposure, men, nursing home residents, stroke, ischaemic heart disease, dependency in activities of daily living, and number of prescribed medications as factors associated with the risk of hospitalisation. ACB scores of 1-2 were associated with an increased risk of hospitalisation (Hazard Ratio= 1.84, 95% CI:1.17-2.90, p = 0.01) compared to those with an ACB score of 0 in the univariate Cox-regression analysis (\nTable 3\n). However, this association was attenuation and was no longer significant after adjusting for ischaemic heart disease, dependency in activities of daily living, and the number of prescribed medications. Those with an ACB score of ≥3 showed no association with hospitalisation risk.\nTable 3\nCox Proportional Hazard Analysis Between Hospitalisation and Anticholinergic Cognitive Burden Groups\nImage Hyperlink.\nThe hospitalisation causes stratified by ACB score groups are presented in\nTable 4\n. The most frequently reported reasons for admission were pneumonia (5.7%), acute kidney injury (3.8%), delirium (2.6%) and falls (2.6%). Fragility fractures were documented in nine older adults, involving the hip (n=5), wrist (n=2), pubic rami (n=1), clavicle (n=1) and vertebrae (n=1). Serious cardiovascular events, comprising myocardial infarction, stroke, heart failure, or cardiac arrhythmia, demonstrated a significant increasing trend with higher ACB scores. Infected pressure ulcers (3 in sacrum and 1 at the greater trochanter) were more frequently observed in older adults with ACB score ≥3. Mortality was reported in four hospitalised older adults during the study period.\nTable 4\nAssociation Between ACB Score Groups and Reasons for Hospitalisation\nImage Hyperlink.", "doc_items_refs": ["#/texts/215", "#/texts/216", "#/texts/217", "#/texts/218", "#/texts/219", "#/texts/220", "#/texts/221", "#/texts/222", "#/texts/223", "#/texts/224", "#/texts/225", "#/texts/226"], "page_nos": [], "uuid": "a0f65898-8961-4277-8124-568a4e002a71"}
{"doc_id": "2025__Anticholinergic_Burden_and_Its_Association_with_Hospitalisation_Risk_and_Causes___W4414468114", "source_path": "<redacted:source_path>", "chunk_id": 13, "source_chunk_idxs": [23], "num_tokens": 386, "text": "Anticholinergic Burden and Its Association with Hospitalisation Risk and Causes of Admission in Older Adults with Mild Cognitive Impairment or Dementia\nDiscussion\nIn this study, approximately one-third of older adults with MCI or dementia were prescribed anticholinergic medications, with more than half of them receiving medication with ACB score of ≥3. Those with higher ACB scores often exhibited characteristics associated with frailty, such as residing in nursing homes, experiencing more neuropsychiatric symptoms, and having poorer cognitive and functional status. Although high anticholinergic burden was not independently associated with overall hospitalisation risk after adjustment for confounders, this attenuation suggests that ACB may serve as a surrogate marker for frailty or complex health needs, rather than a direct contributor to hospitalisation risk. Nevertheless, those hospitalised for serious adverse cardiovascular events or infected pressure ulcer had significantly higher ACB scores indicating the potential role of anticholinergic burden in precipitating specific adverse outcomes in this population.\nThe medications contributing to anticholinergic burden in older adults with MCI or dementia differs from community-dwelling older adults, possibly due to frequent use of psychotropic medications to manage neuropsychiatric symptoms. In this study, quetiapine was one of the main contributors to ACB. Emerging hypothesis suggest that high ACB may impair the cholinergic pathway, potentially worsening psychotic symptoms.\n22\nPrevious studies by Jaidi et al, showed that reducing anticholinergic burden was associated with a significantly reduction in neuropsychiatric symptoms.\n23\n,\n24\nHowever, there is a lack of subsequent research to support this association, and a Cochrane review in 2022 highlighted the absence of interventional studies that specifically assessed neuropsychiatric symptoms as an outcome.\n2\nThis represents a research gap that remains unaddressed, and high-quality studies are needed to investigate this association.", "doc_items_refs": ["#/texts/228", "#/texts/229", "#/texts/230", "#/texts/231", "#/texts/232", "#/texts/233", "#/texts/234", "#/texts/235", "#/texts/236", "#/texts/237"], "page_nos": [], "uuid": "0b1737aa-ecf0-4b49-a613-e97bc5926996"}
{"doc_id": "2025__Anticholinergic_Burden_and_Its_Association_with_Hospitalisation_Risk_and_Causes___W4414468114", "source_path": "<redacted:source_path>", "chunk_id": 14, "source_chunk_idxs": [24], "num_tokens": 251, "text": "Anticholinergic Burden and Its Association with Hospitalisation Risk and Causes of Admission in Older Adults with Mild Cognitive Impairment or Dementia\nDiscussion\nOur study found no significant association between high ACB and hospitalisation, but those who were hospitalised for serious cardiovascular events or infected pressure ulcer were significantly associated with higher ACB scores. In large population-based national registry records of older adults from Denmark and Taiwan, anticholinergic burden was associated with an increased risk of major adverse cardiovascular events (MACE), with a greater burden linked to a higher risk in a dose-response pattern.\n25\n,\n26\nThis aligns with previous findings suggesting that anticholinergic medications may contribute to cardiovascular instability through pro-arrhythmic and pro-ischemic effects, tachycardia, and orthostatic hypotension, all of which can increase the risk of ischemic stroke and mortality.\n9\nAdditionally, sedation and reduced mobility due to anticholinergic use may increase the risk of pressure ulceration. In a study of hip fracture patients, one-fifth of whom had underlying dementia, found an association between anticholinergic use and polypharmacy, with the occurrence of pressure ulcers.\n27", "doc_items_refs": ["#/texts/238", "#/texts/239", "#/texts/240", "#/texts/241", "#/texts/242", "#/texts/243", "#/texts/244", "#/texts/245"], "page_nos": [], "uuid": "447e4e8e-b613-455b-89b8-b84f0c6050e9"}
{"doc_id": "2025__Anticholinergic_Burden_and_Its_Association_with_Hospitalisation_Risk_and_Causes___W4414468114", "source_path": "<redacted:source_path>", "chunk_id": 15, "source_chunk_idxs": [25], "num_tokens": 343, "text": "Anticholinergic Burden and Its Association with Hospitalisation Risk and Causes of Admission in Older Adults with Mild Cognitive Impairment or Dementia\nDiscussion\nStructured medication reviews and deprescribing strategies are crucial to reducing unnecessary medication burden, especially in individuals with cognitive impairment. However, systematic reviews of randomised controlled trials have shown mixed results, likely due to heterogeneity in intervention design, short follow-up durations and frequency, and insufficient training provided to interventional staff.\n28\nDeprescribing anticholinergic medication can be challenging in the geriatric population. Barriers include clinician and caregiver hesitancy due to concerns about withdrawal effects, especially for psychoactive medication, lack of ownership for medications prescribed by other physicians, and limited consultation time. Medication such as analgesics, antihistamines and proton-pump inhibitor are more successfully deprescribed compared to antipsychotics or antidepressants.\n29\nA multidisciplinary team approach to address the complex needs of the older adult population is necessary, and pharmacists play a key role in offering expert guidance and support to ensure safe medication usage. A systematic review by Nguyen et al highlighted the effectiveness of pharmacist-led interventions through medication reconciliation, reviews, and adherence support in reducing anticholinergic burden.\n30\nInterventions involving medication reviews, coupled with dementia education and training for care home staff on the management of neuropsychiatric symptoms, have demonstrated success in reducing or discontinuing antipsychotic use. This suggests that enhancing education, multidisciplinary collaboration and implementing clinical guidelines may further support individualised deprescribing and improve patient outcomes.", "doc_items_refs": ["#/texts/246", "#/texts/247", "#/texts/248", "#/texts/249", "#/texts/250", "#/texts/251", "#/texts/252"], "page_nos": [], "uuid": "2c3a0b57-4de5-43bb-8001-cd87732c3daf"}
{"doc_id": "2025__Anticholinergic_Burden_and_Its_Association_with_Hospitalisation_Risk_and_Causes___W4414468114", "source_path": "<redacted:source_path>", "chunk_id": 16, "source_chunk_idxs": [26, 27], "num_tokens": 385, "text": "Anticholinergic Burden and Its Association with Hospitalisation Risk and Causes of Admission in Older Adults with Mild Cognitive Impairment or Dementia\nDiscussion\nThis study is one of the few conducted in Southeast Asia to examine the relationship between anticholinergic burden and both the risk and causes of hospitalisation in a large sample of older adults with MCI or dementia. With the rising prevalence of dementia in the Asia-Pacific region, understanding medication burden is critical to support the development of national policies for safe prescribing and improving dementia care. However, this study has several limitations. Firstly, the ACB scale used to quantify exposure has not been regularly updated to include newer medications, potentially underestimating the true burden. Nonetheless, it remains one of the most widely adopted and validated tool, allowing for comparison across studies.\n31\nSecondly, the retrospective design of our study relied on electronic prescription records, which may have missed non-prescribed medications, and the lack of adherence data could have affected the accuracy of the findings. Thirdly, as this was an observational study, it cannot establish causality. Future studies should include interviews on medication use and adherence to provide a more accurate and up-to-date assessment of anticholinergic exposure.\n\nAnticholinergic Burden and Its Association with Hospitalisation Risk and Causes of Admission in Older Adults with Mild Cognitive Impairment or Dementia\nConclusion\nAnticholinergic burden is observed in one-third of older adults with MCI or dementia in our setting. While no overall association with hospitalisation was found, higher ACB scores were linked to an increased risk of cardiovascular events and infected pressure ulcers among those who were hospitalised. Future research is needed to assess the long-term impact of anticholinergic burden. Pharmacist-led interventions, including medication reviews and dementia care education, may support successful deprescribing efforts and help reduce anticholinergic burden.", "doc_items_refs": ["#/texts/253", "#/texts/254", "#/texts/255", "#/texts/257"], "page_nos": [], "uuid": "1c8a9b09-c12c-4d7d-afc3-618c27c43f6b"}
{"doc_id": "2025__Anticholinergic_Burden_and_Its_Association_with_Hospitalisation_Risk_and_Causes___W4414468114", "source_path": "<redacted:source_path>", "chunk_id": 17, "source_chunk_idxs": [28, 29, 30, 31], "num_tokens": 327, "text": "Anticholinergic Burden and Its Association with Hospitalisation Risk and Causes of Admission in Older Adults with Mild Cognitive Impairment or Dementia\nAcknowledgments\nThe authors wish to thank Kon Yuen Yin for aiding in the data collection phase. The authors acknowledge that an unauthorized version of the MMSE was used by the study team without permission, however this has now been rectified with PAR. The MMSE is a copyrighted instrument and may not be used or reproduced in whole or in part, in any form or language, or by any means without written permission of PAR (\nwww.parinc.com\n).\n\nAnticholinergic Burden and Its Association with Hospitalisation Risk and Causes of Admission in Older Adults with Mild Cognitive Impairment or Dementia\nAuthor Contributions\nAll authors made a significant contribution to the work reported, whether that is in the conception, study design, execution, acquisition of data, analysis and interpretation, or in all these areas; took part in drafting, revising or critically reviewing the article; gave final approval of the version to be published; have agreed on the journal to which the article has been submitted; and agree to be accountable for all aspects of the work.\n\nAnticholinergic Burden and Its Association with Hospitalisation Risk and Causes of Admission in Older Adults with Mild Cognitive Impairment or Dementia\nFunding\nThe study was funded by the University Malaya Impact Oriented Interdisciplinary Research Grant (IIRG003A-2021HWB).\n\nAnticholinergic Burden and Its Association with Hospitalisation Risk and Causes of Admission in Older Adults with Mild Cognitive Impairment or Dementia\nDisclosure\nAll authors declare no conflicts of interest in this work.", "doc_items_refs": ["#/texts/259", "#/texts/260", "#/texts/261", "#/texts/263", "#/texts/265", "#/texts/267"], "page_nos": [], "uuid": "329f4d91-e8d6-43d7-892b-3758948e3369"}
{"doc_id": "2025__Anticholinergic_Burden_and_Its_Association_with_Hospitalisation_Risk_and_Causes___W4414468114", "source_path": "<redacted:source_path>", "chunk_id": 18, "source_chunk_idxs": [32], "num_tokens": 498, "text": "Anticholinergic Burden and Its Association with Hospitalisation Risk and Causes of Admission in Older Adults with Mild Cognitive Impairment or Dementia\nReferences\n1.\nTaylor-Rowan M, Edwards S, Noel-Storr AH, et al. Anticholinergic burden (prognostic factor) for prediction of dementia or cognitive decline in older adults with no known cognitive syndrome.\nCochrane Database Syst Rev\n. 2021;5(5):Cd013540. doi:10.1002/14651858.CD013540.pub2\n2.\nTaylor-Rowan M, Kraia O, Kolliopoulou C, et al. Anticholinergic burden for prediction of cognitive decline or neuropsychiatric symptoms in older adults with mild cognitive impairment or dementia.\nCochrane Database Syst Rev\n. 2022;8(8):Cd015196. doi:10.1002/14651858.CD015196.pub2\n3.\nBishara D, Harwood D, Sauer J, Taylor DM. Anticholinergic effect on cognition (AEC) of drugs commonly used in older people.\nInt J Geriatr Psychiatry\n. 2017;32(6):650-656. doi:10.1002/gps.4507\n4.\nCross AJ, George J, Woodward MC, et al. Potentially inappropriate medications and anticholinergic burden in older people attending memory clinics in Australia.\nDrugs Aging\n. 2016;33(1):37-44. doi:10.1007/s40266-015-0332-3\n5.\nReallon E, Gervais F, Moutet C, et al. Impact of cumulative exposure to anticholinergic and sedative drugs on cognition in older adults: a memory clinic cohort study.\nAlzheimers Res Ther\n. 2024;16(1):163. doi:10.1186/s13195-024-01530-8\n6.\nCross AJ, Villani ER, Jadczak AD, et al. Prevalence of strong anticholinergic use in residents with and without cognitive impairment and frailty: analysis from 106 nursing homes in 12 Asia-Pacific and European countries.\nArch Gerontol Geriatr\n. 2025;128:105636. doi:10.1016/j.archger.2024.105636", "doc_items_refs": ["#/texts/269", "#/texts/270", "#/texts/271", "#/texts/272", "#/texts/273", "#/texts/274", "#/texts/275", "#/texts/276", "#/texts/277", "#/texts/278", "#/texts/279", "#/texts/280", "#/texts/281", "#/texts/282", "#/texts/283", "#/texts/284", "#/texts/285", "#/texts/286", "#/texts/287", "#/texts/288", "#/texts/289", "#/texts/290", "#/texts/291", "#/texts/292"], "page_nos": [], "uuid": "b6a4659d-7306-4e39-87a0-000f5f8bd488"}
{"doc_id": "2025__Anticholinergic_Burden_and_Its_Association_with_Hospitalisation_Risk_and_Causes___W4414468114", "source_path": "<redacted:source_path>", "chunk_id": 19, "source_chunk_idxs": [33], "num_tokens": 498, "text": "Anticholinergic Burden and Its Association with Hospitalisation Risk and Causes of Admission in Older Adults with Mild Cognitive Impairment or Dementia\nReferences\n7.\nWang K, Alan J, Page AT, Dimopoulos E, Etherton-Beer C. Anticholinergics and clinical outcomes amongst people with pre-existing dementia: a systematic review.\nMaturitas\n. 2021;151:1-14. doi:10.1016/j.maturitas.2021.06.004\n8.\nGamble DT, Clark AB, Luben RN, Wareham NJ, Khaw KT, Myint PK. Baseline anticholinergic burden from medications predicts incident fatal and non-fatal stroke in the EPIC-Norfolk general population.\nInt J Epidemiol\n. 2018;47(2):625-633. doi:10.1093/ije/dyx265\n9.\nMyint PK, Fox C, Kwok CS, Luben RN, Wareham NJ, Khaw KT. Total anticholinergic burden and risk of mortality and cardiovascular disease over 10 years in 21,636 middle-aged and older men and women of EPIC-Norfolk prospective population study.\nAge Ageing\n. 2015;44(2):219-225. doi:10.1093/ageing/afu185\n10.\nFogg C, Griffiths P, Meredith P, Bridges J. Hospital outcomes of older people with cognitive impairment: an integrative review.\nInt J Geriatr Psychiatry\n. 2018;33(9):1177-1197. doi:10.1002/gps.4919\n11.\nHook A, Randall JL, Grubb CM, et al. Anti-cholinergic drug burden in patients with dementia increases after hospital admission: a multicentre cross-sectional study.\nBMC Geriatr\n. 2022;22(1):783. doi:10.1186/s12877-022-03235-9\n12.\nO'Mahony D, Cherubini A, Guiteras AR, et al. STOPP/START criteria for potentially inappropriate prescribing in older people: version 3.\nEur Geriatr Med\n. 2023;14(4):625-632. doi:10.1007/s41999-023-00777-y", "doc_items_refs": ["#/texts/293", "#/texts/294", "#/texts/295", "#/texts/296", "#/texts/297", "#/texts/298", "#/texts/299", "#/texts/300", "#/texts/301", "#/texts/302", "#/texts/303", "#/texts/304", "#/texts/305", "#/texts/306", "#/texts/307", "#/texts/308", "#/texts/309", "#/texts/310", "#/texts/311", "#/texts/312", "#/texts/313", "#/texts/314", "#/texts/315", "#/texts/316"], "page_nos": [], "uuid": "a679d60f-6649-4aa3-b2a9-ff4d63a1e4b8"}
{"doc_id": "2025__Anticholinergic_Burden_and_Its_Association_with_Hospitalisation_Risk_and_Causes___W4414468114", "source_path": "<redacted:source_path>", "chunk_id": 20, "source_chunk_idxs": [34], "num_tokens": 444, "text": "Anticholinergic Burden and Its Association with Hospitalisation Risk and Causes of Admission in Older Adults with Mild Cognitive Impairment or Dementia\nReferences\n13.\nThe 2023 American Geriatrics Society Beers Criteria® Update Expert Panel. American Geriatrics Society 2023 updated AGS Beers Criteria\n®\nfor potentially inappropriate medication use in older adults.\nJ Am Geriatr Soc\n. 2023;71(7):2052-2081. doi:10.1111/jgs.18372\n14.\nRosli R, Goodson M, Tan MP, et al. Challenges and research priorities for dementia care in Malaysia from the perspective of health and allied health professionals.\nInt J Environ Res Public Health\n. 2021;18(21):11010. doi:10.3390/ijerph182111010\n15.\nAlzheimer's Disease International. Dementia in the Asia Pacific region 2014. Available from:\nhttps://www.alzint.org/resource/dementia-in-the-asia-pacific-region/\n. Accessed August 26 , 2025 .\n16.\nHilmer SN, Gnjidic D. The anticholinergic burden: from research to practice.\nAust Prescr\n. 2022;45(4):118-120. doi:10.18773/austprescr.2022.031\n17.\nChan YM, Ganapathy SS, Tan L, Alias N, Nasaruddin NH, Khaw WF. The burden of premature mortality among older adults: a population-based study in Malaysia.\nBMC Public Health\n. 2022;22(1):1181. doi:10.1186/s12889-022-13608-9\n18.\nSela-Katz P, Rabinowitz I, Shugaev I, Shigorina G. Basic knowledge of the medication regimen correlates with performance on cognitive function tests and diagnosis of dementia in elderly patients referred to a geriatric assessment unit.\nGerontology\n. 2010;56(5):491-495. doi:10.1159/000304738", "doc_items_refs": ["#/texts/317", "#/texts/318", "#/texts/319", "#/texts/320", "#/texts/321", "#/texts/322", "#/texts/323", "#/texts/324", "#/texts/325", "#/texts/326", "#/texts/327", "#/texts/328", "#/texts/329", "#/texts/330", "#/texts/331", "#/texts/332", "#/texts/333", "#/texts/334", "#/texts/335", "#/texts/336", "#/texts/337", "#/texts/338", "#/texts/339", "#/texts/340", "#/texts/341", "#/texts/342"], "page_nos": [], "uuid": "92b9e645-9487-4f11-9151-05789a5ae4d7"}
{"doc_id": "2025__Anticholinergic_Burden_and_Its_Association_with_Hospitalisation_Risk_and_Causes___W4414468114", "source_path": "<redacted:source_path>", "chunk_id": 21, "source_chunk_idxs": [35], "num_tokens": 486, "text": "Anticholinergic Burden and Its Association with Hospitalisation Risk and Causes of Admission in Older Adults with Mild Cognitive Impairment or Dementia\nReferences\n19.\nSimoes EJ, Kobau R, Kapp J, Waterman B, Mokdad A, Anderson L. Associations of physical activity and body mass index with activities of daily living in older adults.\nJ Community Health\n. 2006;31(6):453-467. doi:10.1007/s10900-006-9024-6\n20.\nKim B, Noh GO, Kim K. Behavioural and psychological symptoms of dementia in patients with Alzheimer's disease and family caregiver burden: a path analysis.\nBMC Geriatr\n. 2021;21(1):160. doi:10.1186/s12877-021-02109-w\n21.\nBoustani M, Campbell N, Munger S, Maidment I, Fox C. Impact of anticholinergics on the aging brain: a review and practical application.\nAging Health\n. 2008;4(3):311-320. doi:10.2217/1745509x.4.3.311\n22.\nCancelli I, Beltrame M, D'Anna L, Gigli GL, Valente M. Drugs with anticholinergic properties: a potential risk factor for psychosis onset in Alzheimer's disease?\nExpert Opin Drug Saf\n. 2009;8(5):549-557. doi:10.1517/14740330903099636\n23.\nJaidi Y, Guilloteau A, Nonnonhou V, et al. Threshold for a reduction in anticholinergic burden to decrease behavioral and psychological symptoms of dementia.\nJ Am Med Dir Assoc\n. 2019;20(2):159-164e3. doi:10.1016/j.jamda.2018.10.015\n24.\nJaidi Y, Nonnonhou V, Kanagaratnam L, et al. Reduction of the anticholinergic burden makes it possible to decrease behavioral and psychological symptoms of dementia.\nAm J Geriatr Psychiatry\n. 2018;26(3):280-288. doi:10.1016/j.jagp.2017.08.005", "doc_items_refs": ["#/texts/343", "#/texts/344", "#/texts/345", "#/texts/346", "#/texts/347", "#/texts/348", "#/texts/349", "#/texts/350", "#/texts/351", "#/texts/352", "#/texts/353", "#/texts/354", "#/texts/355", "#/texts/356", "#/texts/357", "#/texts/358", "#/texts/359", "#/texts/360", "#/texts/361", "#/texts/362", "#/texts/363", "#/texts/364", "#/texts/365", "#/texts/366"], "page_nos": [], "uuid": "46d4a0f4-2f63-40b6-8fd5-859451b33be8"}
{"doc_id": "2025__Anticholinergic_Burden_and_Its_Association_with_Hospitalisation_Risk_and_Causes___W4414468114", "source_path": "<redacted:source_path>", "chunk_id": 22, "source_chunk_idxs": [36], "num_tokens": 493, "text": "Anticholinergic Burden and Its Association with Hospitalisation Risk and Causes of Admission in Older Adults with Mild Cognitive Impairment or Dementia\nReferences\n25.\nRiis J, Kragholm K, Søndergaard MM, et al. Cardiovascular risk associated with changes in anticholinergic load on four different scales: a registry-based cohort study of geriatric outpatients.\nAge Ageing\n. 2024;53(7). doi:10.1093/ageing/afae151\n26.\nHuang WC, Yang AS, Tsai DH, Shao SC, Lin SJ, Lai EC. Association between recently raised anticholinergic burden and risk of acute cardiovascular events: nationwide case-case-time-control study.\nBMJ\n. 2023;382:e076045. doi:10.1136/bmj-2023-076045\n27.\nFluck D, Lisk R, Yeong K, Robin J, Fry CH, Han TS. Association of polypharmacy and anticholinergic burden with length of stay in hospital amongst older adults admitted with hip fractures: a retrospective observational study.\nCalcif Tissue Int\n. 2023;112(5):584-591. doi:10.1007/s00223-023-01072-5\n28.\nBraithwaite E, Todd OM, Atkin A, et al. Interventions for reducing anticholinergic medication burden in older adults-a systematic review and meta-analysis.\nAge Ageing\n. 2023;52(9). doi:10.1093/ageing/afad176\n29.\nDharmarajan TS, Choi H, Hossain N, et al. Deprescribing as a clinical improvement focus.\nJ Am Med Dir Assoc\n. 2020;21(3):355-360. doi:10.1016/j.jamda.2019.08.031\n30.\nNguyen TA, Gilmartin-Thomas J, Tan ECK, et al. The impact of pharmacist interventions on quality use of medicines, quality of life, and health outcomes in people with dementia and/or cognitive impairment: a systematic review.\nJ Alzheimers Dis\n. 2019;71(1):83-96. doi:10.3233/jad-190162", "doc_items_refs": ["#/texts/367", "#/texts/368", "#/texts/369", "#/texts/370", "#/texts/371", "#/texts/372", "#/texts/373", "#/texts/374", "#/texts/375", "#/texts/376", "#/texts/377", "#/texts/378", "#/texts/379", "#/texts/380", "#/texts/381", "#/texts/382", "#/texts/383", "#/texts/384", "#/texts/385", "#/texts/386", "#/texts/387", "#/texts/388", "#/texts/389", "#/texts/390"], "page_nos": [], "uuid": "c596dcd9-bf78-43ce-afb5-521be34093e7"}
{"doc_id": "2025__Anticholinergic_Burden_and_Its_Association_with_Hospitalisation_Risk_and_Causes___W4414468114", "source_path": "<redacted:source_path>", "chunk_id": 23, "source_chunk_idxs": [37, 38, 39], "num_tokens": 359, "text": "Anticholinergic Burden and Its Association with Hospitalisation Risk and Causes of Admission in Older Adults with Mild Cognitive Impairment or Dementia\nReferences\n31.\nLisibach A, Benelli V, Ceppi MG, Waldner-Knogler K, Csajka C, Lutters M. Quality of anticholinergic burden scales and their impact on clinical outcomes: a systematic review.\nEur J Clin Pharmacol\n. 2021;77(2):147-162. doi:10.1007/s00228-020-02994-x\n© 2025 The Author(s).  This work is published and licensed by Dove Medical Press Limited. The\nfull terms of this license are available at\nhttps://www.dovepress.com/terms.php\nand incorporate the\nCreative Commons Attribution\n- Non Commercial (unported, 4.0) License\n.\nBy accessing the work you hereby accept the Terms. Non-commercial uses of the work are permitted\nwithout any further permission from Dove Medical Press Limited, provided the work is properly\nattributed. For permission for commercial use of this work, please see paragraphs 4.2 and 5 of\nour Terms\n.\nCreative Commons License\nDownload Article [PDF]\n\nAnticholinergic Burden and Its Association with Hospitalisation Risk and Causes of Admission in Older Adults with Mild Cognitive Impairment or Dementia\nRecommended articles\nReview\n\nAnticholinergic Burden and Its Association with Hospitalisation Risk and Causes of Admission in Older Adults with Mild Cognitive Impairment or Dementia\nRecommended articles\nCurrent Understanding of Verbal Fluency in Alzheimer's Disease: Evidence to Date\nWright LM, De Marco M, Venneri A\nPsychology Research and Behavior Management\n2023\n, 16:1691-1705\nPublished Date:\n5 May 2023\nOriginal Research", "doc_items_refs": ["#/texts/391", "#/texts/392", "#/texts/393", "#/texts/394", "#/texts/395", "#/texts/396", "#/texts/397", "#/texts/398", "#/texts/399", "#/texts/400", "#/texts/401", "#/texts/402", "#/texts/403", "#/texts/404", "#/texts/405", "#/texts/406", "#/texts/407", "#/texts/408", "#/texts/410", "#/texts/412", "#/texts/413", "#/texts/414", "#/texts/415", "#/texts/416", "#/texts/417", "#/texts/418"], "page_nos": [], "uuid": "d568ddf4-158e-4261-b4a6-b75d2faea9d4"}
{"doc_id": "2025__Anticholinergic_Burden_and_Its_Association_with_Hospitalisation_Risk_and_Causes___W4414468114", "source_path": "<redacted:source_path>", "chunk_id": 24, "source_chunk_idxs": [40], "num_tokens": 257, "text": "Anticholinergic Burden and Its Association with Hospitalisation Risk and Causes of Admission in Older Adults with Mild Cognitive Impairment or Dementia\nRecommended articles\nHospitalisation Trends for Choroid and Retina Diseases in the Past 20 Years: An Ecological Study in Australia\nNaqeeb MR, Naser AY\nClinical Optometry\n2023\n, 15:247-259\nPublished Date:\n17 October 2023\nContact Us\n•\nPrivacy Policy\n•\nAssociations &amp; Partners\n•\nTestimonials\n•\nTerms &amp; Conditions\n•\nRecommend this site\n•\nCookies\n•\nTop\nContact Us\n•\nPrivacy Policy\n© Copyright 2025\n•\nDove Medical Press Ltd\n•\nphp coding\nby phplab.nz • Web Design by\nAdhesion\nThe opinions expressed in all articles published here are those of the specific author(s), and do not necessarily reflect the views of Dove Medical Press Ltd or any of its employees.\nDove Medical Press is part of Taylor &amp; Francis Group, the Academic Publishing Division of Informa PLC Copyright 2025 Informa PLC. All rights reserved. This site is owned and operated by Informa PLC ( \"Informa\") whose registered office is 5 Howick Place, London SW1P 1WG. Registered in England and Wales. Number 3099067. UK VAT Group: GB 365 4626 36", "doc_items_refs": ["#/texts/420", "#/texts/421", "#/texts/422", "#/texts/423", "#/texts/424", "#/texts/425", "#/texts/426", "#/texts/427", "#/texts/428", "#/texts/429", "#/texts/430", "#/texts/431", "#/texts/432", "#/texts/433", "#/texts/434", "#/texts/435", "#/texts/436", "#/texts/437", "#/texts/438", "#/texts/439", "#/texts/440", "#/texts/441", "#/texts/442", "#/texts/443", "#/texts/444", "#/texts/445", "#/texts/446", "#/texts/447", "#/texts/448", "#/texts/449", "#/texts/450", "#/texts/451", "#/texts/452"], "page_nos": [], "uuid": "7a73731c-8520-4710-a873-5d5d21e4b48b"}
