{"doc_id": "2025__Editorial_The_open_challenges_of_cognitive_frailty_risk_factors_neuropsychologic__W4413303148", "source_path": "<redacted:source_path>", "chunk_id": 0, "source_chunk_idxs": [0, 1, 2, 3, 4], "num_tokens": 349, "text": "&lt;!-- image --&gt;\n&lt;!-- image --&gt;\n\nOPEN ACCESS\nEDITED AND REVIEWED BY Kristy A. Nielson, Marquette University, United States\n*CORRESPONDENCE Simone Varrasi\nsimone.varrasi@unit.ic.ut\nRECEIVED 04 August 2025\nACCEPTED 11 August 2025\nPUBLISHED 19 August 2025\n\nCITATION\nVarrasi S, Castellano S and Magistro D (2025) Editorial: The open challenges of cognitive frailty: risk factors, neuropsychological profiles and psychometric assessment for healthy aging. Front. Aging Neurosci. 17:16979406. doi: 10.3389/fnagi.2025.16979406\n\nCOPYRIGHT\n© 2025 Varrasi, Castellano and Magistro. This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms.\n\nEditorial: The open challenges of cognitive frailty: risk factors, neuropsychological profiles and psychometric assessment for healthy aging\nSimone Varrasi 1 *, Sabrina Castellano 1 and Daniele Magistro 2\n1 Department of Educational Sciences, University of Catania, Catania, Italy, 2 School of Health Sciences, University of Southampton, Southampton, United Kingdom\nKEYWORDS\ncognitive frailty (CF), aging, health, quality of life, cognition", "doc_items_refs": ["#/pictures/0", "#/pictures/1", "#/texts/1", "#/texts/2", "#/texts/3", "#/texts/4", "#/texts/5", "#/texts/6", "#/texts/8", "#/texts/10", "#/texts/15", "#/texts/16", "#/texts/17", "#/texts/18"], "page_nos": [1], "uuid": "2c48321b-defd-4ffe-8ac5-c53a6bad6abb"}
{"doc_id": "2025__Editorial_The_open_challenges_of_cognitive_frailty_risk_factors_neuropsychologic__W4413303148", "source_path": "<redacted:source_path>", "chunk_id": 1, "source_chunk_idxs": [5], "num_tokens": 438, "text": "Editorial on the Research Topic\nThe open challenges of cognitive frailty: risk factors, neuropsychological profiles and psychometric assessment for healthy aging\nCognitive frailty (CF), defined as the co-occurrence of physical frailty and mild cognitive impairment in the absence of dementia, has emerged as a critical concept in aging research. As populations grow older worldwide, there is increasing recognition that age-related decline is rarely confined to a single domain. Rather, it involves complex and overlapping deteriorations in physical health, cognitive function, psychosocial wellbeing, and functional capacity. Cognitive frailty captures this intersection, offering a holistic lens through which to understand vulnerability in later life. However, despite its growing prominence, cognitive frailty remains a contested and evolving construct. Key challenges persist regarding its operational definition, the selection of appropriate and sensitive assessment tools, and the identification of intervention strategies that are both scalable and person-centered. Existing approaches often rely on cognitive screening instruments or physical frailty models developed in isolation, which may not fully reflect the multidimensional nature of CF. Moreover, variation in the criteria used to diagnose CF across studies has made it difficult to build a coherent body of evidence and translate findings into practical guidance for clinicians or policymakers.\nRecognizing these gaps, this Research Topic was conceived to bring together new research, methodological advancements, and interdisciplinary perspectives that can move the field forward. The Research Topic includes contributions from epidemiology, neuropsychology, gerontology, digital health, and rehabilitation sciences, offering both theoretical insights and applied findings. Specific areas addressed include the identification of modifiable risk factors, the development of functional and ecological assessments, the role of biomarkers and brain imaging, and the evaluation of technologyenhanced interventions.\nTogether, the articles in this Research Topic reflect a shared commitment to redefining cognitive frailty not only as a clinical condition, but as a dynamic and potentially reversible state. In doing so, they support a broader vision of healthy aging, one that prioritizes early detection, personalized care, and the integration of physical, cognitive, and social health domains.", "doc_items_refs": ["#/texts/20", "#/texts/21", "#/texts/22", "#/texts/23"], "page_nos": [1], "uuid": "e3e20b2f-dba5-4b07-9ed7-6799ac40f1a6"}
{"doc_id": "2025__Editorial_The_open_challenges_of_cognitive_frailty_risk_factors_neuropsychologic__W4413303148", "source_path": "<redacted:source_path>", "chunk_id": 2, "source_chunk_idxs": [6, 7, 8], "num_tokens": 267, "text": "Beyond screening: functionally grounded assessment and neuropsychological profiling\nWhile cognitive screening tools such as the MoCA are widely used, they may not capture functional impairments relevant to everyday living. Marks et al. demonstrate that performance-based assessments of instrumental activities of daily living (IADLs) identify limitations even among individuals who score within normative cognitive ranges, suggesting that a combined approach to assessment is essential for detecting subtle forms of CF.\n\nConsensus and co-creation in interventions\nTo address the absence of standardized intervention frameworks, Holland et al. convened a Delphi consensus panel involving clinicians, researchers, carers, and individuals with lived experience. The resulting 89 statements establish a foundation for evidence-based prevention and care strategies, highlighting the importance of participatory design in tackling complex aging syndromes.\n\nPsychosocial and sensory pathways to frailty\nThis Research Topic highlights how psychological distress and sensory loss intersect with frailty and cognitive decline. Mao et al. reveal that dual sensory impairment extracts its cognitive effects through anxiety and depression, moderated by frailty. Li et al. corroborate this by showing a robust link between chronic pain and CF. Additionally, Huang et al. find that short sleep duration is associated with increased frailty risk, reinforcing the role of lifestyle factors in CF onset.", "doc_items_refs": ["#/texts/27", "#/texts/29", "#/texts/31"], "page_nos": [1], "uuid": "f51b9e4f-5734-4296-b16c-664779b1ad23"}
{"doc_id": "2025__Editorial_The_open_challenges_of_cognitive_frailty_risk_factors_neuropsychologic__W4413303148", "source_path": "<redacted:source_path>", "chunk_id": 3, "source_chunk_idxs": [9, 10, 11], "num_tokens": 403, "text": "Sociodemographic disparities and health inequities\nSeveral studies explore the structural drivers of CF. Zhang et al. report high prevalence rates of physical and cognitive impairment among older adults in southern China, with strong associations to income, rural residence, social support, and depressive symptoms. Ran et al. extend this analysis through joint longitudinal-survival models, showing that socioeconomic and behavioral risk factors, such as smoking and low education, exert persistent, and often sex-specific, effects on cognition. Mirkovic et al. similarly find that social support and educational level strongly correlate with memory performance among older adults in Serbia.\n\nMetabolic and somatic contributors to cognitive decline\nThe metabolic underpinnings of CF are becoming clearer. Luo et al. show that higher estimated glucose disposal rate (eGDR), a\nproxy for insulin sensitivity, is protective against cognitive decline, especially in women. Guo et al. identify an inverted U-shaped association between the Body Roundness Index and cognitive function, with mid-range values associated with the lowest risk, suggesting metabolic phenotype may serve as an early indicator of CF.\n\nNeurovascular, imaging, and biomarker innovations\nNeurovascular integrity also appears relevant to CF. In Duan et al., extracranial -intracranial bypass surgery is associated with improved cognitive outcomes in elderly patients with cerebral steno-occlusive disease. Zhang et al. find that elevated serum levels of glial fibrillary acidic protein (GFAP) correlate with hippocampal subregion atrophy in individuals with MCI, proposing GFAP as a viable blood-based biomarker for early detection.\nFurther, Zhang et al. use Mendelian randomization to identify associations between frailty and cortical structure, while Chen et al. uncover shared genetic loci between body mass index and cognitive performance, highlighting TUFM and MST1R as potential targets for intervention.", "doc_items_refs": ["#/texts/33", "#/texts/35", "#/texts/39", "#/texts/41", "#/texts/42"], "page_nos": [1], "uuid": "00427c86-7cb4-4d80-a021-bd7674e897e2"}
{"doc_id": "2025__Editorial_The_open_challenges_of_cognitive_frailty_risk_factors_neuropsychologic__W4413303148", "source_path": "<redacted:source_path>", "chunk_id": 4, "source_chunk_idxs": [12, 13], "num_tokens": 222, "text": "Post-stroke cognitive impairment and technological interventions\nThe lasting impact of stroke on cognitive health is reviewed in a bibliometric analysis by Zhang et al., which highlights cerebral small vessel disease as a major contributor to post-stroke cognitive impairment (PSCI). In an interventional study, Xue et al. show that ultrasound-guided stellate ganglion block reduces postoperative cognitive dysfunction by lowering inflammation and oxidative stress. In the realm of digital diagnostics, Tascedda et al. demonstrate the value of artificial intelligence, particularly graph neural networks, specifically Multi-Layer Perceptron, for differentiating Alzheimer ' s disease from MCI. Their work supports the growing use of AI in early and precise dementia diagnosis.\n\nPhysical function, working memory, and daily functioning\nZhou et al. show a strong association between higher frailty index scores and reduced performance across multiple cognitive domains. Liao et al. further demonstrate that muscle strength influences working memory and, in turn, affects capacity for activities of daily living -supporting the rationale for integrated physical and cognitive interventions in older adults.", "doc_items_refs": ["#/texts/44", "#/texts/46"], "page_nos": [1], "uuid": "99cf564c-46ae-4280-90cc-9ddcd772eeaa"}
{"doc_id": "2025__Editorial_The_open_challenges_of_cognitive_frailty_risk_factors_neuropsychologic__W4413303148", "source_path": "<redacted:source_path>", "chunk_id": 5, "source_chunk_idxs": [14], "num_tokens": 322, "text": "Conclusion\nThis Research Topic brings into focus the multidimensionality and modifiability of cognitive frailty. Across biological, psychological, and social domains, the contributions highlight CF as a complex yet tractable condition, one that demands nuanced\napproaches to detection, prevention, and care. Together, these studies reinforce the view that cognitive frailty should not be regarded as an inevitable consequence of aging, but rather as a dynamic and potentially reversible state.\nThe Research Topic demonstrates the value of integrated assessment tools that move beyond screening and incorporate functional, neuropsychological, and ecological measures. It also underscores the importance of co-designed interventions that reflect the lived experiences of older adults, caregivers, and health professionals. Novel contributions from neuroimaging, biomarker research, and artificial intelligence point to promising frontiers in the early identification and personalized management of CF.\nEqually, the findings call attention to persistent inequalities in access to healthcare, education, and social support that may shape the trajectories of frailty and cognitive decline. Addressing cognitive frailty, therefore, also requires attention to its social determinants, ensuring that future strategies are inclusive, equitable, and community-responsive.\nTaken together, this Research Topic Collection offers a strong foundation for future work. It encourages the development of interdisciplinary frameworks and stakeholder-informed practices that can better support cognitive resilience in later life. As the field continues to evolve, efforts to clarify, operationalize, and address cognitive frailty will be essential to advancing the broader goal of healthy aging.", "doc_items_refs": ["#/texts/48", "#/texts/51", "#/texts/52", "#/texts/53", "#/texts/54"], "page_nos": [1], "uuid": "57a81313-4935-4e0a-a22b-1c4b45a7ff19"}
{"doc_id": "2025__Editorial_The_open_challenges_of_cognitive_frailty_risk_factors_neuropsychologic__W4413303148", "source_path": "<redacted:source_path>", "chunk_id": 6, "source_chunk_idxs": [15, 16, 17, 18], "num_tokens": 259, "text": "Author contributions\nSV: Conceptualization, Methodology, Writing - original draft. SC: Investigation, Project administration, Writing -review\n&amp; editing. DM: Conceptualization, Methodology, Supervision, Writing - review &amp; editing.\n\nConflict of interest\nThe authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest.\nThe author(s) declared that they were an editorial board member of Frontiers, at the time of submission. This had no impact on the peer review process and the final decision.\n\nGenerative AI Statement\nThe author(s) declare that no Gen AI was used in the creation of this manuscript.\nAny alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us.\n\nPublisher's note\nAll claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher.", "doc_items_refs": ["#/texts/56", "#/texts/60", "#/texts/62", "#/texts/63", "#/texts/65", "#/texts/66", "#/texts/68"], "page_nos": [1], "uuid": "04b05ef3-e3c7-418d-a2bd-dbdad83df284"}
