{"doc_id": "2025__GLP-1_receptor_agonists_in_delirium_and_encephalopathies_a_neuroprotective_scopi__W4412779459", "source_path": "<redacted:source_path>", "chunk_id": 0, "source_chunk_idxs": [0, 1], "num_tokens": 266, "text": "GLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review | Discover Medicine\nSkip to main content\nAdvertisement\nLog in\nMenu\nFind a journal\nPublish with us\nTrack your research\nSearch\nCart\n1. Home\n2. Discover Medicine\n3. Article\n\nGLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\n- Review\n- Open access\n- Published: 31 July 2025\n- Volume 2 , article number 207 , ( 2025 )\n- Cite this article\nDownload PDF\nYou have full access to this\nopen access\narticle\nDiscover Medicine\nAims and scope\nSubmit manuscript\nGLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\nDownload PDF\n- Francisco Mercado\nORCID: orcid.org/0000-0003-0091-0082\n1\n,\n2\n,\n- Michaela Kop\nORCID: orcid.org/0000-0001-6964-0573\n1\n&amp;\n- Michelle Trinh\nORCID: orcid.org/0009-0000-1148-1493\n1\n- 502 Accesses\n- Explore all metrics", "doc_items_refs": ["#/texts/1", "#/texts/2", "#/texts/3", "#/texts/4", "#/texts/5", "#/texts/6", "#/texts/7", "#/texts/8", "#/texts/9", "#/texts/10", "#/texts/11", "#/texts/12", "#/texts/14", "#/texts/15", "#/texts/16", "#/texts/17", "#/texts/18", "#/texts/19", "#/texts/20", "#/texts/21", "#/texts/22", "#/texts/23", "#/texts/24", "#/texts/25", "#/texts/26", "#/texts/27", "#/texts/28", "#/texts/29", "#/texts/30", "#/texts/31", "#/texts/32"], "page_nos": [], "uuid": "b9e20f8e-ccfa-4027-a01a-799863fa2ea2"}
{"doc_id": "2025__GLP-1_receptor_agonists_in_delirium_and_encephalopathies_a_neuroprotective_scopi__W4412779459", "source_path": "<redacted:source_path>", "chunk_id": 1, "source_chunk_idxs": [2, 3], "num_tokens": 283, "text": "GLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\nAbstract\nBackground and Purpose\nDelirium and encephalopathy are frequent causes of hospitalization leading to functional disability and cognitive impairment. Recent studies have suggested that glucagon-like peptide-1 receptor agonists (GLP-1 RAs) may protect against neurodegeneration in conditions such as Alzheimer's dementia and Parkinson's disease. However, there is limited literature on their benefits in delirium and encephalopathy. This scoping review explores the mechanisms of GLP-1 RAs in relation to delirium and encephalopathy based on animal studies, and presents current clinical evidence on their potential benefits for managing these neurological disorders.\n\nGLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\nAbstract\nMethodology\nA literature search was conducted on PubMed, Embase, Google Scholar,Web of Science, and APA PsycInfo using search terms related to GLP-1 RAs, delirium, and encephalopathy, in which GLP-1 RAs may have potential benefits. In accordance with the Prisma-Scr guidelines, a total of 38 articles were included in the scoping review.", "doc_items_refs": ["#/texts/35", "#/texts/37"], "page_nos": [], "uuid": "a7d42f24-7942-4d01-91c1-60daf41c17c1"}
{"doc_id": "2025__GLP-1_receptor_agonists_in_delirium_and_encephalopathies_a_neuroprotective_scopi__W4412779459", "source_path": "<redacted:source_path>", "chunk_id": 2, "source_chunk_idxs": [4, 5], "num_tokens": 299, "text": "GLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\nAbstract\nResults\nThis review focuses on several key brain dysfunctions in which GLP-1 RAs may offer potential benefits. These include postoperative delirium, sepsis-associated encephalopathy, hepatic encephalopathy, hypoxia-induced encephalopathy, diabetic encephalopathy, and alcohol withdrawal syndrome. Both preclinical and clinical studies suggest that GLP-1 RAs may provide neuroprotective benefits, including anti-apoptotic, anti-inflammatory, and cognitive-enhancing properties. These neuroprotective effects are supported by the molecular and pathophysiological pathways that could serve as potential targets for GLP-1 RAs.\n\nGLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\nAbstract\nConclusion\nGLP-1 RAs may offer neuroprotective benefits in patients with postoperative delirium and encephalopathies.. Cellular benefits involve pathophysiological or molecular pathways that are shared with other biological systems. While the current evidence is based on preclinical and clinical studies, more research involving human subjects is needed to clarify the role of GLP-1 RAs in various brain dysfunctions.", "doc_items_refs": ["#/texts/39", "#/texts/41"], "page_nos": [], "uuid": "c3fff958-6674-497b-86dd-78a70a4dfb07"}
{"doc_id": "2025__GLP-1_receptor_agonists_in_delirium_and_encephalopathies_a_neuroprotective_scopi__W4412779459", "source_path": "<redacted:source_path>", "chunk_id": 3, "source_chunk_idxs": [6, 7, 8, 9], "num_tokens": 279, "text": "GLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\nAbstract\nThe Impact of GLP-1 Receptor Agonists (GLP-1 RAs) on Mental Health: A Systematic Review\nArticle\n18 September 2024\n\nGLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\nAbstract\nAre Glucagon-Like Peptide-1 (GLP-1) Receptor Agonists Central Nervous System (CNS) Penetrant: A Narrative Review\nArticle\nOpen access\n02 April 2025\n\nGLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\nAbstract\nEffects of GLP-1 receptor agonists on neurological complications of diabetes\nArticle\nOpen access\n26 May 2023\n\nGLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\nAbstract\nExplore related subjects\nDiscover the latest articles, books and news in related subjects, suggested using machine learning.\n- Alzheimer's disease\n- G protein-coupled receptors\n- Geriatric Psychiatry\n- Insulin Signalling\n- Neuroendocrinology\n- Neuropharmacology\nUse our pre-submission checklist\nAvoid common mistakes on your manuscript.", "doc_items_refs": ["#/texts/44", "#/texts/45", "#/texts/47", "#/texts/48", "#/texts/49", "#/texts/51", "#/texts/52", "#/texts/53", "#/texts/55", "#/texts/56", "#/texts/57", "#/texts/58", "#/texts/59", "#/texts/60", "#/texts/61", "#/texts/62", "#/texts/63"], "page_nos": [], "uuid": "6402b7b9-5131-4514-92de-d20614a21cbf"}
{"doc_id": "2025__GLP-1_receptor_agonists_in_delirium_and_encephalopathies_a_neuroprotective_scopi__W4412779459", "source_path": "<redacted:source_path>", "chunk_id": 4, "source_chunk_idxs": [10], "num_tokens": 432, "text": "GLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\n1 Introduction\nDelirium and encephalopathy are brain dysfunctions characterized by altered mental status, confusion, and cognitive impairment [\n1\n,\n2\n]. Delirium is a neurological syndrome characterized by an acute change in mental status with a fluctuating course, inattention, and disorganized thinking [\n3\n]. On the other hand, encephalopathy is a broad term representing a global brain disorder that can manifest as delirium, subsyndromal delirium, or even coma, depending on the severity of the underlying brain dysfunction [\n4\n,\n5\n].\nEncephalopathy and delirium are frequently observed in critically ill and elderly patients. These neurological conditions lead to poorer outcomes, including increased mortality rates, long-term cognitive impairment, and dementia [\n6\n,\n7\n,\n8\n]. These conditions often result in hospitalization, and because of their association with an increased risk of cognitive impairment, patients may require extra care or transition to long-term care facilities [\n9\n,\n10\n]. Given this background, prompt diagnosis and management are critical for improving patient outcomes [\n11\n,\n12\n].\nThe management of encephalopathy and delirium share similar principles. These include identifying and treating the underlying cause, such as infections, correcting metabolic issues, emphasizing supportive care, and promoting cerebral perfusion [\n13\n,\n14\n]. In delirium, pharmacological management, including the use of antipsychotics or dexmedetomidine, focuses on controlling agitation but may overlook the complex neurochemical pathways involved [\n15\n]. Similarly, in encephalopathy, no direct therapies targeting the neurochemical and neurotransmitter pathways are currently available [\n13\n]. Emerging research suggests that glucagon-like peptide-1 receptor agonists (GLP-1 RAs) may offer neuroprotective benefits, particularly in neurodegenerative diseases [\n16\n].", "doc_items_refs": ["#/texts/65", "#/texts/66", "#/texts/67", "#/texts/68", "#/texts/69", "#/texts/70", "#/texts/71", "#/texts/72", "#/texts/73", "#/texts/74", "#/texts/75", "#/texts/76", "#/texts/77", "#/texts/78", "#/texts/79", "#/texts/80", "#/texts/81", "#/texts/82", "#/texts/83", "#/texts/84", "#/texts/85", "#/texts/86", "#/texts/87", "#/texts/88", "#/texts/89", "#/texts/90", "#/texts/91", "#/texts/92", "#/texts/93", "#/texts/94", "#/texts/95", "#/texts/96", "#/texts/97", "#/texts/98", "#/texts/99", "#/texts/100", "#/texts/101"], "page_nos": [], "uuid": "0d49699e-4a60-432d-8e6c-0da14f2e53dc"}
{"doc_id": "2025__GLP-1_receptor_agonists_in_delirium_and_encephalopathies_a_neuroprotective_scopi__W4412779459", "source_path": "<redacted:source_path>", "chunk_id": 5, "source_chunk_idxs": [11], "num_tokens": 463, "text": "GLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\n1 Introduction\nGLP-1 receptors are present in the central nervous system and potentially mediate additional neuroprotective effects [\n17\n,\n18\n]. Activation of GLP-1 receptors in the brain regions essential for cognition and memory, such as the hippocampus, cortex, and amygdala, offers neuroprotection in animal models of neurodegenerative diseases (e.g., reducing neuroinflammation, oxidative stress, and apoptosis) [\n19\n]. Furthermore, GLP-1 RAs have become a promising therapy for managing type 2 diabetes mellitus (T2DM) and obesity [\n20\n,\n21\n]. At the molecular level, it emulates the function of the natural incretin hormone GLP-1, which is essential for regulating glucose metabolism and energy balance [\n22\n]. Moreover, GLP-1 RAs offer weight loss, reduced blood pressure, and potential cardiovascular benefits beyond glycemic control [\n23\n]. Indeed, the first GLP-1 RA (i.e., Exenatide or Ex-4) was approved by the FDA in 2005 for T2DM treatment [\n24\n]. Since then, several GLP-1 RAs drugs have become available, including Liraglutide, Semaglutide, and Dulaglutide [\n25\n,\n26\n].\nWhile recent studies have demonstrated the possible neuroprotective effects of GLP-1 RAs in neurodegenerative conditions, such as Alzheimer's dementia, there is a lack of literature reviews on their benefits in the highly neurodegenerative-related condition of delirium [\n17\n,\n18\n]. Additionally, the role and mechanism of GLP-1 RAs in certain acute global brain dysfunction conditions that manifest as delirium, such as postoperative delirium, hepatic encephalopathy, hypoxia-induced encephalopathy, alcohol withdrawal syndrome, diabetic encephalopathy, and sepsis-associated encephalopathy, remain poorly understood.", "doc_items_refs": ["#/texts/102", "#/texts/103", "#/texts/104", "#/texts/105", "#/texts/106", "#/texts/107", "#/texts/108", "#/texts/109", "#/texts/110", "#/texts/111", "#/texts/112", "#/texts/113", "#/texts/114", "#/texts/115", "#/texts/116", "#/texts/117", "#/texts/118", "#/texts/119", "#/texts/120", "#/texts/121", "#/texts/122", "#/texts/123", "#/texts/124", "#/texts/125", "#/texts/126", "#/texts/127"], "page_nos": [], "uuid": "bb4a664f-68a2-453e-a246-6c8bd89bd650"}
{"doc_id": "2025__GLP-1_receptor_agonists_in_delirium_and_encephalopathies_a_neuroprotective_scopi__W4412779459", "source_path": "<redacted:source_path>", "chunk_id": 6, "source_chunk_idxs": [12], "num_tokens": 94, "text": "GLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\n1 Introduction\nAgainst this background, this scoping review aims to clarify the pathophysiological mechanisms of GLP-1 RAs in relation to delirium and encephalopathy based on experimental animal and human models, and to provide current clinical evidence regarding their potential benefits in preventing and managing these brain dysfunctions.", "doc_items_refs": ["#/texts/128"], "page_nos": [], "uuid": "0fd8c252-6efb-4a4e-bf26-fa38fe0a08d9"}
{"doc_id": "2025__GLP-1_receptor_agonists_in_delirium_and_encephalopathies_a_neuroprotective_scopi__W4412779459", "source_path": "<redacted:source_path>", "chunk_id": 7, "source_chunk_idxs": [13], "num_tokens": 443, "text": "GLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\n2 Methodology\nThe search strategy was conducted in accordance with the PRISMA-ScR guidelines (Diagram 1) using PubMed, Embase, Web of Science, EBSCOhost (APA PsycInfo), and Google Scholar databases from the time of inception to January 23,2025. The search terms utilized, including delirium, \"acute delirium,'' ''GLP-1 RA,'' ''GLP-1 receptor agonist,'' and GLP-1 receptor agonist*,'' were carefully selected to ensure a focused and productive search. Truncation was used where appropriate in those databases that support wildcard searching, and in those that did not support truncation, separate search terms were used. Given the topic's novelty and the potential link between delirium and encephalopathy, search terms related to encephalopathy, such as ''encephalopathy'' and ''acute encephalopathy,'' were also included [\n27\n]. We also considered the names of the GLP-1 RA available on the market: Exenatide, Liraglutide, Semaglutide, Dulaglutide, Lixisenatide, and Tirzepatide.\nDiagram 1\nThe inclusion criteria were as follows: (1) animal studies, (2) human studies, (3) observational studies (cohort or case-control, cross-sectional), (4) randomized controlled trials (RCTs), (5) case reports, and (6) scoping/systemic/meta-analyses. Articles were excluded if they (1) were published before 2015, (2) were written in a non-English language, (3) had unavailable abstracts and manuscripts, (4) were poster presentations only, (5) were editorials, (6) included subjects under the age of 18 years, or (7) were guidelines or consensus reports.", "doc_items_refs": ["#/texts/130", "#/texts/131", "#/texts/132", "#/texts/133", "#/texts/134"], "page_nos": [], "uuid": "d000881c-e3b7-4d01-890e-4e957e5c4f4a"}
{"doc_id": "2025__GLP-1_receptor_agonists_in_delirium_and_encephalopathies_a_neuroprotective_scopi__W4412779459", "source_path": "<redacted:source_path>", "chunk_id": 8, "source_chunk_idxs": [14, 15], "num_tokens": 474, "text": "GLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\n2 Methodology\nFM and MK independently screened the titles and abstracts. To eliminate duplicate entries, Zotero was employed. The remaining articles were then screened independently by FM and MK based on the established inclusion and exclusion criteria. After applying these criteria, FM and MK independently extracted the data from the final set of articles included in the scoping review. MT resolved any discrepancies between the two authors.\nBased on available evidence, the following topics were identified in relation to GLP-1 RAs: postoperative delirium, sepsis-associated encephalopathy, hepatic encephalopathy, alcohol withdrawal syndrome, hypoxia-induced encephalopathy, and diabetic encephalopathy. To strengthen the study, due diligence was conducted to search for additional articles by combining the terms from each theme with GLP-1 RAs.\n\nGLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\n3 Results\nThe initial search yielded 152 studies. After removing 21 duplicates using Zotero, 131 articles were eligible for the title and abstract screening. After applying predefined selection criteria, a total of 38 articles (Supplementary Tables 1 and 2) were selected for further full-text review and data extraction.\nIn this section, six main neurologic dysfunctions or conditions identified through the literature search will each be presented as topics: postoperative delirium, sepsis-associated encephalopathy, hepatic encephalopathy, hypoxia-induced encephalopathy, diabetic encephalopathy, and alcohol withdrawal syndrome. The role of GLP-1 RA, based on preclinical (animal) and clinical (human) studies, is presented for each topic to address our first research aim. Additionally, the pathophysiological or molecular mechanism, if it exists, will be discussed to fulfill our second research aim. A simplified diagram (Fig.\n1\n) illustrates the possible pathophysiological mechanisms or pathways linking GLP-1 RA and brain dysfunction.\nFig. 1", "doc_items_refs": ["#/texts/135", "#/texts/136", "#/texts/138", "#/texts/139", "#/texts/140", "#/texts/141", "#/texts/142"], "page_nos": [], "uuid": "67d019d2-b41f-486b-9ea7-940890820f57"}
{"doc_id": "2025__GLP-1_receptor_agonists_in_delirium_and_encephalopathies_a_neuroprotective_scopi__W4412779459", "source_path": "<redacted:source_path>", "chunk_id": 9, "source_chunk_idxs": [16], "num_tokens": 483, "text": "GLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\n3 Results\n3.1 Postoperative delirium\nPostoperative delirium is a common complication of surgeries, with an estimated.\nincidence of 15% in the post-anesthesia care unit and 70% upon Intensive Care Unit (ICU) admission [\n28\n]. Among elderly patients admitted for surgery, the incidence of postoperative delirium can reach 15-53% [\n28\n]. Unfortunately, postoperative delirium poses a significant risk of adverse consequences, including increased morbidity, mortality, extended length of hospital stay, and cognitive decline [\n28\n,\n29\n]. GLP-1 RAs, owing to their potential neuroprotective effects in neurodegenerative disorders, may benefit the treatment and prevention of postoperative delirium[\n30\n].\nThe potential role of GLP-1 RAs in treating postoperative delirium has been reported in some animal studies. In aged mice undergoing cardiac surgery, delirium-like behaviors, such as anxiety and memory deficits, have been linked to A1 astrocyte activation in the hippocampus. This leads to microglial activation and glutamate accumulation, which can be mitigated by Liraglutide and Ex-4 [\n31\n,\n32\n]. Furthermore, Liraglutide reduced the heightened neuroinflammation and impaired neuronal health observed during surgery in aged mice. Neuroinflammation is eased by reduced microglial and NLRP3 inflammasome activation through the PINK1/Parkin pathway, whereas neuronal health is enhanced by increased mitophagy and synaptic plasticity[\n31\n]. In addition, Liraglutide prevents apoptosis by reducing oxidative stress and phosphorylation of tau proteins and neurofilaments in brain cells, supporting its potential neuroprotective effects [\n33\n,\n34\n]. Although these animal studies suggest a promising treatment for postoperative delirium using GLP-1 RAs, these animal models do not capture the complexity of human perioperative care, and the underlying molecular pathways remain unclear; thus, further investigation is needed for validation.", "doc_items_refs": ["#/texts/144", "#/texts/145", "#/texts/146", "#/texts/147", "#/texts/148", "#/texts/149", "#/texts/150", "#/texts/151", "#/texts/152", "#/texts/153", "#/texts/154", "#/texts/155", "#/texts/156", "#/texts/157", "#/texts/158", "#/texts/159", "#/texts/160", "#/texts/161", "#/texts/162", "#/texts/163", "#/texts/164", "#/texts/165", "#/texts/166"], "page_nos": [], "uuid": "f7b0ad7f-2ba8-4494-9be0-eecdc4ecd196"}
{"doc_id": "2025__GLP-1_receptor_agonists_in_delirium_and_encephalopathies_a_neuroprotective_scopi__W4412779459", "source_path": "<redacted:source_path>", "chunk_id": 10, "source_chunk_idxs": [17], "num_tokens": 303, "text": "GLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\n3 Results\n3.1 Postoperative delirium\nResearch on the use of GLP-1 RAs to manage delirium in humans is limited. Glucose metabolism is essential for preventing hypoglycemia and hyperglycemia, particularly with GLP-1 RA, which can mitigate the risk of postoperative delirium [\n35\n,\n36\n]. However, it is important to weigh this benefit against the potential aspiration risk associated with administering GLP-1 RA during surgery [\n37\n]. In a triple-blind randomized controlled trial involving 261 patients with diabetes undergoing cardiac surgery, the mean blood sugar level was significantly lower in the Liraglutide group (6.3 mmol/L) than in the placebo group (7.0 mmol/L), with a 95% confidence interval of 0.39-0.93 (p\n38\n]. This demonstrates the complex relationship between glucose metabolism and delirium, where excessive glucose control may not necessarily translate into improved delirium outcomes [\n39\n]. In addition, postoperative delirium is an inflammatory condition characterized by elevated levels of pro-inflammatory markers (e.g., NF-KB, TNF-α, and IL-1β), that GLP-1RAs may modulate [\n31\n,\n35\n].", "doc_items_refs": ["#/texts/167", "#/texts/168", "#/texts/169", "#/texts/170", "#/texts/171", "#/texts/172", "#/texts/173", "#/texts/174", "#/texts/175", "#/texts/176", "#/texts/177", "#/texts/178", "#/texts/179", "#/texts/180", "#/texts/181"], "page_nos": [], "uuid": "d1685b8d-c8d9-4fda-bf7a-d36bbc7e95a9"}
{"doc_id": "2025__GLP-1_receptor_agonists_in_delirium_and_encephalopathies_a_neuroprotective_scopi__W4412779459", "source_path": "<redacted:source_path>", "chunk_id": 11, "source_chunk_idxs": [18], "num_tokens": 301, "text": "GLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\n3 Results\n3.2 Sepsis-associated encephalopathy\nSepsis is characterized by a dysregulated host response to infection that can result in multiorgan dysfunction, including the brain [\n40\n,\n41\n]. During sepsis, the inflammatory response can lead to blood-brain barrier disruption, cellular exhaustion, neuroinflammation, and metabolic disturbances, all of which contribute to the development of sepsis-associated encephalopathy [\n42\n]. Sepsis-associated encephalopathy represents an acute change in the patient's cognitive state compared to the baseline and can manifest as delirium or, in severe cases, coma [\n43\n]. Longitudinal studies have indicated that sepsis survivors experience cognitive impairment, neuropsychiatric disorders, and functional disabilities [\n44\n]. Previous studies have suggested that GLP-1RAs may serve as a novel target for treating sepsis. In addition to optimizing glucose control during acute illness, GLP-1RAs may offer anti-inflammatory and neuroprotective benefits that can help prevent sepsis-associated encephalopathy [\n45\n]. However, human studies investigating the role of GLP-1RAs in sepsis-associated encephalopathy are limited, as most are preclinical and based on animal studies.", "doc_items_refs": ["#/texts/183", "#/texts/184", "#/texts/185", "#/texts/186", "#/texts/187", "#/texts/188", "#/texts/189", "#/texts/190", "#/texts/191", "#/texts/192", "#/texts/193", "#/texts/194", "#/texts/195"], "page_nos": [], "uuid": "940b58ab-d55d-4716-8b92-9700e56784b4"}
{"doc_id": "2025__GLP-1_receptor_agonists_in_delirium_and_encephalopathies_a_neuroprotective_scopi__W4412779459", "source_path": "<redacted:source_path>", "chunk_id": 12, "source_chunk_idxs": [19], "num_tokens": 452, "text": "GLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\n3 Results\n3.2 Sepsis-associated encephalopathy\nIn animal models of sepsis, treatment with GLP-1RAs has been shown to reduce neuroinflammation and neuronal degeneration, thereby improving cognitive impairment. Specifically, Liraglutide administration in septic mouse models decreased neuroinflammation by enhancing the hippocampal brain insulin pathway, lowering pro-inflammatory markers (e.g., TNF-α), and reducing glycogen synthase kinase 3 beta activity (GSK3B) levels. Subsequently, decreased neuroinflammation leads to enhanced synaptic plasticity [\n46\n]. The enhancement of insulin signaling and the reduction of GSK3β activity contribute to improved cognitive function, as indicated by lower tau phosphorylation levels, a marker of neurodegeneration. In addition, Liraglutide treatment affects proteins crucial for synaptic plasticity, such as cAMP response element-binding protein (CREB) and AMPA receptors (types of glutamate receptors). In post-septic mice, reduced phosphorylated CREB and GluA1 levels (a subunit of AMPA receptors) impair memory and learning, and Liraglutide may restore these levels and improve cognitive function [\n46\n]. Conversely, neuronal degeneration is associated with microglial activation, which leads to programmed cell death, known as apoptosis, and immunologically mediated cell death, known as necroptosis [\n19\n]. In mouse models, treatment with Liraglutide decreased both necroptosis and apoptosis in hippocampal neurons, further supporting the neuroprotective effects of GLP-1 RAs [\n19\n,\n47\n]. A critical pathway involved in necroptosis during sepsis is the reduced activity of mammalian target of rapamycin (mTOR) [\n48\n]. The mTOR-dependent pathway is a crucial molecular mechanism for cellular life and energy metabolism [\n49", "doc_items_refs": ["#/texts/196", "#/texts/197", "#/texts/198", "#/texts/199", "#/texts/200", "#/texts/201", "#/texts/202", "#/texts/203", "#/texts/204", "#/texts/205", "#/texts/206", "#/texts/207", "#/texts/208", "#/texts/209"], "page_nos": [], "uuid": "d261064f-45fb-4a4a-b318-305e291c1b65"}
{"doc_id": "2025__GLP-1_receptor_agonists_in_delirium_and_encephalopathies_a_neuroprotective_scopi__W4412779459", "source_path": "<redacted:source_path>", "chunk_id": 13, "source_chunk_idxs": [20], "num_tokens": 232, "text": "GLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\n3 Results\n3.2 Sepsis-associated encephalopathy\n]. When this pathway is activated, autophagy diminishes. Intriguingly, GLP-1 RAs, such as Ex-4, enhance mTOR activity by reducing caspases-3 and -8 levels, which are key components of apoptosis. This modulation protects neurons from necroptotic cell death in models of neurodegenerative disorders [\n19\n]. However, the intricate relationship between neuroinflammation, apoptosis, necroptosis, and mTOR activity in sepsis-induced encephalopathy is not entirely understood [\n19\n,\n48\n,\n49\n]. Furthermore, the efficacy of GLP-1 RA in treating sepsis and enhancing patient outcomes has not yet been established. Caution is warranted when translating preclinical findings to clinical practice, as further research is essential to understand their mechanisms and optimal use in sepsis-associated encephalopathy.", "doc_items_refs": ["#/texts/210", "#/texts/211", "#/texts/212", "#/texts/213", "#/texts/214", "#/texts/215", "#/texts/216", "#/texts/217", "#/texts/218"], "page_nos": [], "uuid": "51f1d058-1b15-416d-be4a-7f2aceee9e3f"}
{"doc_id": "2025__GLP-1_receptor_agonists_in_delirium_and_encephalopathies_a_neuroprotective_scopi__W4412779459", "source_path": "<redacted:source_path>", "chunk_id": 14, "source_chunk_idxs": [21], "num_tokens": 427, "text": "GLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\n3 Results\n3.3 Hepatic encephalopathy\nHepatic encephalopathy is a complex neuropsychiatric syndrome that is a significant complication of liver cirrhosis and, less frequently, of other forms of liver dysfunction [\n50\n,\n51\n]. This condition leads to cognitive issues, personality changes, and motor function difficulties [\n52\n]. Delirium is one of the manifestations of hepatic encephalopathy and, when present, is associated with higher mortality and functional decline [\n53\n,\n54\n]. Currently, options for treating hepatic encephalopathy are focused on addressing precipitating factors and using ammonia-reducing regimens [\n53\n]. However, these approaches lack long-lasting benefits; thus, exploring alternative therapies is essential in this context. GLP-1 RAs may help manage hepatic encephalopathy and reduce the risk of decompensated cirrhosis.\nA limited number of animal studies are available regarding the role of GLP-1 RAs in hepatic encephalopathy. Kjærgaard et al. (2023) explored the effects of Semaglutide, a GLP-1 RA, on cognitive dysfunction in a mouse model of non-alcoholic steatohepatitis (NASH). They found that a 10-week treatment with Semaglutide prevented cognitive decline and depression-like behaviors, primarily by reducing systemic inflammation and protecting the synaptic density in the prefrontal cortex. However, acute treatment does not have the same benefits. The study also noted that Semaglutide reduced hyperammonemia, a factor that contributes to cognitive dysfunction and hepatic encephalopathy in NASH. These results indicate that Semaglutide may have therapeutic potential for cognitive impairment in NASH; however, further clinical studies are needed to verify these effects in humans[\n55\n].", "doc_items_refs": ["#/texts/220", "#/texts/221", "#/texts/222", "#/texts/223", "#/texts/224", "#/texts/225", "#/texts/226", "#/texts/227", "#/texts/228", "#/texts/229", "#/texts/230", "#/texts/231", "#/texts/232", "#/texts/233", "#/texts/234", "#/texts/235"], "page_nos": [], "uuid": "376f36dd-b7c1-4ee9-a12f-9b47a4055723"}
{"doc_id": "2025__GLP-1_receptor_agonists_in_delirium_and_encephalopathies_a_neuroprotective_scopi__W4412779459", "source_path": "<redacted:source_path>", "chunk_id": 15, "source_chunk_idxs": [22], "num_tokens": 470, "text": "GLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\n3 Results\n3.3 Hepatic encephalopathy\nCurrent human studies indicate that GLP-1 RAs are associated with a decreased risk of hepatic encephalopathy. Several observational studies have found that patients with cirrhosis and T2DM treated with GLP-1 RAs have a significantly lower risk of hepatic encephalopathy[\n56\n,\n57\n,\n58\n]. However, the population study involved patients with a stable liver and may not be applicable to patients with decompensated cirrhosis [\n58\n]. In contrast, Simon et al. (2021) showed that the hepatoprotective benefits of GLP-1 RA persist in both compensated and decompensated cirrhosis [\n59\n].This inconsistency indicates that GLP-1 RA therapy may be protective in a range of patients with cirrhosis, reinforcing the idea that these medications can be beneficial regardless of the cirrhosis stage. In addition, this study suggests that GLP-1 RAs may provide a hepatoprotective effect that is not solely dependent on the severity of cirrhosis but also on its pharmacological properties that benefit liver function overall. In addition to their cardiovascular and metabolic benefits [\n60\n,\n61\n,\n62\n], GLP-1 RAs are associated with a lower risk of cirrhotic complications, including hepatic encephalopathy. More importantly, the safety profile of GLP-1 RA is acceptable, with non-inferior adverse events compared with sodium glucose transporter-2 inhibitor (SGLT-2i) and dipeptidyl peptidase-4 inhibitor (DPP-4i) [\n61\n]. However, liver decompensation, including ascites and hepatic encephalopathy, have been reported following significant weight loss while using Semaglutide. Discontinuing Semaglutide leads to reversal of liver decompensation [\n63\n]. Thus, a potential link between the rapid weight loss induced by GLP1 RA and liver decompensation in vulnerable individuals is possible.", "doc_items_refs": ["#/texts/236", "#/texts/237", "#/texts/238", "#/texts/239", "#/texts/240", "#/texts/241", "#/texts/242", "#/texts/243", "#/texts/244", "#/texts/245", "#/texts/246", "#/texts/247", "#/texts/248", "#/texts/249", "#/texts/250", "#/texts/251", "#/texts/252", "#/texts/253", "#/texts/254", "#/texts/255", "#/texts/256"], "page_nos": [], "uuid": "51023bdf-fbe1-4260-b852-c82bea88c066"}
{"doc_id": "2025__GLP-1_receptor_agonists_in_delirium_and_encephalopathies_a_neuroprotective_scopi__W4412779459", "source_path": "<redacted:source_path>", "chunk_id": 16, "source_chunk_idxs": [23, 24], "num_tokens": 363, "text": "GLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\n3 Results\n3.3 Hepatic encephalopathy\nSince human studies are observational and challenged by confounding factors, the results should be interpreted with caution. Although GLP-1 RA, particularly Liraglutide, offer hepatoprotective benefits through their antioxidant effects by regulating superoxide dismutase and glycated serum protein levels [\n64\n], the precise mechanisms by which GLP-1 RAs protect the liver remain unclear. More randomized controlled trials are needed to further clarify the causal benefit of GLP1 RA in association with hepatic encephalopathy.\n\nGLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\n3 Results\n3.4 Hypoxia-induced encephalopathy\nHypoxia-induced encephalopathy (HIE), caused by severely restricted or completely lost oxygen supply to the brain, results in neuronal damage and long-term neurological deficits [\n65\n]. Therapeutic hypothermia is the standard treatment for HIE [\n66\n]. However, a significant number of patients, specifically infants, still experience adverse outcomes (e.g., neurodevelopmental delay and mortality), highlighting the need for adjunctive therapies [\n66\n]. GLP-1 RAs have demonstrated potential as neuroprotective agents in various neurodegenerative disorders and brain ischemia models, possibly offering a treatment option for HIE and its long-term neurological effects[\n67\n,\n68\n].", "doc_items_refs": ["#/texts/257", "#/texts/258", "#/texts/259", "#/texts/261", "#/texts/262", "#/texts/263", "#/texts/264", "#/texts/265", "#/texts/266", "#/texts/267", "#/texts/268", "#/texts/269", "#/texts/270", "#/texts/271"], "page_nos": [], "uuid": "bcf064c7-676f-48b4-83a1-57f33f81b274"}
{"doc_id": "2025__GLP-1_receptor_agonists_in_delirium_and_encephalopathies_a_neuroprotective_scopi__W4412779459", "source_path": "<redacted:source_path>", "chunk_id": 17, "source_chunk_idxs": [25], "num_tokens": 489, "text": "GLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\n3 Results\n3.4 Hypoxia-induced encephalopathy\nSeveral animal studies have highlighted the neuroprotective benefits of GLP-1 RAs via their anti-inflammatory and anti-apoptotic effects in HIE models. For instance, the administering of Exendin-4, even six hours post-hypoxia, resulted in significant neuroprotective and anti-inflammatory effects, as evidenced by improved injury scores and reduced infarct volume [\n69\n]. This anti-inflammatory effect is linked to reduced pro-inflammatory cytokine production and microglial activation in the brain, which are key features of HIE. This study also highlights the role of GLP-1 RAs in maintaining the blood-brain barrier, lowering vascular permeability, and preventing inflammatory cell infiltration. In addition, GLP-1 RAs, such as Exendin-4, reduce neuronal death or apoptosis by activating the GLP-1R/PI3K/Akt pathway [\n70\n]. Activation of this pathway increases the expression of key proteins involved in cell survival, including PI3K, phosphorylated Akt (p-Akt), Bcl-xl, and Bcl-2, while decreasing pro-apoptotic factors, such as BAX. Exendin-4 also enhances neuroprotection following transient middle cerebral artery occlusion by increasing islet-brain 1, increasing intracellular cAMP levels through elevated GLP1R expression, and attenuating c-Jun NH2 terminal kinase (JNK), COX-2, and prostaglandin E2 [\n71\n,\n72\n]. Furthermore, in mouse models after middle cerebral artery occlusion (MCAO), Liraglutide inhibits neuronal apoptosis by reducing oxidative stress and improving mitochondrial function [\n73\n]. Lastly, animal studies suggest a synergistic benefit of GLP-1 RA administration with therapeutic hypothermia in HIE treatment. This could be due to the combined effects of reduced inflammation, promotion of neuronal survival, and improvement in cerebral blood flow [\n69\n,\n70\n,\n74\n].", "doc_items_refs": ["#/texts/272", "#/texts/273", "#/texts/274", "#/texts/275", "#/texts/276", "#/texts/277", "#/texts/278", "#/texts/279", "#/texts/280", "#/texts/281", "#/texts/282", "#/texts/283", "#/texts/284", "#/texts/285", "#/texts/286", "#/texts/287", "#/texts/288"], "page_nos": [], "uuid": "8415af3f-cf89-4742-a1df-837e00a6c759"}
{"doc_id": "2025__GLP-1_receptor_agonists_in_delirium_and_encephalopathies_a_neuroprotective_scopi__W4412779459", "source_path": "<redacted:source_path>", "chunk_id": 18, "source_chunk_idxs": [26, 27], "num_tokens": 356, "text": "GLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\n3 Results\n3.4 Hypoxia-induced encephalopathy\nClinical data on GLP-1 RAs in HIE are limited. However, available preclinical data provide a strong rationale for clinical investigations. Exenatide is a potential neuroprotective treatment for post-anoxic encephalopathy, highlighting its role in mediating glutamate release and preventing toxic overexcitation [\n75\n]. Although a clinical trial of Exenatide in patients with post-cardiac arrest did not show statistically significant effects on neuron-specific enolase levels or clinical outcomes [\n76\n], preclinical data support the need for further exploration of other GLP-1 RAs, particularly in the context of HIE.\n\nGLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\n3 Results\n3.5 Diabetic encephalopathy\nDiabetic encephalopathy is a serious complication of diabetes mellitus that results in progressive cognitive decline. This decline is caused by structural and functional changes in brain neurons [\n77\n]. Several key factors contribute to the development of diabetic encephalopathy including insulin resistance, chronic hyperglycemia, oxidative stress, and inflammation. These factors can ultimately lead to neuronal dysfunction and loss. Encouragingly, GLP-1 RAs have demonstrated promising neuroprotective benefits in diabetic encephalopathy based on both preclinical and clinical evidence.", "doc_items_refs": ["#/texts/289", "#/texts/290", "#/texts/291", "#/texts/292", "#/texts/293", "#/texts/295", "#/texts/296", "#/texts/297"], "page_nos": [], "uuid": "e311065e-4006-4316-96e4-0e343747b811"}
{"doc_id": "2025__GLP-1_receptor_agonists_in_delirium_and_encephalopathies_a_neuroprotective_scopi__W4412779459", "source_path": "<redacted:source_path>", "chunk_id": 19, "source_chunk_idxs": [28], "num_tokens": 465, "text": "GLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\n3 Results\n3.5 Diabetic encephalopathy\nPreclinical studies have demonstrated the diverse neuroprotective potential of GLP-1 RAs. Research in animals indicates that GLP-1 RAs provide various neuroprotective benefits, including anti-inflammatory effects, reduced apoptosis and oxidative stress, improved synaptic plasticity, and enhanced cognitive function [\n78\n,\n79\n,\n80\n]. Specifically, the anti-inflammatory effects of GLP-1 RAs are associated with activation of the CX3CL1-CX3CR1 pathway, which plays a crucial role in modulating microglial inflammation [\n79\n]. In animal models of diabetic encephalopathy, GLP-1 RAs amplify their anti-inflammatory actions by decreasing NF-κB levels, resulting in lower production of pro-inflammatory cytokines such as interleukin, C-reactive proteins, and TNF-alpha [\n77\n]. Notably, the ability of GLP-1 RAs to enhance insulin sensitivity is associated with their anti-inflammatory properties [\n79\n]. Another significant neuroprotective benefit of GLP-1 receptor agonists is their ability to inhibit apoptosis. For instance, GLP-1 RA Liraglutide has been shown to increase brain-derived neurotrophic factor (BDNF) levels, thereby reducing apoptosis [\n80\n]. Additionally, GLP-1 RAs protect against methylglyoxal-induced apoptosis in PC12 cells (rat pheochromocytoma cells), a model relevant to the neuronal damage observed in diabetic encephalopathy [\n78\n]. Importantly, GLP-1 RAs can also reduce apoptosis by protecting neuronal cells from oxidative stress, achieved through the activation of the AMPK, mTOR, and phosphoinositide 3-kinase (PI3K/Akt/mTOR) signaling pathway, a vital pathway for cell survival and maintenance of redox balance [\n78\n,\n80\n].", "doc_items_refs": ["#/texts/298", "#/texts/299", "#/texts/300", "#/texts/301", "#/texts/302", "#/texts/303", "#/texts/304", "#/texts/305", "#/texts/306", "#/texts/307", "#/texts/308", "#/texts/309", "#/texts/310", "#/texts/311", "#/texts/312", "#/texts/313", "#/texts/314", "#/texts/315", "#/texts/316", "#/texts/317", "#/texts/318"], "page_nos": [], "uuid": "bda73d4b-26a6-4e0c-ad76-03a636d49632"}
{"doc_id": "2025__GLP-1_receptor_agonists_in_delirium_and_encephalopathies_a_neuroprotective_scopi__W4412779459", "source_path": "<redacted:source_path>", "chunk_id": 20, "source_chunk_idxs": [29], "num_tokens": 322, "text": "GLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\n3 Results\n3.5 Diabetic encephalopathy\nThe cognitive benefits of GLP-1 RA in diabetic encephalopathy have also been explored extensively. Exendin-4 improves cognitive function in aged rats by modulating hippocampal NMDA subunits, specifically NMDA-R2A and NMDA-R2B, while increasing NMDA-R2B phosphorylation [\n16\n]. As a result, this modulation potentially enhances neuronal plasticity and mitigates glutamate excitotoxicity, a crucial factor in the pathophysiology of diabetic encephalopathy. Likewise, Liraglutide improves cognitive impairment in rodent models of T2DM by activating and modifying downstream signaling of the PI3K/Akt/mTOR signaling pathway for neuronal survival, growth, and plasticity[\n80\n]. The cognitive benefits of GLP-1 RAs were further expanded in the hippocampus of diabetic mice, showing a decrease in amyloid-β peptide and tau protein levels, consequently decreasing amyloid plaque formation, and protecting neurons from amyloid-β-induced death [\n77\n,\n80\n,\n81\n]. These findings underscore the potential of GLP-1 RAs to boost synaptic plasticity and promote cognitive resilience in diabetic encephalopathy.", "doc_items_refs": ["#/texts/319", "#/texts/320", "#/texts/321", "#/texts/322", "#/texts/323", "#/texts/324", "#/texts/325", "#/texts/326", "#/texts/327", "#/texts/328", "#/texts/329"], "page_nos": [], "uuid": "94d66620-7f97-4d80-9c3b-2108ece5664e"}
{"doc_id": "2025__GLP-1_receptor_agonists_in_delirium_and_encephalopathies_a_neuroprotective_scopi__W4412779459", "source_path": "<redacted:source_path>", "chunk_id": 21, "source_chunk_idxs": [30], "num_tokens": 283, "text": "GLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\n3 Results\n3.5 Diabetic encephalopathy\nClinical studies have substantiated the therapeutic effects of GLP-1 RAs in humans. For instance, the use of Exendin-4 resulted in significant cognitive improvement in elderly patients with diabetes, independent of glycemic control [\n16\n]. In this study of 138 elderly diabetic patients, treating diabetes with Exendin-4 substantially improved their mini-mental status exam scores (MMSE) without correlating with Hemoglobin A1c (HgbA1c) levels. This finding supports a direct neuroprotective effect rather than simply improving glucose metabolism [\n16\n]. In addition, Liraglutide may enhance cognitive function in patients with T2DM in the context of mood disorders [\n80\n]. After a 4-week treatment with Liraglutide, there was a significant improvement in the Trail Making Test-B and composite Z-scores of several neuropsychiatric scales in patients with depression and bipolar disorders [\n82\n]. While further research is needed with more extensive and diverse populations, these findings suggest the potential clinical use of GLP-1 RAs in addressing cognitive decline associated with diabetic encephalopathy.", "doc_items_refs": ["#/texts/330", "#/texts/331", "#/texts/332", "#/texts/333", "#/texts/334", "#/texts/335", "#/texts/336", "#/texts/337", "#/texts/338"], "page_nos": [], "uuid": "22ce8dc2-74b0-4eeb-bc6d-430eb02248a0"}
{"doc_id": "2025__GLP-1_receptor_agonists_in_delirium_and_encephalopathies_a_neuroprotective_scopi__W4412779459", "source_path": "<redacted:source_path>", "chunk_id": 22, "source_chunk_idxs": [31], "num_tokens": 379, "text": "GLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\n3 Results\n3.6 Alcohol withdrawal syndrome\nAlcohol Withdrawal Syndrome (AWS) is a constellation of symptoms that arise from abrupt cessation or reduction of alcohol consumption in individuals with prolonged alcohol use [\n83\n,\n84\n,\n85\n]. This syndrome presents with a range of symptoms, including tremors, anxiety, sweating, headaches, hallucinations, and, in severe cases, seizures and delirium tremens (DT)[\n86\n,\n87\n,\n88\n]. AWS is a common cause of hospitalization, and without adequate monitoring and treatment, it may lead to significant morbidity and mortality [\n89\n,\n90\n]. The pathophysiological mechanism of AWS involves an imbalance between inhibitory GABAergic and excitatory glutamatergic systems [\n88\n,\n91\n,\n92\n]. Current treatment strategies for AWS focus on the early identification and close monitoring of symptoms, administering symptom-relieving medications such as benzodiazepines, gabapentin, and phenobarbital, and offering craving-reducing agents such as naltrexone and acamprosate [\n93\n,\n94\n,\n95\n,\n96\n]. Although psychosocial interventions and the management of co-occurring psychiatric disorders are valuable in promoting abstinence from alcohol use, these strategies have limitations and new treatments are needed [\n97\n,\n98\n]. In this context, GLP-1 RAs may help prevent and alleviate AWS owing to their neuroprotective benefits, offering new therapeutic approaches to improve patient outcomes and quality of life[\n99\n]. Indeed, preclinical and clinical evidence suggests that GLP-1 signaling may regulate alcohol-mediated behaviors [\n100\n].", "doc_items_refs": ["#/texts/340", "#/texts/341", "#/texts/342", "#/texts/343", "#/texts/344", "#/texts/345", "#/texts/346", "#/texts/347", "#/texts/348", "#/texts/349", "#/texts/350", "#/texts/351", "#/texts/352", "#/texts/353", "#/texts/354", "#/texts/355", "#/texts/356", "#/texts/357", "#/texts/358", "#/texts/359", "#/texts/360", "#/texts/361", "#/texts/362", "#/texts/363", "#/texts/364", "#/texts/365", "#/texts/366", "#/texts/367", "#/texts/368", "#/texts/369", "#/texts/370", "#/texts/371", "#/texts/372", "#/texts/373", "#/texts/374", "#/texts/375", "#/texts/376", "#/texts/377", "#/texts/378"], "page_nos": [], "uuid": "b58fead1-a30a-4dc9-a833-8397e673f17e"}
{"doc_id": "2025__GLP-1_receptor_agonists_in_delirium_and_encephalopathies_a_neuroprotective_scopi__W4412779459", "source_path": "<redacted:source_path>", "chunk_id": 23, "source_chunk_idxs": [32], "num_tokens": 448, "text": "GLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\n3 Results\n3.6 Alcohol withdrawal syndrome\nSeveral animal studies have suggested that GLP-1 RAs can effectively mitigate various aspects of AWS. An essential finding was their ability to attenuate anxiety-like behaviors during the withdrawal phase [\n32\n,\n101\n]. This finding is critical because anxiety is a major factor driving relapse [\n102\n]. For instance, Sharma et al. (2015) indicated that reduced anxiety-like behaviors, which are crucial for the maintenance of alcohol abstinence, persisted in alcohol-tolerant mice following acute Liraglutide administration [\n101\n,\n103\n]. In addition to anxiety, GLP-1 RAs, such as Dulaglutide and Liraglutide, attenuate alcohol consumption and preference in mice [\n32\n,\n103\n]. Similarly, a decrease in alcohol-bingeing behavior after using Exendin-4 and Semaglutide has been observed in some animal models [\n104\n]. These outcomes following alcohol consumption are long-lasting, which is crucial for the potential long-term effects of recovery[\n32\n]. Moreover, GLP-1 RAs, specifically Semaglutide, provide anti-inflammatory properties by reducing pro-inflammatory cytokines in the brain, mitigating inflammation during alcohol withdrawal, and reducing alcohol relapse [\n105\n]. This finding highlights the neuroprotective benefits of GLP-1 RA, such as Semaglutide, in the medial prefrontal cortex and hippocampus. Specifically, by preserving synaptic density, Semaglutide plays a crucial role in safeguarding neuronal networks[\n105\n]. Another important pathway is the modulation of hyperammonemia by GLP-1 RA [\n105\n] in the prefrontal cortex, which diminishes cognitive impairments observed during withdrawal [\n32\n,\n92\n,\n106\n]. Although the findings of these animal studies show promise, additional clinical studies are necessary to demonstrate the applicability of GLP-1 RAs for managing AWS in humans.", "doc_items_refs": ["#/texts/379", "#/texts/380", "#/texts/381", "#/texts/382", "#/texts/383", "#/texts/384", "#/texts/385", "#/texts/386", "#/texts/387", "#/texts/388", "#/texts/389", "#/texts/390", "#/texts/391", "#/texts/392", "#/texts/393", "#/texts/394", "#/texts/395", "#/texts/396", "#/texts/397", "#/texts/398", "#/texts/399", "#/texts/400", "#/texts/401", "#/texts/402", "#/texts/403", "#/texts/404", "#/texts/405", "#/texts/406", "#/texts/407", "#/texts/408", "#/texts/409"], "page_nos": [], "uuid": "b296474a-d5a1-4122-a7fd-37d0bfa0e2a6"}
{"doc_id": "2025__GLP-1_receptor_agonists_in_delirium_and_encephalopathies_a_neuroprotective_scopi__W4412779459", "source_path": "<redacted:source_path>", "chunk_id": 24, "source_chunk_idxs": [33], "num_tokens": 242, "text": "GLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\n3 Results\n3.6 Alcohol withdrawal syndrome\nTo the best of our knowledge, only indirect effects of GLP-1 RAs in attenuating AWS in humans have been reported. For instance, some clinical trials have investigated the effects of GLP-1 RAs on alcohol consumption in patients with alcohol use disorders, an outcome that is crucial in preventing AWS. Additionally, a reduction in alcohol intake with GLP-1 RA treatment, particularly in individuals with comorbid obesity (BMI &gt; 30 kg/m2), has been reported [\n32\n,\n100\n,\n107\n]. In contrast, patients with a lower BMI (less than 25 kg/m\n2\n) treated with GLP-1 RA, particularly Exenatide, reported an increase in the number of heavy drinking days [\n107\n]. This indicates that additional research is necessary to determine the optimal parameters and suitable patient populations that will benefit the most from GLP-1 RAs. Currently, no studies have directly evaluated the efficacy of GLP-1 RA in patients with AWS.", "doc_items_refs": ["#/texts/410", "#/texts/411", "#/texts/412", "#/texts/413", "#/texts/414", "#/texts/415", "#/texts/416", "#/texts/417", "#/texts/418", "#/texts/419", "#/texts/420"], "page_nos": [], "uuid": "293e49d9-331f-4761-83aa-6b3e3226c148"}
{"doc_id": "2025__GLP-1_receptor_agonists_in_delirium_and_encephalopathies_a_neuroprotective_scopi__W4412779459", "source_path": "<redacted:source_path>", "chunk_id": 25, "source_chunk_idxs": [34], "num_tokens": 375, "text": "GLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\n4 Discussion\nTo the best of our knowledge, this is the first scoping review to examine the role of GLP-1 RAs in delirium and encephalopathies. A thorough literature search revealed that preclinical and clinical studies indicate that GLP-1 RAs may offer neuroprotective benefits for both the prevention and management of delirium and encephalopathies, including sepsis-associated encephalopathy, hepatic encephalopathy, HIE, diabetic encephalopathy and AWS. In summary, these neuroprotective effects include anti-inflammatory, anti-apoptotic, and cognitive-enhancing properties of GLP-1 RAs (Fig.\n1\n).\nThe anti-inflammatory benefit of GLP-1 RAs is a common mechanistic theme among brain dysfunctions presented in this scoping review. This anti-inflammatory function is linked to reduced levels of pro-inflammatory markers (TNF-alpha, NF-KB, CRP, and IL-1β), possibly contributing to the maintenance of cellular health. This aligns with findings in neurodegenerative diseases such as Alzheimer's and Parkinson's diseases, where anti-inflammation plays a crucial role in treatment, suggesting a shared mechanistic target for GLP-1 RAs across different neurological conditions [\n108\n]. In this review, anti-inflammatory effects represent a promising benefit observed in animal studies used as models for delirium and certain encephalopathies. However, human studies on postoperative delirium and AWS have shown mixed results or are only beneficial for obese patients.", "doc_items_refs": ["#/texts/422", "#/texts/423", "#/texts/424", "#/texts/425", "#/texts/426", "#/texts/427"], "page_nos": [], "uuid": "bc61be3b-9bf8-4a18-aaad-a867bec98923"}
{"doc_id": "2025__GLP-1_receptor_agonists_in_delirium_and_encephalopathies_a_neuroprotective_scopi__W4412779459", "source_path": "<redacted:source_path>", "chunk_id": 26, "source_chunk_idxs": [35], "num_tokens": 413, "text": "GLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\n4 Discussion\nThe benefits of GLP-1 RAs in preventing cell death or apoptosis are evident in animal models of postoperative delirium and various encephalopathies discussed in this review. Several pathophysiological mechanisms have been identified for the prevention of apoptosis, including the reduction of oxidative stress in postoperative delirium, diabetic encephalopathy, and hepatic encephalopathy. Additionally, the involvement of the mTOR pathway has been noted in septic and diabetic encephalopathy and the phosphorylation of tau proteins in diabetic and sepsis-associated encephalopathy and postoperative delirium. These anti-apoptotic benefits of GLP-1 RAs are not unique to delirium and encephalopathies, but have also been established in various biological systems, such as neuronal cells, cardiomyocytes, pancreatic beta cells, and cardiac progenitor cells[\n109\n,\n110\n,\n111\n,\n112\n]. This demonstrated the versatility of GLP-1 RAs in different biological systems, indicating a convergence of shared cellular protection mechanisms through the modulation of apoptotic pathways and other mechanisms that regulate cell death. While the review highlights promising preclinical evidence for GLP-1 RAs in preventing cell death in various encephalopathies, clinical evidence remains limited. Indeed, this review notes that evidence for apoptotic mechanisms is lacking in human studies on sepsis-associated encephalopathy, and most human studies on hepatic encephalopathy are observational in nature. Additionally, limited research on hypoxia-induced encephalopathy has primarily focused on post-cardiac patients, which may not be representative of the broader patient population.", "doc_items_refs": ["#/texts/428", "#/texts/429", "#/texts/430", "#/texts/431", "#/texts/432", "#/texts/433", "#/texts/434", "#/texts/435", "#/texts/436"], "page_nos": [], "uuid": "07adc8d4-82c9-4d98-b5d1-116ea3dc607e"}
{"doc_id": "2025__GLP-1_receptor_agonists_in_delirium_and_encephalopathies_a_neuroprotective_scopi__W4412779459", "source_path": "<redacted:source_path>", "chunk_id": 27, "source_chunk_idxs": [36], "num_tokens": 298, "text": "GLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\n4 Discussion\nThe cognitive-enhancing potential of GLP-1 RAs has been demonstrated in animal models of diabetic encephalopathy. Several pathophysiological mechanisms contribute to cognitive improvement, including the activation of the PI3K/Akt/mTOR pathways. For instance, these mechanisms lead to a reduction in amyloid-beta plaques and modulation of NMDA receptors and glutamate toxicity, all of which promote neuronal health and enhance synaptic plasticity. Similarly, these findings have been translated into improved cognition in human studies. These cognitive-enhancing potentials, similarly implicated in animal models of Alzheimer's disease, stroke, and traumatic brain injury, suggest a broader applicability for GLP-1 RAs in neurological conditions marked by cognitive deficits [\n18\n,\n99\n].\nThis scoping review had several strengths. First, considering the prevalence and harmful cognitive and functional consequences of delirium and encephalopathy, this review offers a comprehensive overview, based on available preclinical and clinical evidence, of the promising role of GLP-1 RAs in brain functions. Second, it highlights potential molecular or pathophysiological mechanisms by illustrating a diagram (Fig.\n1\n) that shows how GLP-1 RAs may exert therapeutic effects in patients with these conditions.", "doc_items_refs": ["#/texts/437", "#/texts/438", "#/texts/439", "#/texts/440", "#/texts/441", "#/texts/442", "#/texts/443", "#/texts/444"], "page_nos": [], "uuid": "2daebe93-9ca9-4908-81df-0c6a6012f985"}
{"doc_id": "2025__GLP-1_receptor_agonists_in_delirium_and_encephalopathies_a_neuroprotective_scopi__W4412779459", "source_path": "<redacted:source_path>", "chunk_id": 28, "source_chunk_idxs": [37], "num_tokens": 327, "text": "GLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\n4 Discussion\nWhile this review offers new insights about the neuroprotective benefits of GLP-1 RAs, we acknowledge some limitations of this study. First, this review does not include other types of delirium and encephalopathies (e.g., delirium due to metabolic causes, encephalopathy from demyelinating diseases such as multiple sclerosis, and seizure-associated encephalopathy). However, it provides a foundational overview of the benefits of GLP-1 RAs in relation to delirium and encephalopathies, laying the groundwork for future research. Second, this review was not a systematic review or meta-analysis; therefore, critical appraisal of each data was not performed, and the quality of evidence was not graded. However, systematic review and meta-analysis may not be appropriate or timely at this point, given the scarcity of human observational and randomized trials; thus, providing a scoping review is the best attempt or opportunity to present the current state of evidence. Third, this review represents brain dysfunction that mainly affects older adults or the elderly; thus, it may not be applicable to pediatric patients. Nevertheless, the hypoxia-induced encephalopathy discussed in this review is common in infants but may have underlying mechanisms that can be translated to other disease states, such as cerebral ischemia or anoxia in adult populations.", "doc_items_refs": ["#/texts/445"], "page_nos": [], "uuid": "b18295f6-e7d4-4e30-bc9a-960415014cf8"}
{"doc_id": "2025__GLP-1_receptor_agonists_in_delirium_and_encephalopathies_a_neuroprotective_scopi__W4412779459", "source_path": "<redacted:source_path>", "chunk_id": 29, "source_chunk_idxs": [38], "num_tokens": 386, "text": "GLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\n4 Discussion\nFinally, this review provides a comprehensive understanding of the neuroprotective potential of GLP-1 RAs. First, additional research is necessary to understand the effects of GLP-1 RAs on other types of encephalopathies and delirium, which are not covered in this review. Second, additional observational or randomized clinical trials are required to further investigate the efficacy and safety of GLP-1 RAs in preventing and treating delirium and encephalopathies. Third, the optimal dose, duration, and timing of GLP-1 RA treatment for delirium and encephalopathies should be determined. Fourth, comparative studies with other diabetic agents (e.g., insulin, SGLT-2i, and DPP-4i) must be undertaken to further elucidate the pharmacological properties and adverse effect profiles of GLP-1 RAs. Fifth, a systematic or meta-analysis review must be conducted to evaluate the therapeutic effects of GLP-1 RAs in encephalopathies and delirium once more observational or randomized studies are published. Sixth, the mechanisms underlying the exact roles of GLP-1 RAs in delirium and encephalopathies are complex. Therefore, further mechanistic studies are necessary to fully elucidate the intricate pathways through which GLP-1 RAs exert their neuroprotective effects, ultimately optimizing their clinical applications. Lastly, the literature search was restricted to studies published between 2015 and 2025. This timeframe may have influenced the identification of all relevant evidence related to the research question. Therefore, future reviews are essential to comprehensively map the existing literature.", "doc_items_refs": ["#/texts/446"], "page_nos": [], "uuid": "8c6d688e-26e1-4b93-9e05-18eea751e518"}
{"doc_id": "2025__GLP-1_receptor_agonists_in_delirium_and_encephalopathies_a_neuroprotective_scopi__W4412779459", "source_path": "<redacted:source_path>", "chunk_id": 30, "source_chunk_idxs": [39, 40], "num_tokens": 293, "text": "GLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\n5 Conclusion\nThis scoping review indicates that GLP-1 RAs may provide neuroprotective advantages for treating postoperative delirium and certain types of encephalopathies. Both preclinical and clinical studies have demonstrated anti-inflammatory, anti-apoptotic, and cognitive enhancement properties. Anti-inflammatory properties are linked to a reduction in inflammatory markers, while anti-apoptotic benefits promote cellular health and synaptic plasticity. This cognitive-enhancing potential may delay cognitive impairment and functional decline in delirium and encephalopathies. Nevertheless, it is still necessary to understand the role of GLP-1 RAs in other types of encephalopathies and different causes of delirium. Further clinical trials are essential to evaluate the efficacy and safety of GLP-1 RAs, establish optimal dosing guidelines, and compare their effects with those of alternative treatments. Future studies should also investigate the mechanisms by which GLP-1 RAs deliver neuroprotective benefits, ultimately leading to improved clinical outcomes.\n\nGLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\nData availability\nNo datasets were generated or analysed during the current study.", "doc_items_refs": ["#/texts/448", "#/texts/450"], "page_nos": [], "uuid": "c52bfb73-da85-4937-b112-d89fab22ccfb"}
{"doc_id": "2025__GLP-1_receptor_agonists_in_delirium_and_encephalopathies_a_neuroprotective_scopi__W4412779459", "source_path": "<redacted:source_path>", "chunk_id": 31, "source_chunk_idxs": [41], "num_tokens": 475, "text": "GLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\nVII. References\n1. Tsuruta R, Oda Y. A clinical perspective of sepsis-associated delirium. BioMed Cent. 2016.\nhttps://doi.org/10.1186/s40560-016-0145-4\n.\nArticle\nGoogle Scholar\n2. Young GB. Encephalopathy of infection and systemic inflammation. Lippincott Williams Wilkins. 2013;30(5):454-61.\nhttps://doi.org/10.1097/wnp.0b013e3182a73d83\n.\nArticle\nGoogle Scholar\n3. Inouye SK, Westendorp RG, Saczynski JS. Delirium in elderly people. Elsevier. 2013;383(9920):911-22.\nhttps://doi.org/10.1016/s0140-6736(13)60688-1\n.\nArticle\nGoogle Scholar\n4. Gupta R, Shrinuvasan S. Encephalopathy: a comprehensive case series of five patients with MRI. Insights. 2024.\nhttps://doi.org/10.36106/ijsr/8114421\n.\nArticle\nGoogle Scholar\n5. Slooter AJC, Stevens RD. Updated nomenclature of delirium and acute encephalopathy. Springer Sci Media. 2020;33(3):864-864.\nhttps://doi.org/10.1007/s12028-020-01074-3\n.\nArticle\nGoogle Scholar\n6. Denk A, et al. Liver diseases as a novel risk factor for delirium in the ICU-delirium and hepatic encephalopathy are two distinct entities. Publ Libr Sci. 2022.\nhttps://doi.org/10.1371/journal.pone.0276914\n.\nArticle\nGoogle Scholar\n7. Dunne C, Dunne SS. Casting light on the links between delirium, infection, and dementia risk. Amsterdam: Elsevier; 2024.\nBook\nGoogle Scholar", "doc_items_refs": ["#/texts/452", "#/texts/453", "#/texts/454", "#/texts/455", "#/texts/456", "#/texts/457", "#/texts/458"], "page_nos": [], "uuid": "78fed71a-d023-4d96-80e8-eaea177b9819"}
{"doc_id": "2025__GLP-1_receptor_agonists_in_delirium_and_encephalopathies_a_neuroprotective_scopi__W4412779459", "source_path": "<redacted:source_path>", "chunk_id": 32, "source_chunk_idxs": [42], "num_tokens": 461, "text": "GLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\nVII. References\n8. Sfera A, Osorio C, Price A, Gradini R, Cummings MA. Delirium from the gliocentric perspective. Front Media. 2015;9:171-171.\nhttps://doi.org/10.3389/fncel.2015.00171\n.\nArticle\nCAS\nGoogle Scholar\n9. Neufeld KJ, et al. Outcomes of early delirium diagnosis after general anesthesia in the elderly. Lippincott Williams Wilkins. 2013;117(2):471-8.\nhttps://doi.org/10.1213/ane.0b013e3182973650\n.\nArticle\nCAS\nGoogle Scholar\n10. M. E. Wilcox, N. E. Brummel, K. Archer, E. W. Ely, J. C. Jackson, and R. O. Hopkins, \"Cognitive Dysfunction in ICU Patients: Risk Factors, Predictors, and Rehabilitation Interventions.\" United States: by the Society of Critical Care Medicine and Lippincott Williams &amp; Wilkins, Sep. 2013.\nhttps://journals.lww.com/ccmjournal/abstract/2013/09001/cognitive\\_dysfunction\\_in\\_icu\\_patients\\_\\_risk.8.aspx\n11. Israni J, Lesser A, Kent T, Ko KJ. Delirium as a predictor of mortality in US medicare beneficiaries discharged from the emergency department: a national claims-level analysis up to 12 months. BMJ. 2018.\nhttps://doi.org/10.1136/bmjopen-2017-021258\n.\nArticle\nGoogle Scholar\n12. Kosar CM, Thomas KS, Inouye SK, Mor V. Delirium during postacute nursing home admission and risk for adverse outcomes. Wiley. 2017;65(7):1470-5.\nhttps://doi.org/10.1111/jgs.14823\n.\nArticle\nGoogle Scholar", "doc_items_refs": ["#/texts/459", "#/texts/460", "#/texts/461", "#/texts/462", "#/texts/463"], "page_nos": [], "uuid": "a85e43db-1e94-43bb-8065-be705992b270"}
{"doc_id": "2025__GLP-1_receptor_agonists_in_delirium_and_encephalopathies_a_neuroprotective_scopi__W4412779459", "source_path": "<redacted:source_path>", "chunk_id": 33, "source_chunk_idxs": [43], "num_tokens": 458, "text": "GLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\nVII. References\n13. Frontera J. Metabolic encephalopathies in the critical care unit. Lippincott Williams &amp; Wilkins. 2012;18:611-39.\nhttps://doi.org/10.1212/01.con.0000415431.07019.c2\n.\nArticle\nGoogle Scholar\n14. Nicholson TR, Henderson M. Management of delirium. MA Healthc. 2009;70(4):217-21.\nhttps://doi.org/10.12968/hmed.2009.70.4.41625\n.\nArticle\nGoogle Scholar\n15. M. Cascella, M. Fiore, S. Leone, D. Carbone, and R. D. Napoli. Current controversies and future perspectives on treatment of intensive care unit delirium in adults,\" vol. 8, no. 3. pp. 18-27, Jun. 2019.\nhttps://doi.org/10.5492/wjccm.v8.i3.18\n.\n16. Romano AD, Villani R, Sangineto M, Cassano T, Serviddio G. The GLP-1 receptor agonist exendin-4 modulates hippocampal NMDA-receptor signaling in aged rats and improves cognitive impairment in diabetic elderly patients. J Gerontol Geriatr. 2022;70(2):1-7.\nhttps://doi.org/10.36150/2499-6564-N474\n.\nArticle\nGoogle Scholar\n17. Mehan S, Bhalla S, Siddiqui EM, Sharma N, Shandilya A, Khan A. Potential roles of glucagon-like peptide-1 and its analogues in dementia targeting impaired insulin secretion and neurodegeneration. Dove Med Press. 2022;12:31-59.\nhttps://doi.org/10.2147/dnnd.s247153\n.\nArticle\nCAS\nGoogle Scholar", "doc_items_refs": ["#/texts/464", "#/texts/465", "#/texts/466", "#/texts/467", "#/texts/468"], "page_nos": [], "uuid": "df0f0f9d-a0d2-45a4-af50-06bbd68211f5"}
{"doc_id": "2025__GLP-1_receptor_agonists_in_delirium_and_encephalopathies_a_neuroprotective_scopi__W4412779459", "source_path": "<redacted:source_path>", "chunk_id": 34, "source_chunk_idxs": [44], "num_tokens": 489, "text": "GLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\nVII. References\n18. Salcedo I, Tweedie D, Li Y, Greig NH. Neuroprotective and neurotrophic actions of glucagon-like peptide-1: an emerging opportunity to treat neurodegenerative and cerebrovascular disorders. Wiley. 2012;166(5):1586-99.\nhttps://doi.org/10.1111/j.1476-5381.2012.01971.x\n.\nArticle\nCAS\nGoogle Scholar\n19. Zaky DA, Abdallah DM, El-Abhar HS. Intranasal exendin-4 modifies necroptosis-mediated innate immune response to combat septic encephalopathy in rats: role of mTORC1 in immunogenic and tolerogenic cell demise. Eur J Pharmacol. 2023;961: 176191.\nhttps://doi.org/10.1016/j.ejphar.2023.176191\n.\nArticle\nCAS\nPubMed\nGoogle Scholar\n20. j. p. h. wilding@liverpool. ac. uk B. Emily Brown Daniel J. Cuthbertson, John P. Wilding, \"Newer GLP-1 receptor agonists and obesity-diabetes,\" vol. undefined, no. undefined. Feb. 2018.\nhttps://www.sciencedirect.com/science/article/pii/S0196978117303789\n21. K. Tran et al. Overview of Glucagon-Like Peptide-1 Receptor Agonists for the Treatment of Patients with Type 2 Diabetes. s10, no. 4, pp. 178-188, Jun. 2017.\n22. S. L. D. Y. L. Lee. Glucagon-like peptide-1 and glucagon-like peptide-1 receptor agonists in the treatment of type 2 diabetes. Korea (South): The Korean Society of Pediatric Endocrinology.\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC5401818/", "doc_items_refs": ["#/texts/469", "#/texts/470", "#/texts/471", "#/texts/472", "#/texts/473"], "page_nos": [], "uuid": "27fc3052-33c6-44f2-af64-b9b57dd1b46a"}
{"doc_id": "2025__GLP-1_receptor_agonists_in_delirium_and_encephalopathies_a_neuroprotective_scopi__W4412779459", "source_path": "<redacted:source_path>", "chunk_id": 35, "source_chunk_idxs": [45], "num_tokens": 490, "text": "GLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\nVII. References\n23. Ryan DH, Acosta A. GLP-1 receptor agonists: nonglycemic clinical effects in weight loss and beyond. Wiley. 2015;23(6):1119-29.\nhttps://doi.org/10.1002/oby.21107\n.\nArticle\nCAS\nGoogle Scholar\n24. Buse JB, Henry RR, Han J, Kim DDH, Fineman M, Baron A. Effects of exenatide (exendin-4) on glycemic control over 30 weeks in sulfonylurea-treated patients with type 2 diabetes. Am Diabetes Assoc. 2004;27(11):2628-35.\nhttps://doi.org/10.2337/diacare.27.11.2628\n.\nArticle\nCAS\nGoogle Scholar\n25. H. W. Rodbard. 2018. The Clinical Impact of GLP 1 Receptor Agonists in Type 2 Diabetes Focus on the Long Acting Analogs. Mary Ann Liebert Inc.\nhttps://doi.org/10.1089/dia.2018.0103\n.\n26. Trujillo JM, Nuffer W, Ellis SL. GLP-1 receptor agonists: a review of head-to-head clinical studies. SAGE Publ. 2014;6(1):19-28.\nhttps://doi.org/10.1177/2042018814559725\n.\nArticle\nCAS\nGoogle Scholar\n27. Oldham MA, Holloway RG. Delirium disorder: integrating delirium and acute encephalopathy. Neurology. 2020;95(4):173-8.\nhttps://doi.org/10.1212/WNL.0000000000009949\n.\nArticle\nPubMed\nGoogle Scholar\n28. Theuerkauf N, Guenther U, Putensen C. Postoperative delirium in the PACU and intensive care unit. Elsevier BV. 2012;2(4):148-55.\nhttps://doi.org/10.1016/j.tacc.2012.03.002\n.\nArticle\nGoogle Scholar", "doc_items_refs": ["#/texts/474", "#/texts/475", "#/texts/476", "#/texts/477", "#/texts/478", "#/texts/479"], "page_nos": [], "uuid": "24afe365-e8d9-4e9a-932d-41c7f97ed198"}
{"doc_id": "2025__GLP-1_receptor_agonists_in_delirium_and_encephalopathies_a_neuroprotective_scopi__W4412779459", "source_path": "<redacted:source_path>", "chunk_id": 36, "source_chunk_idxs": [46], "num_tokens": 461, "text": "GLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\nVII. References\n29. T. Fong, S. Tulebaev, and S. Inouye. Delirium in elderly adults: diagnosis, prevention and treatment. 2009.\nhttps://doi.org/10.1038/nrneurol.2009.24\n.\n30. Laurindo LF, Barbalho SM, Guiguer EL. GLP-1a: going beyond traditional use. Switzerland AGInter J Mol Sci. 2022.\nhttps://doi.org/10.3390/ijms23020739\n.\nArticle\nGoogle Scholar\n31. Jia M, Lv X, Zhu T, Shen J-C, Liu W-X, Yang J-J. Liraglutide ameliorates delirium-like behaviors of aged mice undergoing cardiac surgery by mitigating microglia activation via promoting mitophagy. Psychopharmacology. 2024;241(4):687-98.\nhttps://doi.org/10.1007/s00213-023-06492-7\n.\nArticle\nCAS\nPubMed\nGoogle Scholar\n32. Liu W, Wang Z, Wang W, Wang Z, Xing Y, Hölscher C. Liraglutide reduces alcohol consumption, anxiety, memory impairment, and synapse loss in alcohol dependent mice. Neurochem Res. 2024;49(4):1061-75.\nhttps://doi.org/10.1007/s11064-023-04093-6\n.\nArticle\nCAS\nPubMed\nGoogle Scholar\n33. Xiong H, et al. The neuroprotection of liraglutide on Alzheimer-like learning and memory impairment by modulating the hyperphosphorylation of tau and neurofilament proteins and insulin signaling pathways in mice. IOS Press. 2013;37(3):623-35.\nhttps://doi.org/10.3233/jad-130584\n.\nArticle\nGoogle Scholar", "doc_items_refs": ["#/texts/480", "#/texts/481", "#/texts/482", "#/texts/483", "#/texts/484"], "page_nos": [], "uuid": "84259592-3495-455d-bc15-3c4846427ee2"}
{"doc_id": "2025__GLP-1_receptor_agonists_in_delirium_and_encephalopathies_a_neuroprotective_scopi__W4412779459", "source_path": "<redacted:source_path>", "chunk_id": 37, "source_chunk_idxs": [47], "num_tokens": 494, "text": "GLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\nVII. References\n34. Zhang J, et al. Liraglutide nano-preparation on perioperative neurocognitive dysfunction in aged mice. Cell Mol Biol. 2022;68(3):356-64.\nhttps://doi.org/10.14715/cmb/2022.68.3.39\n.\nArticle\nPubMed\nGoogle Scholar\n35. Androsova G, Krause R, Winterer G, Schneider R. Biomarkers of postoperative delirium and cognitive dysfunction. Front Aging Neurosci. 2015.\nhttps://doi.org/10.3389/fnagi.2015.00112\n.\nArticle\nPubMed Central\nGoogle Scholar\n36. Lagonigro E, Pansini A, Mone P, Guerra G, Komici K, Fantini C. The role of stress hyperglycemia on delirium onset. J Clin Med. 2025;14(2):407.\nhttps://doi.org/10.3390/jcm14020407\n.\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n37. Wolfe RC. Perioperative implications of glucagon-like peptide-1 receptor agonists. J Perianesth Nurs. 2024;39(6):1108-10.\nhttps://doi.org/10.1016/j.jopan.2024.09.022\n.\nArticle\nPubMed\nGoogle Scholar\n38. A. H. Hulst. Glucose control therapies in the perioperative period.\nhttps://hdl.handle.net/11245.1/9f8b3eed-fbd4-4d84-96aa-593b390f447c\n39. Olmo-García MID, et al. Glycemic variability in type 2 diabetes mellitus and acute coronary syndrome: liraglutide compared with insulin glargine: a pilot study. SAGE Publ. 2020.\nhttps://doi.org/10.1177/0300060520926063\n.\nArticle\nGoogle Scholar", "doc_items_refs": ["#/texts/485", "#/texts/486", "#/texts/487", "#/texts/488", "#/texts/489", "#/texts/490"], "page_nos": [], "uuid": "d704e58c-8762-454f-865b-53722b73da8a"}
{"doc_id": "2025__GLP-1_receptor_agonists_in_delirium_and_encephalopathies_a_neuroprotective_scopi__W4412779459", "source_path": "<redacted:source_path>", "chunk_id": 38, "source_chunk_idxs": [48], "num_tokens": 491, "text": "GLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\nVII. References\n40. Pinsky MR. Dysregulation of the immune response in severe sepsis. Elsevier BV. 2004;328(4):220-9.\nhttps://doi.org/10.1097/00000441-200410000-00005\n.\nArticle\nGoogle Scholar\n41. Pool R, Gómez H, Kellum JA. Mechanisms of organ dysfunction in sepsis. Elsevier BV. 2017;34(1):63-80.\nhttps://doi.org/10.1016/j.ccc.2017.08.003\n.\nArticle\nGoogle Scholar\n42. Sonneville R, et al. The spectrum of sepsis-associated encephalopathy: a clinical perspective. BioMed Central. 2013.\nhttps://doi.org/10.1186/s13054-023-04655-8\n.\nArticle\nGoogle Scholar\n43. Piva S, Bertoni M, Gitti N, Rasulo F, Latronico N. Neurological complications of sepsis. Lippincott Williams Wilkins. 2023;29(2):75-84.\nhttps://doi.org/10.1097/mcc.0000000000001022\n.\nArticle\nGoogle Scholar\n44. Barichello T, et al. Long-term cognitive outcomes after sepsis: a translational systematic review. Mol Neurobiol. 2019;56:186-251.\nArticle\nCAS\nPubMed\nGoogle Scholar\n45. Yang F, et al. GLP-1 receptor: a new target for sepsis. Front Pharmacol. 2021;12: 706908.\nhttps://doi.org/10.3389/fphar.2021.706908\n.\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n46. Neves FS, et al. Brain-defective insulin signaling is associated to late cognitive impairment in post-septic mice. Mol Neurobiol. 2018;55(1):435-44.\nhttps://doi.org/10.1007/s12035-016-0307-3\n.\nArticle\nCAS\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/491", "#/texts/492", "#/texts/493", "#/texts/494", "#/texts/495", "#/texts/496", "#/texts/497"], "page_nos": [], "uuid": "ee3d643b-0a52-4b8b-8b76-abd520e32461"}
{"doc_id": "2025__GLP-1_receptor_agonists_in_delirium_and_encephalopathies_a_neuroprotective_scopi__W4412779459", "source_path": "<redacted:source_path>", "chunk_id": 39, "source_chunk_idxs": [49], "num_tokens": 504, "text": "GLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\nVII. References\n47. Yi H, et al. Activation of glucagon-like peptide-1 receptor in microglia exerts protective effects against sepsis-induced encephalopathy via attenuating endoplasmic reticulum stress-associated inflammation and apoptosis in a mouse model of sepsis. Exp Neurol. 2023;363: 114348.\nhttps://doi.org/10.1016/j.expneurol.2023.114348\n.\nArticle\nCAS\nPubMed\nGoogle Scholar\n48. Park SW, et al. Liraglutide activates mTORC1 signaling and AMPA receptors in rat hippocampal neurons under toxic conditions. Front Media. 2018.\nhttps://doi.org/10.3389/fnins.2018.00756\n.\nArticle\nGoogle Scholar\n49. Garcı́a Arencibia M, Hochfeld WE, Toh PC, Rubinsztein DC. Autophagy, a guardian against neurodegeneration. Amsterdam: Elsevier; 2010.\nBook\nGoogle Scholar\n50. Pérez-Monter C, Torre-Delgadillo A. Astrocyte pathophysiology in liver disease. IntechOpen. 2018.\nhttps://doi.org/10.5772/intechopen.72506\n.\nArticle\nGoogle Scholar\n51. Swaminathan M, Ellul M, Cross T. Hepatic encephalopathy: current challenges and future prospects. Dove Med Press. 2018.\nhttps://doi.org/10.2147/hmer.s118964\n.\nArticle\nGoogle Scholar\n52. S. Elwir and R. S. Rahimi. Hepatic Encephalopathy: An Update on the Pathophysiology and Therapeutic Options. pp. 1-10, May 2017.\nhttps://doi.org/10.14218/jcth.2016.00069\n.\n53. Amodio P. Hepatic encephalopathy: diagnosis and management. Wiley. 2018;38(6):966-75.\nhttps://doi.org/10.1111/liv.13752\n.\nArticle\nGoogle Scholar", "doc_items_refs": ["#/texts/498", "#/texts/499", "#/texts/500", "#/texts/501", "#/texts/502", "#/texts/503", "#/texts/504"], "page_nos": [], "uuid": "0cc9d7ee-f63b-4f26-96dd-5844df79eb52"}
{"doc_id": "2025__GLP-1_receptor_agonists_in_delirium_and_encephalopathies_a_neuroprotective_scopi__W4412779459", "source_path": "<redacted:source_path>", "chunk_id": 40, "source_chunk_idxs": [50], "num_tokens": 512, "text": "GLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\nVII. References\n54. Montagnese S, Bajaj JS. Impact of hepatic encephalopathy in cirrhosis on quality-of-life issues. Adis Springer Healthcare. 2019;79:11-6.\nhttps://doi.org/10.1007/s40265-018-1019-y\n.\nArticle\nGoogle Scholar\n55. Kjærgaard K, et al. Semaglutide reduces cognitive dysfunction in experimental non-alcoholic steatohepatitis through anti-inflammatory and neuroprotective effects. Am J Gastroenterol. 2023;118(9):S28-9.\nhttps://doi.org/10.14309/01.ajg.0000948452.01988.0c\n.\nArticle\nGoogle Scholar\n56. Elsaid MI, et al. Impacts of glucagon-like peptide-1 receptor agonists on the risk of adverse liver outcomes in patients with metabolic dysfunction-associated steatotic liver disease cirrhosis and type 2 diabetes. Aliment Pharmacol Ther. 2024;59(9):1096-110.\nhttps://doi.org/10.1111/apt.17925\n.\nArticle\nCAS\nPubMed\nGoogle Scholar\n57. Passos PRC, Filho VOC, Noronha MM, Hyppolito EB, Saldanha EF, Motta RV. Influence of glucagon-like peptide-1 receptor agonists on hepatic events in type 2 diabetes: a systematic review and meta-analysis. J Gastroenterol Hepatol. 2024.\nhttps://doi.org/10.1111/jgh.16752\n.\nArticle\nPubMed\nGoogle Scholar\n58. Yen F-S, et al. Glucagon-like peptide-1 receptor agonist use in patients with liver cirrhosis and type 2 diabetes. Clin Gastroenterol Hepatol Off Clin Pract J Am Gastroenterol Assoc. 2024;22(6):1255-1264.e18.\nhttps://doi.org/10.1016/j.cgh.2023.06.004\n.\nArticle\nCAS\nGoogle Scholar", "doc_items_refs": ["#/texts/505", "#/texts/506", "#/texts/507", "#/texts/508", "#/texts/509"], "page_nos": [], "uuid": "fedf5041-1ffb-4285-9f73-9c6ea7182506"}
{"doc_id": "2025__GLP-1_receptor_agonists_in_delirium_and_encephalopathies_a_neuroprotective_scopi__W4412779459", "source_path": "<redacted:source_path>", "chunk_id": 41, "source_chunk_idxs": [51], "num_tokens": 440, "text": "GLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\nVII. References\n59. Simon TG, Patorno E, Schneeweiss S. Glucagon-like peptide-1 receptor agonists and hepatic decompensation events in patients with cirrhosis and diabetes. Clin Gastroenterol Hepatol Off Clin Pract J Am Gastroenterol Assoc. 2022;20(6):1382-1393.e19.\nhttps://doi.org/10.1016/j.cgh.2021.07.010\n.\nArticle\nCAS\nGoogle Scholar\n60. Kon K, Arai K, Uchiyama A, Fukada H, Yamashina S, Ikejima K. Glycine prevents steatohepatitis-associated heoatocarcinogenesis in hepatocyte-specific PTEN knockout mice through of lipid pofiles. Gastroenterology. 2024.\nhttps://doi.org/10.1016/S0016-5085(24)04221-5\n.\nArticle\nGoogle Scholar\n61. Kutz A, Wexler DJ, Liu J, Paik JM, Patorno E. Association of GLP-1 receptor agonists and SGLT-2 inhibitors with major adverse cardiovascular events and serious liver events among patients with type 2. J Endocr. 2024.\nhttps://doi.org/10.1210/jendso/bvae163.555\n.\nArticle\nGoogle Scholar\n62. Trujillo S, Kamionkowski S, Walsh E, Davila J, Asaad I. Do weight loss medications reduce the risk of cirrhosis and HCC? Am J Gastroenterol. 2021;116(SUPPL):S547-8.\nhttps://doi.org/10.14309/01.ajg.0000778232.15515.30\n.\nArticle\nGoogle Scholar", "doc_items_refs": ["#/texts/510", "#/texts/511", "#/texts/512", "#/texts/513"], "page_nos": [], "uuid": "abf18459-79b2-412a-849e-f6b11c0961fb"}
{"doc_id": "2025__GLP-1_receptor_agonists_in_delirium_and_encephalopathies_a_neuroprotective_scopi__W4412779459", "source_path": "<redacted:source_path>", "chunk_id": 42, "source_chunk_idxs": [52], "num_tokens": 508, "text": "GLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\nVII. References\n63. Peverelle M, Ng J, Peverelle J, Hirsch RD, Testro A. Liver decompensation after rapid weight loss from semaglutide in a patient with non-alcoholic steatohepatitis -associated cirrhosis. World J Gastroenterol. 2023;29(47):6165-7.\nhttps://doi.org/10.3748/wjg.v29.i47.6165\n.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n64. Deng Y, Li K, Li A, Hu W, Hu W. Advances in the treatment of hepatogenous diabetes: a review. Med U S. 2023;102(46):E36068.\nhttps://doi.org/10.1097/MD.0000000000036068\n.\nArticle\nCAS\nGoogle Scholar\n65. A. Yelam and PC Bollu. 2018. Delayed Hypoxic Reversible Leukoencephalopathy Syndrome. Cureus Inc.\nhttps://doi.org/10.7759/cureus.2702\n.\n66. Lemyre B, Chau V. Hypothermia for newborns with hypoxic-ischemic encephalopathy. Oxford Univ Press. 2018;23(4):285-91.\nhttps://doi.org/10.1093/pch/pxy028\n.\nArticle\nGoogle Scholar\n67. Hölscher C. Novel dual GLP-1/GIP receptor agonists show neuroprotective effects in Alzheimer's and Parkinson's disease models. Elsevier BV. 2018;136:251-9.\nhttps://doi.org/10.1016/j.neuropharm.2018.01.040\n.\nArticle\nCAS\nGoogle Scholar\n68. Zhao L, et al. Protective effect of rhGLP-1 (7-36) on brain ischemia/reperfusion damage in diabetic rats. Elsevier BV. 2015;1602:153-9.\nhttps://doi.org/10.1016/j.brainres.2015.01.014\n.\nArticle\nCAS\nGoogle Scholar", "doc_items_refs": ["#/texts/514", "#/texts/515", "#/texts/516", "#/texts/517", "#/texts/518", "#/texts/519"], "page_nos": [], "uuid": "b6afa47e-0d5f-4d3a-a9fa-a323f973c606"}
{"doc_id": "2025__GLP-1_receptor_agonists_in_delirium_and_encephalopathies_a_neuroprotective_scopi__W4412779459", "source_path": "<redacted:source_path>", "chunk_id": 43, "source_chunk_idxs": [53], "num_tokens": 453, "text": "GLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\nVII. References\n69. Rocha-Ferreira E, et al. Neuroprotective exendin-4 enhances hypothermia therapy in a model of hypoxic-ischaemic encephalopathy. Brain J Neurol. 2018;141(10):2925-42.\nhttps://doi.org/10.1093/brain/awy220\n.\nArticle\nGoogle Scholar\n70. Xie Z, et al. Exendin-4 attenuates neuronal death via GLP-1R/PI3K/Akt pathway in early brain injury after subarachnoid hemorrhage in rats. Neuropharmacology. 2018;128:142-51.\nhttps://doi.org/10.1016/j.neuropharm.2017.09.040\n.\nArticle\nCAS\nPubMed\nGoogle Scholar\n71. S. Kim et al. Anti-inflammatory Effect of Glucagon Like Peptide-1 Receptor Agonist, Exendin-4, through Modulation of IB1/JIP1 Expression and JNK Signaling in Stroke,\" vol. 26, no. 4, pp. 227-239, Aug. 2017,\nhttps://doi.org/10.5607/en.2017.26.4.227\n.\n72. Teramoto S, et al. Exendin-4, a glucagon-like peptide-1 receptor agonist, provides neuroprotection in mice transient focal cerebral Ischemia. Sage Publ. 2011;31(8):1696-705.\nhttps://doi.org/10.1038/jcbfm.2011.51\n.\nArticle\nCAS\nGoogle Scholar\n73. Li Y, Gong M. Analysis of the neuroprotective effect of GLP-1 receptor agonist peptide on cerebral ischemia-reperfusion injury by quantitative proteomics mass spectrometry. Cambridge: Wiley; 2021.\nBook\nGoogle Scholar", "doc_items_refs": ["#/texts/520", "#/texts/521", "#/texts/522", "#/texts/523", "#/texts/524"], "page_nos": [], "uuid": "852e4f34-eb4d-427b-ab00-8e1510a354ec"}
{"doc_id": "2025__GLP-1_receptor_agonists_in_delirium_and_encephalopathies_a_neuroprotective_scopi__W4412779459", "source_path": "<redacted:source_path>", "chunk_id": 44, "source_chunk_idxs": [54], "num_tokens": 476, "text": "GLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\nVII. References\n74. Victor S, Rocha-Ferreira E, Rahim A, Hagberg H, Edwards D. New possibilities for neuroprotection in neonatal hypoxic-ischemic encephalopathy. Eur J Pediatr. 2022;181(3):875-87.\nhttps://doi.org/10.1007/s00431-021-04320-8\n.\nArticle\nPubMed\nGoogle Scholar\n75. Nutma S, Le Feber J, Hofmeijer J. Neuroprotective treatment of post-anoxic encephalopathy: a review of clinical evidence. Front Neurol. 2021;12: 614698.\nhttps://doi.org/10.3389/fneur.2021.614698\n.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n76. Wiberg S, et al. GLP-1 analogues for neuroprotection after out-of-hospital cardiac arrest: study protocol for a randomized controlled trial. Trials. 2016;17(1):304.\nhttps://doi.org/10.1186/s13063-016-1421-2\n.\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n77. Sima AAF. Encephalopathies: the emerging diabetic complications. Acta Diabetol. 2010;47(4):279-93.\nhttps://doi.org/10.1007/s00592-010-0218-0\n.\nArticle\nCAS\nPubMed\nGoogle Scholar\n78. Kimura R, et al. Glucagon-like peptide-1 (GLP-1) protects against methylglyoxal-induced PC12 cell apoptosis through the PI3K/Akt/mTOR/GCLc/redox signaling pathway. Neuroscience. 2009;162(4):1212-9.\nhttps://doi.org/10.1016/j.neuroscience.2009.05.025\n.\nArticle\nCAS\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/525", "#/texts/526", "#/texts/527", "#/texts/528", "#/texts/529"], "page_nos": [], "uuid": "bfb5140c-3f53-4434-84fc-f783988c2112"}
{"doc_id": "2025__GLP-1_receptor_agonists_in_delirium_and_encephalopathies_a_neuroprotective_scopi__W4412779459", "source_path": "<redacted:source_path>", "chunk_id": 45, "source_chunk_idxs": [55], "num_tokens": 506, "text": "GLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\nVII. References\n79. Wątroba M, Grabowska AD, Szukiewicz D. Chemokine CX3CL1 (fractalkine) signaling and diabetic encephalopathy. Int J Mol Sci. 2024;25(14):7527.\nhttps://doi.org/10.3390/ijms25147527\n.\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n80. Xourgia E, Papazafiropoulou A, Melidonis A. Antidiabetic treatment on memory and spatial learning: from the pancreas to the neuron. World J Diabetes. 2019;10(3):169-80.\nhttps://doi.org/10.4239/wjd.v10.i3.169\n.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n81. Soares E, Nunes S, Reis F, Pereira FC. Diabetic encephalopathy: the role of oxidative stress and inflammation in type 2 diabetes. Int J Interferon Cytokine Mediat Res. 2012;4(1):75-85.\nhttps://doi.org/10.2147/IJICMR.S29322\n.\nArticle\nGoogle Scholar\n82. Mansur RB, et al. Liraglutide promotes improvements in objective measures of cognitive dysfunction in individuals with mood disorders: a pilot, open-label study. Elsevier. 2016;207:114-20.\nhttps://doi.org/10.1016/j.jad.2016.09.056\n.\nArticle\nCAS\nGoogle Scholar\n83. Bayard M, McIntyre J, Hill KR, Woodside JR. Alcohol withdrawal syndrome. Informa. 2000.\nhttps://doi.org/10.1201/9781420036961-14\n.\nArticle\nGoogle Scholar\n84. Jesse S, et al. Alcohol withdrawal syndrome: mechanisms, manifestations, and management. Wiley. 2016;135(1):4-16.\nhttps://doi.org/10.1111/ane.12671\n.\nArticle\nGoogle Scholar\n85. Vale A. The management of alcohol withdrawal. Amsterdam: Elsevier Ltd; 2006.\nBook\nGoogle Scholar", "doc_items_refs": ["#/texts/530", "#/texts/531", "#/texts/532", "#/texts/533", "#/texts/534", "#/texts/535", "#/texts/536"], "page_nos": [], "uuid": "868dc8c2-2cdf-4ef8-9b36-7a4abf2760cd"}
{"doc_id": "2025__GLP-1_receptor_agonists_in_delirium_and_encephalopathies_a_neuroprotective_scopi__W4412779459", "source_path": "<redacted:source_path>", "chunk_id": 46, "source_chunk_idxs": [56], "num_tokens": 471, "text": "GLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\nVII. References\n86. Gonçalves MCB, Félix F, Romão J, André R, Sereijo C, Ismail F. Seizures and alcohol withdrawal: a literature review. Camb Univ Press. 2022.\nhttps://doi.org/10.1192/j.eurpsy.2022.2143\n.\nArticle\nGoogle Scholar\n87. Kaye AD, et al. The role of glucagon-like peptide-1 agonists in the treatment of multiple sclerosis: a narrative review. Cureus. 2024.\nhttps://doi.org/10.7759/cureus.67232\n.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n88. Mirijello A, et al. Identification and management of alcohol withdrawal syndrome. Adis Springer Healthcare. 2015;75(4):353-65.\nhttps://doi.org/10.1007/s40265-015-0358-1\n.\nArticle\nCAS\nGoogle Scholar\n89. Mahajan R, Singh R, Bansal P, Bala R. Use of propofol as adjuvant therapy in refractory delirium tremens. Medknow. 2010;19(1):58-58.\nhttps://doi.org/10.4103/0972-6748.77641\n.\nArticle\nGoogle Scholar\n90. Trevisan L, Boutros NN, Petrakis IL, Krystal JH. Complications of alcohol withdrawal: pathophysiological insights. Natl Inst Health. 1998;22(1):61-6.\nCAS\nGoogle Scholar\n91. Abulseoud OA, Çamsarı UM, Ruby CL, Kasasbeh A, Choi S, Choi D-S. Attenuation of ethanol withdrawal by ceftriaxone-induced upregulation of glutamate transporter EAAT2. Springer Nat. 2014;39(7):1674-84.\nhttps://doi.org/10.1038/npp.2014.14\n.\nArticle\nCAS\nGoogle Scholar", "doc_items_refs": ["#/texts/537", "#/texts/538", "#/texts/539", "#/texts/540", "#/texts/541", "#/texts/542"], "page_nos": [], "uuid": "e2fcd49c-728d-4fc3-8c1e-0004b9255f67"}
{"doc_id": "2025__GLP-1_receptor_agonists_in_delirium_and_encephalopathies_a_neuroprotective_scopi__W4412779459", "source_path": "<redacted:source_path>", "chunk_id": 47, "source_chunk_idxs": [57], "num_tokens": 488, "text": "GLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\nVII. References\n92. Bauer J, et al. Craving in alcohol-dependent patients after detoxification is related to glutamatergic dysfunction in the nucleus accumbens and the anterior cingulate cortex. Springer Nat. 2013;38(8):1401-8.\nhttps://doi.org/10.1038/npp.2013.45\n.\nArticle\nCAS\nGoogle Scholar\n93. Dixit D, et al. Management of acute alcohol withdrawal syndrome in critically Ill patients. Wiley. 2016;36(7):797-822.\nhttps://doi.org/10.1002/phar.1770\n.\nArticle\nCAS\nGoogle Scholar\n94. Elliott DY. Caring for hospitalized patients with alcohol withdrawal syndrome. Lippincott Williams Wilkins. 2019;14(5):18-30.\nhttps://doi.org/10.1097/01.ccn.0000578828.37034.c2\n.\nArticle\nGoogle Scholar\n95. Maldonado JR. Novel algorithms for the prophylaxis and management of alcohol withdrawal syndromes-beyond benzodiazepines. Elsevier BV. 2017;33(3):559-99.\nhttps://doi.org/10.1016/j.ccc.2017.03.012\n.\nArticle\nGoogle Scholar\n96. McPheeters M, O'Connor EA, Riley S. Naltrexone, acamprosate show strongest results in review of alcohol use disorder treatments. Wiley. 2024;35(3):4-4.\nhttps://doi.org/10.1002/pu.31133\n.\nArticle\nGoogle Scholar\n97. Rizk JG, Saini J, Kim K, Pathan U, Qato DM. County-level factors associated with a mismatch between opioid overdose mortality and availability of opioid treatment facilities. Public Libr Sci. 2024.\nhttps://doi.org/10.1371/journal.pone.0301863\n.\nArticle\nGoogle Scholar\n98. Swift RM. Emerging approaches to managing alcohol dependence. Oxford: Oxford University Press; 2007.\nBook\nGoogle Scholar", "doc_items_refs": ["#/texts/543", "#/texts/544", "#/texts/545", "#/texts/546", "#/texts/547", "#/texts/548", "#/texts/549"], "page_nos": [], "uuid": "034f2a3f-863f-48ec-8262-b3d04eed83fd"}
{"doc_id": "2025__GLP-1_receptor_agonists_in_delirium_and_encephalopathies_a_neuroprotective_scopi__W4412779459", "source_path": "<redacted:source_path>", "chunk_id": 48, "source_chunk_idxs": [58], "num_tokens": 448, "text": "GLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\nVII. References\n99. Grieco M, et al. Glucagon-like peptide-1: a focus on neurodegenerative diseases. Frontiers Media. 2019.\nhttps://doi.org/10.3389/fnins.2019.01112\n.\nArticle\nGoogle Scholar\n100. Jerlhag E. GLP-1 signaling and alcohol-mediated behaviors; preclinical and clinical evidence. Elsevier BV. 2018;136:343-9.\nhttps://doi.org/10.1016/j.neuropharm.2018.01.013\n.\nArticle\nCAS\nGoogle Scholar\n101. Sharma AN, Pise A, Sharma JN, Shukla P. Glucagon-like peptide-1 (GLP-1) receptor agonist prevents development of tolerance to anti-anxiety effect of ethanol and withdrawal-induced anxiety in rats. Metab Brain Dis. 2015;30(3):719-30.\nhttps://doi.org/10.1007/s11011-014-9627-z\n.\nArticle\nCAS\nPubMed\nGoogle Scholar\n102. Breese GR, Overstreet DH, Knapp DJ, Navarro M. Prior multiple ethanol withdrawals enhance stress-induced anxiety-like behavior: inhibition by CRF1- and benzodiazepine-receptor antagonists and a 5-HT1a-receptor agonist. Springer Nat. 2005;30(9):1662-9.\nhttps://doi.org/10.1038/sj.npp.1300706\n.\nArticle\nCAS\nGoogle Scholar\n103. Jerlhag E. The therapeutic potential of glucagon-like peptide-1 for persons with addictions based on findings from preclinical and clinical studies. Front Pharmacol. 2023.\nhttps://doi.org/10.3389/fphar.2023.1063033\n.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/550", "#/texts/551", "#/texts/552", "#/texts/553", "#/texts/554"], "page_nos": [], "uuid": "4fc9be4f-b128-4bbf-ac0f-b83ea88066ee"}
{"doc_id": "2025__GLP-1_receptor_agonists_in_delirium_and_encephalopathies_a_neuroprotective_scopi__W4412779459", "source_path": "<redacted:source_path>", "chunk_id": 49, "source_chunk_idxs": [59], "num_tokens": 448, "text": "GLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\nVII. References\n104. Celik M, Gold MS, Fuehrlein B. A narrative review of current and emerging trends in the treatment of alcohol use disorder. Brain Sci. 2024;14(3):294.\nhttps://doi.org/10.3390/brainsci14030294\n.\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n105. Jerlhag E. Alcohol-mediated behaviours and the gut-brain axis; with focus on glucagon-like peptide-1. Elsevier BV. 2019;1727:146562-146562.\nhttps://doi.org/10.1016/j.brainres.2019.146562\n.\nArticle\nCAS\nGoogle Scholar\n106. Thomsen M, Holst JJ, Molander A, Línnet K, Ptito M, Fink-Jensen A. Effects of glucagon-like peptide 1 analogs on alcohol intake in alcohol-preferring vervet monkeys. Springer Sci Media. 2018;236(2):603-11.\nhttps://doi.org/10.1007/s00213-018-5089-z\n.\nArticle\nCAS\nGoogle Scholar\n107. M. R. Shen, K. Owusu-Boaitey, L. M. Holsen, and J. Suzuki, \"The Efficacy of GLP-1 Agonists in Treating Substance Use Disorder in Patients: A Scoping Review.\" Jan. 2024.\n108. Kopp KO, Glotfelty EJ, Li Y, Greig NH. Glucagon-like peptide-1 (GLP-1) receptor agonists and neuroinflammation: Implications for neurodegenerative disease treatment. Elsevier BV. 2022;186:106550-106550.\nhttps://doi.org/10.1016/j.phrs.2022.106550\n.\nArticle\nCAS\nGoogle Scholar", "doc_items_refs": ["#/texts/555", "#/texts/556", "#/texts/557", "#/texts/558", "#/texts/559"], "page_nos": [], "uuid": "626bce3c-e96d-4076-bb46-d4bbccad1179"}
{"doc_id": "2025__GLP-1_receptor_agonists_in_delirium_and_encephalopathies_a_neuroprotective_scopi__W4412779459", "source_path": "<redacted:source_path>", "chunk_id": 50, "source_chunk_idxs": [60], "num_tokens": 461, "text": "GLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\nVII. References\n109. Cheng L-Z, Li W, Chen Y-X, Lin Y-J, Miao Y. Autophagy and diabetic encephalopathy: mechanistic insights and potential therapeutic implications. Aging Dis. 2022;13(2):447-57.\nhttps://doi.org/10.14336/AD.2021.0823\n.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n110. Hui H, Nourparvar A, Zhao X, Perfetti R. Glucagon-like peptide-1 inhibits apoptosis of insulin-secreting cells via a cyclic 5′-adenosine monophosphate-dependent protein kinase A- and a phosphatidylinositol 3-kinase-dependent pathway. Oxf Univ Press. 2003;144(4):1444-55.\nhttps://doi.org/10.1210/en.2002-220897\n.\nArticle\nCAS\nGoogle Scholar\n111. Kobara M, Toba H, Nakata T. A glucagon-like peptide 1 analog protects mitochondria and attenuates hypoxia-reoxygenation injury in cultured cardiomyocytes. J Cardiovasc Pharmacol. 2022;79(4):568-76.\nhttps://doi.org/10.1097/FJC.0000000000001218\n.\nArticle\nCAS\nPubMed\nGoogle Scholar\n112. I. S. D. T. Y. L. N. H. G. Salcedo, \"Neuroprotective and neurotrophic actions of glucagon-like peptide-1: an emerging opportunity to treat neurodegenerative and cerebrovascular disorders,\" vol. undefined, no. undefined. Apr. 2012.\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC3419902/\nDownload references", "doc_items_refs": ["#/texts/560", "#/texts/561", "#/texts/562", "#/texts/563", "#/texts/564"], "page_nos": [], "uuid": "7187ec96-a637-4cb5-8f35-576a27b1566b"}
{"doc_id": "2025__GLP-1_receptor_agonists_in_delirium_and_encephalopathies_a_neuroprotective_scopi__W4412779459", "source_path": "<redacted:source_path>", "chunk_id": 51, "source_chunk_idxs": [61, 62, 63, 64], "num_tokens": 299, "text": "GLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\nAcknowledgements\nNot applicable.\n\nGLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\nFunding\nNo funds, grants, or other support was received.\n\nGLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\nAuthor information\nAuthors and Affiliations\n1. University of Hawaii John A. Burns School of Medicine Honolulu, Hawaii, HI, 96813, USA Francisco Mercado, Michaela Kop &amp; Michelle Trinh\n2. Tripler Army Medical Center, Honolulu, HI, USA Francisco Mercado\nAuthors\n1. Francisco Mercado\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n2. Michaela Kop\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n3. Michelle Trinh\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n\nGLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\nAuthor information\nContributions\nFM conceived the study, conducted the literature review, drafted and revised the manuscript, and supervised the overall process. MT and MK reviewed the manuscript, screened the articles, extracted data, created and modified the diagram, and ensured the completeness of the references.", "doc_items_refs": ["#/texts/566", "#/texts/568", "#/texts/571", "#/texts/572", "#/texts/573", "#/texts/574", "#/texts/575", "#/texts/576", "#/texts/578"], "page_nos": [], "uuid": "f961ee5a-43e1-4f35-9816-0f4b9753e346"}
{"doc_id": "2025__GLP-1_receptor_agonists_in_delirium_and_encephalopathies_a_neuroprotective_scopi__W4412779459", "source_path": "<redacted:source_path>", "chunk_id": 52, "source_chunk_idxs": [65, 66, 67, 68, 69], "num_tokens": 285, "text": "GLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\nAuthor information\nCorresponding author\nCorrespondence to\nFrancisco Mercado\n.\n\nGLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\nEthics declarations\nEthical approval and consent to participate\nEthical approval was not necessary for this scoping review since it reviews existing literature and does not involve collecting new data from human participants. Consent to participate was not necessary for this scoping review, as it is a review of the existing literature and does not involve collecting new data from human participants.\n\nGLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\nEthics declarations\nConsent for publication\nConsent to publish was not necessary for this scoping review since it did not include identifiable personal data.\n\nGLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\nEthics declarations\nCompeting interests\nThe authors declare no competing interests.\n\nGLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\nAdditional information\nPublisher's Note\nSpringer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations.", "doc_items_refs": ["#/texts/580", "#/texts/581", "#/texts/582", "#/texts/585", "#/texts/587", "#/texts/589", "#/texts/592"], "page_nos": [], "uuid": "3356e653-0b09-4c19-a2b2-7035d3aa9810"}
{"doc_id": "2025__GLP-1_receptor_agonists_in_delirium_and_encephalopathies_a_neuroprotective_scopi__W4412779459", "source_path": "<redacted:source_path>", "chunk_id": 53, "source_chunk_idxs": [70, 71, 72], "num_tokens": 424, "text": "GLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\nSupplementary Information\nBelow is the link to the electronic supplementary material.\n\nGLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\nRights and permissions\nOpen Access\nThis article is licensed under a Creative Commons Attribution 4.0 International License, which permits use, sharing, adaptation, distribution and reproduction in any medium or format, as long as you give appropriate credit to the original author(s) and the source, provide a link to the Creative Commons licence, and indicate if changes were made. The images or other third party material in this article are included in the article's Creative Commons licence, unless indicated otherwise in a credit line to the material. If material is not included in the article's Creative Commons licence and your intended use is not permitted by statutory regulation or exceeds the permitted use, you will need to obtain permission directly from the copyright holder. To view a copy of this licence, visit\nhttp://creativecommons.org/licenses/by/4.0/\n.\nReprints and permissions\n\nGLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\nAbout this article\nCite this article\nMercado, F., Kop, M. &amp; Trinh, M. GLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review.\nDiscov Med\n2\n, 207 (2025). https://doi.org/10.1007/s44337-025-00428-0\nDownload citation\n- Received : 14 April 2025\n- Accepted : 10 July 2025\n- Published : 31 July 2025\n- DOI : https://doi.org/10.1007/s44337-025-00428-0", "doc_items_refs": ["#/texts/594", "#/texts/598", "#/texts/599", "#/texts/600", "#/texts/601", "#/texts/602", "#/texts/605", "#/texts/606", "#/texts/607", "#/texts/608", "#/texts/609", "#/texts/610", "#/texts/611", "#/texts/612", "#/texts/613"], "page_nos": [], "uuid": "a2334dcb-6fdc-4731-a934-9484ff730b53"}
{"doc_id": "2025__GLP-1_receptor_agonists_in_delirium_and_encephalopathies_a_neuroprotective_scopi__W4412779459", "source_path": "<redacted:source_path>", "chunk_id": 54, "source_chunk_idxs": [73, 74, 75, 76, 77, 78, 79, 80], "num_tokens": 469, "text": "GLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\nAbout this article\nKeywords\n- Glucagon-like peptide-1 receptor agonists (GLP-1 RA or GLP-1 RAs)\n- Delirium\n- Encephalopathy\n- Neuroprotection\n- Neurodegenerative diseases\n- Neuroinflammation\n- Cognitive impairment\n\nGLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\nAbout this article\nProfiles\n1. Francisco Mercado\nView author profile\nUse our pre-submission checklist\nAvoid common mistakes on your manuscript.\nAdvertisement\n\nGLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\nSearch\nSearch by keyword or author\nSearch\n\nGLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\nNavigation\n- Find a journal\n- Publish with us\n- Track your research\n\nGLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\nNavigation\nDiscover content\n- Journals A-Z\n- Books A-Z\n\nGLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\nNavigation\nPublish with us\n- Journal finder\n- Publish your research\n- Language editing\n- Open access publishing\n\nGLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\nNavigation\nProducts and services\n- Our products\n- Librarians\n- Societies\n- Partners and advertisers\n\nGLP-1 receptor agonists in delirium and encephalopathies: a neuroprotective scoping review\nNavigation\nOur brands\n- Springer\n- Nature Portfolio\n- BMC\n- Palgrave Macmillan\n- Apress\n- Discover\n- Your privacy choices/Manage cookies\n- Your US state privacy rights\n- Accessibility statement\n- Terms and conditions\n- Privacy policy\n- Help and support\n- Legal notice\n- Cancel contracts here\n173.68.96.214\nNot affiliated\nImage Hyperlink.\n© 2025 Springer Nature", "doc_items_refs": ["#/texts/615", "#/texts/616", "#/texts/617", "#/texts/618", "#/texts/619", "#/texts/620", "#/texts/621", "#/texts/623", "#/texts/624", "#/texts/625", "#/texts/626", "#/texts/628", "#/texts/629", "#/texts/631", "#/texts/632", "#/texts/633", "#/texts/635", "#/texts/636", "#/texts/638", "#/texts/639", "#/texts/640", "#/texts/641", "#/texts/643", "#/texts/644", "#/texts/645", "#/texts/646", "#/texts/648", "#/texts/649", "#/texts/650", "#/texts/651", "#/texts/652", "#/texts/653", "#/texts/654", "#/texts/655", "#/texts/656", "#/texts/657", "#/texts/658", "#/texts/659", "#/texts/660", "#/texts/661", "#/texts/662", "#/texts/663", "#/texts/664", "#/texts/665"], "page_nos": [], "uuid": "38c934bf-17ca-4ecb-846a-b648c17b7659"}
