{"doc_id": "2025__Mobile_applications_for_individuals_living_with_dementia_and_their_caregivers_De__W4411154372", "source_path": "<redacted:source_path>", "chunk_id": 0, "source_chunk_idxs": [0], "num_tokens": 62, "text": "Mobile applications for individuals living with dementia and their caregivers. Dementia prevention - Aktualności Neurologiczne - Current Neurology\nIndexing\nA\nA\nA\nPartner serwisu:\nPL\nAbout the Journal\nEditorial Board\nIndexing\nContact\nONLINE FIRST\nCurrent Issue\nArchive\nInstructions for Authors\nPublication Ethics\nSubmit article", "doc_items_refs": ["#/texts/1", "#/texts/2", "#/texts/3", "#/texts/4", "#/texts/5", "#/texts/6", "#/texts/7", "#/texts/8", "#/texts/9", "#/texts/10", "#/texts/11", "#/texts/12", "#/texts/13", "#/texts/14", "#/texts/15", "#/texts/16"], "page_nos": [], "uuid": "0dfdd67a-d76b-45ed-8d42-9a2c81b3fde3"}
{"doc_id": "2025__Mobile_applications_for_individuals_living_with_dementia_and_their_caregivers_De__W4411154372", "source_path": "<redacted:source_path>", "chunk_id": 1, "source_chunk_idxs": [1], "num_tokens": 511, "text": "Mobile applications for individuals living with dementia and their caregivers. Dementia prevention - Aktualności Neurologiczne - Current Neurology\nMobile applications for individuals living with dementia and their caregivers. Dementia prevention\nJulia Lipska, Klaudia Karina Leś\nAffiliation and address for correspondence\nStudent Scientific Society, Chair and Department of Neurology, Medical University of Lublin, Lublin, Poland\nCorrespondence: Julia Lipska, Student Scientific Society, Chair and Department of Neurology, Medical University of Lublin, Jaczewskiego 8, 20-090 Lublin, Poland, e-mail:\njulka98712@gmail.com\nORCID iDs\n1. Julia Lipska\nhttps://orcid.org/0009-0009-4093-2543\n2. Klaudia Karina Leś\nhttps://orcid.org/0009-0007-9357-5573\nAktualn Neurol 2024; 24 (4): 154-159\nDOI:\n10.15557/AN.2024.0023\nPlumX metrics:\nAbstract\nThe increasing global aging population and the rising incidence of dementia create urgent demands for medical professionals. Innovation in medical technology is driving novel approaches to facilitate early diagnosis, rehabilitation, treatment, and care. Researchers worldwide are increasingly exploring the potential of mobile applications to support effective cognitive training for older adults and individuals living with dementia. Cognitively stimulating activities have consistently demonstrated a positive influence on cognitive functions such as processing speed, memory, reasoning, and verbal abilities. These activities are among the non-pharmacological approaches recommended for dementia care. Consequently, engaging in cognitively stimulating activities could benefit older adults by decreasing the risk of developing neurodegenerative conditions or helping to halt the progression of mild cognitive impairment in some individuals. The increasing use of mobile devices across all demographics, including 61% of adults aged 65+ according to a 2022 Pew Research Center study in the United States (Faverio, 2023), makes mobile platforms a promising vehicle to expand access, ease, and usability in cognitive training. This review aims to summarise findings from scientific literature on existing mobile applications designed to promote cognitive training and their potential to support cognition in older adults. The review presents examples of commercially available mobile games for cognitive training and exercise, discussing their potential advantages and disadvantages in usability for cognitive stimulation therapy in older adults.\nKeywords\ndementia, cognitive training, mHealth, mobile apps", "doc_items_refs": ["#/texts/18", "#/texts/19", "#/texts/20", "#/texts/21", "#/texts/22", "#/texts/23", "#/texts/24", "#/texts/25", "#/texts/26", "#/texts/27", "#/texts/28", "#/texts/29", "#/texts/30", "#/texts/31", "#/texts/32", "#/texts/33", "#/texts/34", "#/texts/35"], "page_nos": [], "uuid": "90ac1f2a-aaa5-4bb7-88a2-16c549cb095f"}
{"doc_id": "2025__Mobile_applications_for_individuals_living_with_dementia_and_their_caregivers_De__W4411154372", "source_path": "<redacted:source_path>", "chunk_id": 2, "source_chunk_idxs": [2], "num_tokens": 426, "text": "Mobile applications for individuals living with dementia and their caregivers. Dementia prevention - Aktualności Neurologiczne - Current Neurology\nMobile applications for individuals living with dementia and their caregivers. Dementia prevention\nOświadczam, że posiadam prawo wykonywania zawodu lekarza i jestem uprawniony do otrzymywania specjalistycznych informacji medycznych. Chcę zapoznać się z informacją z serwisu.\nTAK\nNiniejszy serwis skierowany jest do lekarzy. Ze względu na wymogi ustawy z dnia 6 września 2001 r. Prawo farmaceutyczne (tekst jednolity Dz. U. z 2004 r., Nr 53, poz. 533 z późn. zm.), dostęp do treści zawartych w serwisie, materiałów i informacji, możliwy jest wyłącznie dla osób uprawnionych do otrzymywania specjalistycznych informacji medycznych oraz reklamy produktów leczniczych. Jeśli nie jesteś osobą uprawnioną niektóre treści prezentowane w serwisie nie są przeznaczone dla Ciebie.\nAby zapoznać się z wybraną treścią serwisu przeznaczoną dla lekarzy podaj\nNumer Prawa Wykonywania Zawodu:\nBłędny NPWZ\nDalej\nImage Hyperlink.\nNewsletter:\nIf you want to receive notifications about new articles, please enter your e-mail address:\nAdd\n- Contact\n- Indexing\n- Advertising\n- Privacy policy\nISSN 1641-9227, eISSN 2451-0696", "doc_items_refs": ["#/texts/36", "#/texts/37", "#/texts/38", "#/texts/39", "#/texts/40", "#/texts/41", "#/texts/42", "#/texts/43", "#/texts/44", "#/texts/45", "#/texts/46", "#/texts/47", "#/texts/48", "#/texts/49", "#/texts/50", "#/texts/51"], "page_nos": [], "uuid": "2da2a88e-8677-4c9c-a343-7433428b7a3c"}
