{"doc_id": "2025__Causal_Effects_of_the_Plasma_Proteome_on_Vascular_Dementia_Risk_A_Mendelian_Rand__W4412068972", "source_path": "<redacted:source_path>", "chunk_id": 0, "source_chunk_idxs": [0, 1], "num_tokens": 226, "text": "Causal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation | Cellular and Molecular Neurobiology\nSkip to main content\nAdvertisement\nLog in\nMenu\nFind a journal\nPublish with us\nTrack your research\nSearch\nCart\n1. Home\n2. Cellular and Molecular Neurobiology\n3. Article\n\nCausal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\n- Original Research\n- Open access\n- Published: 07 July 2025\n- Volume 45 , article number 66 , ( 2025 )\n- Cite this article\nDownload PDF\nYou have full access to this\nopen access\narticle\nCellular and Molecular Neurobiology\nAims and scope\nSubmit manuscript\nCausal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nDownload PDF\n- Yunmeng Chen\n1\nna1\n,\n- Chunyan Guo\n1\nna1\n,\n- Xiao Liang\n1\n,\n- Xiansu Chi\n1\n,\n- Zixuan Zhang\n1\n,\n- Ze Chang\n1\n&amp;\n- ...\n- Yunling Zhang\n1\nShow authors\n- 1192 Accesses\n- Explore all metrics", "doc_items_refs": ["#/texts/1", "#/texts/2", "#/texts/3", "#/texts/4", "#/texts/5", "#/texts/6", "#/texts/7", "#/texts/8", "#/texts/9", "#/texts/10", "#/texts/11", "#/texts/12", "#/texts/14", "#/texts/15", "#/texts/16", "#/texts/17", "#/texts/18", "#/texts/19", "#/texts/20", "#/texts/21", "#/texts/22", "#/texts/23", "#/texts/24", "#/texts/25", "#/texts/26", "#/texts/27", "#/texts/28", "#/texts/29", "#/texts/30", "#/texts/31", "#/texts/32", "#/texts/33", "#/texts/34", "#/texts/35", "#/texts/36", "#/texts/37", "#/texts/38"], "page_nos": [], "uuid": "97149476-6d3e-4a84-aea5-2be267ee33b6"}
{"doc_id": "2025__Causal_Effects_of_the_Plasma_Proteome_on_Vascular_Dementia_Risk_A_Mendelian_Rand__W4412068972", "source_path": "<redacted:source_path>", "chunk_id": 1, "source_chunk_idxs": [2, 3, 4, 5], "num_tokens": 480, "text": "Causal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nAbstract\nVascular dementia (VaD) is a prevalent form of dementia caused by cerebrovascular disease, leading to cognitive impairment. While various risk factors have been identified, the role of plasma proteins in VaD etiology remains poorly understood. This study employs Mendelian randomization (MR) to investigate the causal relationship between plasma proteins and VaD risk, complemented by experimental validation. We conducted a two-sample MR analysis using summary statistics from genome-wide association studies (GWAS) on plasma proteins and VaD. Plasma protein data were derived from the deCODE Health study, encompassing 35,559 Icelandic participants and genetic associations for 4907 circulating proteins. VaD GWAS data were obtained from the FinnGen biobank, comprising 2717 VaD patients and 393,024 controls. Instrumental variables (IVs) were selected based on genome-wide significance thresholds (P\n-8\nfor plasma proteins, P\n-6\nfor VaD). The primary analysis used inverse variance weighting (IVW), supplemented by weighted median, MR-Egger, simple mode, and weighted mode methods. The Sensitivity analyses included heterogeneity tests, horizontal pleiotropy assessments, and leave-one-out analyses. Additionally, a 2-vessel occlusion (2-VO) animal model was used to validate key genes, with gene expression measured by quantitative real-time PCR (qPCR). Our initial MR analysis identified 123 plasma proteins significantly associated with VaD (\nP\n\nCausal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nAbstract\nCombining GWAS Summary Data and Proteomics Identified Potential Drug Targets in Dementia\nArticle\n23 April 2025\n\nCausal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nAbstract\nMendelian randomization and genetic colocalization infer the effects of the multi-tissue proteome on 211 complex disease-related phenotypes\nArticle\nOpen access\n12 December 2022\n\nCausal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nAbstract\nProspective Investigation Unravels Plasma Proteomic Links to Dementia\nArticle\n30 January 2025", "doc_items_refs": ["#/texts/40", "#/texts/41", "#/texts/42", "#/texts/43", "#/texts/44", "#/texts/45", "#/texts/49", "#/texts/50", "#/texts/52", "#/texts/53", "#/texts/54", "#/texts/56", "#/texts/57"], "page_nos": [], "uuid": "187bb324-b8ce-4aa9-8e95-b27394f12e57"}
{"doc_id": "2025__Causal_Effects_of_the_Plasma_Proteome_on_Vascular_Dementia_Risk_A_Mendelian_Rand__W4412068972", "source_path": "<redacted:source_path>", "chunk_id": 2, "source_chunk_idxs": [6], "num_tokens": 482, "text": "Causal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nAbstract\nExplore related subjects\nDiscover the latest articles, books and news in related subjects, suggested using machine learning.\n- Alzheimer's disease\n- Blood proteins\n- Physics of Proteins in Health and Disease\n- Protein Complex\n- Proteins\n- Proteomics\nUse our pre-submission checklist\nAvoid common mistakes on your manuscript.\nAs the global population ages, dementia has become a major public health challenge, with over 50 million people currently estimated to be living with the condition. This number is projected to rise to 132 million by 2050 (Collaborators\n2022\n). Vascular dementia (VaD) is the second most common type of dementia after Alzheimer's disease, accounting for approximately 30% of all dementia cases (Jia et al.\n2020\n). VaD often has an insidious onset, making it prone to misdiagnosis or being overlooked. Disease progression is associated with poor clinical outcomes, including accelerated cognitive decline, reduced quality of life, and increased mortality risk (Wolters and Ikram\n2019\n). Unfortunately, due to the complex and poorly understood pathogenesis of VaD, no effective drugs have been developed to slow its progression. Therefore, identifying potential mechanisms and therapeutic targets for VaD is of great importance.\nProteins play a central role in all biological processes, both in health and disease. The human plasma proteome consists of proteins that are secreted or shed into the circulation, where they either carry out their functions or mediate cross-tissue communication (Zhong et al.\n2021\n). These proteins are often dysregulated in disease and represent important therapeutic targets. Together with the accessibility of blood compared to other tissues, plasma proteins provide an attractive source for identifying molecular signatures of disease in large cohorts. Some studies have investigated the associations between plasma proteins and VaD (Shang et al.\n2018\n). However, most of these studies relied on low-throughput protein measurement techniques and had limited sample sizes. Moreover, due to the observational nature of these studies, confounding bias and reverse causation were unavoidable. In other words, the associated plasma proteins identified in these studies may serve as biomarkers but are not necessarily causal factors of VaD. Therefore, stronger evidence is needed to clarify the role of plasma proteins in VaD.", "doc_items_refs": ["#/texts/59", "#/texts/60", "#/texts/61", "#/texts/62", "#/texts/63", "#/texts/64", "#/texts/65", "#/texts/66", "#/texts/67", "#/texts/68", "#/texts/69", "#/texts/70", "#/texts/71", "#/texts/72", "#/texts/73", "#/texts/74", "#/texts/75", "#/texts/76", "#/texts/77", "#/texts/78", "#/texts/79"], "page_nos": [], "uuid": "029546a7-eaaa-4f5a-9496-3f88eed4f503"}
{"doc_id": "2025__Causal_Effects_of_the_Plasma_Proteome_on_Vascular_Dementia_Risk_A_Mendelian_Rand__W4412068972", "source_path": "<redacted:source_path>", "chunk_id": 3, "source_chunk_idxs": [7], "num_tokens": 197, "text": "Causal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nAbstract\nExplore related subjects\nMendelian randomization (MR) is a robust approach that can estimate the causal effects of exposures on disease risk (Lawlor et al.\n2008\n). According to Mendel's law, the genetic variants are randomly allocated during meiosis and remain fixed from conception onward. This random allocation reduces susceptibility to confounding bias and reverse causation, making MR a powerful tool for causal inference (Davies et al.\n2019\n). In this study, we applied the MR approach to assess the potential causal relationships between plasma proteins and the risk of VaD using publicly available genome-wide association study (GWAS) data. Furthermore, we conducted two-sample MR analyses to identify plasma proteins associated with VaD. Finally, we performed functional genomic pathway analyses to identify biologically relevant pathways enriched by the identified proteins.", "doc_items_refs": ["#/texts/80", "#/texts/81", "#/texts/82", "#/texts/83", "#/texts/84"], "page_nos": [], "uuid": "c091f936-4c2c-4c62-88a2-2f2dbc29f52c"}
{"doc_id": "2025__Causal_Effects_of_the_Plasma_Proteome_on_Vascular_Dementia_Risk_A_Mendelian_Rand__W4412068972", "source_path": "<redacted:source_path>", "chunk_id": 4, "source_chunk_idxs": [8], "num_tokens": 320, "text": "Causal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nMaterials and Methods\nStudy Design\nThis study utilizes publicly available genome-wide association study (GWAS) summary statistics. In the MR analysis, we employ single nucleotide polymorphisms (SNPs) as instrumental variables and plasma proteins as exposure factors. VaD is used as the outcome to elucidate the causal relationship between plasma proteins and VaD.\nThe instrumental variables selected for MR analysis in this study must satisfy the following three core assumptions to ensure the validity of causal inference:\n(1)The instrumental variable SNPs must exhibit a robust and statistically significant association with the exposure (plasma proteins). The strength of the genetic instruments is evaluated using the F-statistic; an F-statistic exceeding 10 indicates a strong correlation between the instrumental variable and the exposure.(2)The instrumental variable SNPs must be independent of other confounding variables that influence VaD.(3)The instrumental variable SNPs must impact VaD exclusively through their effect on plasma proteins, without any alternative causal pathways.\nTo further validate the findings from the MR analysis, we employed an in vivo animal model. Specifically, a bilateral carotid artery ligation model was used to simulate vascular dementia conditions. This model allows for the examination of key gene expressions and their potential roles in the pathogenesis of VaD. By integrating MR analysis with experimental validation, this study provides both statistical and biological evidence to support the causal relationships between plasma proteins and VaD.", "doc_items_refs": ["#/texts/87", "#/texts/88", "#/texts/89", "#/texts/90"], "page_nos": [], "uuid": "3c579443-368d-42ba-a323-0cb9f08f0af8"}
{"doc_id": "2025__Causal_Effects_of_the_Plasma_Proteome_on_Vascular_Dementia_Risk_A_Mendelian_Rand__W4412068972", "source_path": "<redacted:source_path>", "chunk_id": 5, "source_chunk_idxs": [9, 10], "num_tokens": 310, "text": "Causal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nMaterials and Methods\nMendelian Randomization\nData Sources\nThe GWAS data for plasma proteins were sourced from the deCODE Health study, which involves an extensive protein quantitative trait loci (pQTL) analysis of 35,559 Icelandic participants. This research provides comprehensive summary statistics on the genetic associations of 4907 circulating protein levels (Ferkingstad et al.\n2021\n).The summary GWAS data for VaD were obtained from the 10th release of the FinnGen consortium (\nhttps://r8.risteys.finngen.fi/\n). This dataset specifically comprises 2717 VaD cases and 393,024 controls(Gao et al.\n2023\n).\n\nCausal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nMaterials and Methods\nMendelian Randomization\nSelection of Instrumental Variables\nFor plasma proteins, IVs were selected based on a significance threshold of P\n−8\n. To ensure the independence of IVs and exclude linkage disequilibrium (LD) interference, we applied a parameter setting of r\n2\n−6\n(Gao et al.\n2023\n; Hu et al.\n2022\n). The strength of the IVs was evaluated using the F-statistic. IVs with F &gt; 10 were deemed strong instruments, while those falling below this threshold, indicating weak instrument bias, were systematically excluded from the analysis.", "doc_items_refs": ["#/texts/93", "#/texts/94", "#/texts/95", "#/texts/96", "#/texts/97", "#/texts/98", "#/texts/99", "#/texts/101", "#/texts/102", "#/texts/103", "#/texts/104", "#/texts/106", "#/texts/107", "#/texts/108", "#/texts/109", "#/texts/110", "#/texts/111"], "page_nos": [], "uuid": "fbc076a3-fd1d-4326-aacf-fac8e024a0f7"}
{"doc_id": "2025__Causal_Effects_of_the_Plasma_Proteome_on_Vascular_Dementia_Risk_A_Mendelian_Rand__W4412068972", "source_path": "<redacted:source_path>", "chunk_id": 6, "source_chunk_idxs": [11], "num_tokens": 291, "text": "Causal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nMaterials and Methods\nMendelian Randomization\nStatistical Methods\nThis study employed a bidirectional two-sample MR approach to integrate GWAS data from plasma proteins and VaD. The primary analytical method utilized was inverse variance weighted (IVW) analysis, augmented and validated by weighted median, MR-Egger, simple mode, and weighted mode methods. All MR analyses were conducted using R software (version 4.2.3), with the TwoSampleMR (version 0.5.7) (Hemani et al.\n2018\n) and MR-PRESSO packages.\nThe Sensitivity analyses encompassed assessments for heterogeneity, horizontal pleiotropy, and leave-one-out analysis. Heterogeneity among instrumental variables was evaluated using Cochran's Q test, where\nP\n&gt; 0.05 indicated no significant heterogeneity. Horizontal pleiotropy was examined through MR-Egger regression, with an intercept approaching zero suggesting an absence of horizontal pleiotropy. The leave-one-out method was employed to assess the impact of individual SNPs on the results.\nThe association between plasma proteins and VaD risk was quantified using odds ratios (OR) and their corresponding 95% confidence intervals (CI). Statistical significance was defined as\nP", "doc_items_refs": ["#/texts/113", "#/texts/114", "#/texts/115", "#/texts/116", "#/texts/117", "#/texts/118", "#/texts/119", "#/texts/120"], "page_nos": [], "uuid": "259cdbbc-09e6-4175-96ec-6bbabada716a"}
{"doc_id": "2025__Causal_Effects_of_the_Plasma_Proteome_on_Vascular_Dementia_Risk_A_Mendelian_Rand__W4412068972", "source_path": "<redacted:source_path>", "chunk_id": 7, "source_chunk_idxs": [12, 13], "num_tokens": 396, "text": "Causal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nMaterials and Methods\nAnimal Experimentation\nAnimal Model Establishment\nTo validate the differentially expressed genes identified in VaD research, we utilized healthy SPF-grade Sprague-Dawley rats aged 6 to 8 weeks. The rats were housed under controlled conditions, including a 12-h light/dark cycle, a temperature of 22 °C, and humidity levels of 45-60%, in accordance with ethical guidelines (Approval No.: 2024XLC019).\nThe two-vessel occlusion (2-VO) model was established by anesthetizing the rats with sodium pentobarbital at a dosage of 0.1-0.2 ml/100 g body weight. In the 2-VO group, both common carotid arteries were ligated to induce chronic cerebral hypoperfusion, while the control group underwent only the vessel exposure procedure without occlusion(Tian et al.\n2014\n). Post-surgery, each rat received a subcutaneous injection of 100,000 units of penicillin daily for three consecutive days to prevent infection, and their recovery was closely monitored.\n\nCausal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nMaterials and Methods\nAnimal Experimentation\nBehavioral Assessments\nThe Morris Water Maze was employed to assess spatial learning and memory in rats. The Place Navigation Test was conducted over five consecutive days, with each rat undergoing four trials per day. The average escape latency across the four quadrants was calculated daily to evaluate spatial learning ability. On the sixth day, the Spatial Probe Test was conducted. During this test, the platform was removed, and each rat was placed at the midpoint of the quadrant opposite to the former platform location. The number of platform crossings and the time spent in the target quadrant within 120 s were recorded to evaluate spatial memory retention.", "doc_items_refs": ["#/texts/124", "#/texts/125", "#/texts/126", "#/texts/127", "#/texts/129"], "page_nos": [], "uuid": "6eb115d3-56f3-4b26-87c3-c97870d0e15f"}
{"doc_id": "2025__Causal_Effects_of_the_Plasma_Proteome_on_Vascular_Dementia_Risk_A_Mendelian_Rand__W4412068972", "source_path": "<redacted:source_path>", "chunk_id": 8, "source_chunk_idxs": [14, 15], "num_tokens": 387, "text": "Causal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nMaterials and Methods\nAnimal Experimentation\nMolecular Validation (PCR)\nAfter the behavioral experiments, the left hippocampal tissue was collected for molecular validation, including RNA extraction and cDNA synthesis. The RNA extraction was performed using RNase-Free Water (Beijing Solarbio Science &amp; Technology Co., Ltd., Product No.: R1600). Reverse transcription was conducted using a reverse transcription kit (Hunan Accurate Biotechnology Co., Ltd., Product No.: AG11728), with GAPDH as the reference gene for primer design. The specific primer sequences are listed in the Table\n1\n.\nReal-time quantitative PCR (qPCR) was performed using QPCR reagents (Hunan Accurate Biotechnology Co., Ltd., Product No.: AG11739). The qPCR was conducted on an ABI QuantStudio 7 Flex instrument, targeting genes including MED4, COPS7B, CSF3, NRXN1, and LRRTM4, with GAPDH as the reference gene.\n\nCausal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nMaterials and Methods\nAnimal Experimentation\nStatistical Analysis\nBehavioral and qPCR data were analyzed using GraphPad Prism 8.0. The normality of the data was assessed using the Shapiro-Wilk test. For normally distributed data, the group differences were analyzed using one-way ANOVA or independent-samples t-tests, with post hoc analyses performed using Tukey's HSD test when applicable. For non-normally distributed data, non-parametric tests such as the Mann-Whitney U test (for two groups) or the Kruskal-Wallis test (for multiple groups) were applied.A\np\n-value of", "doc_items_refs": ["#/texts/131", "#/texts/132", "#/texts/133", "#/texts/134", "#/texts/136", "#/texts/137", "#/texts/138"], "page_nos": [], "uuid": "d15af7c3-3b06-46d7-a341-fc99942b9c5f"}
{"doc_id": "2025__Causal_Effects_of_the_Plasma_Proteome_on_Vascular_Dementia_Risk_A_Mendelian_Rand__W4412068972", "source_path": "<redacted:source_path>", "chunk_id": 9, "source_chunk_idxs": [16], "num_tokens": 349, "text": "Causal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nResults\nThe Causal Relationship Between Plasma Proteins and Dementia\nTo investigate the role of various plasma proteins in the pathogenesis of VaD, we utilized a two-sample MR analysis to explore their causal associations. The MR analysis identified 123 plasma proteins significantly associated with VaD (\np\n2\n).\nFig. 1\nAfter FDR correction, 12 proteins showed significant associations with vascular dementia (VaD) (Fig.\n2\n). Among these, 7 proteins-MED4, COPS7B, CSF3, IL26, NRXN1, LRRTM4, and MAGEA3-were identified as risk factors potentially promoting the development of VaD. Both IVW and weighted median methods consistently indicated the same direction of causality. Notably, MED4 demonstrated the most significant association with VaD (OR = 1.819, 95% CI: 1.493-2.217, FDR\nFig. 2\nTo further confirm the stability of our MR analysis, we conducted sensitivity analyses (Table\n2\nand Supplementary material Fig.\n1\n). Among the nine plasma proteins-MED4, COPS7B, CSF3, IL26, NRXN1, LRRTM4, MAGEA3, CRYZL1, and TMCC3-ultimately identified as having robust causal associations with VaD, sensitivity analyses confirmed stable results. The cochran's Q statistic indicated the presence of heterogeneity in the significant causal relationships between plasma proteins TP53I11, FAM69C, CRYZL1, GGT2, TMCC3, and VaD (P", "doc_items_refs": ["#/texts/141", "#/texts/142", "#/texts/144", "#/texts/145", "#/texts/146", "#/texts/147", "#/texts/148", "#/texts/149", "#/texts/150", "#/texts/151", "#/texts/152", "#/texts/153", "#/texts/154", "#/texts/155"], "page_nos": [], "uuid": "720bd488-2dd5-4aae-920d-94407eade523"}
{"doc_id": "2025__Causal_Effects_of_the_Plasma_Proteome_on_Vascular_Dementia_Risk_A_Mendelian_Rand__W4412068972", "source_path": "<redacted:source_path>", "chunk_id": 10, "source_chunk_idxs": [17, 18], "num_tokens": 294, "text": "Causal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nResults\nCausal Effect of VaD on Plasma Proteins\nIn the reverse two-sample MR analysis, VaD was considered as the exposure factor, and the previously identified nine plasma proteins were treated as the outcome variables. Since no SNPs associated with VaD were identified at the threshold of P = 5 × 10^−8, we adjusted the threshold to P = 5 × 10^−6 for selecting instrumental variables (IVs) between VaD and plasma proteins. Ultimately, 17 SNPs were included as IVs for the reverse MR analysis (Supplementary material Table\n3\n). All IVs had F-statistics greater than 10, indicating strong instrument strength.\nThe reverse MR analysis revealed potential reverse causal relationships between VaD and CRYZL1, TMCC3 (Fig.\n3\n). However, the results from the IVW method were not consistent with those from the weighted median method, suggesting instability in these causal relationships. The Cochran's Q statistic indicated heterogeneity in the significant causal relationships between CRYZL1, TMCC3, and VaD (P\n2\nand Supplementary material Fig.\n2\n.\nFig. 3\n\nCausal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nResults\nPlasma Protein Network Analysis\nWe selected plasma proteins with\nP\n4\n.\nFig. 4", "doc_items_refs": ["#/texts/157", "#/texts/158", "#/texts/159", "#/texts/160", "#/texts/161", "#/texts/162", "#/texts/163", "#/texts/164", "#/texts/165", "#/texts/166", "#/texts/167", "#/texts/169", "#/texts/170", "#/texts/172", "#/texts/173", "#/texts/174"], "page_nos": [], "uuid": "9b87a4d7-36ec-4f19-8c1e-ab09afcf7b7c"}
{"doc_id": "2025__Causal_Effects_of_the_Plasma_Proteome_on_Vascular_Dementia_Risk_A_Mendelian_Rand__W4412068972", "source_path": "<redacted:source_path>", "chunk_id": 11, "source_chunk_idxs": [19, 20, 21], "num_tokens": 478, "text": "Causal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nResults\nGO Enrichment Analysis and Pathway Analysis\nThe GO enrichment analysis (Fig.\n5\n) showed that the main biological functions of plasma proteins associated with VaD were protein folding, regulation of humoral immune response, positive regulation of leukocyte migration, positive regulation of non-canonical NF-kappaB signal transduction, regulation of stress-activated MAPK cascade, and regulation of stress-activated protein kinase signaling cascade. In terms of molecular function, the main endopeptidase activator activity, endopeptidase regulator activity, peptidase regulator activity, tau protein binding, peptidase activator activity, calcium activator activity, and peptide activator activity. Activity, calcium-dependent protein binding. The molecular functions are proteasome accessory complex, endolysosome, proteasome complex, glutamatergic synapse, endopeptidase complex, neuronal cell body. Plasma proteins are mainly enriched for KEGG pathway analysis antigen processing and presentation, proteasome, efferocytosis, cell adhesion molecules (Fig.\n6\n).\nFig. 5\nFig. 6\n\nCausal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nResults\nAnimal Experiment Results\nValidation of the Animal Model\nDuring the 4-day spatial navigation training, both the sham-operated group and the model group showed a reduction in escape latency, indicating an improvement in the rats' spatial memory with training. However, compared to the sham-operated group, the model group exhibited a significantly prolonged escape latency, particularly on the third and fifth days, with statistically significant differences (P\n7\n(A-C).\n\nCausal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nResults\nAnimal Experiment Results\nDifferential Gene Expression Analysis\nThe qRT-PCR analysis indicated that the expression levels of COPS7B, CSF3, and NRXN1 were upregulated to varying degrees in the model group. Among these, the upregulation of NRXN1 was statistically significant compared to the sham-operated group (P\n7\n(D-F).\nFig. 7", "doc_items_refs": ["#/texts/176", "#/texts/177", "#/texts/178", "#/texts/179", "#/texts/180", "#/texts/181", "#/texts/182", "#/texts/185", "#/texts/186", "#/texts/187", "#/texts/189", "#/texts/190", "#/texts/191", "#/texts/192"], "page_nos": [], "uuid": "eeee56cf-b71d-4d84-adb2-0c84bd401c31"}
{"doc_id": "2025__Causal_Effects_of_the_Plasma_Proteome_on_Vascular_Dementia_Risk_A_Mendelian_Rand__W4412068972", "source_path": "<redacted:source_path>", "chunk_id": 12, "source_chunk_idxs": [22], "num_tokens": 450, "text": "Causal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nDiscussions\nSerum biomarkers of VaD have been in the limelight of current clinical research trends (Sanchez et al.\n2024\n). However, most of the studies used low throughput methods to detect serum protein biomarkers (Ehtewish et al.\n2023\n). This study employs MR methods with the aim of elucidating the causal relationships between various plasma proteins and the risk of VaD. By using genetic variants as instrumental variables, we are able to infer potential causal relationships while minimizing the confounding factors commonly seen in observational studies. Our findings are significant for understanding the pathophysiology of VaD and identifying potential biomarkers or therapeutic targets. The Mendelian randomization analysis identified nine plasma proteins demonstrating significant associations with vascular dementia (VaD). Specifically, MED4, COPS7B, CSF3, IL26, NRXN1, LRRTM4, and MAGEA3 emerged as risk factors, implicating their potential roles in VaD pathogenesis. The mechanistic investigation through protein-protein interaction network analysis uncovered a highly interconnected functional module comprising FN1, APOE, H6PD, CXCL1, CSF3, HSPA1B, TPI1, and CXCL13. Gene Ontology enrichment analysis revealed this module's primary involvement in humoral immune regulation, non-canonical NF-κB activation, stress-responsive MAPK cascades, and apoptotic cell clearance. These pathways have been extensively documented to contribute to the self-perpetuating cycle of blood-brain barrier dysfunction and neuroinflammation resulting from chronic cerebral hypoperfusion (Wang et al.\n2020\n; Lee et al.\n2022\n). In the animal model studies, quantitative analysis revealed significant differential expression patterns for MED4 and NRXN1 among the investigated targets (MED4, COPS7B, CSF3, NRXN1, and LRRTM4), providing experimental validation of their putative roles in VaD pathogenesis.", "doc_items_refs": ["#/texts/194", "#/texts/195", "#/texts/196", "#/texts/197", "#/texts/198", "#/texts/199", "#/texts/200", "#/texts/201", "#/texts/202"], "page_nos": [], "uuid": "f4cfb1d9-8813-4fa8-9376-db5703a00bf8"}
{"doc_id": "2025__Causal_Effects_of_the_Plasma_Proteome_on_Vascular_Dementia_Risk_A_Mendelian_Rand__W4412068972", "source_path": "<redacted:source_path>", "chunk_id": 13, "source_chunk_idxs": [23], "num_tokens": 254, "text": "Causal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nDiscussions\nMED4, also known as Mediator Complex Subunit 4, is one of the key subunits of the Mediator complex, a multi-subunit transcriptional regulatory complex. The Mediator complex regulates gene expression by interacting with RNA polymerase II (Pol II) and enhancer-bound transcription factors (Cevher et al.\n2014\n; Nath et al.\n2020\n). Mechanistically, MED4 stabilizes Mediator-Pol II engagement to potentiate transcriptional activation, notably enhancing APOE promoter activity. This regulatory function may exacerbate oligodendrocyte dysfunction through impaired lipid metabolism, ultimately contributing to myelin sheath degradation in pathological conditions (Blanchard et al.\n2022\n). The MED4-containing Mediator complex can form a molecular bridge with p65 (NF-κB), directly binding to the CSF3 promoter to regulate neutrophil activation and migration (Hwang et al.\n2010\n). This mechanism potentiates neuroinflammatory responses and exacerbates cognitive impairment in disease states (Garcia-Bonilla et al.\n2015\n).", "doc_items_refs": ["#/texts/203", "#/texts/204", "#/texts/205", "#/texts/206", "#/texts/207", "#/texts/208", "#/texts/209", "#/texts/210", "#/texts/211", "#/texts/212", "#/texts/213"], "page_nos": [], "uuid": "ac0e07a3-9628-45df-b44d-8c4db017aeb7"}
{"doc_id": "2025__Causal_Effects_of_the_Plasma_Proteome_on_Vascular_Dementia_Risk_A_Mendelian_Rand__W4412068972", "source_path": "<redacted:source_path>", "chunk_id": 14, "source_chunk_idxs": [24], "num_tokens": 499, "text": "Causal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nDiscussions\nNeurexin 1 (NRXN1), a pivotal synaptic protein, plays a central role in synaptogenesis, synaptic maintenance, and the regulation of synaptic transmission (Shiota et al.\n2022\n). Extensive research has demonstrated that mutations in NRXN1 are implicated in various neuropsychiatric disorders, including autism spectrum disorder (Bourgeron\n2007\n), schizophrenia (Sebastian et al.\n2023\n), and dementia (Patel et al.\n2023\n). While NRXN1 expression demonstrates progressive downregulation during Alzheimer's disease (AD) progression (Gómez Ravetti et al.\n2010\n). It exhibits a unique compensatory upregulation in vascular dementia (VaD) pathogenesis. This dichotomy likely stems from distinct pathological mechanisms between these disorders: under chronic cerebral hypoperfusion, the glutamatergic synaptic networks with highest metabolic demands-particularly hippocampal CA1-dentate gyrus projections and orbitofrontal cortex-striatal connections-sustain primary ischemic damage (Alfaro-Ruiz et al.\n2024\n), thereby triggering NRXN1 upregulation. This adaptive response may confer neuroprotection through two mechanisms: first, by reducing oxidative stress in synaptic mitochondria and preventing degeneration of thalamocortical circuits (Bartoli et al.\n2020\n); second, by stabilizing presynaptic membranes to counteract neuronal damage caused by vascular hypoxia (Palermo et al.\n2025\n). This compensatory mechanism represents a unique neural adaptation to vascular injury that stands in marked contrast to the progressive synaptic protein depletion observed in AD. Protein-protein interaction analysis identified NRXN1 as exhibiting the highest connectivity with FN1 and H6PD. As a presynaptic membrane protein, NRXN1's extracellular domain binds to the extracellular matrix via fibronectin (FN1). FN1 serves dual roles as both a ligand for APOE-containing lipoprotein particles and a regulator of CSF3 receptor (CSF3R) membrane stability in microglia (Ito et al.\n2014", "doc_items_refs": ["#/texts/214", "#/texts/215", "#/texts/216", "#/texts/217", "#/texts/218", "#/texts/219", "#/texts/220", "#/texts/221", "#/texts/222", "#/texts/223", "#/texts/224", "#/texts/225", "#/texts/226", "#/texts/227", "#/texts/228", "#/texts/229", "#/texts/230", "#/texts/231"], "page_nos": [], "uuid": "974739b9-7584-4933-9020-825ca84b1418"}
{"doc_id": "2025__Causal_Effects_of_the_Plasma_Proteome_on_Vascular_Dementia_Risk_A_Mendelian_Rand__W4412068972", "source_path": "<redacted:source_path>", "chunk_id": 15, "source_chunk_idxs": [25], "num_tokens": 119, "text": "Causal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nDiscussions\n). NRXN1 upregulation may transiently mitigate structural damage by coordinating synaptic adhesion remodeling (through FN1) with lipoprotein metabolism and granulocyte factor signaling. Conversely, NRXN1 deficiency alters synaptic gene expression, impairing plasticity and contributing to learning/memory deficits-potentially significant in VaD pathophysiology (Zhang et al.\n2021\n).", "doc_items_refs": ["#/texts/232", "#/texts/233", "#/texts/234"], "page_nos": [], "uuid": "1be24176-bd31-43df-94bc-20de045eac68"}
{"doc_id": "2025__Causal_Effects_of_the_Plasma_Proteome_on_Vascular_Dementia_Risk_A_Mendelian_Rand__W4412068972", "source_path": "<redacted:source_path>", "chunk_id": 16, "source_chunk_idxs": [26], "num_tokens": 495, "text": "Causal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nDiscussions\nNotably, while Mendelian randomization (MR) analysis indicates that lifelong genetic elevation of both MED4 and NRXN1 increases VaD risk, the 2-VO model at 6 weeks demonstrates MED4 downregulation and NRXN1 upregulation associated with spatial memory deficits (prolonged escape latency and reduced platform crossings). This apparent discrepancy reflects biologically distinct temporal dynamics rather than contradiction. MR captures lifelong exposure effects, whereas the animal model reveals acute/subacute transcriptional responses post-ischemia (VanderWeele et al.\n2014\n). Under chronic cerebral hypoperfusion, ROS/Ca2⁺ overload activates non-canonical NF-κB and stress-responsive MAPK pathways (Lee et al.\n2022\n), leading to massive recruitment of MED4-containing mediator complexes to sustain high transcription of inflammatory-metabolic genes (Garcia-Bonilla et al.\n2015\n). When transcriptional demand exceeds nuclear MED4 replenishment capacity, a \"compensatory depletion\" of MED4 occurs during the subacute phase, ultimately disrupting cellular energy metabolism and protein homeostasis. Notably, alternative transcriptional regulatory pathways can partially sustain gene expression even under conditions of Mediator complex insufficiency, suggesting the existence of compensatory transcriptomic reprogramming in VaD pathogenesis (Allen and Taatjes\n2015\n). The upregulation of NRXN1 likely represents a compensatory neuronal response to ischemic injury. Mechanistically, this process may involve p38-CaMKII signaling pathway activation, through which NRXN1 cooperates with FN1 and H6PD to establish a \"fibronectin-lipoprotein\" network. This integrated network serves dual neuroprotective functions during the acute phase by both strengthening synaptic adhesion and remodeling extracellular matrix architecture, thereby mitigating structural damage (LaConte et al.\n2016\n; Iijima et al.\n2011\n; Lukomska et al.\n2024\n; Loniewska et al.\n2020\n).However, this adaptive mechanism appears linked to excessive unfolded protein response (UPR) activation (Xiao et al.\n2013", "doc_items_refs": ["#/texts/235", "#/texts/236", "#/texts/237", "#/texts/238", "#/texts/239", "#/texts/240", "#/texts/241", "#/texts/242", "#/texts/243", "#/texts/244", "#/texts/245", "#/texts/246", "#/texts/247", "#/texts/248", "#/texts/249", "#/texts/250", "#/texts/251", "#/texts/252"], "page_nos": [], "uuid": "2d7e5b4b-3978-4a95-bf72-404c340903e8"}
{"doc_id": "2025__Causal_Effects_of_the_Plasma_Proteome_on_Vascular_Dementia_Risk_A_Mendelian_Rand__W4412068972", "source_path": "<redacted:source_path>", "chunk_id": 17, "source_chunk_idxs": [27], "num_tokens": 270, "text": "Causal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nDiscussions\n), which compromises synaptic plasticity by attenuating neuronal protein synthesis (Freeman and Mallucci\n2016\n). Furthermore, long-term NRXN1 overexpression (as demonstrated by MR analysis) may exacerbate dysfunction in the matrix-immune axis (Patel et al.\n2023\n). Collectively, the compensatory depletion of MED4 coupled with acute NRXN1 upregulation disrupts synaptic plasticity and metabolic homeostasis, driving characteristic spatial memory deficits in the rat model-revealing a critical transition from adaptive compensation to decompensation in vascular dementia pathogenesis.\nAlthough CSF3, COPS7B, and LRRTM4 did not exhibit statistically significant differences during the animal validation phase, their trends suggest that these genes may have potential biological significance in the pathological process of VaD. Therefore, it is necessary to further investigate the roles of these genes in larger human samples. Additionally, due to the lack of relevant information in gene databases, MAGEA3 could not be validated in animal experiments. However, its potential importance indicates that further exploration of its role in VaD is warranted in future studies.", "doc_items_refs": ["#/texts/253", "#/texts/254", "#/texts/255", "#/texts/256", "#/texts/257", "#/texts/258"], "page_nos": [], "uuid": "a3ab4a38-fd24-43e5-9859-29559a07b2bc"}
{"doc_id": "2025__Causal_Effects_of_the_Plasma_Proteome_on_Vascular_Dementia_Risk_A_Mendelian_Rand__W4412068972", "source_path": "<redacted:source_path>", "chunk_id": 18, "source_chunk_idxs": [28], "num_tokens": 477, "text": "Causal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nDiscussions\nCSF3 also known as granulocyte-colony stimulating factor (G-CSF), is a cytokine that primarily functions by promoting the production and release of granulocytes from the bone marrow (Bor Tekdemir et al.\n2020\n). Recent studies have highlighted the significant impact of CSF3 on the pathological mechanisms and potential treatment of dementia. The reports indicate that in mouse models of AD, CSF3 enhances spatial learning abilities and significantly reduces amyloid deposition in the hippocampus and entorhinal cortex (Sanchez-Ramos et al.\n2012\n). Research suggests that CSF3 may improve non-spatial cognitive functions in patients with cerebral small vessel disease (CSVD) by restoring brain vascular endothelial cell function, repairing blood-brain barrier (BBB) damage, and reducing white matter lesions (Tuo et al.\n2019\n; Wei et al.\n2017\n). In this study, although the expression of CSF3 in the model group was higher than in the sham-operated group, the difference did not reach statistical significance. However, from a numerical perspective, this change still holds potential biological significance. This discrepancy may reflect the diverse roles of CSF3 in different pathological contexts. Studies have shown that cytokine levels in cerebrospinal fluid (CSF) exhibit age-related changes in Alzheimer's disease patients, such as increased levels of TNF-α and IL-8 with advancing age (Hu et al.\n2019\n). Furthermore, the patterns of change in CSF Aβ42 and sTREM2 levels vary across different neurodegenerative diseases, suggesting that these biomarkers are associated with specific pathological mechanisms (Suárez-Calvet et al.\n2016\n; Spitzer et al.\n2018\n).\nLRRTM4 exhibits highly selective expression in the brain, particularly at the excitatory postsynaptic sites of granule cells in the hippocampal dentate gyrus (Linhoff et al.\n2009\n). Loss of LRRTM4 function leads to reduced synaptic density, impaired AMPA receptor trafficking, and compromised synaptic function (Siddiqui et al.\n2013\n).", "doc_items_refs": ["#/texts/259", "#/texts/260", "#/texts/261", "#/texts/262", "#/texts/263", "#/texts/264", "#/texts/265", "#/texts/266", "#/texts/267", "#/texts/268", "#/texts/269", "#/texts/270", "#/texts/271", "#/texts/272", "#/texts/273", "#/texts/274", "#/texts/275", "#/texts/276", "#/texts/277", "#/texts/278"], "page_nos": [], "uuid": "7950da11-80e2-410b-8a11-3b2c3ea55f80"}
{"doc_id": "2025__Causal_Effects_of_the_Plasma_Proteome_on_Vascular_Dementia_Risk_A_Mendelian_Rand__W4412068972", "source_path": "<redacted:source_path>", "chunk_id": 19, "source_chunk_idxs": [29], "num_tokens": 331, "text": "Causal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nDiscussions\nEmerging evidence suggests these synaptic deficits may be mechanistically linked to mitochondrial dysfunction caused by reactive oxygen species (ROS) accumulation (Nazzi et al.\n2024\n). Given its crucial role in maintaining synaptic plasticity and cognitive function, dysregulated LRRTM4 expression in vascular dementia (VaD) likely contributes to disease pathogenesis by disrupting synaptic integrity. However, the precise molecular mechanisms underlying this process require further elucidation. Although COPS7B and MAGEA3 are more commonly studied in the context of cancer (Gaspar et al.\n2017\n; Gao et al.\n2020\n), their functions suggest they may also be relevant to VaD pathology. COPS7B is involved in regulating protein stability, while MAGEA3 influences cell proliferation (Tang et al.\n2023\n; Gaspar et al.\n2017\n). These roles indicate that both proteins could contribute to the pathological processes underlying VaD, warranting further investigation into their specific contributions.\nOverall, This study combines MR and animal experiments to reveal the significant role of plasma proteins in the pathogenesis of VaD. Through MR analysis, we can identify potential drug targets, offering new perspectives for VaD treatment strategies. Given the current lack of effective treatments for VaD, there is an urgent need to develop new therapies. MR, as a standard tool for identifying new drug targets, can prioritize drug discovery efforts and facilitate the repurposing of existing drugs for VaD treatment.", "doc_items_refs": ["#/texts/279", "#/texts/280", "#/texts/281", "#/texts/282", "#/texts/283", "#/texts/284", "#/texts/285", "#/texts/286", "#/texts/287", "#/texts/288", "#/texts/289", "#/texts/290"], "page_nos": [], "uuid": "1b294524-b2a6-4518-8727-0ecfb5ddbba0"}
{"doc_id": "2025__Causal_Effects_of_the_Plasma_Proteome_on_Vascular_Dementia_Risk_A_Mendelian_Rand__W4412068972", "source_path": "<redacted:source_path>", "chunk_id": 20, "source_chunk_idxs": [30], "num_tokens": 311, "text": "Causal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nDiscussions\nHowever, this study has the following limitations: (1) A key limitation of this Mendelian randomization (MR) study is the potential for pleiotropy. Despite using MR-Egger regression and the weighted median method to address pleiotropy, these methods might not completely remove confounding effects. The variability in the strength of the genetic instruments (measured by F-statistics) and the presence of weaker instruments could also compromise the reliability of our causal estimates. (2) Population Specificity: Our study primarily relies on genetic data from European populations, potentially limiting its applicability to other ethnic groups. Therefore, results may not be directly transferable to non-European populations, and further validation in diverse cohorts is essential.(3) Biological Mechanisms and Validation: While the study indicates a causal relationship between plasma proteins and VaD, the specific biological mechanisms remain unclear. Although animal experiments have provided some validation, further research is needed to explore the mechanistic pathways and biological processes to elucidate the specific roles of these proteins in VaD.(4) The translational applicability of animal model findings to human disease requires careful consideration, particularly regarding species-specific differences in protein expression profiles and compensatory mechanisms. To enhance clinical relevance, future studies will validate key protein expression patterns using cerebrospinal fluid and serum samples from vascular dementia patients.", "doc_items_refs": ["#/texts/291"], "page_nos": [], "uuid": "0a822f59-17d1-4124-80af-de6c3d29dfdf"}
{"doc_id": "2025__Causal_Effects_of_the_Plasma_Proteome_on_Vascular_Dementia_Risk_A_Mendelian_Rand__W4412068972", "source_path": "<redacted:source_path>", "chunk_id": 21, "source_chunk_idxs": [31, 32], "num_tokens": 222, "text": "Causal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nConclusion\nThis study, through MR analysis, has revealed potential causal relationships between various plasma proteins and VaD. Our findings suggest that MED4, CSF3, NRXN1, and LRRTM4 may play significant roles in the pathogenesis of VaD. These results not only broaden our understanding of the pathological mechanisms of VaD but also provide important insights for future research on biomarkers and therapeutic targets. Given the current lack of approved treatments for VaD, the discoveries from this study offer a scientific foundation for the development of new drugs and the repurposing of existing ones. Future research should focus on validating the roles of these proteins in larger populations and exploring their potential applications in VaD treatment to advance the development of effective therapeutic strategies.\n\nCausal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nData Availability\nThe data used to support the findings of this study are included within the article and Supplementary Material.", "doc_items_refs": ["#/texts/293", "#/texts/295"], "page_nos": [], "uuid": "9078b24d-d90d-4629-b88d-e51ce3d2bb7a"}
{"doc_id": "2025__Causal_Effects_of_the_Plasma_Proteome_on_Vascular_Dementia_Risk_A_Mendelian_Rand__W4412068972", "source_path": "<redacted:source_path>", "chunk_id": 22, "source_chunk_idxs": [33], "num_tokens": 500, "text": "Causal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nReferences\n- Alfaro-Ruiz R, Martín-Belmonte A, Aguado C, Moreno-Martínez AE, Fukazawa Y, Luján R (2024) Selective disruption of synaptic NMDA receptors of the hippocampal trisynaptic circuit in Aβ pathology. Biol Res 57(1):56.\nhttps://doi.org/10.1186/s40659-024-00537-7\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n- Allen BL, Taatjes DJ (2015) The Mediator complex: a central integrator of transcription. Nat Rev Mol Cell Biol 16(3):155-166.\nhttps://doi.org/10.1038/nrm3951\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n- Bartoli M, Palermo S, Stanziano M, Cipriani GE, Leotta D, Valentini MC, Amanzio M (2020) Reduced self-awareness following a combined polar and paramedian bilateral thalamic infarction. A possible relationship with SARS-CoV-2 risk of contagion? Front Psycho 11:570160.\nhttps://doi.org/10.3389/fpsyg.2020.570160\nArticle\nGoogle Scholar\n- Blanchard JW, Akay LA, Davila-Velderrain J, von Maydell D, Mathys H, Davidson SM, Effenberger A, Chen CY, Maner-Smith K, Hajjar I, Ortlund EA, Bula M, Agbas E, Ng A, Jiang X, Kahn M, Blanco-Duque C, Lavoie N, Liu L, Reyes R, Lin YT, Ko T, R'Bibo L, Ralvenius WT, Bennett DA, Cam HP, Kellis M, Tsai LH (2022) APOE4 impairs myelination via cholesterol dysregulation in oligodendrocytes. Nature 611(7937):769-779.\nhttps://doi.org/10.1038/s41586-022-05439-w\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/297", "#/texts/298", "#/texts/299", "#/texts/300"], "page_nos": [], "uuid": "be834be2-5650-4a96-8873-5e0dfdaf268f"}
{"doc_id": "2025__Causal_Effects_of_the_Plasma_Proteome_on_Vascular_Dementia_Risk_A_Mendelian_Rand__W4412068972", "source_path": "<redacted:source_path>", "chunk_id": 23, "source_chunk_idxs": [34], "num_tokens": 452, "text": "Causal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nReferences\n- Bor Tekdemir Z, Seckin AI, Kacar T, Yilmaz E, Bekiroglu S (2020) Evaluation of structural, biological, and functional similarity of biosimilar granulocyte colony stimulating factor to its reference product. Pharm Res 37(11):215.\nhttps://doi.org/10.1007/s11095-020-02932-7\nArticle\nCAS\nPubMed\nGoogle Scholar\n- Bourgeron T (2007) The possible interplay of synaptic and clock genes in autism spectrum disorders. Cold Spring Harb Symp Quant Biol 72:645-654.\nhttps://doi.org/10.1101/sqb.2007.72.020\nArticle\nCAS\nPubMed\nGoogle Scholar\n- Cevher MA, Shi Y, Li D, Chait BT, Malik S, Roeder RG (2014) Reconstitution of active human core mediator complex reveals a critical role of the MED14 subunit. Nat Struct Mol Biol 21(12):1028-1034.\nhttps://doi.org/10.1038/nsmb.2914\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n- Collaborators GDF (2022) Estimation of the global prevalence of dementia in 2019 and forecasted prevalence in 2050: an analysis for the global burden of disease study 2019. Lancet Public Health 7(2):e105-e125.\nhttps://doi.org/10.1016/s2468-2667(21)00249-8\nArticle\nGoogle Scholar\n- Davies NM, Howe LJ, Brumpton B, Havdahl A, Evans DM, Davey Smith G (2019) Within family Mendelian randomization studies. Hum Mol Genet 28(R2):R170-r179.\nhttps://doi.org/10.1093/hmg/ddz204\nArticle\nCAS\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/301", "#/texts/302", "#/texts/303", "#/texts/304", "#/texts/305"], "page_nos": [], "uuid": "5ef070ee-b962-46e6-91c7-b7dee50cd0e2"}
{"doc_id": "2025__Causal_Effects_of_the_Plasma_Proteome_on_Vascular_Dementia_Risk_A_Mendelian_Rand__W4412068972", "source_path": "<redacted:source_path>", "chunk_id": 24, "source_chunk_idxs": [35], "num_tokens": 477, "text": "Causal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nReferences\n- Ehtewish H, Mesleh A, Ponirakis G, De la Fuente A, Parray A, Bensmail I, Abdesselem H, Ramadan M, Khan S, Chandran M, Ayadathil R, Elsotouhy A, Own A, Al Hamad H, Abdelalim EM, Decock J, Alajez NM, Albagha O, Thornalley PJ, Arredouani A, Malik RA, El-Agnaf OMA (2023) Blood-based proteomic profiling identifies potential biomarker candidates and pathogenic pathways in dementia. Int J Mol Sci.\nhttps://doi.org/10.3390/ijms24098117\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n- Ferkingstad E, Sulem P, Atlason BA, Sveinbjornsson G, Magnusson MI, Styrmisdottir EL, Gunnarsdottir K, Helgason A, Oddsson A, Halldorsson BV, Jensson BO, Zink F, Halldorsson GH, Masson G, Arnadottir GA, Katrinardottir H, Juliusson K, Magnusson MK, Magnusson OT, Fridriksdottir R, Saevarsdottir S, Gudjonsson SA, Stacey SN, Rognvaldsson S, Eiriksdottir T, Olafsdottir TA, Steinthorsdottir V, Tragante V, Ulfarsson MO, Stefansson H, Jonsdottir I, Holm H, Rafnar T, Melsted P, Saemundsdottir J, Norddahl GL, Lund SH, Gudbjartsson DF, Thorsteinsdottir U, Stefansson K (2021) Large-scale integration of the plasma proteome with genetics and disease. Nat Genet 53(12):1712-1721.\nhttps://doi.org/10.1038/s41588-021-00978-w\nArticle\nCAS\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/306", "#/texts/307"], "page_nos": [], "uuid": "e20311ed-eeb4-42cb-b7bc-e6c174b24761"}
{"doc_id": "2025__Causal_Effects_of_the_Plasma_Proteome_on_Vascular_Dementia_Risk_A_Mendelian_Rand__W4412068972", "source_path": "<redacted:source_path>", "chunk_id": 25, "source_chunk_idxs": [36], "num_tokens": 473, "text": "Causal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nReferences\n- Freeman OJ, Mallucci GR (2016) The UPR and synaptic dysfunction in neurodegeneration. Brain Res 1648(Pt B):530-537.\nhttps://doi.org/10.1016/j.brainres.2016.03.029\nArticle\nCAS\nPubMed\nGoogle Scholar\n- Gao X, Li Q, Chen G, He H, Ma Y (2020) MAGEA3 promotes proliferation and suppresses apoptosis in cervical cancer cells by inhibiting the KAP1/p53 signaling pathway. Am J Transl Res 12(7):3596-3612\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n- Gao YF, Jin TY, Chen Y, Ding YH (2023) No causal genetic relationships between atrial fibrillation and vascular dementia: a bidirectional Mendelian randomization study. Front Cardiovas Med 10:1071574.\nhttps://doi.org/10.3389/fcvm.2023.1071574\nArticle\nCAS\nGoogle Scholar\n- Garcia-Bonilla L, Racchumi G, Murphy M, Anrather J, Iadecola C (2015) Endothelial CD36 contributes to postischemic brain injury by promoting neutrophil activation via CSF3. J Neurosci 35(44):14783-14793.\nhttps://doi.org/10.1523/jneurosci.2980-15.2015\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n- Gaspar L, Howald C, Popadin K, Maier B, Mauvoisin D, Moriggi E, Gutierrez-Arcelus M, Falconnet E, Borel C, Kunz D, Kramer A, Gachon F, Dermitzakis ET, Antonarakis SE, Brown SA (2017) The genomic landscape of human cellular circadian variation points to a novel role for the signalosome. Elife.\nhttps://doi.org/10.7554/eLife.24994\nArticle\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/308", "#/texts/309", "#/texts/310", "#/texts/311", "#/texts/312"], "page_nos": [], "uuid": "7eabe1be-c53e-431e-8b2b-8585bab8c15b"}
{"doc_id": "2025__Causal_Effects_of_the_Plasma_Proteome_on_Vascular_Dementia_Risk_A_Mendelian_Rand__W4412068972", "source_path": "<redacted:source_path>", "chunk_id": 26, "source_chunk_idxs": [37], "num_tokens": 447, "text": "Causal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nReferences\n- Gómez Ravetti M, Rosso OA, Berretta R, Moscato P (2010) Uncovering molecular biomarkers that correlate cognitive decline with the changes of hippocampus' gene expression profiles in Alzheimer's disease. PLoS ONE 5(4):e10153.\nhttps://doi.org/10.1371/journal.pone.0010153\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n- Hemani G, Zheng J, Elsworth B, Wade KH, Haberland V, Baird D, Laurin C, Burgess S, Bowden J, Langdon R, Tan VY, Yarmolinsky J, Shihab HA, Timpson NJ, Evans DM, Relton C, Martin RM, Davey Smith G, Gaunt TR, Haycock PC (2018) The MR-Base platform supports systematic causal inference across the human phenome. Elife.\nhttps://doi.org/10.7554/eLife.34408\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n- Hu WT, Howell JC, Ozturk T, Gangishetti U, Kollhoff AL, Hatcher-Martin JM, Anderson AM, Tyor WR (2019) CSF cytokines in aging, multiple sclerosis, and dementia. Front Immunol 10:480.\nhttps://doi.org/10.3389/fimmu.2019.00480\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n- Hu X, Zhao J, Lin Z, Wang Y, Peng H, Zhao H, Wan X, Yang C (2022) Mendelian randomization for causal inference accounting for pleiotropy and sample structure using genome-wide summary statistics. Proc Natl Acad Sci USA 119(28):e2106858119.\nhttps://doi.org/10.1073/pnas.2106858119\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/313", "#/texts/314", "#/texts/315", "#/texts/316"], "page_nos": [], "uuid": "ae63de65-2df2-46b7-963f-260ff4e01deb"}
{"doc_id": "2025__Causal_Effects_of_the_Plasma_Proteome_on_Vascular_Dementia_Risk_A_Mendelian_Rand__W4412068972", "source_path": "<redacted:source_path>", "chunk_id": 27, "source_chunk_idxs": [38], "num_tokens": 305, "text": "Causal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nReferences\n- Hwang I, Choi YS, Jeon MY, Jeong S (2010) NF-κB p65 represses β-catenin-activated transcription of cyclin D1. Biochem Biophys Res Commun 403(1):79-84.\nhttps://doi.org/10.1016/j.bbrc.2010.10.118\nArticle\nCAS\nPubMed\nGoogle Scholar\n- Iijima T, Wu K, Witte H, Hanno-Iijima Y, Glatter T, Richard S, Scheiffele P (2011) SAM68 regulates neuronal activity-dependent alternative splicing of neurexin-1. Cell 147(7):1601-1614.\nhttps://doi.org/10.1016/j.cell.2011.11.028\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n- Ito J, Nagayasu Y, Miura Y, Yokoyama S, Michikawa M (2014) Astrocyte׳s endogenous apoE generates HDL-like lipoproteins using previously synthesized cholesterol through interaction with ABCA1. Brain Res 1570:1-12.\nhttps://doi.org/10.1016/j.brainres.2014.04.037\nArticle\nCAS\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/317", "#/texts/318", "#/texts/319"], "page_nos": [], "uuid": "efc31e9f-c823-4b90-aa00-899e2687867e"}
{"doc_id": "2025__Causal_Effects_of_the_Plasma_Proteome_on_Vascular_Dementia_Risk_A_Mendelian_Rand__W4412068972", "source_path": "<redacted:source_path>", "chunk_id": 28, "source_chunk_idxs": [39], "num_tokens": 421, "text": "Causal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nReferences\n- Jia L, Du Y, Chu L, Zhang Z, Li F, Lyu D, Li Y, Li Y, Zhu M, Jiao H, Song Y, Shi Y, Zhang H, Gong M, Wei C, Tang Y, Fang B, Guo D, Wang F, Zhou A, Chu C, Zuo X, Yu Y, Yuan Q, Wang W, Li F, Shi S, Yang H, Zhou C, Liao Z, Lv Y, Li Y, Kan M, Zhao H, Wang S, Yang S, Li H, Liu Z, Wang Q, Qin W, Jia J (2020) Prevalence, risk factors, and management of dementia and mild cognitive impairment in adults aged 60 years or older in China: a cross-sectional study. The Lancet Public Health 5(12):e661-e671.\nhttps://doi.org/10.1016/s2468-2667(20)30185-7\nArticle\nPubMed\nGoogle Scholar\n- LaConte LE, Chavan V, Liang C, Willis J, Schonhense EM, Schoch S, Mukherjee K (2016) CASK stabilizes neurexin and links it to liprin-alpha in a neuronal activity-dependent manner. Cell Mol Life Sci 73(18):3599-3621.\nhttps://doi.org/10.1007/s00018-016-2183-4\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n- Lawlor DA, Harbord RM, Sterne JA, Timpson N, Davey Smith G (2008) Mendelian randomization: using genes as instruments for making causal inferences in epidemiology. Stat Med 27(8):1133-1163.\nhttps://doi.org/10.1002/sim.3034\nArticle\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/320", "#/texts/321", "#/texts/322"], "page_nos": [], "uuid": "9ed06c21-5b9c-4a41-b1ec-c521f178c2fb"}
{"doc_id": "2025__Causal_Effects_of_the_Plasma_Proteome_on_Vascular_Dementia_Risk_A_Mendelian_Rand__W4412068972", "source_path": "<redacted:source_path>", "chunk_id": 29, "source_chunk_idxs": [40], "num_tokens": 423, "text": "Causal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nReferences\n- Lee EC, Hong DY, Lee DH, Park SW, Lee JY, Jeong JH, Kim EY, Chung HM, Hong KS, Park SP, Lee MR, Oh JS (2022) Inflammation and Rho-associated protein kinase-induced brain changes in vascular dementia. Biomedicines.\nhttps://doi.org/10.3390/biomedicines10020446\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n- Linhoff MW, Laurén J, Cassidy RM, Dobie FA, Takahashi H, Nygaard HB, Airaksinen MS, Strittmatter SM, Craig AM (2009) An unbiased expression screen for synaptogenic proteins identifies the LRRTM protein family as synaptic organizers. Neuron 61(5):734-749.\nhttps://doi.org/10.1016/j.neuron.2009.01.017\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n- Loniewska MM, Gupta A, Bhatia S, MacKay-Clackett I, Jia Z, Wells PG (2020) DNA damage and synaptic and behavioural disorders in glucose-6-phosphate dehydrogenase-deficient mice. Redox Biol 28:101332.\nhttps://doi.org/10.1016/j.redox.2019.101332\nArticle\nCAS\nPubMed\nGoogle Scholar\n- Lukomska A, Rheaume BA, Frost MP, Theune WC, Xing J, Damania A, Trakhtenberg EF (2024) Augmenting fibronectin levels in injured adult CNS promotes axon regeneration in vivo. Exp Neurol 379:114877.\nhttps://doi.org/10.1016/j.expneurol.2024.114877\nArticle\nCAS\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/323", "#/texts/324", "#/texts/325", "#/texts/326"], "page_nos": [], "uuid": "414df124-7216-4d16-b282-e9aece068de4"}
{"doc_id": "2025__Causal_Effects_of_the_Plasma_Proteome_on_Vascular_Dementia_Risk_A_Mendelian_Rand__W4412068972", "source_path": "<redacted:source_path>", "chunk_id": 30, "source_chunk_idxs": [41], "num_tokens": 400, "text": "Causal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nReferences\n- Nath VS, Shrestha A, Awasthi P, Mishra AK, Kocábek T, Matoušek J, Sečnik A, Jakše J, Radišek S, Hallan V (2020) Mapping the gene expression spectrum of mediator subunits in response to viroid infection in plants. Int J Mol Sci 21(7):2498.\nhttps://doi.org/10.3390/ijms21072498\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n- Nazzi C, Avenanti A, Battaglia S (2024) The involvement of antioxidants in cognitive decline and neurodegeneration: mens sana in corpore Sano. Antioxidants 13(6):701.\nhttps://doi.org/10.3390/antiox13060701\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n- Palermo S, Di Fazio C, Scaliti E, Stanziano M, Nigri A, Tamietto M (2025) Cortical excitability and the aging brain: toward a biomarker of cognitive resilience. Front Psychol 16:1542880.\nhttps://doi.org/10.3389/fpsyg.2025.1542880\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n- Patel PJ, Ren Y, Yan Z (2023) Epigenomic analysis of Alzheimer's disease brains reveals diminished CTCF binding on genes involved in synaptic organization. Neurobiol Dis 184:106192.\nhttps://doi.org/10.1016/j.nbd.2023.106192\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/327", "#/texts/328", "#/texts/329", "#/texts/330"], "page_nos": [], "uuid": "f1805681-c39a-4b2a-8891-7557cb27c071"}
{"doc_id": "2025__Causal_Effects_of_the_Plasma_Proteome_on_Vascular_Dementia_Risk_A_Mendelian_Rand__W4412068972", "source_path": "<redacted:source_path>", "chunk_id": 31, "source_chunk_idxs": [42], "num_tokens": 493, "text": "Causal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nReferences\n- Sanchez E, Wilkinson T, Coughlan G, Mirza S, Baril AA, Ramirez J, Binns MA, Black SE, Borrie M, Dilliott AA, Dixon RA, Dowlatshahi D, Farhan S, Finger E, Fischer CE, Frank A, Freedman M, Goncalves RA, Grimes DA, Hassan A, Hegele RA, Kumar S, Lang AE, Marras C, McLaughlin PM, Orange JB, Pasternak SH, Pollock BG, Rajji TK, Roberts AC, Robinson JF, Rogaeva E, Sahlas DJ, Saposnik G, Strong MJ, Swartz RH, Tang-Wai DF, Tartaglia MC, Troyer AK, Kvartsberg H, Zetterberg H, Munoz DP, Masellis M (2024) Association of plasma biomarkers with cognition, cognitive decline, and daily function across and within neurodegenerative diseases: results from the ontario neurodegenerative disease research initiative. Alzheimers Dement 20(3):1753-1770.\nhttps://doi.org/10.1002/alz.13560\nArticle\nPubMed\nGoogle Scholar\n- Sanchez-Ramos J, Cimino C, Avila R, Rowe A, Chen R, Whelan G, Lin X, Cao C, Ashok R (2012) Pilot study of granulocyte-colony stimulating factor for treatment of Alzheimer's disease. J Alzheimers Dis 31(4):843-855.\nhttps://doi.org/10.3233/JAD-2012-120196\nArticle\nCAS\nPubMed\nGoogle Scholar\n- Sebastian R, Jin K, Pavon N, Bansal R, Potter A, Song Y, Babu J, Gabriel R, Sun Y, Aronow B, Pak C (2023) Schizophrenia-associated NRXN1 deletions induce developmental-timing- and cell-type-specific vulnerabilities in human brain organoids. Nat Commun 14(1):3770.\nhttps://doi.org/10.1038/s41467-023-39420-6\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/331", "#/texts/332", "#/texts/333"], "page_nos": [], "uuid": "907b27d2-65a7-4937-a99a-a9097bd061e7"}
{"doc_id": "2025__Causal_Effects_of_the_Plasma_Proteome_on_Vascular_Dementia_Risk_A_Mendelian_Rand__W4412068972", "source_path": "<redacted:source_path>", "chunk_id": 32, "source_chunk_idxs": [43], "num_tokens": 480, "text": "Causal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nReferences\n- Shang J, Yamashita T, Fukui Y, Song D, Li X, Zhai Y, Nakano Y, Morihara R, Hishikawa N, Ohta Y, Abe K (2018) Different associations of plasma biomarkers in alzheimer's disease, mild cognitive impairment, vascular dementia, and ischemic stroke. J Clin Neurol 14(1):29-34.\nhttps://doi.org/10.3988/jcn.2018.14.1.29\nArticle\nPubMed\nGoogle Scholar\n- Shiota Y, Matsudaira I, Takeuchi H, Ono C, Tomita H, Kawashima R, Taki Y (2022) The influence of NRXN1 on systemizing and the brain structure in healthy adults. Brain Imaging Behav 16(2):692-701.\nhttps://doi.org/10.1007/s11682-021-00530-8\nArticle\nPubMed\nGoogle Scholar\n- Siddiqui TJ, Tari PK, Connor SA, Zhang P, Dobie FA, She K, Kawabe H, Wang YT, Brose N, Craig AM (2013) An LRRTM4-HSPG complex mediates excitatory synapse development on dentate gyrus granule cells. Neuron 79(4):680-695.\nhttps://doi.org/10.1016/j.neuron.2013.06.029\nArticle\nCAS\nPubMed\nGoogle Scholar\n- Spitzer P, Lang R, Oberstein TJ, Lewczuk P, Ermann N, Huttner HB, Masouris I, Kornhuber J, Ködel U, Maler JM (2018) A Specific Reduction in Aβ(1-42) vs a universal loss of Aβ peptides in CSF differentiates Alzheimer's disease from meningitis and multiple sclerosis. Front Aging Neurosci 10:152.\nhttps://doi.org/10.3389/fnagi.2018.00152\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/334", "#/texts/335", "#/texts/336", "#/texts/337"], "page_nos": [], "uuid": "99d66580-2181-41c2-bb68-293991a8ef20"}
{"doc_id": "2025__Causal_Effects_of_the_Plasma_Proteome_on_Vascular_Dementia_Risk_A_Mendelian_Rand__W4412068972", "source_path": "<redacted:source_path>", "chunk_id": 33, "source_chunk_idxs": [44], "num_tokens": 459, "text": "Causal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nReferences\n- Suárez-Calvet M, Kleinberger G, Araque Caballero M, Brendel M, Rominger A, Alcolea D, Fortea J, Lleó A, Blesa R, Gispert JD, Sánchez-Valle R, Antonell A, Rami L, Molinuevo JL, Brosseron F, Traschütz A, Heneka MT, Struyfs H, Engelborghs S, Sleegers K, Van Broeckhoven C, Zetterberg H, Nellgård B, Blennow K, Crispin A, Ewers M, Haass C (2016) sTREM2 cerebrospinal fluid levels are a potential biomarker for microglia activity in early-stage Alzheimer's disease and associate with neuronal injury markers. EMBO Mol Med 8(5):466-476.\nhttps://doi.org/10.15252/emmm.201506123\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n- Tang J, Wang S, Weng M, Guo Q, Ren L, He Y, Cui Z, Cong M, Qin M, Yu J, Su R, Li X (2023) The IGF2BP3-COPS7B axis facilitates mRNA translation to drive colorectal cancer progression. Cancer Res 83(21):3593-3610.\nhttps://doi.org/10.1158/0008-5472.CAN-23-0557\nArticle\nCAS\nPubMed\nGoogle Scholar\n- Tian XS, Guo XJ, Ruan Z, Lei Y, Chen YT, Zhang HY (2014) Long-term vision and non-vision dominant behavioral deficits in the 2-VO rats are accompanied by time and regional glial activation in the white matter. PLoS ONE 9(6):e101120.\nhttps://doi.org/10.1371/journal.pone.0101120\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/338", "#/texts/339", "#/texts/340"], "page_nos": [], "uuid": "12aee57c-f42c-4ccf-a566-ddd8dfd1f936"}
{"doc_id": "2025__Causal_Effects_of_the_Plasma_Proteome_on_Vascular_Dementia_Risk_A_Mendelian_Rand__W4412068972", "source_path": "<redacted:source_path>", "chunk_id": 34, "source_chunk_idxs": [45], "num_tokens": 461, "text": "Causal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nReferences\n- Tuo M, Xiao Y, Xu Y, Wang L, Wei X, Zhang L (2019) Role of granulocyte-colony stimulating factor in the protection of cerebral vascular endothelium, white matter, and cognition. Curr Neurovasc Res 16(5):425-432.\nhttps://doi.org/10.2174/1567202616666191029115113\nArticle\nCAS\nPubMed\nGoogle Scholar\n- VanderWeele TJ, Tchetgen Tchetgen EJ, Cornelis M, Kraft P (2014) Methodological challenges in mendelian randomization. Epidemiology 25(3):427-435.\nhttps://doi.org/10.1097/ede.0000000000000081\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n- Wang XX, Zhang B, Xia R, Jia QY (2020) Inflammation, apoptosis and autophagy as critical players in vascular dementia. Eur Rev Med Pharmacol Sci 24(18):9601-9614.\nhttps://doi.org/10.26355/eurrev\\_202009\\_23048\nArticle\nPubMed\nGoogle Scholar\n- Wei X, Xu Y, Jin Y, Feng H, Xiao Y, Dong S (2017) Granulocyte colony-stimulating factor attenuates blood-brain barrier damage and improves cognitive function in spontaneously hypertensive rats. CNS Neurol Disord Drug Targets 16(7):781-788.\nhttps://doi.org/10.2174/1871527316666170207155730\nArticle\nCAS\nPubMed\nGoogle Scholar\n- Wolters FJ, Ikram MA (2019) Epidemiology of vascular dementia. Arterioscler Thromb Vasc Biol 39(8):1542-1549.\nhttps://doi.org/10.1161/ATVBAHA.119.311908\nArticle\nCAS\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/341", "#/texts/342", "#/texts/343", "#/texts/344", "#/texts/345"], "page_nos": [], "uuid": "927da1fe-c407-4cbb-89e2-b9290fa7fd8f"}
{"doc_id": "2025__Causal_Effects_of_the_Plasma_Proteome_on_Vascular_Dementia_Risk_A_Mendelian_Rand__W4412068972", "source_path": "<redacted:source_path>", "chunk_id": 35, "source_chunk_idxs": [46], "num_tokens": 307, "text": "Causal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nReferences\n- Xiao G, Sun T, Songming C, Cao Y (2013) NR4A1 enhances neural survival following oxygen and glucose deprivation: an in vitro study. J Neurol Sci 330(1-2):78-84.\nhttps://doi.org/10.1016/j.jns.2013.04.010\nArticle\nCAS\nPubMed\nGoogle Scholar\n- Zhang S, Wu D, Xu Q, You L, Zhu J, Wang J, Liu Z, Yang L, Tong M, Hong Q, Chi X (2021) The protective effect and potential mechanism of NRXN1 on learning and memory in ADHD rat models. Exp Neurol 344:113806.\nhttps://doi.org/10.1016/j.expneurol.2021.113806\nArticle\nCAS\nPubMed\nGoogle Scholar\n- Zhong W, Altay O, Arif M, Edfors F, Doganay L, Mardinoglu A, Uhlen M, Fagerberg L (2021) Next generation plasma proteome profiling of COVID-19 patients with mild to moderate symptoms. EBioMedicine 74:103723.\nhttps://doi.org/10.1016/j.ebiom.2021.103723\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\nDownload references", "doc_items_refs": ["#/texts/346", "#/texts/347", "#/texts/348", "#/texts/349"], "page_nos": [], "uuid": "49214f92-b05e-4da4-9efc-cc3d0535d79c"}
{"doc_id": "2025__Causal_Effects_of_the_Plasma_Proteome_on_Vascular_Dementia_Risk_A_Mendelian_Rand__W4412068972", "source_path": "<redacted:source_path>", "chunk_id": 36, "source_chunk_idxs": [47, 48, 49], "num_tokens": 295, "text": "Causal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nAcknowledgements\nNot applicable\n\nCausal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nFunding\nThis research was supported and funded by the Scientific and Technological Innovation Project of CACMS. (No. CI2021B006), CACMS Innovation Fund (No. CI2021A01301, CI2021A01311), Hospital capability enhancement project of Xiyuan Hospital, CACMS. (No. XYZX0204-05, XYZX0101-21), the Innovation Team and Talents Cultivation Program of National Administration of Traditional Chinese Medicine (No. ZYYCXTD-C-202007), the National Natural Science Foundation of China (82405370), the China Postdoctoral Researchers National Funding Program Project (GZC20233131), the National TCM Leading Personnel Support Program (NATCM Personnel and Education Department (2018) (No. 12). Chinese Society of Traditional Chinese Medicine Research and Evaluation Special Topics (CACMRE2021-A-06).\n\nCausal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nAuthor information\nAuthor notes\n1. Yunmeng Chen and Chunyan Guo have contributed equally to this work.", "doc_items_refs": ["#/texts/351", "#/texts/353", "#/texts/355", "#/texts/356"], "page_nos": [], "uuid": "428219e6-16f7-45d4-afba-0e507c88f4d5"}
{"doc_id": "2025__Causal_Effects_of_the_Plasma_Proteome_on_Vascular_Dementia_Risk_A_Mendelian_Rand__W4412068972", "source_path": "<redacted:source_path>", "chunk_id": 37, "source_chunk_idxs": [50, 51], "num_tokens": 276, "text": "Causal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nAuthor information\nAuthors and Affiliations\n1. Xiyuan Hospital of China Academy of Chinese Medical Sciences, Beijing, 100091, China Yunmeng Chen, Chunyan Guo, Xiao Liang, Xiansu Chi, Zixuan Zhang, Ze Chang &amp; Yunling Zhang\nAuthors\n1. Yunmeng Chen\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n2. Chunyan Guo\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n3. Xiao Liang\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n4. Xiansu Chi\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n5. Zixuan Zhang\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n6. Ze Chang\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n7. Yunling Zhang\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n\nCausal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nAuthor information\nContributions\nYunling Zhang and Ze Chang were responsible for conceiving and designing the study. Yunmeng Chen and Chunyan Guo conducted the experiments and edited the manuscript. Data analysis and figure creation were carried out by, Xiao Liang, Xiansu Chi, and Zixuan Zhang.", "doc_items_refs": ["#/texts/358", "#/texts/359", "#/texts/360", "#/texts/361", "#/texts/362", "#/texts/363", "#/texts/364", "#/texts/365", "#/texts/366", "#/texts/368"], "page_nos": [], "uuid": "6c1ce572-c5d2-4d9b-a9b8-738b771b2cc0"}
{"doc_id": "2025__Causal_Effects_of_the_Plasma_Proteome_on_Vascular_Dementia_Risk_A_Mendelian_Rand__W4412068972", "source_path": "<redacted:source_path>", "chunk_id": 38, "source_chunk_idxs": [52, 53, 54, 55, 56, 57, 58, 59], "num_tokens": 497, "text": "Causal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nAuthor information\nCorresponding authors\nCorrespondence to\nZe Chang\nor\nYunling Zhang\n.\n\nCausal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nEthics declarations\nCompeting Interests\nAll of the authors declare that there are no conflicts of interest.\n\nCausal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nEthics declarations\nEthical Approval\nNot applicable.\n\nCausal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nEthics declarations\nConsent to Participate\nNot applicable.\n\nCausal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nEthics declarations\nConsent for Publication\nNot applicable.\n\nCausal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nAdditional information\nPublisher's Note\nSpringer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations.\n\nCausal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nSupplementary Information\nBelow is the link to the electronic supplementary material.\n\nCausal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nRights and permissions\nOpen Access\nThis article is licensed under a Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International License, which permits any non-commercial use, sharing, distribution and reproduction in any medium or format, as long as you give appropriate credit to the original author(s) and the source, provide a link to the Creative Commons licence, and indicate if you modified the licensed material. You do not have permission under this licence to share adapted material derived from this article or parts of it. The images or other third party material in this article are included in the article's Creative Commons licence, unless indicated otherwise in a credit line to the material. If material is not included in the article's Creative Commons licence and your intended use is not permitted by statutory regulation or exceeds the permitted use, you will need to obtain permission directly from the copyright holder. To view a copy of this licence, visit\nhttp://creativecommons.org/licenses/by-nc-nd/4.0/\n.\nReprints and permissions", "doc_items_refs": ["#/texts/370", "#/texts/371", "#/texts/372", "#/texts/373", "#/texts/374", "#/texts/377", "#/texts/379", "#/texts/381", "#/texts/383", "#/texts/386", "#/texts/388", "#/texts/393", "#/texts/394", "#/texts/395", "#/texts/396", "#/texts/397"], "page_nos": [], "uuid": "a373dbad-bb0d-4bc9-810e-44d3c435d5f0"}
{"doc_id": "2025__Causal_Effects_of_the_Plasma_Proteome_on_Vascular_Dementia_Risk_A_Mendelian_Rand__W4412068972", "source_path": "<redacted:source_path>", "chunk_id": 39, "source_chunk_idxs": [60, 61, 62, 63], "num_tokens": 294, "text": "Causal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nAbout this article\nCite this article\nChen, Y., Guo, C., Liang, X.\net al.\nCausal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation.\nCell Mol Neurobiol\n45\n, 66 (2025). https://doi.org/10.1007/s10571-025-01583-9\nDownload citation\n- Received : 02 March 2025\n- Accepted : 10 June 2025\n- Published : 07 July 2025\n- DOI : https://doi.org/10.1007/s10571-025-01583-9\n\nCausal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nAbout this article\nKeywords\n- Vascular dementia\n- Plasma proteins\n- Mendelian randomization\n- Causal inference\n- Experimental validation\nUse our pre-submission checklist\nAvoid common mistakes on your manuscript.\n\nCausal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nAssociated Content\nPart of a collection:\n\nCausal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nAssociated Content\nBiomarkers in Neurological Diseases: Advances in Diagnostic and Prognostic Tools\nAdvertisement", "doc_items_refs": ["#/texts/400", "#/texts/401", "#/texts/402", "#/texts/403", "#/texts/404", "#/texts/405", "#/texts/406", "#/texts/407", "#/texts/408", "#/texts/409", "#/texts/410", "#/texts/412", "#/texts/413", "#/texts/414", "#/texts/415", "#/texts/416", "#/texts/417", "#/texts/418", "#/texts/420", "#/texts/422"], "page_nos": [], "uuid": "24d233ff-c438-46d1-9a7d-5d8fed27a6fd"}
{"doc_id": "2025__Causal_Effects_of_the_Plasma_Proteome_on_Vascular_Dementia_Risk_A_Mendelian_Rand__W4412068972", "source_path": "<redacted:source_path>", "chunk_id": 40, "source_chunk_idxs": [64, 65, 66, 67, 68, 69], "num_tokens": 282, "text": "Causal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nSearch\nSearch by keyword or author\nSearch\n\nCausal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nNavigation\n- Find a journal\n- Publish with us\n- Track your research\n\nCausal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nNavigation\nDiscover content\n- Journals A-Z\n- Books A-Z\n\nCausal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nNavigation\nPublish with us\n- Journal finder\n- Publish your research\n- Language editing\n- Open access publishing\n\nCausal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nNavigation\nProducts and services\n- Our products\n- Librarians\n- Societies\n- Partners and advertisers\n\nCausal Effects of the Plasma Proteome on Vascular Dementia Risk: A Mendelian Randomization Study with Experimental Validation\nNavigation\nOur brands\n- Springer\n- Nature Portfolio\n- BMC\n- Palgrave Macmillan\n- Apress\n- Discover\n- Your privacy choices/Manage cookies\n- Your US state privacy rights\n- Accessibility statement\n- Terms and conditions\n- Privacy policy\n- Help and support\n- Legal notice\n- Cancel contracts here\n173.68.96.214\nNot affiliated\nImage Hyperlink.\n© 2025 Springer Nature", "doc_items_refs": ["#/texts/424", "#/texts/425", "#/texts/427", "#/texts/428", "#/texts/429", "#/texts/431", "#/texts/432", "#/texts/434", "#/texts/435", "#/texts/436", "#/texts/437", "#/texts/439", "#/texts/440", "#/texts/441", "#/texts/442", "#/texts/444", "#/texts/445", "#/texts/446", "#/texts/447", "#/texts/448", "#/texts/449", "#/texts/450", "#/texts/451", "#/texts/452", "#/texts/453", "#/texts/454", "#/texts/455", "#/texts/456", "#/texts/457", "#/texts/458", "#/texts/459", "#/texts/460", "#/texts/461"], "page_nos": [], "uuid": "dbf103b8-6ca2-4d92-af4e-114b38268981"}
