{"doc_id": "2025__Developing_an_explainable_machine_learning_and_fog_computing-based_visual_rating__W4412486382", "source_path": "<redacted:source_path>", "chunk_id": 0, "source_chunk_idxs": [0, 1, 2], "num_tokens": 298, "text": "Developing an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression | Scientific Reports\nSkip to main content\nThank you for visiting nature.com. You are using a browser version with limited support for CSS. To obtain\nthe best experience, we recommend you use a more up to date browser (or turn off compatibility mode in\nInternet Explorer). In the meantime, to ensure continued support, we are displaying the site without styles\nand JavaScript.\nAdvertisement\n- View all journals\n- Search\n- Log in\n- Content Explore content\n- About the journal\n- Publish with us\n- Sign up for alerts\n- RSS feed\n1. nature\n2. scientific reports\n3. articles\n4. article\nDeveloping an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nDownload PDF\nDownload PDF\n- Article\n- Open access\n- Published: 16 July 2025\n\nDeveloping an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\n- Zainab H. Ali\n1\n,\n2\n,\n- Esraa Hassan\n3\n,\n- Shimaa Elgamal\n4\n&amp;\n- ...\n- Nora El-Rashidy\n3\nShow authors\nScientific Reports\nvolume 15\n, Article number: 25872 ( 2025 )\nCite this article\n- 1511 Accesses\n- 10 Altmetric\n- Metrics details\n\nDeveloping an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nSubjects\n- Cardiology\n- Engineering\n- Health care", "doc_items_refs": ["#/texts/1", "#/texts/2", "#/texts/3", "#/texts/4", "#/texts/5", "#/texts/6", "#/texts/7", "#/texts/8", "#/texts/9", "#/texts/10", "#/texts/11", "#/texts/12", "#/texts/13", "#/texts/14", "#/texts/15", "#/texts/16", "#/texts/17", "#/texts/18", "#/texts/19", "#/texts/20", "#/texts/21", "#/texts/22", "#/texts/23", "#/texts/24", "#/texts/26", "#/texts/27", "#/texts/28", "#/texts/29", "#/texts/30", "#/texts/31", "#/texts/32", "#/texts/33", "#/texts/34", "#/texts/35", "#/texts/36", "#/texts/37", "#/texts/38", "#/texts/40", "#/texts/41", "#/texts/42"], "page_nos": [], "uuid": "3e3ae9ac-9b84-4699-9092-346c810e5dfd"}
{"doc_id": "2025__Developing_an_explainable_machine_learning_and_fog_computing-based_visual_rating__W4412486382", "source_path": "<redacted:source_path>", "chunk_id": 1, "source_chunk_idxs": [3], "num_tokens": 406, "text": "Developing an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nAbstract\nRecently, dementia research has primarily concentrated on using Magnetic Resonance Imaging (MRI) to develop learning models in processing and analyzing brain data. However, these models often cannot provide early detection of affected brain regions. Alternatively, mental test scores such as the Mini-Mental State Examination (MMSE) and Montreal Cognitive Assessment (MoCA) offer valuable insights into the likelihood of dementia and cognitive impairments. The main objective of this study is to introduce an innovative and dependable context-aware health monitoring system based on fog computing to measure mental impairment in the elderly population. The framework provides screening tests utilizing MMSE and MoCA to achieve accurate and real-time monitoring of cognitive function, allowing for early detection and treatment of mental disorders. To assess the effectiveness of our screening test, we evaluated a dataset comprising 450 subjects with Mild Cognitive Impairment (MCI) from Kaferelshikh University. The aggregated dataset is categorized into three classes: (1) 150 patients with MCI, (2) 150 subjects with subcortical diseases, Parkinson's Disease (PD), and (3) 150 subjects with cortical diseases, Alzheimer's Disease (AD). To accurately determine health risks, we employ an ensemble AdaBoost model, providing superior performance in accuracy, precision, recall, F-score, and Area Under the Curve (AUC). To validate the effectiveness of our Machine Learning (ML) model on unseen data, we evaluate an additional 18 subjects using the proposed scoring test, with six subjects from each class. The results indicate that our proposed ML model achieves an impressive accuracy of 0.93, outperforming the MoCA score (0.90) and MMSE score (0.83). Through our research, we demonstrate the potential of our context-aware fog computing approach in significantly enhancing early diagnosis of dementia, leveraging mental test scores as valuable indicators.", "doc_items_refs": ["#/texts/44"], "page_nos": [], "uuid": "b9729a2f-163f-4505-9eb1-86799c03f58a"}
{"doc_id": "2025__Developing_an_explainable_machine_learning_and_fog_computing-based_visual_rating__W4412486382", "source_path": "<redacted:source_path>", "chunk_id": 2, "source_chunk_idxs": [4, 5, 6, 7], "num_tokens": 511, "text": "Developing an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nAbstract\nA multimodal machine learning model for predicting dementia conversion in Alzheimer's disease\nArticle\nOpen access\n29 May 2024\n\nDeveloping an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nAbstract\nDifferential diagnosis of neurodegenerative dementias with the explainable MRI based machine learning algorithm MUQUBIA\nArticle\nOpen access\n13 October 2023\n\nDeveloping an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nAbstract\nPredicting conversion to Alzheimer's disease in individuals with Mild Cognitive Impairment using clinically transferable features\nArticle\nOpen access\n16 September 2022\n\nDeveloping an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nIntroduction\nOverview\nWith increased clinician burnout, it is essential to accelerate the growth of telehealth to provide high-quality healthcare services to individuals. Integrating the Internet of Things (IoT) and computing platforms such as fog, edge, and cloud can enhance the quality of healthcare services by enabling various telecom computing solutions. Reliable data collection is one of the biggest challenges in the healthcare industry, and intelligent sensors powered by IoT can help address this challenge seamlessly\n1\n. With recent advancements in IoT and computing platforms, hybrid modules have been created, delivering efficient e-healthcare computing solutions and enabling easy wireless data transfer among different units. Fog computing is a low-cost computing paradigm that extends cloud services to the network's edge. Unlike traditional computing services, fog computing provides massive computational and e-services on-demand, with proximity to end-users. Doing so reduces the latency time, and reliable and effective data are handled\n2\n. Figure\n1\nillustrates the structure of the hybrid model. Furthermore, a comparison of cloud and fog technologies will be conducted in Table\n1\n.\nFig. 1\nMild Cognitive Impairment (MCI) is a neurocognitive disorder that affects a significant portion of the elderly population. It is characterized by a slight memory deficit, which often describes a transitional state between Cognitively Normal (CN) and overt dementia, such as Alzheimer's Disease (AD) and Parkinson's Disease (PD). The symptoms of MCI are not severe enough to interfere with daily activities, but they are noticeable enough to cause concern. Memory loss is a common symptom of MCI, but other cognitive functions, such as decision-making, language, and attention, may also be affected\n8\n,\n9\n.", "doc_items_refs": ["#/texts/47", "#/texts/48", "#/texts/49", "#/texts/51", "#/texts/52", "#/texts/53", "#/texts/55", "#/texts/56", "#/texts/57", "#/texts/60", "#/texts/61", "#/texts/62", "#/texts/63", "#/texts/64", "#/texts/65", "#/texts/66", "#/texts/67", "#/texts/68", "#/texts/69", "#/texts/70", "#/texts/71", "#/texts/72", "#/texts/73", "#/texts/74"], "page_nos": [], "uuid": "fc7e79e7-b591-4fac-a6b7-4e7a77e6ab50"}
{"doc_id": "2025__Developing_an_explainable_machine_learning_and_fog_computing-based_visual_rating__W4412486382", "source_path": "<redacted:source_path>", "chunk_id": 3, "source_chunk_idxs": [8], "num_tokens": 413, "text": "Developing an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nIntroduction\nOverview\nBased on the clinical trials in the last ten years, cognitive impairment diseases have affected more than 60% of MCI patients; the diagnosis and severity of the disease vary extensively between individuals\n10\n. Unfortunately, these outcomes' factors are not fully understood\n11\n. Medical studies exploring the relationship between cognitive impairment and the risk of developing PD or AD have provided valuable insights into these neurodegenerative diseases. While cognitive impairment is strongly associated with AD, PD also presents cognitive symptoms, albeit with a different cognitive profile. Understanding the nature of cognitive impairment and its relationship to specific neurodegenerative diseases is crucial for accurate diagnosis, appropriate management, and targeted interventions to enhance the quality of life for individuals affected by these conditions\n12\n,\n13\n. Although this impact is significant, it is frequently missing in many studies. Some studies mentioned that mild cognitive impairment mainly depends on memory impairment for predicting AD.\nThe available information regarding the correlation between cognitive function in domains other than episodic Memory and the hazard of developing AD is limited. While episodic memory deficits are commonly associated with AD, the impact of different cognitive domains on the risk of developing the disease is not yet fully understood\n14\n,\n15\n. Episodic Memory is defined as the ability to remember specific events or experiences, and it is often one of the first cognitive functions affected in AD. However, AD is a complex neurodegenerative disease that involves impairments in multiple cognitive domains, including language, attention, executive function, and visuospatial abilities. Several studies have provided a detailed analysis of the progression from MCI to AD\n16\n,\n17\n,\n18\n, and they conclude reasons as follows: (i) MCI subject has less significant memory defects than AD, (ii) MCI subjects convert to AD within a range of time. Therefore, MCI needs special treatment to stabilize the cognitive function progression, and (iii) the state of AD could be predicted several years before progression.", "doc_items_refs": ["#/texts/75", "#/texts/76", "#/texts/77", "#/texts/78", "#/texts/79", "#/texts/80", "#/texts/81", "#/texts/82", "#/texts/83", "#/texts/84", "#/texts/85", "#/texts/86", "#/texts/87", "#/texts/88", "#/texts/89", "#/texts/90", "#/texts/91", "#/texts/92", "#/texts/93", "#/texts/94"], "page_nos": [], "uuid": "311b1ef4-0bbb-493e-aa05-52436e134499"}
{"doc_id": "2025__Developing_an_explainable_machine_learning_and_fog_computing-based_visual_rating__W4412486382", "source_path": "<redacted:source_path>", "chunk_id": 4, "source_chunk_idxs": [9], "num_tokens": 403, "text": "Developing an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nIntroduction\nOverview\nRecently, there has been extensive clinical research on using statistical techniques in Machine Learning (ML) and Deep Learning (DL) models to provide more efficient analysis and reliable decisions on large datasets. Every day, health centers produce a lot of data. For ML and DL algorithms to produce reliable results that give patients accurate information and quick outcomes regarding their health, a sizable amount of data is required. In healthcare prospects, the importance of ML and DL lies in their ability to handle enormous datasets more effectively without human intervention, and they improve the overall clinician experience at a lower cost.\nIn the context of early prediction of cognitive decline, ML and DL techniques have been utilized to drive non-traditional and high computational incentive solutions such as magnetic resonance imaging (MRI)\n12\n,\n13\n,\n14\n,\n15\n,\n16\n,\n17\n, biomarkers, and genetic data\n19\n. For example, authors in\n20\nutilized EfficientNet-B2 as a backbone for the building model to predict Alzheimer's disease- dementia. They first used EfficientNet to extract features from retrained images and then used the DL model to train the classification model. The same is true for\n21\n, where they utilized a stratified randomization method to predict cognitive decline. In\n20\n, the authors used a 3d CNN model to make an early diagnosis for Alzheimer's disease. Although the results seem better, they have often exceeded expectations. Due to the Patient's measurements in the diagnosis do not always coincide due to several reasons, including (i) the unavailability of all datasets, (ii) the need for continuous aggregating of patient data to track brain image changes which are expensive, and (iii) several signs don't appear at the early stage of the diseases. To address this issue, we must find alternative ways to provide an accurate and continuous assessment of MCI patients' cognitive functions.", "doc_items_refs": ["#/texts/95", "#/texts/96", "#/texts/97", "#/texts/98", "#/texts/99", "#/texts/100", "#/texts/101", "#/texts/102", "#/texts/103", "#/texts/104", "#/texts/105", "#/texts/106", "#/texts/107", "#/texts/108", "#/texts/109", "#/texts/110", "#/texts/111", "#/texts/112", "#/texts/113", "#/texts/114", "#/texts/115", "#/texts/116"], "page_nos": [], "uuid": "96d85fcb-b5dd-4e10-81d1-cbcb281b6ff9"}
{"doc_id": "2025__Developing_an_explainable_machine_learning_and_fog_computing-based_visual_rating__W4412486382", "source_path": "<redacted:source_path>", "chunk_id": 5, "source_chunk_idxs": [10], "num_tokens": 331, "text": "Developing an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nIntroduction\nScoring test\nScreening and medical examination tools have been developed to follow up on the status of cognitive decline among MCI patients. In 1975, Folstein developed a screening tool in clinical research called the Mini-Mental State Examination (MMSE)\n18\n. MMSE is the most common examination designed to detect cognitive dysfunction in different contexts, such as Memory, language, and attention. It allows the physician to determine cognitive ability deterioration as a measure of dementia progression and the influence of pharmaceutical therapies. However, due to the large percentage of a calling effect, there is currently debate whether this method can accurately identify cognitive dysfunction in the early stage. In\n19\n, they investigated MMSE ability as a screening tool for 34 patients with dementia. They concluded that MMSE should be used with extra care due to its mild sensitivity in predicting early deficits of such dementia diseases\n3\n,\n11\n. In 1995, in Montreal, Canada, the researcher developed a new screening tool known as the Montreal Cognitive Assessment (MoCA) to detect cognitive defects at an early stage\n22\n. MOCA has more sophisticated and broader tasks to check the visuospatial processing, usually in patients with MCI. In\n23\n, five meta-analyses of Parkinson's disease patients were examined to investigate how MOCA and MMSE scores are calculated. They concluded that both metrics could be used interchangeably for early diagnosis of Parkinson's disease. In another study\n24\n, 149 patients mentioned that MMSE is more sensitive than MOCA as a screening tool for Parkinson's disease\n25\n.", "doc_items_refs": ["#/texts/118", "#/texts/119", "#/texts/120", "#/texts/121", "#/texts/122", "#/texts/123", "#/texts/124", "#/texts/125", "#/texts/126", "#/texts/127", "#/texts/128", "#/texts/129", "#/texts/130", "#/texts/131", "#/texts/132", "#/texts/133", "#/texts/134"], "page_nos": [], "uuid": "ca46b852-ef21-48a6-a856-f44ab18077ea"}
{"doc_id": "2025__Developing_an_explainable_machine_learning_and_fog_computing-based_visual_rating__W4412486382", "source_path": "<redacted:source_path>", "chunk_id": 6, "source_chunk_idxs": [11], "num_tokens": 423, "text": "Developing an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nIntroduction\nScoring test\n1. 1.\nMMSE:\nMMSE is a screening tool that quickly assesses cognitive performance. It detects cognitive impairment and estimates cognitive evolution over time. MMSE is widely used in epidemiological studies and forms a part of the Dysostotic Interview Schedule (DIS) and epidemiologic catchment Area (ECA). MMSE depends on multiple cognitive domains, including repetition and verbal recall. Attention, calculation language, and visual construction. It consists of various questions with a minimum score of zero and a maximum score of 30 (appendix A shows the content of MMSE questions). These questions, grouped into seven categories, represent different categories. Each category takes a score from 1 to 8. Table\n2\nshows the distribution of each category with its degree. MMSE was developed to identify people at risk of developing AD, PD, and other forms of dementia. Unless the accepted results were reported using MMSE in some cases, different physicians reported that MMSE is not an accepted tool for MCI evaluation; patients with cognitive impairment perform in the normal range on the MMSE. Therefore, a tool to evaluate MCI. To address this problem, MoCA was developed as a screening tool for patients with mild cognitive complaints.\n2. 2.\nMoCA:\nMoCA is a screening test developed to detect impairment domains commonly occurring in MCI. It is used to evaluate people with symptoms of cognitive decline, such as memory loss, language loss, etc. The initial version of MoCA covered ten domains using an easy and rapid cognitive task. The iterative enhancement of MoCA took place over six years of its usage. The last version of the MoCA test, available at (\nwww.mocatest.org\n), is a page of 30 points distributed in Table\n3\n. MoCA is a clinical screening tool for Parkinson's, brain tumors, Alzheimer's, etc. For comfort reading, the list of frequently used abbreviations is shown in Table\n4\n.", "doc_items_refs": ["#/texts/135", "#/texts/136"], "page_nos": [], "uuid": "8f09459a-217a-4301-bb3e-1a7ca9b908a6"}
{"doc_id": "2025__Developing_an_explainable_machine_learning_and_fog_computing-based_visual_rating__W4412486382", "source_path": "<redacted:source_path>", "chunk_id": 7, "source_chunk_idxs": [12], "num_tokens": 270, "text": "Developing an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nIntroduction\nPaper contribution\nThis study introduces a reliable context-aware health monitoring framework based on fog computing to assess mental impairment in older people. This proposed framework provides a remote diagnosis of dementia diseases using fog computing technology and IoT devices. Fog computing receives sensing data from mobile applications or websites and generates real-time warning alerts based on adequate data analysis. The data analysis operation uses a new screening test that combines the strength of MMSE and MOCA to detect any cognitive impairment progression for MCI patients and predict the development of such dementia in the elderly stage. The proposed framework utilizes Adaptive Boosting (AdaBoost) and a multilayer perceptron model (MLP) for predictive operations. AdaBoost is an ML algorithm that boosts the performance of weak learners by sequentially training them and focusing on the misclassified instances to improve overall prediction accuracy. This study employs the AdaBoost MLP model to enhance the framework's prediction power. The model can make more accurate predictions by leveraging the strengths of multiple weak learners and compensating for their weaknesses. This approach is particularly useful when a single predictive model may not be sufficient to achieve desired results. The following points summarise the paper's contributions:", "doc_items_refs": ["#/texts/138"], "page_nos": [], "uuid": "3d22e4f1-0742-4b15-9554-e18af4d7b279"}
{"doc_id": "2025__Developing_an_explainable_machine_learning_and_fog_computing-based_visual_rating__W4412486382", "source_path": "<redacted:source_path>", "chunk_id": 8, "source_chunk_idxs": [13], "num_tokens": 363, "text": "Developing an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nIntroduction\nPaper contribution\n1. 1. Introducing a novel context-aware health monitoring framework utilizing fog computing to assess mental impairment in the elderly, combining advanced technologies for accurate real-time cognitive function monitoring. This framework's real-time tracking and analysis, facilitated by fog computing and IoT sensors, enable early detection of mental impairments, leading to timely interventions and enhanced outcomes.\n2. 2. Aggregating dataset for cortical and subcortical diseases is as follows: (1) 150 patients with MCI, (2) 150 subjects with PD (cortical diseases), and (3) 150 subjects with AD (subcortical diseases).\n3. 3. Developing a novel screening test using the MMSE and the MoCA for the early prediction of cortical and subcortical diseases in the Patient's brain.\n4. 4. Building an ensemble of multilayer perceptron (MLP) models for classification. Each neural network weak learners utilize includes adaptive learning with gradient descent, adaptive learning with momentum, and conjugate gradient descent. It helps to reduce errors by using several weak classifiers, leading to improvement in speed and performance.\n5. 5. Enhanced prediction power by using the AdaBoost MLP model, the framework achieves improved prediction accuracy compared to using a single weak learner. The sequential training process of AdaBoost allows for the combination of multiple weak learners, resulting in a more robust predictive model.\n6. 6. Ensuring the effectiveness of the proposed ML model by testing the performance on unseen data. The test data were also aggregated from Kaferelshikh University, 18 subjects (6 subjects for each class).", "doc_items_refs": ["#/texts/139", "#/texts/140", "#/texts/141", "#/texts/142", "#/texts/143", "#/texts/144"], "page_nos": [], "uuid": "379f6107-b6ae-4cad-a55a-3fae1c9f3033"}
{"doc_id": "2025__Developing_an_explainable_machine_learning_and_fog_computing-based_visual_rating__W4412486382", "source_path": "<redacted:source_path>", "chunk_id": 9, "source_chunk_idxs": [14, 15], "num_tokens": 263, "text": "Developing an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nIntroduction\nPaper organization\nThe remainder of this article is organized as follows: Section \"\nDiscussion\n\" discusses related work and a recent literature review. Section \"\nLiterature review\n\" introduces the proposed reliable context-aware health monitoring framework and its functionalities, and describes the used dataset and its characteristics. Section 4 analyzes numerical results; Sect. 5 details system strength limitations. Section \"\nProposed reliable context-aware health monitoring framework based on fog-computing\n\" provides the paper's conclusion.\n\nDeveloping an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nLiterature review\nThis section presents a thorough review of the literature pertinent to our research topic. By delving into prior studies, theoretical frameworks, and empirical findings, we aim to provide a solid foundation for our research and highlight our study's significance in advancing the field's current understanding. The literature review section is divided into three subsections. The first provides a comprehensive overview of existing research and scholarly works relevant to AD and the usage of learning techniques under investigation. The second subsection aims to establish the current state of knowledge in fog computing and cloud services. The third section illustrates the potential benefit of fog technology in healthcare applications.", "doc_items_refs": ["#/texts/146", "#/texts/147", "#/texts/148", "#/texts/149", "#/texts/150", "#/texts/151", "#/texts/152", "#/texts/154"], "page_nos": [], "uuid": "1a21e95f-ebb4-494d-8d58-ec0625744359"}
{"doc_id": "2025__Developing_an_explainable_machine_learning_and_fog_computing-based_visual_rating__W4412486382", "source_path": "<redacted:source_path>", "chunk_id": 10, "source_chunk_idxs": [16], "num_tokens": 391, "text": "Developing an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nLiterature review\nAlzheimer's disease with learning techniques\nAs age-associated epidemics, AD and PD have garnered significant attention due to their impact on cognitive function and overall brain health. The prevalence of AD increases exponentially with age, ranging from 1% among people between 60 and 64 years to 38% among individuals over 85 years\n26\n. Similarly, PD is more prevalent in older individuals. Consequently, there is a growing need to understand the progression of these diseases and develop early identification methods\n27\n,\n28\n.\nPatients with MCI exhibit memory impairment that exceeds what would be expected for their age, but they do not meet the criteria for a diagnosis of AD\n28\n. However, individuals with MCI are at a higher risk of developing AD and PD, making early detection crucial\n29\n,\n30\n. Research indicates that the conversion rate from MCI to AD is approximately 15% per year, while the conversion rate from MCI to PD is approximately 12.8%\n29\n,\n30\n. To address the need for early identification and prediction of disease progression, recent research has focused on predicting cognitive function decline and the risk of developing AD and PD. By combining these predictive models, researchers aim to provide valuable insights into disease trajectories and enable timely interventions.\nAdvancements in data analysis and ML techniques have facilitated the development of predictive models for cognitive decline and disease progression. These models utilize various data sources, including medical records, cognitive assessments, genetic information, and biomarkers, to identify patterns and indicators of disease progression. Recent studies have shown promising results in predicting the progression of cognitive function. Researchers have identified specific biomarkers, genetic factors, and cognitive assessments that can effectively predict the likelihood of transitioning from MCI to AD or PD by analyzing longitudinal data. These predictive models provide valuable information for clinicians and researchers to intervene early and tailor treatment plans accordingly.", "doc_items_refs": ["#/texts/156", "#/texts/157", "#/texts/158", "#/texts/159", "#/texts/160", "#/texts/161", "#/texts/162", "#/texts/163", "#/texts/164", "#/texts/165", "#/texts/166", "#/texts/167", "#/texts/168", "#/texts/169", "#/texts/170", "#/texts/171", "#/texts/172", "#/texts/173", "#/texts/174"], "page_nos": [], "uuid": "61d2dbe0-8600-40e6-862b-fb4b134efdbe"}
{"doc_id": "2025__Developing_an_explainable_machine_learning_and_fog_computing-based_visual_rating__W4412486382", "source_path": "<redacted:source_path>", "chunk_id": 11, "source_chunk_idxs": [17], "num_tokens": 410, "text": "Developing an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nLiterature review\nAlzheimer's disease with learning techniques\nSeveral studies utilized brain images of MCI patients to predict the progression of brain functions and the development of dementia. For example\n31\n, utilized the CNN model to explore MRI images and extract the most significant features. These features detect both an individual's cognitive symptoms and the neurodegeneration process. The classification model is used to analyze the distribution of the extracted features and the influence of each feature on AD diagnosis. They achieved a performance of 80% in terms of classification accuracy. Others in\n32\nclaimed that MCI is not the reason for AD conversion. They proposed a dual learning and ad-hoc layer model to predict MCI subjects developing AD. This model takes various inputs, including MRI, demographic, genetic, and neurophysiological data.\nThe model works to two tasks: (i) predict MCI subjects likely to convert to AD and detect AD subjects themselves. They concluded that MRI is the most accurate prediction task technique. Another model proposed a model for predicting MCI progression to AD based on hippocampal MRI features\n16\n. The proposed model detects the different patterns, then adopts the Classifier in a way that cuts off at a certain threshold of points. In\n11\n, an accurate DL model was proposed to assess dementia service that applied to functional MRI automatically. They proposed another predictive DL to identify subjects with dementia based on electronic health record (EHR) datasets (i.e., MRI, medical data, lab test data, pharmacy, etc.). The authors claimed that the model helps predict the risk of AD 4-9 years before the onset of the disease.\nSeveral studies have utilized the Alzheimer's Disease Neuroimaging Initiative (ANDI) data to predict the diagnosis of AD. These studies leverage ML techniques to analyze the demographic and neurophysiological data extracted from ANDI, providing insights into cognitive function and disease differentiation.", "doc_items_refs": ["#/texts/175", "#/texts/176", "#/texts/177", "#/texts/178", "#/texts/179", "#/texts/180", "#/texts/181", "#/texts/182", "#/texts/183", "#/texts/184", "#/texts/185"], "page_nos": [], "uuid": "f19164a4-9d01-481d-8f9b-6a7848804950"}
{"doc_id": "2025__Developing_an_explainable_machine_learning_and_fog_computing-based_visual_rating__W4412486382", "source_path": "<redacted:source_path>", "chunk_id": 12, "source_chunk_idxs": [18], "num_tokens": 391, "text": "Developing an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nLiterature review\nAlzheimer's disease with learning techniques\nIn one study conducted by Williams et al.\n33\n, four ML models, namely Support Vector Machine (SVM), Decision Tree (DT), Neural Network (NN), and Naive Bayes, were employed to predict cognitive functions based on ANDI data. The study concluded that Naive Bayes achieved the highest accuracy in predicting cognitive function. In another study\n34\n, a deep neural network (DNN) model was designed to differentiate between AD, MCI, and CN subjects using ANDI data. The proposed model achieved validation accuracies of 76%, 85%, and 72% for CN vs. MCI, AD vs. CN, and AD vs. MCI, respectively. In a study by\n35\n, a recurrent neural network (RNN) with a Long short-term memory (LSTM) autoencoder model was developed to learn and represent cognitive features using ANDI data. The model achieved an accuracy of 85% in evaluating cognitive performance. Similarly, another study\n36\nused ML models and autoencoders to predict the conversion from MCI to AD. The proposed model achieved an accuracy of 83.7% in predicting this conversion.\nThese studies demonstrate the effectiveness of ML techniques and DL models in analyzing ANDI data for predicting AD diagnosis, cognitive function, and disease progression. The results highlight the potential of these models in aiding early identification and personalized interventions for individuals at risk of developing AD or progressing from MCI to AD. However, it is significant to note that while these studies have achieved promising results, further research and validation are necessary to enhance the robustness and generalizability of these predictive models. Large-scale studies involving diverse populations and longitudinal data would contribute to the advancement and clinical implementation of these prediction models based on ANDI data.", "doc_items_refs": ["#/texts/186", "#/texts/187", "#/texts/188", "#/texts/189", "#/texts/190", "#/texts/191", "#/texts/192", "#/texts/193", "#/texts/194", "#/texts/195"], "page_nos": [], "uuid": "c9b6910a-dafb-42fa-a926-c28cb70f1464"}
{"doc_id": "2025__Developing_an_explainable_machine_learning_and_fog_computing-based_visual_rating__W4412486382", "source_path": "<redacted:source_path>", "chunk_id": 13, "source_chunk_idxs": [19], "num_tokens": 375, "text": "Developing an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nLiterature review\nAlzheimer's disease with learning techniques\nOther studies utilized genetic data for prediction. In\n37\n, they proposed a DL model that worked on features extracted from genetic data to predict the conversion between MCI and AD two years before the onset of AD. This model proves its efficiency in distinguishing between progressive MCI and stable MCI. The same is true in\n38\n,\n39\n. Other studies mentioned that the progression from MCI to AD is associated with different characteristics. For example, in\n35\nkarlekar et al. depend on changes in language as an initial sign for AD prediction. They utilized Natural Language Processing (NLP) to classify the differences in linguistics from the Deminta bank dataset. They combined three NN models (CNN-LSTM, RNN-LSTM, and CNN). The analysis is based on the derivative saliency technique that rediscovered the language patterns of AD survivors. The proposed model obtained an accuracy of 95.6% and a sensitivity of 97.04%. They concluded that risk factors could include obesity, depression, smoking, hearing loss, and social isolation.\nThey regarded PD prediction. Several studies used the Patient's voice dataset to predict the diagnosis of Parkinson's. For instance, in\n25\n, the UCI dataset (the Patient's voice dataset) was used to indicate the diagnosis of PD based on several ML models. They mentioned that SVM with a polynomial kernel gives the best performance in prediction (accuracy = 86% and sensitivity = 88%). In\n40\n, a random forest algorithm over the dataset, including attributes, is used. They first used PCA to reduce the data dimension; then, the dataset applied random forest to give the best performance (approximately 90%).", "doc_items_refs": ["#/texts/196", "#/texts/197", "#/texts/198", "#/texts/199", "#/texts/200", "#/texts/201", "#/texts/202", "#/texts/203", "#/texts/204", "#/texts/205", "#/texts/206", "#/texts/207", "#/texts/208", "#/texts/209"], "page_nos": [], "uuid": "833531ef-7541-4460-9b4f-c350b4be39c9"}
{"doc_id": "2025__Developing_an_explainable_machine_learning_and_fog_computing-based_visual_rating__W4412486382", "source_path": "<redacted:source_path>", "chunk_id": 14, "source_chunk_idxs": [20], "num_tokens": 189, "text": "Developing an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nLiterature review\nAlzheimer's disease with learning techniques\nUnless the existence of several studies is concerned with the development of such mental cognitive impairments, such as PD and AD, the accuracy of early diagnosis is still limited. This return to several reasons, including (i) structural neuroimages such as MRI and CCT do not provide all the characteristic features that could provide a diagnosis such as neurodegenerative disorder, (ii) functional neuroimages using SPECT may help in the early diagnosis, but it is expensive, (iii) Transcranial Sonography (TCS) has achieved good performance in early diagnosis of Parkinson's but it not commonly available, (vi) such brain images need to be reported continuously to track the changes in brain characteristics. A summary of the state of the art is detailed in Table\n5\n.", "doc_items_refs": ["#/texts/210", "#/texts/211", "#/texts/212"], "page_nos": [], "uuid": "2f3fb186-966f-470a-a94b-bb37b331a664"}
{"doc_id": "2025__Developing_an_explainable_machine_learning_and_fog_computing-based_visual_rating__W4412486382", "source_path": "<redacted:source_path>", "chunk_id": 15, "source_chunk_idxs": [21], "num_tokens": 440, "text": "Developing an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nLiterature review\nFog technology\nAccording to\n45\n, IoT is a growing market that demands more effective data storage and processing technologies. Fog computing is a solution for managing the expanding number of linked devices. Unlike remote computing, fog computing makes use of local computer resources. It brings the cloud computing paradigm to the network edge, making it ideal for real-time interactions and IoT applications. Fog computing creates a network fabric that connects data sources and storage locations in the cloud or a client's data center. It is a decentralized computer infrastructure with files, storage, computing, and applications between the data source and the cloud. The requirement for real-time monitoring mainly drives the adoption of fog computing, since it allows for edge analysis close to the data source.\nIn contrast, cloud computing focuses more on long-term deep analysis because of its sensitivity\n46\n,\n47\n. Fog computing reduces the likelihood of failure by employing various protocols and specifications. Its hierarchical structure provides a more solid framework than the cloud. The goal of fog computing is to relieve the computational burden of cloud computing. Fog computing has become a popular IoT solution because it brings data collection, storage, networking, and analytics closer to the devices and applications that use the network\n48\n.\nIn a fog computing system, most computational tasks are performed in a data hub on a smart mobile computer. This approach is particularly advantageous for IoT due to the immense volume of sensor-generated data. Sending all the data produced by a group of sensors to the cloud for processing and analysis is impractical due to the large bandwidth requirements and the slow back-and-forth communication between sensors and the cloud. This delay issue can be critical, especially in applications like vehicle-to-vehicle communication\n49\n. While cloud computing remains vital for IoT implementations, it is gradually losing its prominence. Fog computing is poised to take over and handle all essential tasks, relegating cloud computing to a secondary role. With the exponential growth of the IoT, a specialized technology is needed to meet its requirements, and fog computing appears to be the most feasible and practical alternative.", "doc_items_refs": ["#/texts/214", "#/texts/215", "#/texts/216", "#/texts/217", "#/texts/218", "#/texts/219", "#/texts/220", "#/texts/221", "#/texts/222", "#/texts/223", "#/texts/224", "#/texts/225", "#/texts/226"], "page_nos": [], "uuid": "9a5149e9-378e-4fc7-9fc5-81d8022d7600"}
{"doc_id": "2025__Developing_an_explainable_machine_learning_and_fog_computing-based_visual_rating__W4412486382", "source_path": "<redacted:source_path>", "chunk_id": 16, "source_chunk_idxs": [22], "num_tokens": 337, "text": "Developing an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nLiterature review\nFog computing in smart healthcare\nIn healthcare systems, fog computing has emerged as a prominent solution compared to cloud computing. This is primarily due to several advantages it offers, including enhanced security, efficient utilization of network capacity, reduced operational expenses, decreased latency, ease of developing fog applications in mobile environments, and its ability to withstand harsh environmental conditions\n50\n,\n51\n,\n52\n. Cloud computing was utilized to develop a large-scale, compact health-monitoring model to assist a significant number of rural residents in Bangladesh\n53\n. This scheme enables effective treatment for a diverse population. In\n54\n, a cloud-based gaming platform was proposed, allowing individuals to perceive emotions through the cloud server, altering the gaming visualization accordingly.\nFurthermore\n55\n, introduced a cloud-based telemedicine framework that employed various sensors to monitor cardiac function, record electrocardiograms, and measure blood pressure. The collected data was then transferred to the cloud for automated diagnosis and patient notification. In health monitoring, Muhammad et al.\n56\nproposed a computerized speech-recognition device that analyzed spectrograms of patient voice signals to detect interlaced derivative sequences, similarly to\n57\n, which proposed a cloud computing-based system for monitoring PD in Smart Cities, achieving an accuracy rate of 97.2%. This system takes speech signals as input and analyzes them on a cloud server to determine if they originate from a Parkinson's Patient or a healthy individual. Subsequently, the collected samples are sent to authorized doctors for appropriate medical intervention, and the Patient is informed of the findings and necessary steps to be taken.", "doc_items_refs": ["#/texts/228", "#/texts/229", "#/texts/230", "#/texts/231", "#/texts/232", "#/texts/233", "#/texts/234", "#/texts/235", "#/texts/236", "#/texts/237", "#/texts/238", "#/texts/239", "#/texts/240", "#/texts/241", "#/texts/242", "#/texts/243", "#/texts/244", "#/texts/245"], "page_nos": [], "uuid": "30a60912-fb16-4f86-a703-97e6b97620a3"}
{"doc_id": "2025__Developing_an_explainable_machine_learning_and_fog_computing-based_visual_rating__W4412486382", "source_path": "<redacted:source_path>", "chunk_id": 17, "source_chunk_idxs": [23], "num_tokens": 290, "text": "Developing an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nProposed reliable context-aware health monitoring framework based on fog-computing\nThe proposed reliable context-aware health monitoring framework based on fog-computing is specifically tailored to assess mental impairment in elderly individuals. As depicted in Fig.\n2\n, the proposed framework consists of two core stages, including sensing and preprocessing data, and fog-computing, which ensure real-time patient health notifications and alerts through fog-computing and IoT infrastructure. By continuously monitoring patients' health conditions, collecting data, and performing real-time analysis, the framework aids healthcare providers in identifying patterns associated with dementia diseases. The fog server component provides extensive storage capabilities and generates historical reports while minimizing the transmission of data that requires prolonged analysis and storage. This comprehensive approach contributes to enhanced system reliability and improved network performance.\nFig. 2\nThe framework caters to two types of patients: those already afflicted with the disease and requiring timely monitoring to prevent further deterioration, and those at high risk of developing the disease due to genetic factors or other causes. Data acquisition pertaining to the symptoms of individuals is collected periodically, with predetermined intervals set by healthcare experts. In the cases of both Alzheimer's and Parkinson's, patients wear IoT-wearable devices that enable continuous monitoring of their progress and immediate transmission of real-time warnings to healthcare providers.", "doc_items_refs": ["#/texts/247", "#/texts/248", "#/texts/249", "#/texts/250", "#/texts/251"], "page_nos": [], "uuid": "0efd9397-460a-424d-aa70-26195fa77276"}
{"doc_id": "2025__Developing_an_explainable_machine_learning_and_fog_computing-based_visual_rating__W4412486382", "source_path": "<redacted:source_path>", "chunk_id": 18, "source_chunk_idxs": [24], "num_tokens": 243, "text": "Developing an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nProposed reliable context-aware health monitoring framework based on fog-computing\nSensing and preprocessing data (SPPD)\nSPPD is the initial layer in the first stage, responsible for acquiring real-time data from IoT-wearable devices or personal web communities. The data includes the location sensor, health sensor ID, and environmental information. To avoid heterogeneity and achieve minimal effort and costs of acquired data, the proposed framework adjusts one of the time synchronization cores, such as PTP, PPS, IRIG, and NMEA. At the beginning of the operation, the patients registered themself via the cord number given by the hospital or using Social Security Number (SSN) immediately. The healthcare system can detect the sensor ID by asking the Patient about it; it is unique. Data preprocessing will be locally done at the fog-computing stage to accelerate decision-making and avoid network bandwidth consumption. To put the network bandwidth under control, different communication technologies make a set of communication ranges available for high connectivity among fog nodes (see Table\n6\n).", "doc_items_refs": ["#/texts/253", "#/texts/254", "#/texts/255"], "page_nos": [], "uuid": "ccdba50b-fa25-4774-b7fc-d8a5eccc3031"}
{"doc_id": "2025__Developing_an_explainable_machine_learning_and_fog_computing-based_visual_rating__W4412486382", "source_path": "<redacted:source_path>", "chunk_id": 19, "source_chunk_idxs": [25], "num_tokens": 384, "text": "Developing an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nProposed reliable context-aware health monitoring framework based on fog-computing\nSensing and preprocessing data (SPPD)\nData preparation\nThe data preparation process in the proposed healthcare monitoring system is divided into three primary operations: (i) outlier detection, (ii) data imputation, and (iii) data scaling. These operations will be discussed in detail in the following subsections.\n1. 1.\nOutlier Detection\n: Outlier detection involves the identification of exceptional values within a dataset in relation to normal values. Recognizing outliers is a crucial step in data preparation as it significantly impacts the performance of classification and clustering algorithms. Various statistical techniques, such as proximity-based models and distance-based methods, address the outlier problem. However, in this investigation, we rely on the expertise of our medical professionals to identify and resolve data outliers.\n2. 2.\nMICE\n: For handling missing values, we employ the Multivariate Imputation by Chained Equations (MICE) method implemented in R. Missing values can arise due to corruption or data collection errors, and their presence can adversely affect classifier performance, leading to bias effects. Basic methods, such as mean, maximum, and minimum, are commonly used for inputting numeric values, while the most frequently occurring item is employed for categorical values. In our study, we observe a small number of missing values in each column, ranging from 2 to 5 for each column. To ensure high accuracy in the imputed data, we adopt the MICE method, which generates n complete datasets by replacing missing variables with n distinct values. These datasets are then analyzed, pooled, and combined to create a resultant dataset. Although this method requires more processing resources, it outperforms single imputation methods\n58\n,\n59", "doc_items_refs": ["#/texts/257", "#/texts/258", "#/texts/259"], "page_nos": [], "uuid": "00b33d9e-78d9-48a8-81e6-82c80bcf5795"}
{"doc_id": "2025__Developing_an_explainable_machine_learning_and_fog_computing-based_visual_rating__W4412486382", "source_path": "<redacted:source_path>", "chunk_id": 20, "source_chunk_idxs": [26], "num_tokens": 282, "text": "Developing an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nProposed reliable context-aware health monitoring framework based on fog-computing\nSensing and preprocessing data (SPPD)\nData preparation\n3. 3.\nData Scaling\n: The purpose of ML data scaling approaches is to normalize all data points. This prevents the Classifier from exhibiting bias towards a particular class, reducing uncertainty and minimizing the likelihood of inaccurate findings or increased cost/processing time. In our study, we employ min-max scaling, which ensures that the data range falls within a specified range. The following equation represents the min-max scaling approach utilized in our research, where \\(\\text{x}\\) represents the feature, \\(\\overline{\\text{x} }\\) represents the feature mean and \\(\\delta\\) is the standard deviation\n60\n$${\\text{X}}^{\\prime } = \\frac{{{\\text{x}} - {\\overline{\\text{x}}}}}{\\delta }$$ (1)\nThe data preparation process in the proposed healthcare monitoring system consists of three primary operations: (i) outlier detection, (ii) data imputation, and (iii) data scaling. These operations will be extensively discussed in the subsequent subsections.", "doc_items_refs": ["#/texts/260", "#/texts/261"], "page_nos": [], "uuid": "a3852864-7946-4360-a7d7-305c34eefaee"}
{"doc_id": "2025__Developing_an_explainable_machine_learning_and_fog_computing-based_visual_rating__W4412486382", "source_path": "<redacted:source_path>", "chunk_id": 21, "source_chunk_idxs": [27], "num_tokens": 510, "text": "Developing an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nProposed reliable context-aware health monitoring framework based on fog-computing\nDataset description and classification (DDC)\nThe DDC serves as the primary layer within the fog-computing stage, harnessing the potential of a genuine dataset obtained from real patients. The dataset comprises information encompassing three health-related categories, comprising 150 patients sourced from the neurology clinic at Kafrelskeikh University Hospital. These patients have received clinical diagnoses of AD in accordance with the criteria outlined by the National Institute of Neurological and Communicative Disorders and Stroke-Alzheimer's Disease and Related Disorders Association (NINCDS-ADRDA)\n47\n. Several key considerations are essential in this context, including: (i) The patients' Cognitive deficits and functional impairment needed to be significant enough to satisfy the criteria for dementia. (ii) The definitive diagnosis relied on postmortem examination, ensuring the highest diagnostic accuracy. (iii) For living patients, the clinician's most reliable diagnosis was classified as probable Alzheimer's disease. (iv) The clinician diligently ruled out alternative causes of cognitive impairment. These meticulous considerations establish a robust foundation for utilizing the real dataset in further research and analysis within the fog-computing stage, and (v) the cognitive deficits were not operationalized for characteristics or severity.\nThe second category is 150 patients with idiopathic PD with cognitive impairment, admitted to the Neurology department in Kafrelskeikh University Hospital through the outpatient clinic (OPC). All of them were diagnosed according to the UK Parkinson's Disease Society Brain Bank clinical diagnostic criteria\n61\n. The third category is 150 patients with MCI (neither demented nor normal). Showed complete general and neurological examination. All patients were examined generally, neurologically, and cognitively by MMNE and MOCA Arabic version to determine the main domains of cognition that are affected in each group for ML for high accuracy of diagnosis and early diagnosis of MCI to manage the case as early as possible and delay dementia whenever possible (see Table\n7\n). Also, all patients underwent routine lab and conventional MRI to exclude any other cause of dementia other than Alzheimer's or Parkinson's. The distribution of the dataset is shown in Fig.\n3\n. The distribution of MoCA and MMSE according to parameters is shown in Table\n8\n. The distribution of correct and incorrect samples is detailed in Table\n9\n.", "doc_items_refs": ["#/texts/263", "#/texts/264", "#/texts/265", "#/texts/266", "#/texts/267", "#/texts/268", "#/texts/269", "#/texts/270", "#/texts/271", "#/texts/272", "#/texts/273", "#/texts/274", "#/texts/275", "#/texts/276"], "page_nos": [], "uuid": "f42efdc9-95ae-419d-a5bf-5d9647866baa"}
{"doc_id": "2025__Developing_an_explainable_machine_learning_and_fog_computing-based_visual_rating__W4412486382", "source_path": "<redacted:source_path>", "chunk_id": 22, "source_chunk_idxs": [28, 29], "num_tokens": 364, "text": "Developing an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nProposed reliable context-aware health monitoring framework based on fog-computing\nDataset description and classification (DDC)\nFig. 3\n\nDeveloping an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nProposed reliable context-aware health monitoring framework based on fog-computing\nCognitive progression examination (CPE)\nThe CPE is the second layer in the fog-computing stage. It provides a new hybrid test based on a set of features extracted from both MMSE and MoCA. The purpose of this hybrid is to provide an efficient monitoring tool for assessing the Patient's cognitive progression.\nThe concept of classifying dementia into cortical and subcortical types has garnered considerable attention in both clinical and etiological diagnosis. By studying various neurological conditions that impact specific brain regions, it is possible to identify symptoms such as aphasia, forgetfulness, agnosia, and apraxia as indicative of cortical dementia, which includes AD and frontotemporal dementia. On the other hand, subcortical dementias encompass Parkinson's disease, Huntington's disease, Binswanger's disease, progressive supranuclear palsy, multiple sclerosis, and Sydenham's chorea. However, certain diseases, such as corticobasal degeneration, multiple system atrophy, vascular dementia, and HIV dementia, affect both cortical and subcortical regions of the brain, resulting in a complex manifestation of dementia\n62\n,\n63\n.\nThe novelty of the hybrid test is to introduce a set of features combination that allows healthcare providers to evaluate cognitive progression and differentiate between cortical and subcortical diseases, for instance:", "doc_items_refs": ["#/texts/277", "#/texts/279", "#/texts/280", "#/texts/281", "#/texts/282", "#/texts/283", "#/texts/284", "#/texts/285"], "page_nos": [], "uuid": "f6ffec0d-9734-422c-be8d-30516932a31d"}
{"doc_id": "2025__Developing_an_explainable_machine_learning_and_fog_computing-based_visual_rating__W4412486382", "source_path": "<redacted:source_path>", "chunk_id": 23, "source_chunk_idxs": [30], "num_tokens": 420, "text": "Developing an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nProposed reliable context-aware health monitoring framework based on fog-computing\nCognitive progression examination (CPE)\n1. 1.\nMemory test:\nsince cortical dementia has a more severe loss on the tests of delayed recall, memory testing was chosen (i.e., abnormally rapid forgetting). However, encoding and storage, which are severely compromised in cortical-type diseases, are mostly unaffected. Subcortical abnormalities also result in a deficiency in spontaneous recall.\n2. 2.\nLanguage evaluation\n: This is attributed to the fact that cortical forms of dementia are more likely to exhibit linguistic impairments. Patients with AD experience progressive language impairments that begin with anomia and advance to transcortical sensory aphasia, eventually leading to a terminal language syndrome characterized by echolalia, logoclonia, and palilalia, resulting in a complex dementia profile\n31\n. Aphasia manifests early in cortical dementias, such as AD, whereas specific aphasia syndromes have not been delineated in subcortical dementias.\n3. 3. Executive functions involve the prefrontal lobes and associated subcortical structures. Therefore, it is reasonable to expect impairments in executive functions in both subcortical and cortical dementias.\n4. 4.\nVisuospatial function\n: Visuospatial deficits are prominent in cortical and subcortical dementias. Although it is challenging to quantify and distinguish cognitive processing slowdown from motor retardation accurately, bradyphrenia appears to be more prevalent in subcortical dementia syndromes than in cortical types\n63\n. Additionally, 10 tests were employed covering various abilities such as attention, writing, and reading. Table\n10\nprovides an overview of all the score tests, including the hybrid test. These tests were selected under the supervision of a medical expert committee from Kaferelshikh University.\nTable 10 Features of the new hybrid test.\nFull size table", "doc_items_refs": ["#/texts/286", "#/texts/287", "#/texts/288", "#/texts/289"], "page_nos": [], "uuid": "9d157771-0fdc-4456-baac-c1f3af22b349"}
{"doc_id": "2025__Developing_an_explainable_machine_learning_and_fog_computing-based_visual_rating__W4412486382", "source_path": "<redacted:source_path>", "chunk_id": 24, "source_chunk_idxs": [31], "num_tokens": 452, "text": "Developing an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nProposed reliable context-aware health monitoring framework based on fog-computing\nCognitive progression examination (CPE)\nIn AD, the primary pathological features include the presence of senile plaques and neurofibrillary tangles in the cortex, along with generalized cortical atrophy, particularly affecting the frontal and temporal lobes. This degeneration leads to neuronal degeneration and severe brain atrophy. Clinical manifestations commonly observed in AD include dyscalculia, dysphasia, and dyspraxia. On the other hand, subcortical dementia syndromes encompass various conditions such as degenerative extrapyramidal syndromes, subcortical infarctions, acquired immunodeficiency syndrome (AIDS), multiple sclerosis, thalamic degenerative disorders, subcortical trauma, inflammatory processes, and tumors. Lesions in subcortical dementias mainly occur in the basal ganglia, select brainstem nuclei, and the cerebellum\n64\n. The atrophy of the caudate nucleus, due to its close connections with the prefrontal cortex, can disrupt the caudate-prefrontal loops and lead to neuropsychological alterations in patients without apparent prefrontal lesions. Cognitive impairment in such patients has been strongly associated with the severity of motor symptoms rather than the duration of the disease\n65\n.\nProcedural learning in PD and Huntington's dementia has been extensively studied. Saint-Cyr et al.\n66\ndiscovered that patients with both conditions exhibited impaired performance on the Tower of Hanoi task. In contrast, amnesic patients with AD typically perform well on this task due to their intact procedural Memory. Executive function, which involves difficulties in verbal fluency, categorization, set-shifting, and planning, is significantly impaired in subcortical dementias\n67\n. Similarly, it is also affected in early cortical dementia, such as AD. In summary, we aim to develop neuropsychological tests encompassing various cognitive domains to enable clinicians to differentiate between cortical and subcortical dementia even before conducting clinical examinations or investigations.", "doc_items_refs": ["#/texts/290", "#/texts/291", "#/texts/292", "#/texts/293", "#/texts/294", "#/texts/295", "#/texts/296", "#/texts/297", "#/texts/298", "#/texts/299"], "page_nos": [], "uuid": "7c45a325-b6ad-4ce4-9bbb-99142302e8b8"}
{"doc_id": "2025__Developing_an_explainable_machine_learning_and_fog_computing-based_visual_rating__W4412486382", "source_path": "<redacted:source_path>", "chunk_id": 25, "source_chunk_idxs": [32], "num_tokens": 236, "text": "Developing an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nProposed reliable context-aware health monitoring framework based on fog-computing\nDecision-making based on multilayer perceptron (DMMLP)\nThe DMMLP layer is the third stage of the fog-computing stages, which is responsible for making a real-time informatics decision of health state based on the different attributes of the individual. To this end, we propose an ensemble model based on hybridization between AdaBoost and Multilayer Perceptron (MLP) networks. This proposed model consists of several perceptrons, each a weak classifier with low performance. This results in a more accurate model that outperforms all weak learners. This improvement returns to a couple of reasons, including (i) combining several models results in a more flexible, robust, and precise model, (ii) integration contributes to developing a less biased and more precise model, and (iii) using random subspace and bagging contributes to preventing overfitting.\nIn DMMLP, the base layer deals with heterogeneous events and the selected proper attributes.", "doc_items_refs": ["#/texts/301", "#/texts/302"], "page_nos": [], "uuid": "60eae7e8-ca21-4267-b61f-274c17ec47d5"}
{"doc_id": "2025__Developing_an_explainable_machine_learning_and_fog_computing-based_visual_rating__W4412486382", "source_path": "<redacted:source_path>", "chunk_id": 26, "source_chunk_idxs": [33], "num_tokens": 512, "text": "Developing an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nProposed reliable context-aware health monitoring framework based on fog-computing\nDecision-making based on multilayer perceptron (DMMLP)\n1. 1. For each input, the feature vector is mathematically expressed as \\(X \\in {R}^{d}, {y}^{i} \\in \\{\\text{0,1},2\\}\\) , where denotes the vector dimension. {0,1,2} denotes different classes, where d denotes the vector dimension. The classes are denoted as {0, 1, 2}, with 0 representing the Alzheimer class, 1 representing the Parkinson class, and 2 representing the MCI class.\n2. 2. Initialize data subsets represented as \\({S}\\_{1 }\\left(i\\right)=for i=1,\\dots ,m\\) , where \\(m\\) is the number of iterations.\n3. 3. As shown in Fig.\n4\n, the predicted states are recognized as \\({h}\\_{t}=pool\\{{h}\\_{1},{h}\\_{2},{h}\\_{3},\\dots .,{h}\\_{ns}\\}\\) , where \\({h}\\_{t} \\in {R}^{q}\\) \\(q\\) denotes the vector's dimension. The pooling operation combines the outputs of multiple weak classifiers. \\({h}\\_{1},{h}\\_{2},{h}\\_{3},\\dots .,{h}\\_{ns}\\) into a single representation \\({h}\\_{t}\\) By applying a specific pooling method (average pooling)\n68\n,\n69\n,\n70\n.\n4. 4. The weak classifiers that have the lowest classification error are represented as: $$C\\_{{m = E\\_{{w\\_{m} }} \\left[ {1\\_{y \\ne f\\left( x \\right)} } \\right]}}$$ (2)\nFig. 4\nwhere \\(C= 1\\) denotes the weak Classifier, and it makes a set of operations as follows:", "doc_items_refs": ["#/texts/303", "#/texts/304", "#/texts/305", "#/texts/306", "#/texts/307", "#/texts/308"], "page_nos": [], "uuid": "17959fe1-0b47-46cd-b8db-4e83d2f252e7"}
{"doc_id": "2025__Developing_an_explainable_machine_learning_and_fog_computing-based_visual_rating__W4412486382", "source_path": "<redacted:source_path>", "chunk_id": 27, "source_chunk_idxs": [34], "num_tokens": 494, "text": "Developing an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nProposed reliable context-aware health monitoring framework based on fog-computing\nDecision-making based on multilayer perceptron (DMMLP)\n(1) Training the weak Classifier \\(C\\) on the distribution \\({S}\\_{i}\\)\n(2) Getting the results from the weak Classifier \\({h}\\_{t} :X\\to \\{\\text{0,1},2\\}\\)\n(3) choosing the \\({h}\\_{t}\\) that result in high performance and low error\n(4) \\({{\\varvec{\\varepsilon}}}\\_{{\\varvec{t}}}=prediction \\left({S}\\_{t}\\right)\\left[{h}\\_{t}\\left({x}\\_{i}\\right)\\ne {y}\\_{i}\\right]\\)\n(5) choosing \\(\\alpha\\_{t }\\)\n$$\\alpha\\_{t } = \\frac{1}{2}\\ln \\left( {\\frac{{1 - \\in\\_{m} }}{{\\epsilon\\_{m} }}} \\right)$$ (3)\n(6) The weight for all weak classifiers \\(\\theta\\_{m}\\) It is calculated as follows:\n$$\\theta\\_{m} = \\frac{1}{2}\\ln \\left( {\\frac{{1 - \\in\\_{m} }}{{\\epsilon\\_{m} }}} \\right)$$ (4)\nThe weight of any classifier with an accuracy of more than 50% is positive, and it becomes higher if the Classifier is more accurate. All classifiers contribute to the final decision. However, the final prediction will not include any classifier with precisely 50% classification accuracy. After each iteration, the misclassified samples are updated with higher weights, and the negatively classified samples behave similarly. All classifiers' performances are considered when calculating the final decision using the weighted sum process.", "doc_items_refs": ["#/texts/309", "#/texts/310", "#/texts/311", "#/texts/312", "#/texts/313", "#/texts/314", "#/texts/315", "#/texts/316", "#/texts/317"], "page_nos": [], "uuid": "e2cb6c37-fa77-4683-a7c4-4e6a667d9753"}
{"doc_id": "2025__Developing_an_explainable_machine_learning_and_fog_computing-based_visual_rating__W4412486382", "source_path": "<redacted:source_path>", "chunk_id": 28, "source_chunk_idxs": [35, 36, 37], "num_tokens": 500, "text": "Developing an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nProposed reliable context-aware health monitoring framework based on fog-computing\nEnd-to-end fog-making a decision (E2EFMD)\nE2EFMD is the final layer at the fog-computing stage; it acts as an IoT presentation layer for replying to individual requests and displaying timely prediction results on smartphones or web applications. This layer also comprises a mapping tool with a Geographical Information System (GIS) to help individuals find the nearest hospital for observation or treatment. Undoubtedly, the advantageous location of fog-computing, which is very close to end-users, reduces the decision delay time and enhances time responsibilities. Algorithm 1 represents the overall operations in the proposed framework.\nAlgorithm 1\n\nDeveloping an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nResults and discussion\nThis section is going to evaluate the proposed reliable context-aware health monitoring framework based on fog computing technology in two directions i) improving network performance in terms of network throughput and transmission reliability and ii) Developing a novel screening test using the MMSE and the MoCA for the early prediction of cortical and subcortical diseases in the patient brain (iii) building new ensemble model that could predict the early diagnosis of Parkinson and Alzheimer diseases based on proposed test results.\n\nDeveloping an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nResults and discussion\nExperiment 1st: comparing fog technology and cloud computing\nThis subsection contains the experimental results described in the excerpt, which aim to demonstrate the benefits of using fog technology to improve overall network performance. Standard metrics measure network throughput, bandwidth, latency, jitter, and packet loss. The size of the network is between 100 and 500 sensor nodes. The connection between these nodes was made using IEEE 802.11p/WAVE. The configuration of the IEEE 802.11 protocol is described in Table\n12\n, according to the Fog Hierarchical Deployment Model from OpenFog Reference Architecture\n65\n. The experiment was conducted on an Intel Core i7-1260P, 16 GB of DDR4 storage, 512 GB SSD, and Ubuntu operating system 22.04.1. NS2.35 was used to present and simulate the network model, and the network setting is demonstrated in Table\n11\n. The deployed sensors were reconfigured in a 1:5 ratio\n71\n.", "doc_items_refs": ["#/texts/319", "#/texts/320", "#/texts/322", "#/texts/324", "#/texts/325", "#/texts/326", "#/texts/327", "#/texts/328", "#/texts/329", "#/texts/330", "#/texts/331", "#/texts/332"], "page_nos": [], "uuid": "12684b43-978d-488c-bed5-8f19b0d4f41c"}
{"doc_id": "2025__Developing_an_explainable_machine_learning_and_fog_computing-based_visual_rating__W4412486382", "source_path": "<redacted:source_path>", "chunk_id": 29, "source_chunk_idxs": [38], "num_tokens": 508, "text": "Developing an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nResults and discussion\nExperiment 1st: comparing fog technology and cloud computing\nEvaluation metrics\n(1) Packet loss:\nThis metric refers to the number of dropped packets from the source to the destination during data transmission. The percentage of packet loss can be expressed as follows\n72\n:\n$$Packt \\,loss\\%= \\frac{transmitted\\, packets\\,-\\,recieved\\, packets}{transmitted\\, packets}$$\nA comparison of the proposed framework-based fog technology and the existing cloud system\n73\nwas conducted to test the performance of the proposed architecture in terms of packet loss reduction. As Fig.\n5\na shows, a significant difference between fog technology and cloud computing is diminishing the number of lost packets across the network. This effect emerged because fog technology's local data processing feature is crucial in decreasing the need to use network bandwidth continuously. Therefore, there is no network congestion, so the likelihood of losing data and the need to send it frequently is minimal. For more clarification, Fig.\n5\nb shows the difference between fog technology and the existing cloud system (Table\n12\n).\nFig. 5\n(2) Network throughput:\nThis metric indicates the quality of the network bandwidth or the link quality that is usually used to evaluate the amount of network connection and transmission reliability. The total network throughput refers to the average of successful packet delivery across network channels, and it can be measured as follows\n72\n:\n$$Total \\,throughput= \\frac{delivered\\, packets\\,*\\,size\\, of\\, packet}{simulation\\, time}$$\nFigure\n6\na shows that the proposed framework-based fog technology was compared with the existing cloud system\n73\nto measure its effectiveness in network throughput. The concept of throughput is usually related to both the link quality and the percentage of packet loss. This effect explains that packet loss directly reduces throughput, as some protocols used in the transport layer interpret loss as an indication of link congestion. Thus, their transmission rate must be adjusted to avert congestive network collapse. This describes the proposed framework's outperformance over the cloud system. The proposed framework maintains its performance by reducing bandwidth consumption due to its ability to deal with packet requests locally without uploading them to the cloud server. For more clarification, Fig.\n6\nb depicts the percentage difference between the two systems.\nFig. 6", "doc_items_refs": ["#/texts/334", "#/texts/335", "#/texts/336", "#/texts/337", "#/texts/338", "#/texts/339", "#/texts/340", "#/texts/341", "#/texts/342", "#/texts/343", "#/texts/344", "#/texts/345", "#/texts/346", "#/texts/347", "#/texts/348", "#/texts/349", "#/texts/350", "#/texts/351", "#/texts/352", "#/texts/353", "#/texts/354", "#/texts/355", "#/texts/356", "#/texts/357", "#/texts/358", "#/texts/359", "#/texts/360", "#/texts/361"], "page_nos": [], "uuid": "b47b07f8-0c9d-4d35-808e-fb6a41c55867"}
{"doc_id": "2025__Developing_an_explainable_machine_learning_and_fog_computing-based_visual_rating__W4412486382", "source_path": "<redacted:source_path>", "chunk_id": 30, "source_chunk_idxs": [39, 40], "num_tokens": 387, "text": "Developing an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nResults and discussion\nExperiment 2nd\nExperiment setup\nAll experiments in this study were implemented with an Intel Core i7 workstation with 32 GB RAM and a 2 TB hard disk. We used Python 3.8, which was distributed in Anaconda 3. All developed models were implemented using the Keras library developed on the TensorFlow backend. We used a grid search algorithm to tune all algorithms based on the validation dataset. The best model for each algorithm was chosen based on model performance on the validation data. The final result was calculated based on the test data, which was used sparingly to avoid test set leakage.\n\nDeveloping an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nResults and discussion\nExperiment 2nd\nEvaluation metrics\nThe effectiveness of the proposed intrusion detection method was assessed using a confusion matrix comprising True Positive (TP), True Negative (TN), False Positive (FP), and False Negative (FN) values.\n1. 1. True Positive (TP): Number of records correctly identified as an injection attack.\n2. 2. True Negative (TN): Number of records accurately classified as belonging to the regular class.\n3. 3. False Positive (FP): Number of records erroneously classified as an injection attack.\n4. 4. False Negative (FN): Number of injection attacks that went undetected by the intrusion detection system (IDS).\nTo evaluate the performance of our proposed model, we employed various metrics, including accuracy, precision, recall, F1 score, and area under the curve (AUC). Cross-validation (CV) results were computed using the training data, while the generalization performance was assessed using the testing data. Detailed information regarding the evaluation metrics used can be found in Table\n13\n.", "doc_items_refs": ["#/texts/364", "#/texts/366", "#/texts/367", "#/texts/368", "#/texts/369", "#/texts/370", "#/texts/371", "#/texts/372", "#/texts/373"], "page_nos": [], "uuid": "9d2d5396-b59b-4ec2-8a2e-099d8a6d8140"}
{"doc_id": "2025__Developing_an_explainable_machine_learning_and_fog_computing-based_visual_rating__W4412486382", "source_path": "<redacted:source_path>", "chunk_id": 31, "source_chunk_idxs": [41], "num_tokens": 347, "text": "Developing an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nResults and discussion\nExperiments using MMSE\nThis section evaluates five single classifiers and the proposed voting classifier. We carefully choose the algorithms that are commonly used on the medical side. As we can observe, DT gives a minor performance with ( ACC = 0.756%, AUC = 0.7571%), followed by KNN with (ACC = 0.822%, AUC = 0.8102%). Unless LR gives the best performance in terms of a training score of 0.8992%, it provides in terms of (ACC = 0.8266%, AUC = 0.8118%). The best performance of the traditional ML models is from MLP (ACC = 0.8531, AUC = 0.8325). Our proposed algorithm outperforms all other algorithms by about 5-7%. It gives the best performance of (ACC = 0.8662, AUC = 0.8425). Table\n13\ndetails the results of MMSE. Several figures have been utilized to visualize the proposed model's performance across the MMSE dataset, as shown in Fig.\n6\na,b,c,d. Figure\n7\nb shows the relationship between the training data and the cross-validation data as an estimator for the training dataset. The validation curve also helps to identify whether the model is sensitive to bias or variance. However, the learning curve is drawn with the mean score; cross-validation variability is depicted by the shaded areas, representing the standard deviation and mean.\nFig. 7", "doc_items_refs": ["#/texts/375", "#/texts/376", "#/texts/377", "#/texts/378", "#/texts/379", "#/texts/380", "#/texts/381", "#/texts/382"], "page_nos": [], "uuid": "cd5d9f8b-04c4-4fd9-8edd-2304c099027e"}
{"doc_id": "2025__Developing_an_explainable_machine_learning_and_fog_computing-based_visual_rating__W4412486382", "source_path": "<redacted:source_path>", "chunk_id": 32, "source_chunk_idxs": [42, 43], "num_tokens": 458, "text": "Developing an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nResults and discussion\nExperiments using MMSE\nFigure\n7\nb shows the precision-recall curve to evaluate the model's quality. It represents the tradeoff between the Classifier's precision (relevance) and recalls (completeness). In our classification task ( multiclass classification task), the curve was created in terms of OneVsRest to produce a binary comparison between classes. The possible instances are all instances related to the class, and the negative is any other instance. Then we used Micro-average to compute the precision-recall curve for all classes. Figure\n7\nD shows the receiver operating characteristic curve; it measures the Classifier's predictive quality in sensitivity and specificity. The ROC curve displays the TPR on the Y-axis and FPR on the X-axis, resulting in the area under the ROC curve (AUC). AUC is a measurement of the correlation between true and false favorable rates. Table\n14\nshows the details of the MMSE results.\n\nDeveloping an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nResults and discussion\nExperiments using MOCA\nThis section evaluates the models based on the MoCA dataset, as seen in Table\n14\n. Using the MoCa dataset increases the performance by about 2% to 8%. SVC gives a minor performance among all traditional classifiers ( ACC = 0.821, AUC = 0.846), followed by DT with the performance of (ACC = 0.832, AUC = 0.885). The best performance from traditional ML was obtained from MLP ( ACC = 0.863, AUC = 0.901) and LR (ACC = 0.8531, AUC = 0.992). The proposed method outperforms all traditional models with differences ranging from 2 to 7%. It achieved 0.901 and 0.915 in terms of ACC and AUC. The proposed method improved when using the MoCA dataset over the MMSE dataset by about 3%. Table\n15\nshows the results of the MoCA test (Fig.\n8\n).\nFig. 8", "doc_items_refs": ["#/texts/383", "#/texts/384", "#/texts/385", "#/texts/386", "#/texts/387", "#/texts/388", "#/texts/389", "#/texts/391", "#/texts/392", "#/texts/393", "#/texts/394", "#/texts/395", "#/texts/396", "#/texts/397", "#/texts/398"], "page_nos": [], "uuid": "1ca222b7-dba1-4d0e-ae21-a2664525b590"}
{"doc_id": "2025__Developing_an_explainable_machine_learning_and_fog_computing-based_visual_rating__W4412486382", "source_path": "<redacted:source_path>", "chunk_id": 33, "source_chunk_idxs": [44], "num_tokens": 265, "text": "Developing an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nResults and discussion\nExperiments proposed screening test\nThis section evaluates the models based on the proposed hybrid score in the aggregated dataset, as we observe in Table\n15\n. The performance increases by about (3% to 9%) over MMSE and (2% to 7%) over MoCA. The minor performance among all traditional classifiers is LR (ACC = 0.805, AUC = 0.852), followed by SVC with a performance of (ACC = 0.871, AUC = 0.906). The best performance from traditional ML was obtained from MLP (ACC = 0.926, AUC = 0.925) and LR (ACC = 0.8531, AUC = 0.992). The proposed method outperforms all traditional models with differences ranging from 4 to 11%. It achieved 0.962 and 0.971 in terms of ACC and AUC. The proposed method improved and outperformed the MoCA MMSE dataset with the same dataset. The performance of the proposed model has been shown in Fig.\n7\nA-D. Table\n16\nshows the results of the proposed test.", "doc_items_refs": ["#/texts/400", "#/texts/401", "#/texts/402", "#/texts/403", "#/texts/404", "#/texts/405", "#/texts/406"], "page_nos": [], "uuid": "579171f7-05d6-4fee-961e-72f5251c1532"}
{"doc_id": "2025__Developing_an_explainable_machine_learning_and_fog_computing-based_visual_rating__W4412486382", "source_path": "<redacted:source_path>", "chunk_id": 34, "source_chunk_idxs": [45], "num_tokens": 501, "text": "Developing an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nResults and discussion\nExperiments proposed screening test\nTo support a more straightforward interpretation and better comparison across all models, the classification report will describe the numerical results with a colored heatmap. As shown in Fig.\n9\n, all heatmaps ranged from (0.0 to 1.0). These metrics are defined as false negatives, true negatives, false positives, and true positives to show the main classification result per class. By contrast, the model accuracy can hide the functional deficiencies in one class of multiclass problems, and this report provides deeper insights into the model's behavior. From Fig.\n9\nA, we can observe the following with the classification report of MMSE. (1) class 0 provides precision = 0.821 and recall = 0.793, which indicates that the model of all instances that are classified as PD is correct, where not all PD instances are classified correctly, for class 1(AD class), both negative and positive instances are classified with close percentage (precision = 0.760), and (recall = 0.761), where MMSE is successful in MCI classification (Class 2) (precision = 0.900, recall = 0.931). Figure\n9\nB is the classification report per class for the MoCA dataset. We can observe that the MoCA is less sensitive in classifying PD and AD. MoCA achieved adequate performance in detecting PD (precision = 0.862, recall = 0.862) and AD (precision = 0.750, recall = 0.840). The proposed framework outperforms both MoCA and MMSE tests in all classes. It achieved precision = 0.957, recall = 0.759 in class 0, precision 0.828, and recall 0.960 in class 1. From these results, we can observe the following: (i) MMSE are not sufficient for predicting PD, (ii) MoCA outperforms MMSE in predicting both PD and AD, (iii) MMSE and MoCA are approximately the same in predicting MCI, and (iv) proposed test outperforms both MMSE and MoCA tests in classifying PD and AD. Figure\n10\ncompares the three cognitive tests regarding various evaluation metrics, including precision, recall, measure, etc..\nFig. 9\nFig. 10", "doc_items_refs": ["#/texts/407", "#/texts/408", "#/texts/409", "#/texts/410", "#/texts/411", "#/texts/412", "#/texts/413", "#/texts/414", "#/texts/415", "#/texts/416", "#/texts/417"], "page_nos": [], "uuid": "2bfe4dd9-be05-4cfa-b1a4-30a1d571c3d5"}
{"doc_id": "2025__Developing_an_explainable_machine_learning_and_fog_computing-based_visual_rating__W4412486382", "source_path": "<redacted:source_path>", "chunk_id": 35, "source_chunk_idxs": [46], "num_tokens": 241, "text": "Developing an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nResults and discussion\nStatistical significance test\nTo ensure the superiority of the proposed model, we decided to depend on both accurate results and statistical tests. First, we rely on the Wilcoxon signed-rank test\n74\n. It's a nonparametric test developed by Demsar to compare the performance of all algorithms. It counts the number of ties and wins obtained from the algorithm. The algorithm is considered better from a statistical point of view if the number of wins is greater than the number of ties. All algorithms are then compared according to the Friedman test\n75\n. The Friedman test is a nonparametric test that measures ANOVA. The Friedman test determined whether there was a significant difference between all utilized algorithms, but it didn't specify the best algorithms. To rank all utilized algorithms and choose the best one, we decided on the Nemenyi test\n76\nand calculated the average rank for each Classifier. When several models are compared against each other, the results could be plotted using a critical distance diagram. Figure\n10\nshows the essential distance of all classifiers according to the average rank of the Nemenyi test.", "doc_items_refs": ["#/texts/419", "#/texts/420", "#/texts/421", "#/texts/422", "#/texts/423", "#/texts/424", "#/texts/425", "#/texts/426", "#/texts/427"], "page_nos": [], "uuid": "ba6a7cc3-d67e-41a2-8f9f-129adf27a08a"}
{"doc_id": "2025__Developing_an_explainable_machine_learning_and_fog_computing-based_visual_rating__W4412486382", "source_path": "<redacted:source_path>", "chunk_id": 36, "source_chunk_idxs": [47], "num_tokens": 408, "text": "Developing an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nResults and discussion\nExplanation of the proposed hybrid test\nExplanatory tools are utilized to interpret any ML or DL model. It could be done based on two levels: global and local. The global explanation refers to how the full features affect the overall model. In contrast, the local explanation shows that the features with specific values in each instance affect the overall output. SHAP( Shapely Additive Explanations) is one of the valuable tools that could provide each feature's importance according to the SHAP score\n64\n. First, we generate a summary plot (Fig.\n11\na) that visualizes each feature's contribution to the model's overall decision. The plot displays a bar graph with the critical features on the x-axis and their corresponding feature importance on the y-axis. The length of each bar represents its importance. The blue indicates the model's contribution to moving the model toward a positive class, while the red indicates its contribution toward negative courses. Figure\n11\na shows that naming, registration, and visuospatial are the most impactful features. This plot helps identify the model's most critical features and how they contribute to the classification of the input data. These results are assured using Fig.\n11\nb. This figure shows how each model affected the class. On the x-axis of the plot, we have the names of the features, while the bars on the y-axis represent the importance of each feature. The color scheme uses blue, green, and purple to indicate the impact of the features on the PD, MCI, and AD classes, respectively. Figure\n12\na shows that Memory and registration significantly impact the prediction of the PD class but are less critical for the MCI and AD classes. On the other hand, abstraction and attention are highly impactful in predicting the MCI class but have less importance for the PD class and no impact on the AD class.\nFig. 11\nFig. 12", "doc_items_refs": ["#/texts/429", "#/texts/430", "#/texts/431", "#/texts/432", "#/texts/433", "#/texts/434", "#/texts/435", "#/texts/436", "#/texts/437", "#/texts/438", "#/texts/439", "#/texts/440", "#/texts/441"], "page_nos": [], "uuid": "04cfbea9-94e3-422b-96da-cb2bf8f68443"}
{"doc_id": "2025__Developing_an_explainable_machine_learning_and_fog_computing-based_visual_rating__W4412486382", "source_path": "<redacted:source_path>", "chunk_id": 37, "source_chunk_idxs": [48], "num_tokens": 257, "text": "Developing an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nResults and discussion\nExplanation of the proposed hybrid test\nTo examine the significance of each feature for individual instances, we used SHAP local explainers for local explanations[77]. Figure\n12\na shows that the base value was 1.026, and the predicted probability was 1. According to SHAP, Memory, registration, and writing were the most significant features, consistent with the global explainer in Fig.\n12\n. For Fig.\n13\na-c, the base value was 1.026, and the predicted probability was 1.54. The base value shows the probability that it will go out if this instance has no specific value. Red and blue features show which features contribute to the model in the lower and higher directions.\nFig. 13\nBy combining global and local explanations, we gain a comprehensive understanding of model behavior. Globally, we identify which features are most influential across all predictions. Locally, we dissect individual cases to see how specific feature values alter outcomes. his dual approach ensures model transparency, helps in feature selection, and builds trust in AI-driven decisions, particularly in critical domains like healthcare (e.g., predicting neurodegenerative diseases).", "doc_items_refs": ["#/texts/442", "#/texts/443", "#/texts/444", "#/texts/445", "#/texts/446", "#/texts/447", "#/texts/448", "#/texts/449", "#/texts/450"], "page_nos": [], "uuid": "7832810e-307a-4af1-a906-f9a1eae89e79"}
{"doc_id": "2025__Developing_an_explainable_machine_learning_and_fog_computing-based_visual_rating__W4412486382", "source_path": "<redacted:source_path>", "chunk_id": 38, "source_chunk_idxs": [49, 50], "num_tokens": 367, "text": "Developing an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nResults and discussion\nCase study\nIn this section, the experiment was conducted on 30 patients at Kafrelsheikh Hospital University to evaluate the performance of the proposed screening test. The steps for assessing the proposed screening test can be summarized as follows: (i) all patients were examined generally to follow up on their cognitive abilities, (ii) patients underwent routine lab and conventional MRI to exclude any other cause of dementia other than Alzheimer's or Parkinson's diseases, and (iii)to compare the performance of the proposed screening test with the MoCA and MMSE examination test, all patients were examined with MMNE, MOCA Arabic version, in addition to our proposed test. Results of all examination tests were recorded to provide a fair comparison according to the Patient's score. Table\n17\nshows the patient distribution according to their scores in each examination test. Tables\n18\nand\n19\ncompare the proposed test, MMSE, and MoCA regarding corrected and uncorrected classified samples.\nThe results demonstrate the proposed hybrid's ability to provide high accuracy of diagnosis and early diagnosis of MCI to manage the case as early as possible and delay dementia whenever possible.\n\nDeveloping an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nDiscussion\nThe correct proposed test provides higher accuracy in detecting MCI than the correct MMSE or MOCA. As the proposed test includes more objective domains than the other two tests, it can measure cortical areas' domains, e.g., speech, apraxia, abstraction, and delayed memory testing, which also detect subcortical domains like visuospatial and executive function. Moreover, the examiner can intentionally detect the affected brain area once the patient is tested.", "doc_items_refs": ["#/texts/452", "#/texts/453", "#/texts/454", "#/texts/455", "#/texts/456", "#/texts/457", "#/texts/458", "#/texts/459", "#/texts/461"], "page_nos": [], "uuid": "3a6cec6a-98e3-40e6-9bfa-e48b72b0fb69"}
{"doc_id": "2025__Developing_an_explainable_machine_learning_and_fog_computing-based_visual_rating__W4412486382", "source_path": "<redacted:source_path>", "chunk_id": 39, "source_chunk_idxs": [51, 52], "num_tokens": 427, "text": "Developing an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nConclusion\nEarly diagnosis of such mental progression is essential. Several mental cognitive tests are used to check the progression of a patient's cognitive functioning. The MoCA test checks language, visual, spatial thinking, orientation, reasoning, and Memory. Such a scoring system could quickly help determine when someone is at risk of developing Parkinson's and Alzheimer's. In this study, a reliable context-aware health monitoring framework based on fog computing to assess mental impairment in the elderly is introduced. This proposed framework provided a remote diagnosis of dementia diseases using fog computing technology and IoT devices. Fog computing receives sensing data from mobile applications or websites, generating real-time warning alerts based on practical data analysis.\nIn the proposed framework, the data were aggregated from 450 patients, 150 patients already clinically diagnosed with Alzheimer's, 150 patients diagnosed with PD dementia, and another 150 patients with MCI (neither demented nor normal). All patients were examined cognitively by both MMSE and MOCA in the Arabic version. The aggregated dataset was utilized to make the following: (i) test the efficiency of both MMSE and MOCA scores, (ii) determine the main domains of cognition that are affected in each group, (iii) use ML for building model that could make an early diagnosis of PK and Alzheimer among MCI patients to manage the case as early as possible and prevent dementia, and (iv) providing a novel cognitive test that could quickly and accurately predict cortical and subcortical diseases. Results demonstrate the superiority of our proposed test over other tests like MoCA and MMSE. Such applications assist clinicians in providing accurate prognoses and personalized treatment, in addition to increasing patients' quality of life.\n\nDeveloping an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nData availability\nRaw data for dataset D1 are not publicly available to preserve individuals' privacy and coud be accessed upon formal request . The first author could be contacted for formal request.", "doc_items_refs": ["#/texts/463", "#/texts/464", "#/texts/466"], "page_nos": [], "uuid": "4b8be18a-ef58-4000-9b3d-47cadb4202fc"}
{"doc_id": "2025__Developing_an_explainable_machine_learning_and_fog_computing-based_visual_rating__W4412486382", "source_path": "<redacted:source_path>", "chunk_id": 40, "source_chunk_idxs": [53], "num_tokens": 498, "text": "Developing an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nReferences\n1. Nguyen Gia, T., et al. Low-cost fog-assisted healthcare IoT system with energy-efficient sensor nodes.\n2017 13th International Wireless Communications on Mobile Computing Conference IWCMC 2017\n, pp. 1765-1770, 2017.\nhttps://doi.org/10.1109/IWCMC.2017.7986551\n.\n2. Costa, B. G. S., Bachiega, J., de Carvalho, L. R. &amp; Araújo, A. P. F. Orchestration in fog computing: A comprehensive survey.\nACM Comput. Surv.\n55\n, 1-34 (2022).\nArticle\nGoogle Scholar\n3. Stojmenovic, I. Fog computing: A cloud to the ground support for smart things and machine-to-machine networks, in\n2014 Australasian Telecommunication Networks and Applications Conference (ATNAC)\n, Nov. 2014, pp. 117-122.\nhttps://doi.org/10.1109/ATNAC.2014.7020884\n.\n4. Yi, S., Li, C &amp; Li, Q. A. A survey of fog computing: concepts, applications and issues,\"\nProc. 2015 Work. Mob. Big Data\n, 2015.\n5. Hu, P., Dhelim, S., Ning, H. &amp; Qiu, T. Survey on fog computing: architecture, key technologies, applications and open issues.\nJ. Netw. Comput. Appl.\n98\n, 27-42.\nhttps://doi.org/10.1016/j.jnca.2017.09.002\n(2017).\nArticle\nGoogle Scholar\n6. Shaukat, U., Ahmed, E., Anwar, Z. &amp; Xia, F. Cloudlet deployment in local wireless networks: Motivation, architectures, applications, and open challenges.\nJ. Netw. Comput. Appl.\n62\n, 18-40 (2016).\nArticle\nGoogle Scholar\n7. Hou, X. et al. Vehicular fog computing: A viewpoint of vehicles as the infrastructures.\nIEEE Trans. Veh. Technol.\n65\n(6), 3860-3873 (2016).\nArticle\nGoogle Scholar", "doc_items_refs": ["#/texts/468", "#/texts/469", "#/texts/470", "#/texts/471", "#/texts/472", "#/texts/473", "#/texts/474"], "page_nos": [], "uuid": "9ed09ffb-8347-4595-92b3-a09b01f0c89d"}
{"doc_id": "2025__Developing_an_explainable_machine_learning_and_fog_computing-based_visual_rating__W4412486382", "source_path": "<redacted:source_path>", "chunk_id": 41, "source_chunk_idxs": [54], "num_tokens": 439, "text": "Developing an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nReferences\n8. Tolosa, E., Garrido, A., Scholz, S. W. &amp; Poewe, W. Challenges in the diagnosis of Parkinson's disease.\nLancet. Neurol.\n20\n(5), 385-397.\nhttps://doi.org/10.1016/S1474-4422(21)00030-2\n(2021).\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n9. Emamzadeh, F. N. &amp; Surguchov, A. Parkinson's disease: Biomarkers, treatment, and risk factors.\nFront. Neurosci.\n12\n, 612.\nhttps://doi.org/10.3389/fnins.2018.00612\n(2018).\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n10. Gordon, C. &amp; Martin, D. J. Mild cognitive impairment.\nExpert Rev. Neurother.\n13\n(11), 1247-1261.\nhttps://doi.org/10.1586/14737175.2013.856265\n(2013).\nArticle\nCAS\nPubMed\nGoogle Scholar\n11. Munteanu, C. R. et al. Classification of mild cognitive impairment and Alzheimer's Disease with machine-learning techniques using 1H magnetic resonance spectroscopy data.\nExpert Syst. Appl.\n42\n(15-16), 6205-6214.\nhttps://doi.org/10.1016/j.eswa.2015.03.011\n(2015).\nArticle\nGoogle Scholar\n12. Joseph-Mathurin, N. et al. Longitudinal accumulation of cerebral microhemorrhages in dominantly inherited Alzheimer disease.\nNeurology\n96\n(12), e1632-e1645.\nhttps://doi.org/10.1212/WNL.0000000000011542\n(2021).\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/475", "#/texts/476", "#/texts/477", "#/texts/478", "#/texts/479"], "page_nos": [], "uuid": "1a59c11f-4140-4f54-8392-0c9affd6bb51"}
{"doc_id": "2025__Developing_an_explainable_machine_learning_and_fog_computing-based_visual_rating__W4412486382", "source_path": "<redacted:source_path>", "chunk_id": 42, "source_chunk_idxs": [55], "num_tokens": 459, "text": "Developing an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nReferences\n13. Slot, R. E. R. et al. Subjective cognitive decline and rates of incident Alzheimer's disease and non-Alzheimer's disease dementia.\nAlzheimers. Dement.\n15\n(3), 465-476.\nhttps://doi.org/10.1016/j.jalz.2018.10.003\n(2019).\nArticle\nPubMed\nGoogle Scholar\n14. El-Rashidy, N., ElSayed, N. E., El-Ghamry, A. &amp; Talaat, F. M. Prediction of gestational diabetes based on explainable deep learning and fog computing.\nSoft Comput.\nhttps://doi.org/10.1007/s00500-022-07420-1\n(2022).\nArticle\nGoogle Scholar\n15. El-Rashidy, N., El-Sappagh, S., Islam, S. M. R., El-Bakry, H. M. &amp; Abdelrazek, S. End-to-end deep learning framework for coronavirus (COVID-19) detection and monitoring.\nElectron.\n9\n(9), 1-25.\nhttps://doi.org/10.3390/electronics9091439\n(2020).\nArticle\nCAS\nGoogle Scholar\n16. Chawan, P. M. &amp; Zaveri, R. R. Prediction of Parkinson's disease using data mining: A survey.\nInt. Res. J. Eng. Technol.\n773-777 (2020).\n17. Prange, S., Klinger, H., Laurencin, C., Danaila, T. &amp; Thobois, S. Depression in patients with Parkinson's disease: Current understanding of its neurobiology and implications for treatment.\nDrugs Aging\n39\n(6), 417-439.\nhttps://doi.org/10.1007/s40266-022-00942-1\n(2022).\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/480", "#/texts/481", "#/texts/482", "#/texts/483", "#/texts/484"], "page_nos": [], "uuid": "fb384de7-2f02-4906-bea3-456d668442d6"}
{"doc_id": "2025__Developing_an_explainable_machine_learning_and_fog_computing-based_visual_rating__W4412486382", "source_path": "<redacted:source_path>", "chunk_id": 43, "source_chunk_idxs": [56], "num_tokens": 451, "text": "Developing an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nReferences\n18. Weintraub, D. et al. The neuropsychiatry of Parkinson's disease: advances and challenges.\nLancet. Neurol.\n21\n(1), 89-102.\nhttps://doi.org/10.1016/S1474-4422(21)00330-6\n(2022).\nArticle\nMathSciNet\nPubMed\nPubMed Central\nGoogle Scholar\n19. Wang, Y. Contra-directional expression of serum homocysteine and uric acid as important biomarkers of multiple system atrophy severity : a cross-sectional study.\nFront. Cell Neurosci.\n9\n, 1-12.\nhttps://doi.org/10.3389/fncel.2015.00247\n(2015).\nArticle\nCAS\nGoogle Scholar\n20. Cheung, C. Y. et al. A deep learning model for detection of Alzheimer's disease based on retinal photographs: A retrospective, multicentre case-control study.\nLancet Digit. Health\n4\n(11), e806-e815.\nhttps://doi.org/10.1016/S2589-7500(22)00169-8\n(2022).\nArticle\nCAS\nPubMed\nGoogle Scholar\n21. Liu, S. et al. Generalizable deep learning model for early Alzheimer's disease detection from structural MRIs.\nSci. Rep.\n12\n(1), 1-12.\nhttps://doi.org/10.1038/s41598-022-20674-x\n(2022).\nArticle\nCAS\nGoogle Scholar\n22. Nasreddine, Z. S. et al. The montreal cognitive assessment, MoCA: A brief screening tool for mild cognitive impairment.\nJ. Am. Geriatr. Soc.\n53\n(4), 695-699.\nhttps://doi.org/10.1111/j.1532-5415.2005.53221.x\n(2005).\nArticle\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/485", "#/texts/486", "#/texts/487", "#/texts/488", "#/texts/489"], "page_nos": [], "uuid": "85e5f3cb-66e2-4120-b8dd-fef7186de776"}
{"doc_id": "2025__Developing_an_explainable_machine_learning_and_fog_computing-based_visual_rating__W4412486382", "source_path": "<redacted:source_path>", "chunk_id": 44, "source_chunk_idxs": [57], "num_tokens": 462, "text": "Developing an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nReferences\n23. Lawton, M. et al. Validation of conversion between mini-mental state examination and montreal cognitive assessment.\nMov. Disord.\n31\n(4), 593-596.\nhttps://doi.org/10.1002/mds.26498\n(2016).\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n24. Chen, X. et al. Reliability and validity of the beijing version of the montreal cognitive assessment in the evaluation of cognitive function of adult patients with OSAHS.\nPLoS ONE\nhttps://doi.org/10.1371/journal.pone.0132361\n(2015).\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n25. Chaudhari, M. &amp; Patil, R. Classification and prediction of heart disease: A machine learning approach.\nNew Front. Commun. Intell. Syst.\nhttps://doi.org/10.52458/978-81-95502-00-4-18\n(2021).\nArticle\nGoogle Scholar\n26. Meyer, J. C., Harirari, P. &amp; Schellack, N. Overview of Alzheimer's disease and its management.\nSA Pharm. J.\n83\n(9), 48-56 (2016).\nGoogle Scholar\n27. Farnikova, K., Krobot, A. &amp; Kanovsky, P. Musculoskeletal problems as an initial manifestation of Parkinson's disease: A retrospective study.\nJ. Neurol. Sci.\n319\n(1-2), 102-104.\nhttps://doi.org/10.1016/j.jns.2012.05.002\n(2012).\nArticle\nPubMed\nGoogle Scholar\n28. Abdelnour, C. et al. Perspectives and challenges in patient stratification in Alzheimer's disease.\nAlzheimers. Res. Ther.\nhttps://doi.org/10.1186/s13195-022-01055-y\n(2022).\nArticle\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/490", "#/texts/491", "#/texts/492", "#/texts/493", "#/texts/494", "#/texts/495"], "page_nos": [], "uuid": "7e6d7bd0-37ea-40f0-a1e3-4e6d37057dab"}
{"doc_id": "2025__Developing_an_explainable_machine_learning_and_fog_computing-based_visual_rating__W4412486382", "source_path": "<redacted:source_path>", "chunk_id": 45, "source_chunk_idxs": [58], "num_tokens": 451, "text": "Developing an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nReferences\n29. Perovnik, M. et al. Identification and validation of Alzheimer's disease-related metabolic brain pattern in biomarker confirmed Alzheimer's dementia patients.\nSci. Rep.\n12\n(1), 11752.\nhttps://doi.org/10.1038/s41598-022-15667-9\n(2022).\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n30. Cafasso, J. Is It Mild Cognitive Impairment or Something Else?\nHealthline\n, no. Mci, pp. 1-11, 2020, [Online]. Available:\nhttps://www.healthline.com/health/is-it-mild-cognitive-impairment-or-something-else#MCI-vs.-dementia-vs.-healthy-aging\n31. Martinez-Murcia, F. J., Ortiz, A., Gorriz, J.-M., Ramirez, J. &amp; Castillo-Barnes, D. Studying the manifold structure of Alzheimer's disease: A deep learning approach using convolutional autoencoders.\nIEEE J. Biomed. Heal. informatics\n24\n(1), 17-26.\nhttps://doi.org/10.1109/JBHI.2019.2914970\n(2020).\nArticle\nGoogle Scholar\n32. Spasov, S., Passamonti, L., Duggento, A., Liò, P. &amp; Toschi, N. A parameter-efficient deep learning approach to predict conversion from mild cognitive impairment to Alzheimer's disease.\nNeuroimage\n189\n, 276-287.\nhttps://doi.org/10.1016/j.neuroimage.2019.01.031\n(2019).\nArticle\nPubMed\nGoogle Scholar\n33. Williams, J. &amp; Weakley, A. Machine learning techniques for diagnostic differentiation of mild cogni- tive impairment and dementia.\nAssoc. Adv. Artif. Intell.\n(2012).", "doc_items_refs": ["#/texts/496", "#/texts/497", "#/texts/498", "#/texts/499", "#/texts/500"], "page_nos": [], "uuid": "29ba2af2-94a5-4957-9773-ae53dc35d134"}
{"doc_id": "2025__Developing_an_explainable_machine_learning_and_fog_computing-based_visual_rating__W4412486382", "source_path": "<redacted:source_path>", "chunk_id": 46, "source_chunk_idxs": [59], "num_tokens": 503, "text": "Developing an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nReferences\n34. Prajapati, R., Khatri, U. &amp; Kwon, G. R. An efficient deep neural network binary classifier for Alzheimer's disease classification. In\n2021 International Conference on Artificial Intelligence in Information and Communication (ICAIIC)\n, Apr. 2021, pp. 231-234.\nhttps://doi.org/10.1109/ICAIIC51459.2021.9415212\n.\n35. Karlekar, S., Niu, T. &amp; Bansal, M. Detecting linguistic characteristics of Alzheimer's dementia by interpreting neural models.\nNAACL HLT 2018-2018 Conf. North Am. Chapter Assoc. Comput. Linguist. Hum. Lang. Technol.- Proc. Conf.\n, vol. 2, pp. 701-707, 2018.\nhttps://doi.org/10.18653/v1/n18-2110\n.\n36. Diogo, V. S., Ferreira, H. A., Prata, D. &amp; Neuroimaging, D. Early diagnosis of Alzheimer ' s disease using machine learning: A multi - diagnostic, generalizable approach.\nAlzheimers. Res. Ther.\nhttps://doi.org/10.1186/s13195-022-01047-y\n(2022).\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n37. Iqbal Qureshi, M. N., Ryu, S., Song, J., Ho Lee, K. &amp; Lee, B. Evaluation of functional decline in Alzheimer's dementia using 3D deep learning and group ICA for RS-fMRI measurements.\nFront. Aging Neurosci.\n10\n, 1-9.\nhttps://doi.org/10.3389/fnagi.2019.00008\n(2019).\nArticle\nGoogle Scholar\n38. Ding, Y. et al. A deep learning model to predict a diagnosis of Alzheimer disease by using (18)F-FDG PET of the brain.\nRadiology\n290\n(2), 456-464.\nhttps://doi.org/10.1148/radiol.2018180958\n(2019).\nArticle\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/501", "#/texts/502", "#/texts/503", "#/texts/504", "#/texts/505"], "page_nos": [], "uuid": "ee6c6f31-0f09-44ce-8289-03a1b42829bc"}
{"doc_id": "2025__Developing_an_explainable_machine_learning_and_fog_computing-based_visual_rating__W4412486382", "source_path": "<redacted:source_path>", "chunk_id": 47, "source_chunk_idxs": [60], "num_tokens": 458, "text": "Developing an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nReferences\n39. Park, C., Ha, J. &amp; Park, S. Prediction of Alzheimer's disease based on deep neural network by integrating gene expression and DNA methylation dataset.\nExpert Syst. Appl.\n140\n, 112873.\nhttps://doi.org/10.1016/j.eswa.2019.112873\n(2020).\nArticle\nGoogle Scholar\n40. Gupta, I., Sharma, V., Kaur, S. &amp; Singh, A. K. PCA-RF: An efficient Parkinson's disease prediction model based on random forest classification (2022).\nhttp://arxiv.org/abs/2203.11287\n41. Khan, P. et al. Machine learning and deep learning approaches for brain disease diagnosis: principles and recent advances.\nIEEE Access\n9\n(March), 37622-37655.\nhttps://doi.org/10.1109/ACCESS.2021.3062484\n(2021).\nArticle\nGoogle Scholar\n42. Saratxaga, C. L. et al. Mri deep learning-based solution for Alzheimer's disease prediction.\nJ. Pers. Med.\nhttps://doi.org/10.3390/jpm11090902\n(2021).\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n43. Basheer, S., Bhatia, S. &amp; Sakri, S. B. Computational modeling of dementia prediction using deep neural network: Analysis on OASIS dataset.\nIEEE Access\n9\n, 42449-42462.\nhttps://doi.org/10.1109/ACCESS.2021.3066213\n(2021).\nArticle\nGoogle Scholar\n44. Sudharsan, M. &amp; Thailambal, G. Alzheimer's disease prediction using machine learning techniques and principal component analysis (PCA).\nMater. Today Proc.\nhttps://doi.org/10.1016/j.matpr.2021.03.061\n(2021).\nArticle\nGoogle Scholar", "doc_items_refs": ["#/texts/506", "#/texts/507", "#/texts/508", "#/texts/509", "#/texts/510", "#/texts/511"], "page_nos": [], "uuid": "bccc1468-d695-49f1-b7c8-fef10fba5610"}
{"doc_id": "2025__Developing_an_explainable_machine_learning_and_fog_computing-based_visual_rating__W4412486382", "source_path": "<redacted:source_path>", "chunk_id": 48, "source_chunk_idxs": [61], "num_tokens": 490, "text": "Developing an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nReferences\n45. Gubbi, J., Buyya, R., Marusic, S. &amp; Palaniswami, M. Internet of Things (IoT): A vision, architectural elements, and future directions.\nFutur. Gener. Comput. Syst.\n29\n(7), 1645-1660.\nhttps://doi.org/10.1016/j.future.2013.01.010\n(2013).\nArticle\nGoogle Scholar\n46. Asghari, A. &amp; Sohrabi, M. K. Server placement in mobile cloud computing: A comprehensive survey for edge computing, fog computing and cloudlet.\nComput. Sci. Rev.\n51\n, 100616.\nhttps://doi.org/10.1016/j.cosrev.2023.100616\n(2024).\nArticle\nMathSciNet\nGoogle Scholar\n47. Cassel, G. A., da Rosa Righi, R., da Costa, C. A., Bez, M. R. &amp; Pasin, M. Towards providing a priority-based vital sign offloading in healthcare with serverless computing and a fog-cloud architecture.\nFutur. Gener. Comput. Syst.\n157\n, 51-66.\nhttps://doi.org/10.1016/j.future.2024.03.032\n(2024).\nArticle\nGoogle Scholar\n48. Dogani, J., Namvar, R. &amp; Khunjush, F. Auto-scaling techniques in container-based cloud and edge/fog computing: Taxonomy and survey.\nComput. Commun.\n209\n, 120-150.\nhttps://doi.org/10.1016/j.comcom.2023.06.010\n(2023).\nArticle\nGoogle Scholar\n49. Tuli, S. et al. HealthFog: An ensemble deep learning based smart healthcare system for automatic diagnosis of heart diseases in integrated iot and fog computing environments.\nFutur. Gener. Comput. Syst.\n104\n, 187-200.\nhttps://doi.org/10.1016/j.future.2019.10.043\n(2020).\nArticle\nGoogle Scholar", "doc_items_refs": ["#/texts/512", "#/texts/513", "#/texts/514", "#/texts/515", "#/texts/516"], "page_nos": [], "uuid": "099d11c7-6c2f-4151-9a24-22d7b7983acb"}
{"doc_id": "2025__Developing_an_explainable_machine_learning_and_fog_computing-based_visual_rating__W4412486382", "source_path": "<redacted:source_path>", "chunk_id": 49, "source_chunk_idxs": [62], "num_tokens": 431, "text": "Developing an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nReferences\n50. Das, R. &amp; Inuwa, M. M. A review on fog computing: Issues, characteristics, challenges, and potential applications.\nTelemat. Inf. Rep.\n10\n, 100049.\nhttps://doi.org/10.1016/j.teler.2023.100049\n(2023).\nArticle\nGoogle Scholar\n51. Ahmad, S., Shakeel, I., Mehfuz, S. &amp; Ahmad, J. Deep learning models for cloud, edge, fog, and IoT computing paradigms: Survey, recent advances, and future directions.\nComput. Sci. Rev.\n49\n, 100568.\nhttps://doi.org/10.1016/j.cosrev.2023.100568\n(2023).\nArticle\nMathSciNet\nGoogle Scholar\n52. Kumar, R. &amp; Agrawal, N. Analysis of multi-dimensional Industrial IoT (IIoT) data in Edge-Fog-Cloud based architectural frameworks: A survey on current state and research challenges.\nJ. Ind. Inf. Integr.\n35\n, 100504.\nhttps://doi.org/10.1016/j.jii.2023.100504\n(2023).\nArticle\nGoogle Scholar\n53. Ahmed, A. et al. Targeting morbidity in unreached communities using portable health clinic system.\nIEICE Trans. Commun.\nhttps://doi.org/10.1587/transcom.E97.B.540\n(2014).\nArticle\nGoogle Scholar\n54. Hossain, M. S. et al. Audio-visual emotion-aware cloud gaming framework.\nIEEE Trans. Circuits Syst. Video Technol.\n25\n(12), 2105-2118.\nhttps://doi.org/10.1109/TCSVT.2015.2444731\n(2015).\nArticle\nGoogle Scholar", "doc_items_refs": ["#/texts/517", "#/texts/518", "#/texts/519", "#/texts/520", "#/texts/521"], "page_nos": [], "uuid": "11a4cf95-1976-48df-bf25-4a494849308c"}
{"doc_id": "2025__Developing_an_explainable_machine_learning_and_fog_computing-based_visual_rating__W4412486382", "source_path": "<redacted:source_path>", "chunk_id": 50, "source_chunk_idxs": [63], "num_tokens": 459, "text": "Developing an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nReferences\n55. Al-Shareeda, M. A., Alsadhan, A. A., Qasim, H. H. &amp; Manickam, S. Software defined networking for internet of things: Review, techniques, challenges, and future directions.\nBull. Electr. Eng. Inf.\n13\n(1), 638-647.\nhttps://doi.org/10.11591/eei.v13i1.6386\n(2024).\nArticle\nGoogle Scholar\n56. Yadav, K. Automatic detection of vocal cord disorders using machine learning method for healthcare system.\nInt. J. Syst. Assur. Eng. Manag.\n15\n(1), 429-438.\nhttps://doi.org/10.1007/s13198-022-01761-8\n(2024).\nArticle\nMathSciNet\nGoogle Scholar\n57. Wadhwa, H., et al. The fusion of fog computing and intelligent technologies for parkinson's disease care in intelligent technologies and parkinson's disease: Prediction and diagnosis. edited by Abhishek Kumar, et al., 52-69.\nIGI Glob.\n2024.\nhttps://doi.org/10.4018/979-8-3693-1115-8.ch003\n.\n58. Zhang, Z. Multiple imputation with multivariate imputation by chained equation (MICE) package.\nAnn. Transl. Med.\n4\n, 30.\nhttps://doi.org/10.3978/j.issn.2305-5839.2015.12.63\n(2016).\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n59. Buuren, S. &amp; Groothuis-Oudshoorn, C. MICE: Multivariate imputation by chained equations in R.\nJ. Stat. Softw.\nhttps://doi.org/10.18637/jss.v045.i03\n(2011).\nArticle\nGoogle Scholar", "doc_items_refs": ["#/texts/522", "#/texts/523", "#/texts/524", "#/texts/525", "#/texts/526"], "page_nos": [], "uuid": "bff6de76-339b-4128-87c7-fca0e25206e7"}
{"doc_id": "2025__Developing_an_explainable_machine_learning_and_fog_computing-based_visual_rating__W4412486382", "source_path": "<redacted:source_path>", "chunk_id": 51, "source_chunk_idxs": [64], "num_tokens": 411, "text": "Developing an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nReferences\n60. Sharma, V. A study on data scaling methods for machine learning.\nInt. J. Glob. Acad. Sci. Res\nhttps://doi.org/10.55938/ijgasr.v1i1.4\n(2022).\nArticle\nGoogle Scholar\n61. Rajput, D. R. Accuracy of clinical diagnosis of idiopathic Parkinson's disease.\nJ. Neurol. Neurosurg. Psychiatry\n56\n(8), 938-939.\nhttps://doi.org/10.1136/jnnp.56.8.938\n(1993).\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n62. Mega, M. S. &amp; Cummings, J. L. Frontal-subcortical circuits and neuropsychiatric disorders.\nJ. Neuropsychiatry Clin. Neurosci.\n6\n(4), 358-370.\nhttps://doi.org/10.1176/jnp.6.4.358\n(1994).\nArticle\nCAS\nPubMed\nGoogle Scholar\n63. Leyton, C. E. et al. Subtypes of progressive aphasia: application of the International Consensus Criteria and validation using β-amyloid imaging.\nBrain\n134\n(Pt 10), 3030-3043.\nhttps://doi.org/10.1093/brain/awr216\n(2011).\nArticle\nPubMed\nGoogle Scholar\n64. Crews, L. &amp; Masliah, E. Molecular mechanisms of neurodegeneration in Alzheimer's disease.\nHum. Mol. Genet.\n19\n(R1), R12-20.\nhttps://doi.org/10.1093/hmg/ddq160\n(2010).\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/527", "#/texts/528", "#/texts/529", "#/texts/530", "#/texts/531"], "page_nos": [], "uuid": "2b7d9511-9548-467c-b136-6ea5b5b64f0f"}
{"doc_id": "2025__Developing_an_explainable_machine_learning_and_fog_computing-based_visual_rating__W4412486382", "source_path": "<redacted:source_path>", "chunk_id": 52, "source_chunk_idxs": [65], "num_tokens": 465, "text": "Developing an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nReferences\n65. Jayanthi, P. 7-Machine learning and deep learning algorithms in disease prediction: Future trends for the healthcare system, in\nDeep Learning for Medical Applications with Unique Data\n, D. Gupta, U. Kose, A. Khanna, and V. E. Balas, Eds. Academic Press, 2022, pp. 123-152.\nhttps://doi.org/10.1016/B978-0-12-824145-5.00009-5\n.\n66. To, K. K. W. et al. Temporal profiles of viral load in posterior oropharyngeal saliva samples and serum antibody responses during infection by SARS-CoV-2: An observational cohort study.\nLancet Infect. Dis.\n20\n(5), 565-574.\nhttps://doi.org/10.1016/S1473-3099(20)30196-1\n(2020).\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n67. Grespan, L. &amp; Fiorini, P. Patient safety in robotic surgery BT-The route to patient safety in robotic surgery. In: Grespan, L., Fiorini, P., &amp; Colucci, G. Eds. Cham: Springer International Publishing, pp. 7-23 (2019).\nhttps://doi.org/10.1007/978-3-030-03020-9\\_2\n.\n68. Bashivan, P., Ibrahim, A., Dehghani, A. &amp; Ren, Y. Learning robust kernel ensembles with kernel average pooling\n2014\n, 1-20 (2022).\n69. Salman, R., Alzaatreh, A. &amp; Sulieman, H. The stability of different aggregation techniques in ensemble feature selection.\nJ. Big Data\n9\n(1), 51.\nhttps://doi.org/10.1186/s40537-022-00607-1\n(2022).\nArticle\nGoogle Scholar", "doc_items_refs": ["#/texts/532", "#/texts/533", "#/texts/534", "#/texts/535", "#/texts/536"], "page_nos": [], "uuid": "1a1efd1d-06b9-463b-a6bb-cb3c55e1cb28"}
{"doc_id": "2025__Developing_an_explainable_machine_learning_and_fog_computing-based_visual_rating__W4412486382", "source_path": "<redacted:source_path>", "chunk_id": 53, "source_chunk_idxs": [66], "num_tokens": 512, "text": "Developing an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nReferences\n70. Campagner, A., Ciucci, D. &amp; Cabitza, F. Aggregation models in ensemble learning: A large-scale comparison.\nInf. Fusion\n90\n, 241-252.\nhttps://doi.org/10.1016/j.inffus.2022.09.015\n(2023).\nArticle\nGoogle Scholar\n71. Ameixieira, C. et al. Harbornet: A real-world testbed for vehicular networks.\nIEEE Commun. Mag.\n52\n, 108-114 (2014).\nArticle\nGoogle Scholar\n72. Ali, Z. H. &amp; Ali, H. A. EEOMA: End-to-end oriented management architecture for 6G-enabled drone communications.\nPeer-to-Peer Netw. Appl.\n15\n(2), 1232-1254.\nhttps://doi.org/10.1007/s12083-022-01296-6\n(2022).\nArticle\nGoogle Scholar\n73. Teng, Y., Cui, J. &amp; Jiang, W. Research on application of edge computing in real-time environmental monitoring system.\nJ. Phys. Conf. Ser.\n2010\n, 12157.\nhttps://doi.org/10.1088/1742-6596/2010/1/012157\n(2021).\nArticle\nGoogle Scholar\n74. Qu, Y., Zhao, Y. D. &amp; Rahardja, D. Wilcoxon-Mann-Whitney test: Stratify or not?.\nJ. Biopharm. Stat.\n18\n(6), 1103-1111.\nhttps://doi.org/10.1080/10543400802369103\n(2008).\nArticle\nMathSciNet\nPubMed\nGoogle Scholar\n75. Dem, J. Statistical Comparisons of Classifiers over Multiple Data Sets\n7\n, 1-30 (2006).\n76. Malik, A. K. A Novel Ensemble Method of RVFL For Classification Problem, no. April, 2021,\nhttps://doi.org/10.1109/IJCNN52387.2021.9533836\n.\n77. \"SHAP.\"\nhttps://shap.readthedocs.io/en/latest/", "doc_items_refs": ["#/texts/537", "#/texts/538", "#/texts/539", "#/texts/540", "#/texts/541", "#/texts/542", "#/texts/543", "#/texts/544"], "page_nos": [], "uuid": "95db1e7e-555d-4615-841c-2ad6b4e6f1ae"}
{"doc_id": "2025__Developing_an_explainable_machine_learning_and_fog_computing-based_visual_rating__W4412486382", "source_path": "<redacted:source_path>", "chunk_id": 54, "source_chunk_idxs": [67, 68, 69], "num_tokens": 362, "text": "Developing an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nReferences\nDownload references\n\nDeveloping an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nFunding\nOpen access funding provided by The Science, Technology &amp; Innovation Funding Authority (STDF) in cooperation with The Egyptian Knowledge Bank (EKB). Open access funding provided by The Science, Technology &amp; Innovation Funding Authority (STDF) in cooperation with The Egyptian Knowledge Bank (EKB). The paper has gained no funding.\n\nDeveloping an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nAuthor information\nAuthors and Affiliations\n1. Department of Embedded Network Systems and Technology, Faculty of Artificial Intelligence, Kafrelsheikh University, El-Geish St, Kafrelsheikh, 33516, Egypt Zainab H. Ali\n2. Department of Electronics and Computer Engineering, School of Engineering and Applied Sciences, Nile University, Giza, Egypt Zainab H. Ali\n3. Department of Machine Learning and Information Retrieval, Faculty of Artificial Intelligence, Kafrelsheikh University, El-Geish St, Kafrelsheikh, 33516, Egypt Esraa Hassan &amp; Nora El-Rashidy\n4. Faculty of Medicine , kaferelshikh University , kaferelshikh, Egypt Shimaa Elgamal\nAuthors\n1. Zainab H. Ali\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n2. Esraa Hassan\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n3. Shimaa Elgamal\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n4. Nora El-Rashidy\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/545", "#/texts/547", "#/texts/550", "#/texts/551", "#/texts/552", "#/texts/553", "#/texts/554", "#/texts/555", "#/texts/556", "#/texts/557", "#/texts/558"], "page_nos": [], "uuid": "79b5c7fd-e1ce-40b0-bba1-d5a395436c89"}
{"doc_id": "2025__Developing_an_explainable_machine_learning_and_fog_computing-based_visual_rating__W4412486382", "source_path": "<redacted:source_path>", "chunk_id": 55, "source_chunk_idxs": [70, 71, 72, 73, 74], "num_tokens": 309, "text": "Developing an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nAuthor information\nContributions\nN.E.R. and Z.H.A makes the practical experiment, Z.H.A , E.H contribution to writing and revising the manuscript. N.E.R , Sh. E and E.H contribute to aggregating the datasets. SH.E approved the results from the medical side. All authors contribute to the progression.\n\nDeveloping an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nAuthor information\nCorresponding authors\nCorrespondence to\nZainab H. Ali\nor\nNora El-Rashidy\n.\n\nDeveloping an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nEthics declarations\nCompeting interests\nThe authors declare no competing interests.\n\nDeveloping an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nEthics declarations\nEthical approval\nAll methods were carried out in accordance with medical guidelines and regulations. The study protocol was approved by the [Kaferelshikh university- faculty of medicine] (Approval No. MKSU 50-1-18).\n\nDeveloping an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nEthics declarations\nInformed consent\nAll subjects agreed to participate in our study after getting written informed consent from the patients or their first-of kin relatives and after approval from the ethical committee of the faculty of medicine at Kafr El-Sheik University.", "doc_items_refs": ["#/texts/560", "#/texts/562", "#/texts/563", "#/texts/564", "#/texts/565", "#/texts/566", "#/texts/569", "#/texts/571", "#/texts/573"], "page_nos": [], "uuid": "60e1280c-59f8-4d30-bcf9-f90aaf3577a0"}
{"doc_id": "2025__Developing_an_explainable_machine_learning_and_fog_computing-based_visual_rating__W4412486382", "source_path": "<redacted:source_path>", "chunk_id": 56, "source_chunk_idxs": [75, 76, 77], "num_tokens": 402, "text": "Developing an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nAdditional information\nPublisher's note\nSpringer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations.\n\nDeveloping an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nRights and permissions\nOpen Access\nThis article is licensed under a Creative Commons Attribution 4.0 International License, which permits use, sharing, adaptation, distribution and reproduction in any medium or format, as long as you give appropriate credit to the original author(s) and the source, provide a link to the Creative Commons licence, and indicate if changes were made. The images or other third party material in this article are included in the article's Creative Commons licence, unless indicated otherwise in a credit line to the material. If material is not included in the article's Creative Commons licence and your intended use is not permitted by statutory regulation or exceeds the permitted use, you will need to obtain permission directly from the copyright holder. To view a copy of this licence, visit\nhttp://creativecommons.org/licenses/by/4.0/\n.\nReprints and permissions\n\nDeveloping an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nAbout this article\nCite this article\nAli, Z.H., Hassan, E., Elgamal, S.\net al.\nDeveloping an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression.\nSci Rep\n15\n, 25872 (2025). https://doi.org/10.1038/s41598-025-06310-4\nDownload citation\n- Received : 29 January 2025\n- Accepted : 09 June 2025\n- Published : 16 July 2025\n- DOI : https://doi.org/10.1038/s41598-025-06310-4", "doc_items_refs": ["#/texts/576", "#/texts/580", "#/texts/581", "#/texts/582", "#/texts/583", "#/texts/584", "#/texts/587", "#/texts/588", "#/texts/589", "#/texts/590", "#/texts/591", "#/texts/592", "#/texts/593", "#/texts/594", "#/texts/595", "#/texts/596", "#/texts/597"], "page_nos": [], "uuid": "6b52e767-97e6-40f3-adc4-356e16ad3150"}
{"doc_id": "2025__Developing_an_explainable_machine_learning_and_fog_computing-based_visual_rating__W4412486382", "source_path": "<redacted:source_path>", "chunk_id": 57, "source_chunk_idxs": [78, 79, 80, 81, 82, 83], "num_tokens": 288, "text": "Developing an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nAbout this article\nKeywords\n- Machine learning\n- Mental test scores\n- Real-time monitoring system\n- Internet of things\n- Fog computing\nDownload PDF\nAdvertisement\n\nDeveloping an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nExplore content\n- Research articles\n- News &amp; Comment\n- Collections\n- Subjects\n- Follow us on Facebook\n- Follow us on Twitter\n- Sign up for alerts\n- RSS feed\n\nDeveloping an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nAbout the journal\n- About Scientific Reports\n- Contact\n- Journal policies\n- Guide to referees\n- Calls for Papers\n- Editor's Choice\n- Journal highlights\n- Open Access Fees and Funding\n\nDeveloping an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nPublish with us\n- For authors\n- Language editing services\n- Open access funding\n- Submit manuscript\n\nDeveloping an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nSearch\nSearch articles by subject, keyword or author\nShow results from\nAll journals\nThis journal\nSearch\nAdvanced search\n\nDeveloping an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nSearch\nQuick links\n- Explore articles by subject\n- Find a job\n- Guide to authors\n- Editorial policies\nScientific Reports (\nSci Rep\n)\nISSN 2045-2322 (online)", "doc_items_refs": ["#/texts/599", "#/texts/600", "#/texts/601", "#/texts/602", "#/texts/603", "#/texts/604", "#/texts/605", "#/texts/607", "#/texts/608", "#/texts/609", "#/texts/610", "#/texts/611", "#/texts/612", "#/texts/613", "#/texts/614", "#/texts/616", "#/texts/617", "#/texts/618", "#/texts/619", "#/texts/620", "#/texts/621", "#/texts/622", "#/texts/623", "#/texts/625", "#/texts/626", "#/texts/627", "#/texts/628", "#/texts/630", "#/texts/631", "#/texts/632", "#/texts/633", "#/texts/634", "#/texts/635", "#/texts/637", "#/texts/638", "#/texts/639", "#/texts/640", "#/texts/641", "#/texts/642", "#/texts/643", "#/texts/644"], "page_nos": [], "uuid": "b3072744-b6fd-4059-b8de-7c8ab4a076d5"}
{"doc_id": "2025__Developing_an_explainable_machine_learning_and_fog_computing-based_visual_rating__W4412486382", "source_path": "<redacted:source_path>", "chunk_id": 58, "source_chunk_idxs": [84, 85, 86, 87, 88, 89, 90, 91], "num_tokens": 459, "text": "Developing an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nnature.com sitemap\nAbout Nature Portfolio\n- About us\n- Press releases\n- Press office\n- Contact us\n\nDeveloping an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nnature.com sitemap\nDiscover content\n- Journals A-Z\n- Articles by subject\n- protocols.io\n- Nature Index\n\nDeveloping an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nnature.com sitemap\nPublishing policies\n- Nature portfolio policies\n- Open access\n\nDeveloping an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nnature.com sitemap\nAuthor & Researcher services\n- Reprints &amp; permissions\n- Research data\n- Language editing\n- Scientific editing\n- Nature Masterclasses\n- Research Solutions\n\nDeveloping an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nnature.com sitemap\nLibraries & institutions\n- Librarian service &amp; tools\n- Librarian portal\n- Open research\n- Recommend to library\n\nDeveloping an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nnature.com sitemap\nAdvertising & partnerships\n- Advertising\n- Partnerships &amp; Services\n- Media kits\n- Branded content\n\nDeveloping an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nnature.com sitemap\nProfessional development\n- Nature Awards\n- Nature Careers\n- Nature Conferences\n\nDeveloping an explainable machine learning and fog computing-based visual rating scale for the prediction of dementia progression\nnature.com sitemap\nRegional websites\n- Nature Africa\n- Nature China\n- Nature India\n- Nature Japan\n- Nature Middle East\n- Privacy Policy\n- Use of cookies\n- Your privacy choices/Manage cookies\n- Legal notice\n- Accessibility statement\n- Terms &amp; Conditions\n- Your US state privacy rights\nImage Hyperlink.\n© 2025 Springer Nature Limited\nClose banner\nClose\nNature Briefing\nSign up for the\nNature Briefing\nnewsletter - what matters in science, free to your inbox daily.\nEmail address\nSign up\nI agree my information will be processed in accordance with the\nNature\nand Springer Nature Limited\nPrivacy Policy\n.\nClose banner\nClose\nGet the most important science stories of the day, free in your inbox.\nSign up for Nature Briefing", "doc_items_refs": ["#/texts/647", "#/texts/648", "#/texts/649", "#/texts/650", "#/texts/652", "#/texts/653", "#/texts/654", "#/texts/655", "#/texts/657", "#/texts/658", "#/texts/660", "#/texts/661", "#/texts/662", "#/texts/663", "#/texts/664", "#/texts/665", "#/texts/667", "#/texts/668", "#/texts/669", "#/texts/670", "#/texts/672", "#/texts/673", "#/texts/674", "#/texts/675", "#/texts/677", "#/texts/678", "#/texts/679", "#/texts/681", "#/texts/682", "#/texts/683", "#/texts/684", "#/texts/685", "#/texts/686", "#/texts/687", "#/texts/688", "#/texts/689", "#/texts/690", "#/texts/691", "#/texts/692", "#/texts/693", "#/texts/694", "#/texts/695", "#/texts/696", "#/texts/697", "#/texts/698", "#/texts/699", "#/texts/700", "#/texts/701", "#/texts/702", "#/texts/703", "#/texts/704", "#/texts/705", "#/texts/706", "#/texts/707", "#/texts/708", "#/texts/709", "#/texts/710", "#/texts/711"], "page_nos": [], "uuid": "6b2c3577-ad53-4863-b8d5-e91f1d2a6100"}
