{"doc_id": "2025__Effects_of_Blood_Pressure_Variability_and_Its_Association_With_Dementia_and_Cogn__W4411804266", "source_path": "<redacted:source_path>", "chunk_id": 0, "source_chunk_idxs": [0], "num_tokens": 143, "text": "Effects of Blood Pressure Variability and Its Association With Dementia and Cognitive Impairment: A Systematic Review\n\t\t\t\t\t\t\t| International Journal of Medical Students\nSkip to main content\nSkip to main navigation menu\nSkip to site footer\nOpen Menu\n- About\n- About the Journal\n- Editorial Team\n- Indexing\n- Statistics\n- Policies\n- License\n- Others\n- Announcements\n- Instructions for Authors\n- Article Types\n- General Instructions\n- Publishing Criteria\n- Submission Process\n- Editorial Ethics\n- Copyright Notice\n- Privacy Statement\n- Welcome message\n- Submission Guidelines\n- Sponsors &amp; Partners\n- WCMSR Editions\n- MedEd Research Webinars\n- Research Pathways\nSearch\n- Register\n- Login\n1. Home\n/\n2. Archives\n/\n3. Vol. 13 No. 2 (2025)\n/\n4. Review", "doc_items_refs": ["#/texts/1", "#/texts/2", "#/texts/3", "#/texts/4", "#/texts/5", "#/texts/6", "#/texts/7", "#/texts/8", "#/texts/9", "#/texts/10", "#/texts/11", "#/texts/12", "#/texts/13", "#/texts/14", "#/texts/15", "#/texts/16", "#/texts/17", "#/texts/18", "#/texts/19", "#/texts/20", "#/texts/21", "#/texts/22", "#/texts/23", "#/texts/24", "#/texts/25", "#/texts/26", "#/texts/27", "#/texts/28", "#/texts/29", "#/texts/30", "#/texts/31", "#/texts/32", "#/texts/33", "#/texts/34"], "page_nos": [], "uuid": "7b790f0a-667a-4668-9b04-6c4857be53b4"}
{"doc_id": "2025__Effects_of_Blood_Pressure_Variability_and_Its_Association_With_Dementia_and_Cogn__W4411804266", "source_path": "<redacted:source_path>", "chunk_id": 1, "source_chunk_idxs": [1], "num_tokens": 431, "text": "Effects of Blood Pressure Variability and Its Association With Dementia and Cognitive Impairment: A Systematic Review\nAuthors\n- Aakanksha Pitliya MD, Internal Medicine, Mercy Catholic Medical Center, Darby, PA, USA\nhttps://orcid.org/0000-0003-4535-0090\n- Aniket Jaimalani MBBS, Physician, SMIMER Hospital and Medical College, Surat, Gujrat, India\nhttps://orcid.org/0009-0000-2574-2877\n- Mizba Basheer Patel MBBS, Physician, Deccan College of Medical Sciences, Hyderabad, Telangana, India\nhttps://orcid.org/0009-0008-7871-5256\n- Aditi Parulkar MBBS, Physician, People's College of Medical Sciences, Bhopal, MP, India\nhttps://orcid.org/0000-0003-4704-4505\n- Mahendra Kumar MBBS, Physician, Sardar Patel Medical College, Bikaner, Rajasthan, India\nhttps://orcid.org/0009-0006-1149-0633\n- Vanshika Batra Fourth year-medical student, SGT Medical College, Gurugram, Haryana, India\nhttps://orcid.org/0009-0005-6523-1998\n- Sahaj Modi MBBS, PGY1-Anaesthesia, LNCT Medical College, Bhopal, MP, India\nhttps://orcid.org/0009-0005-9099-9237\n- Srivasta Surya Vasudevan MS, Researcher, Louisiana State University Health Center, Shreveport, LA, USA\nhttps://orcid.org/0000-0002-6998-1658\n- Anmol Pitliya MD, Hospitalist, Camden Clark Medical Center, Parkersburg, WV, USA\nhttps://orcid.org/0000-0002-5142-9638", "doc_items_refs": ["#/texts/37", "#/texts/38", "#/texts/39", "#/texts/40", "#/texts/41", "#/texts/42", "#/texts/43", "#/texts/44", "#/texts/45"], "page_nos": [], "uuid": "24dacebc-1618-43ec-910c-308579b1cfe4"}
{"doc_id": "2025__Effects_of_Blood_Pressure_Variability_and_Its_Association_With_Dementia_and_Cogn__W4411804266", "source_path": "<redacted:source_path>", "chunk_id": 2, "source_chunk_idxs": [2, 3, 4, 5], "num_tokens": 438, "text": "Effects of Blood Pressure Variability and Its Association With Dementia and Cognitive Impairment: A Systematic Review\nDOI:\nhttps://doi.org/10.5195/ijms.2025.2482\n\nEffects of Blood Pressure Variability and Its Association With Dementia and Cognitive Impairment: A Systematic Review\nKeywords:\nAlzheimer's disease, \t\t\t\t\t\t\t\t\t\t\tdementia, \t\t\t\t\t\t\t\t\t\t\tcongnitive impairment, \t\t\t\t\t\t\t\t\t\t\tBlood Pressure, \t\t\t\t\t\t\t\t\t\t\tHypertension\n\nEffects of Blood Pressure Variability and Its Association With Dementia and Cognitive Impairment: A Systematic Review\nAbstract\nBackground:\nThis systematic review aimed to assess the relationship between blood pressure, cognitive function, and the potential for dementia in individuals with hypertension or at risk of developing hypertension.\nMethods:\nThe review adhered strictly to the Preferred Reporting Items for Systematic Reviews and Meta-analyses (PRISMA) guidelines. A comprehensive search was conducted in databases, including PubMed, Research Gate, Google Scholar, and Science Direct. The inclusion criteria required studies that examined the association between blood pressure variability and the occurrence or progression of dementia and cognitive impairment. Two independent reviewers evaluated each study's quality and potential bias using study-specific tools before inclusion.\nResults:\nThere were 17 studies, including four systematic reviews and meta-analyses, four randomized controlled trials, and nine observational studies, with 16,985,492 participants. The findings indicated that late-life blood pressure had a stronger association with cognitive function than midlife blood pressure. Hypertension was linked to an increased risk of all-cause dementia, Alzheimer's disease, and vascular dementia. Anti-hypertensive medications could reduce the risk of dementia or cognitive impairment, although the specific type of medication did not significantly affect overall cognitive performance. A significant limitation of this review was the heterogeneity in diagnostic criteria, cognitive assessment tools, and imaging techniques used among the studies, which limited direct comparisons and conclusive findings.\nConclusion:\nBlood pressure variability emerged as a potential predictor for cognitive impairment. Implementing strategies to reduce blood pressure variability may help mitigate the risk of dementia and improve cognitive outcomes in vulnerable populations.\n\nEffects of Blood Pressure Variability and Its Association With Dementia and Cognitive Impairment: A Systematic Review\nAbstract\nMetrics\nMetrics Loading ...", "doc_items_refs": ["#/texts/47", "#/texts/49", "#/texts/51", "#/texts/52", "#/texts/53", "#/texts/54", "#/texts/55", "#/texts/56", "#/texts/57", "#/texts/58", "#/texts/60"], "page_nos": [], "uuid": "9bf01a40-04aa-4b26-8cef-b1a9bab68594"}
{"doc_id": "2025__Effects_of_Blood_Pressure_Variability_and_Its_Association_With_Dementia_and_Cogn__W4411804266", "source_path": "<redacted:source_path>", "chunk_id": 3, "source_chunk_idxs": [6], "num_tokens": 474, "text": "Effects of Blood Pressure Variability and Its Association With Dementia and Cognitive Impairment: A Systematic Review\nReferences\nLivingston G, Huntley J, Sommerlad A, Costafreda SG, Huntley J, Ames D, et al. Dementia prevention, intervention, and care: 2020 report of the Lancet Commission. Lancet. 2020;396:413-446.\nIadecola C, Gottesman RF. Neurovascular and cognitive impairment in Hypertension. Circ Res. 2019;124:1025-1044.\nDe Heus RAA, Tzourio C, Lee EJL, Opozda M, Vincent AD, Anstey KJ, Hofman A, et al. Association Between Blood Pressure Variability With Dementia and Cognitive Impairment: A Systematic Review and Meta-Analysis. Hypertension. 2021;78:1478-1489.\nHughes D, Judge C, Murphy R, , Loughlin E, Costello M, Whiteley W, Bosch J, et al. Association of Blood Pressure Lowering With Incident Dementia or Cognitive Impairment: A Systematic Review and Meta-analysis. JAMA. 2020;323:1934-1944.\nWijsman LW, de Craen AJ, Muller M, Sabayan B, Stott D, Ford I, Trompet S, et al. Visit-to-Visit Blood Pressure Variability, and Cognitive Function in Old Age. Am J Hypertens. 2016;29:311-8.\nBöhm M, Schumacher H, Leong D, Mancia G, Unger T, Schmieder R, et al. Systolic blood pressure variation and mean heart rate is associated with cognitive impairment in patients with high cardiovascular risk. Hypertension. 2015;65:651-61.\nMa Y, Wolters FJ, Chibnik LB, Licher S, Ikram MA, Hofman A, et al. Variation in blood pressure and long-term risk of dementia: A population-based cohort study. PLoS Med. 2019;16.\nYoo JE, Shin DW, Han K, Kim D, Lee SP, Jeong SM, et Al. Blood Pressure Variability and the Risk of Dementia: A Nationwide Cohort Study. Hypertension. 2020;75:982-990.", "doc_items_refs": ["#/texts/62", "#/texts/63", "#/texts/64", "#/texts/65", "#/texts/66", "#/texts/67", "#/texts/68", "#/texts/69"], "page_nos": [], "uuid": "57583006-aa50-4c8b-af50-4eb5b48ca2de"}
{"doc_id": "2025__Effects_of_Blood_Pressure_Variability_and_Its_Association_With_Dementia_and_Cogn__W4411804266", "source_path": "<redacted:source_path>", "chunk_id": 4, "source_chunk_idxs": [7], "num_tokens": 495, "text": "Effects of Blood Pressure Variability and Its Association With Dementia and Cognitive Impairment: A Systematic Review\nReferences\nMoher D, Liberati A, Tetzlaff J, Altman DG. Preferred reporting items for systematic reviews and meta-analyses: the PRISMA statement. PLoS Med. 2009;6:e1000097.\nShea BJ, Reeves BC, Wells G, Thuku M, Hamel C, Moran J, et al. AMSTAR 2: a critical appraisal tool for systematic reviews that include randomised or non-randomised studies of healthcare interventions, or both. BMJ. 2017;358:j4008.\nHartling L, Hamm M, Milne A, Vandermeer B, Santaguida PL, Ansari M, et al. Validity and Inter-Rater Reliability Testing of Quality Assessment Instruments. In Agency for Healthcare Research and Quality (US); 2012\nHiggins JP, Altman DG, Gøtzsche PC, Jüni P, Moher D, Oxman AD, et al. The Cochrane Collaboration's tool for assessing risk of bias in randomised trials. BMJ. 2011;343:d5928.\nOkonkwo OC, Cohen RA, Gunstad J, Poppas A. Cardiac output, blood pressure variability, and cognitive impairment in geriatric cardiac patients. J Cardiopulm Rehabil Prev. 2011;31:290-297.\nRouch L, Cestac P, Sallerin B, Piccoli M, Benattar-Zibi L, Bertin P, et al. Visit-to-Visit Blood Pressure Variability Is Associated With cognitive impairment and Incident Dementia: The S.AGES Cohort. Hypertension. 2020;76:1280-1288.\nWilliamson JD, Pajewski NM, Auchus AP, Bryan RN, Chelune G, Cheung AK, Cleveland ML, et al. Effect of Intensive vs Standard Blood Pressure Control on Probable Dementia: A Randomized Clinical Trial. JAMA. 2019;321:553-561.\nPrince MJ, Bird AS, Blizard RA, Mann AH. Is the cognitive function of older patients affected by antihypertensive treatment? Results from 54 months of the Medical Research Council's trial of hypertension in older adults. BMJ. 1996;312:801-805.", "doc_items_refs": ["#/texts/70", "#/texts/71", "#/texts/72", "#/texts/73", "#/texts/74", "#/texts/75", "#/texts/76", "#/texts/77"], "page_nos": [], "uuid": "ce603211-f451-4e5d-b3da-5f5f24c07f44"}
{"doc_id": "2025__Effects_of_Blood_Pressure_Variability_and_Its_Association_With_Dementia_and_Cogn__W4411804266", "source_path": "<redacted:source_path>", "chunk_id": 5, "source_chunk_idxs": [8], "num_tokens": 479, "text": "Effects of Blood Pressure Variability and Its Association With Dementia and Cognitive Impairment: A Systematic Review\nReferences\nQin B, Viera AJ, Muntner P, Plassman BL, Edwards LJ, Adair LS, et al. Visit-to-Visit Variability in Blood Pressure Is Related to Late-Life cognitive impairment. Hypertension. 2016;68:106-113.\nYano Y, Griswold M, Wang W, Greenland P, Lloyd-Jones DM, Heiss G, et al. Long-Term Blood Pressure Level and Variability From Midlife to Later Life and Subsequent Cognitive Change: The ARIC Neurocognitive Study. J Am Heart Assoc. 2018;7.\nOu YN, Tan CC, Shen XN, Xu W, Hou XH, Dong Q, et al. Blood Pressure and Risks of Cognitive Impairment and Dementia: A Systematic Review and Meta-Analysis of 209 Prospective Studies. Hypertension. 2020;76:217-225.\nChiu TJ, Yeh JT, Huang CJ, Chiang CE, Sung SH, Chen CH, et al. Blood pressure variability and cognitive impairment: A systematic review and meta-analysis of longitudinal cohort studies. J Clin Hypertens (Greenwich). 2021;23:1463-1482.\nXu L, Yang Y, Cui D. Association between blood pressure control status, visit-to-visit blood pressure variability, and cognitive function in elderly Chinese: A nationwide study. Front Public Health. 2022;10:877192.\nLiu Z, Zhao Y, Zhang H, Chai Q, Cui Y, Diao Y, et al. Excessive variability in systolic blood pressure that is self-measured at home exacerbates the progression of brain white matter lesions and cognitive impairment in the oldest old. Hypertens Res. 2016;39:245-253.\nSible IJ, Yew B, Jang JY, Alitin JPM, Li Y, Gaubert A, et al. Blood pressure variability and plasma Alzheimer's disease biomarkers in older adults. Sci Rep. 2022;12:17197.\nDuron E, Hanon O. Vascular risk factors, cognitive impairment, and dementia. Vasc Health Risk Manag. 2008;4:363-81.", "doc_items_refs": ["#/texts/78", "#/texts/79", "#/texts/80", "#/texts/81", "#/texts/82", "#/texts/83", "#/texts/84", "#/texts/85"], "page_nos": [], "uuid": "3e23bee4-ccca-4666-a897-6a7eb59032fe"}
{"doc_id": "2025__Effects_of_Blood_Pressure_Variability_and_Its_Association_With_Dementia_and_Cogn__W4411804266", "source_path": "<redacted:source_path>", "chunk_id": 6, "source_chunk_idxs": [9], "num_tokens": 493, "text": "Effects of Blood Pressure Variability and Its Association With Dementia and Cognitive Impairment: A Systematic Review\nReferences\nDregan A, Stewart R, Gulliford MC. Cardiovascular risk factors and cognitive impairment in adults aged 50 and over: a population-based cohort study. Age Ageing. 2013;42:338-345.\nSingh-Manoux A, Marmot M. High blood pressure was associated with cognitive function in middle-age in the Whitehall II study. J Clin Epidemiol. 2005;58:1308-1315.\nWaldstein SR, Giggey PP, Thayer JF, Zonderman AB. Nonlinear relations of blood pressure to cognitive function: the Baltimore Longitudinal Study of Aging. Hypertension. 2005;45:374-379.\nOishi E, Ohara T, Sakata S, Fukuhara M, Hata J, Yoshida D, Shibata M, et al. Day-to-Day blood pressure variability and risk of dementia in a general Japanese elderly population: the Hisayama Study. Circulation. 2017; 136:516-525.\nGottesman RF, Schneider AL, Albert M, Alonso A, Bandeen-Roche K, Coker L, et al. Midlife hypertension and 20-year cognitive change: the Atherosclerosis Risk in Communities Neurocognitive Study. JAMA Neurol. 2014;71:1218-1227.\nTsivgoulis G, Alexandrov AV, Wadley VG, Unverzagt FW, Go RC, Moy CS, et al. Association of higher diastolic blood pressure levels with cognitive impairment. Neurology. 2009; 73:589-595.\nDen Heijer T, Launer LJ, Prins ND, van Dijk EJ, Vermeer SE, Hofman A, Koudstaal PJ, et al. Association between blood pressure, white matter lesions, and atrophy of the medial temporal lobe. Neurology. 2005; 64:263-267.\nChen KH, Henderson VW, Stolwyk RJ, Dennerstein L, Szoeke C. Prehypertension in midlife is associated with worse cognition a decade later in middle-aged and older women. Age Ageing. 2015;44:439-445.", "doc_items_refs": ["#/texts/86", "#/texts/87", "#/texts/88", "#/texts/89", "#/texts/90", "#/texts/91", "#/texts/92", "#/texts/93"], "page_nos": [], "uuid": "9c9eb833-d283-44ab-896f-dab4cbb3c1a3"}
{"doc_id": "2025__Effects_of_Blood_Pressure_Variability_and_Its_Association_With_Dementia_and_Cogn__W4411804266", "source_path": "<redacted:source_path>", "chunk_id": 7, "source_chunk_idxs": [10, 11, 12, 13, 14, 15, 16], "num_tokens": 443, "text": "Effects of Blood Pressure Variability and Its Association With Dementia and Cognitive Impairment: A Systematic Review\nDownloads\n- PDF\n- PubReader\n- In-press\n\nEffects of Blood Pressure Variability and Its Association With Dementia and Cognitive Impairment: A Systematic Review\nPublished\n2025-04-27 - Updated on 2025-06-23\n\nEffects of Blood Pressure Variability and Its Association With Dementia and Cognitive Impairment: A Systematic Review\nHow to Cite\nPitliya, A., Jaimalani, A., Patel, M. B., Parulkar, A., Kumar, M., Batra, V., Modi, S., Vasudevan, S. S., &amp; Pitliya, A. (2025). Effects of Blood Pressure Variability and Its Association With Dementia and Cognitive Impairment: A Systematic Review.\nInternational Journal of Medical Students\n,\n13\n(2), 192-203. https://doi.org/10.5195/ijms.2025.2482\nMore Citation Formats\n- ACM\n- ACS\n- APA\n- ABNT\n- Chicago\n- Harvard\n- IEEE\n- MLA\n- Turabian\n- Vancouver\nDownload Citation\n- Endnote/Zotero/Mendeley (RIS)\n- BibTeX\n\nEffects of Blood Pressure Variability and Its Association With Dementia and Cognitive Impairment: A Systematic Review\nIssue\nVol. 13 No. 2 (2025)\n\nEffects of Blood Pressure Variability and Its Association With Dementia and Cognitive Impairment: A Systematic Review\nSection\nReview\n\nEffects of Blood Pressure Variability and Its Association With Dementia and Cognitive Impairment: A Systematic Review\nCategories\n- COVID-19\n\nEffects of Blood Pressure Variability and Its Association With Dementia and Cognitive Impairment: A Systematic Review\nLicense\nCopyright (c) 2025 Aakanksha Pitliya, Aniket Jaimalani, Mizba Basheer Patel, Aditi Parulkar, Mahendra Kumar, Vanshika Batra, Sahaj Modi, Srivasta Surya Vasudevan, Anmol Pitliya\nImage Hyperlink.\nThis work is licensed under a\nCreative Commons Attribution 4.0 International License\n.\nAuthors who publish with this journal agree to the following terms:", "doc_items_refs": ["#/texts/95", "#/texts/96", "#/texts/97", "#/texts/99", "#/texts/101", "#/texts/102", "#/texts/103", "#/texts/104", "#/texts/105", "#/texts/106", "#/texts/107", "#/texts/108", "#/texts/109", "#/texts/110", "#/texts/111", "#/texts/112", "#/texts/113", "#/texts/114", "#/texts/115", "#/texts/116", "#/texts/117", "#/texts/118", "#/texts/119", "#/texts/121", "#/texts/123", "#/texts/125", "#/texts/127", "#/texts/128", "#/texts/129", "#/texts/130", "#/texts/131", "#/texts/132"], "page_nos": [], "uuid": "253d3f3b-71ef-418f-9776-1da74cbb784a"}
{"doc_id": "2025__Effects_of_Blood_Pressure_Variability_and_Its_Association_With_Dementia_and_Cogn__W4411804266", "source_path": "<redacted:source_path>", "chunk_id": 8, "source_chunk_idxs": [17], "num_tokens": 510, "text": "Effects of Blood Pressure Variability and Its Association With Dementia and Cognitive Impairment: A Systematic Review\nLicense\n1. The Author retains copyright in the Work, where the term \"Work\" shall include all digital objects that may result in subsequent electronic publication or distribution.\n2. Upon acceptance of the Work, the author shall grant to the Publisher the right of first publication of the Work.\n3. The Author shall grant to the Publisher and its agents the nonexclusive perpetual right and license to publish, archive, and make accessible the Work in whole or in part in all forms of media now or hereafter known under a\nCreative Commons Attribution 4.0 International License\nor its equivalent, which, for the avoidance of doubt, allows others to copy, distribute, and transmit the Work under the following conditions:\n4. Attribution-other users must attribute the Work in the manner specified by the author as indicated on the journal Web site; with the understanding that the above condition can be waived with permission from the Author and that where the Work or any of its elements is in the public domain under applicable law, that status is in no way affected by the license.\n5. The Author is able to enter into separate, additional contractual arrangements for the nonexclusive distribution of the journal's published version of the Work (e.g., post it to an institutional repository or publish it in a book), as long as there is provided in the document an acknowledgment of its initial publication in this journal.\n6. Authors are permitted and encouraged to post online a prepublication manuscript (but not the Publisher's final formatted PDF version of the Work) in institutional repositories or on their Websites prior to and during the submission process, as it can lead to productive exchanges, as well as earlier and greater citation of published work. Any such posting made before acceptance and publication of the Work shall be updated upon publication to include a reference to the Publisher-assigned DOI (Digital Object Identifier) and a link to the online abstract for the final published Work in the Journal.\n7. Upon Publisher's request, the Author agrees to furnish promptly to Publisher, at the Author's own expense, written evidence of the permissions, licenses, and consents for use of third-party material included within the Work, except as determined by Publisher to be covered by the principles of Fair Use.\n8. The Author represents and warrants that:\n9. the Work is the Author's original work;", "doc_items_refs": ["#/texts/133", "#/texts/134", "#/texts/135", "#/texts/136", "#/texts/137", "#/texts/138", "#/texts/139", "#/texts/140", "#/texts/141"], "page_nos": [], "uuid": "1db2542b-4453-4243-a9d9-e72037d49a98"}
{"doc_id": "2025__Effects_of_Blood_Pressure_Variability_and_Its_Association_With_Dementia_and_Cogn__W4411804266", "source_path": "<redacted:source_path>", "chunk_id": 9, "source_chunk_idxs": [18], "num_tokens": 263, "text": "Effects of Blood Pressure Variability and Its Association With Dementia and Cognitive Impairment: A Systematic Review\nLicense\n10. the Author has not transferred, and will not transfer, exclusive rights in the Work to any third party;\n11. the Work is not pending review or under consideration by another publisher;\n12. the Work has not previously been published;\n13. the Work contains no misrepresentation or infringement of the Work or property of other authors or third parties; and\n14. the Work contains no libel, invasion of privacy, or other unlawful matter.\nEnforcement of copyright\nThe IJMS takes the protection of copyright very seriously.\nIf the IJMS discovers that you have used its copyright materials in contravention of the license above, the IJMS may bring legal proceedings against you seeking reparation and an injunction to stop you using those materials. You could also be ordered to pay legal costs.\nIf you become aware of any use of the IJMS' copyright materials that contravenes or may contravene the license above, please report this by email to\ncontact@ijms.org\nInfringing material\nIf you become aware of any material on the website that you believe infringes your or any other person's copyright, please report this by email to\ncontact@ijms.org", "doc_items_refs": ["#/texts/142", "#/texts/143", "#/texts/144", "#/texts/145", "#/texts/146", "#/texts/147", "#/texts/148", "#/texts/149", "#/texts/150", "#/texts/151", "#/texts/152", "#/texts/153", "#/texts/154"], "page_nos": [], "uuid": "d0ca30d4-244f-4828-8bdb-86af99c0eda6"}
{"doc_id": "2025__Effects_of_Blood_Pressure_Variability_and_Its_Association_With_Dementia_and_Cogn__W4411804266", "source_path": "<redacted:source_path>", "chunk_id": 10, "source_chunk_idxs": [19, 20, 21, 22, 23, 24], "num_tokens": 421, "text": "Effects of Blood Pressure Variability and Its Association With Dementia and Cognitive Impairment: A Systematic Review\nLicense\nMost read articles by the same author(s)\n- Aakanksha Pitliya,\nA Rare Case Report of Neurological Condition: Moersch-Woltman Syndrome with Positive Anti-GAD Antibodies\n,\nInternational Journal of Medical Students: Vol. 11 No. 3 (2023)\n\nEffects of Blood Pressure Variability and Its Association With Dementia and Cognitive Impairment: A Systematic Review\ndonate\nThe IJMS doesn't charge readers or authors, relying on your support\n\nEffects of Blood Pressure Variability and Its Association With Dementia and Cognitive Impairment: A Systematic Review\nMake a Submission\nMake a Submission\n\nEffects of Blood Pressure Variability and Its Association With Dementia and Cognitive Impairment: A Systematic Review\nInformation\n- For Readers\n- For Authors\n- For Librarians\n\nEffects of Blood Pressure Variability and Its Association With Dementia and Cognitive Impairment: A Systematic Review\nSponsor\nAre you looking for a place to showcase your company or organization? Contact us at\nsponsors@ijms.info\n\nEffects of Blood Pressure Variability and Its Association With Dementia and Cognitive Impairment: A Systematic Review\nBrowse\n- Categories\n- Clinical Specialties\n- Obstetrics &amp; Gynecology\n- Ophthalmology\n- Cardiovascular\n- Dermatology\n- Emergency Medicine\n- Endocrinology\n- Otolaryngology, Head &amp; Neck Surgery\n- Genetics\n- Geriatrics\n- Gastroenterology\n- Hematology\n- Immunology\n- Infectious Diseases\n- Microbiology\n- Musculoskeletal Disorders\n- Nephrology\n- Neurology\n- Oncology\n- Original Research\n- Orthopedics\n- Pediatrics\n- Pathology\n- Psychiatry\n- Respiratory\n- Rheumatology\n- Sports Medicine\n- Surgery\n- Urology\n- Physical Medicine &amp; Rehabilitation\n- COVID-19\n- Meeting Abstracts\n- Medical Education\n- Medical Ethics\n- Molecular Medicine\n- Other\n- Pharmacology\n- Artificial Intelligence/Machine Learning in Medicine\n- Public Health and Community Medicine\n- Family Medicine\n- Community Medicine\n- Public Health\n- Global Health\n- Research Designs\n- Case Report\n- Narrative Review\n- Systematic Review\n- Editorials\n- Experience Articles and Letters", "doc_items_refs": ["#/texts/156", "#/texts/158", "#/texts/160", "#/texts/162", "#/texts/163", "#/texts/164", "#/texts/166", "#/texts/167", "#/texts/169", "#/texts/170", "#/texts/171", "#/texts/172", "#/texts/173", "#/texts/174", "#/texts/175", "#/texts/176", "#/texts/177", "#/texts/178", "#/texts/179", "#/texts/180", "#/texts/181", "#/texts/182", "#/texts/183", "#/texts/184", "#/texts/185", "#/texts/186", "#/texts/187", "#/texts/188", "#/texts/189", "#/texts/190", "#/texts/191", "#/texts/192", "#/texts/193", "#/texts/194", "#/texts/195", "#/texts/196", "#/texts/197", "#/texts/198", "#/texts/199", "#/texts/200", "#/texts/201", "#/texts/202", "#/texts/203", "#/texts/204", "#/texts/205", "#/texts/206", "#/texts/207", "#/texts/208", "#/texts/209", "#/texts/210", "#/texts/211", "#/texts/212", "#/texts/213", "#/texts/214", "#/texts/215", "#/texts/216", "#/texts/217", "#/texts/218"], "page_nos": [], "uuid": "8eed40bf-31f5-4d02-a43c-27513bb704e9"}
{"doc_id": "2025__Effects_of_Blood_Pressure_Variability_and_Its_Association_With_Dementia_and_Cogn__W4411804266", "source_path": "<redacted:source_path>", "chunk_id": 11, "source_chunk_idxs": [25, 26, 27], "num_tokens": 278, "text": "Effects of Blood Pressure Variability and Its Association With Dementia and Cognitive Impairment: A Systematic Review\nCurrent Issue\n- Image Hyperlink.\n- Image Hyperlink.\n- Image Hyperlink.\n\nEffects of Blood Pressure Variability and Its Association With Dementia and Cognitive Impairment: A Systematic Review\nAnnouncements\nNew Issue Published at the International Journal of Medical Students: Volume 13, Issue 3 (2025)\nSeptember 30, 2025\nDear IJMS Readers,\nWe are delighted to announce the publication of\nVolume 13, Issue 3 (2025)\nof the\nInternational Journal of Medical Students (IJMS)\n. This issue presents diverse and timely contributions that showcase the breadth of medical student research and global collaboration.\nHighlights include:\n- Editorial:\nBlueprints for Discovery: The Anatomy of a Global Medical Student Research Conference\n,...\n\nEffects of Blood Pressure Variability and Its Association With Dementia and Cognitive Impairment: A Systematic Review\nAnnouncements\nFinal Countdown-1 DAY LEFT to Apply to the World Conference of Medical Student Research!\nSeptember 29, 2025\nlogo-name-horizont.jpg\nHello Fellow Researchers,\nIt is the final countdown-there is just over\n1 DAY LEFT\nto submit your abstract to be considered for presentation at the 4th annual IJMS'\nWorld Conference of Medical Student Research (WCMSR).\nAbstracts and proof of payment must be received by...\nKeywords\nTweets by @TheIJMS\nImage Hyperlink.", "doc_items_refs": ["#/texts/220", "#/texts/221", "#/texts/222", "#/texts/225", "#/texts/226", "#/texts/227", "#/texts/228", "#/texts/229", "#/texts/230", "#/texts/231", "#/texts/232", "#/texts/233", "#/texts/235", "#/texts/236", "#/texts/237", "#/texts/238", "#/texts/239", "#/texts/240", "#/texts/241", "#/texts/242", "#/texts/243", "#/texts/244", "#/texts/245"], "page_nos": [], "uuid": "7872136d-faae-4922-9ddc-2bd51dd32b41"}
