{"doc_id": "2025__Comparison_of_two_preprocessing_methods_for_18F-Flortaucipir_PET_quantification___W4412521606", "source_path": "<redacted:source_path>", "chunk_id": 0, "source_chunk_idxs": [0, 1], "num_tokens": 325, "text": "Comparison of two preprocessing methods for 18F-Flortaucipir PET quantification in Alzheimer's disease | European Journal of Nuclear Medicine and Molecular Imaging\nSkip to main content\nAdvertisement\nLog in\nMenu\nFind a journal\nPublish with us\nTrack your research\nSearch\nCart\n1. Home\n2. European Journal of Nuclear Medicine and Molecular Imaging\n3. Article\n\nComparison of two preprocessing methods for 18 F-Flortaucipir PET quantification in Alzheimer's disease\n- Original Article\n- Open access\n- Published: 19 July 2025\n- ( 2025 )\n- Cite this article\nDownload PDF\nYou have full access to this\nopen access\narticle\nEuropean Journal of Nuclear Medicine and Molecular Imaging\nAims and scope\nSubmit manuscript\nComparison of two preprocessing methods for\n18\nF-Flortaucipir PET quantification in Alzheimer's disease\nDownload PDF\n- Elif Harput\n1\n,\n- Debora Elisa Peretti\n1\n,\n- Max Scheffler\n2\n,\n- Nicholas J. Ashton\n3\n,\n4\n,\n5\n,\n6\n,\n- Kaj Blennow\n3\n,\n7\n,\n8\n,\n9\n,\n- Henrik Zetterberg\n3\n,\n7\n,\n10\n,\n11\n,\n12\n,\n13\n,\n- Ruben Smith\n14\n,\n15\n,\n- Giovanni B. Frisoni\n16\n,\n17\n,\n- Valentina Garibotto\n1\n,\n18\n,\n19\n&amp;\n- ...\n- Cecilia Boccalini\nORCID: orcid.org/0000-0002-3518-436X\n1\nShow authors\n- 1030 Accesses\n- 7 Altmetric\n- 1 Mention\n- Explore all metrics", "doc_items_refs": ["#/texts/1", "#/texts/2", "#/texts/3", "#/texts/4", "#/texts/5", "#/texts/6", "#/texts/7", "#/texts/8", "#/texts/9", "#/texts/10", "#/texts/11", "#/texts/12", "#/texts/14", "#/texts/15", "#/texts/16", "#/texts/17", "#/texts/18", "#/texts/19", "#/texts/20", "#/texts/21", "#/texts/22", "#/texts/23", "#/texts/24", "#/texts/25", "#/texts/26", "#/texts/27", "#/texts/28", "#/texts/29", "#/texts/30", "#/texts/31", "#/texts/32", "#/texts/33", "#/texts/34", "#/texts/35", "#/texts/36", "#/texts/37", "#/texts/38", "#/texts/39", "#/texts/40", "#/texts/41", "#/texts/42", "#/texts/43", "#/texts/44", "#/texts/45"], "page_nos": [], "uuid": "192a0466-1e04-4a79-88a1-0d68c7d3f0e9"}
{"doc_id": "2025__Comparison_of_two_preprocessing_methods_for_18F-Flortaucipir_PET_quantification___W4412521606", "source_path": "<redacted:source_path>", "chunk_id": 1, "source_chunk_idxs": [2, 3], "num_tokens": 282, "text": "Comparison of two preprocessing methods for 18 F-Flortaucipir PET quantification in Alzheimer's disease\nAbstract\nBackground\nTau-Positron Emission Tomography (PET) has become central in Alzheimer's disease (AD) research and clinical settings. Multiple preprocessing pipelines for tau-PET quantification have been described, with satisfactory performance but direct comparisons remain scarse. Our study evaluates the comparability of two commonly used PET preprocessing methods, respectively in native and standard spaces, in quantifying tau deposition and in their ability to discriminate AD patients.\n\nComparison of two preprocessing methods for 18 F-Flortaucipir PET quantification in Alzheimer's disease\nAbstract\nMethods\n209 subjects were included from the Geneva memory clinic including cognitively unimpaired (CU) individuals, mild cognitive impairment (MCI) and dementia patients. Images were processed in native and standard space using inferior cerebellar grey matter as reference region. Standardized uptake value ratios (SUVR) were extracted from AD-specific regions. Correlations between SUVR obtained by different methods and plasma biomarkers were assessed. ROC analyses compared the ability of the two methods to discriminate visually assessed tau status, amyloid-positive cognitively impaired from amyloid-negative CU, and subjects with declining cognition over time.", "doc_items_refs": ["#/texts/48", "#/texts/50"], "page_nos": [], "uuid": "362e671f-e032-4b55-b8b1-06d5704152b2"}
{"doc_id": "2025__Comparison_of_two_preprocessing_methods_for_18F-Flortaucipir_PET_quantification___W4412521606", "source_path": "<redacted:source_path>", "chunk_id": 2, "source_chunk_idxs": [4, 5, 6, 7, 8, 9], "num_tokens": 471, "text": "Comparison of two preprocessing methods for 18 F-Flortaucipir PET quantification in Alzheimer's disease\nAbstract\nResults\nSUVR from the two methods were strongly correlated across all regions. However, SUVR values obtained with standard space method showed higher values. SUVR in the medial temporal lobe from native space processing provided a greater accuracy in discriminating positive scans and identifying subjects with cognitive decline. For all other analyses methods performed equally well. The correlation with plasma biomarkers was comparably high with both methods.\n\nComparison of two preprocessing methods for 18 F-Flortaucipir PET quantification in Alzheimer's disease\nAbstract\nConclusion\nWhile preprocessing in native and standard space is adequate for quantifying\n18\nF-Flortaucipir PET and for discriminating AD patients, higher accuracy can be obtained in the mesial temporal regions and to predict cognitive decline using processing in native space.\n\nComparison of two preprocessing methods for 18 F-Flortaucipir PET quantification in Alzheimer's disease\nAbstract\nCould tau-PET imaging contribute to a better understanding of the different patterns of clinical progression in Alzheimer's disease? A 2-year longitudinal study\nArticle\nOpen access\n03 May 2023\n\nComparison of two preprocessing methods for 18 F-Flortaucipir PET quantification in Alzheimer's disease\nAbstract\nComparison of CSF markers and semi-quantitative amyloid PET in Alzheimer's disease diagnosis and in cognitive impairment prognosis using the ADNI-2 database\nArticle\nOpen access\n26 April 2017\n\nComparison of two preprocessing methods for 18 F-Flortaucipir PET quantification in Alzheimer's disease\nAbstract\n[ 18 F]-D3FSP β-amyloid PET imaging in older adults and alzheimer's disease\nArticle\n08 July 2024\n\nComparison of two preprocessing methods for 18 F-Flortaucipir PET quantification in Alzheimer's disease\nAbstract\nExplore related subjects\nDiscover the latest articles, books and news in related subjects, suggested using machine learning.\n- Alzheimer's disease\n- Characterization and Analytical Technique\n- Image Processing\n- Positron-Emission Tomography\n- Psychometrics\n- Sensory Evaluation\nUse our pre-submission checklist\nAvoid common mistakes on your manuscript.", "doc_items_refs": ["#/texts/52", "#/texts/54", "#/texts/55", "#/texts/56", "#/texts/59", "#/texts/60", "#/texts/61", "#/texts/63", "#/texts/64", "#/texts/65", "#/texts/67", "#/texts/68", "#/texts/70", "#/texts/71", "#/texts/72", "#/texts/73", "#/texts/74", "#/texts/75", "#/texts/76", "#/texts/77", "#/texts/78"], "page_nos": [], "uuid": "61393f8c-9b75-40a5-9288-cd788910dadb"}
{"doc_id": "2025__Comparison_of_two_preprocessing_methods_for_18F-Flortaucipir_PET_quantification___W4412521606", "source_path": "<redacted:source_path>", "chunk_id": 3, "source_chunk_idxs": [10], "num_tokens": 503, "text": "Comparison of two preprocessing methods for 18 F-Flortaucipir PET quantification in Alzheimer's disease\nIntroduction\nAlzheimer's disease (AD) is characterized by the accumulation of amyloid-beta (Aβ) plaques and tau neurofibrillary tangles, accompanied by a progressive neurodegenerative process leading to neuronal and synaptic loss [\n1\n]. Positron emission tomography (PET) serves a pivotal tool for the in vivo visualisation and quantification of AD pathology [\n2\n], with tau-PET measuring tau pathological changes [\n3\n] that have been strongly associated with cognitive impairment and decline in AD. Tau-PET outperformed other AD biomarkers in predicting cognitive worsening [\n4\n,\n5\n,\n6\n], overall supporting its relevance as a biomarker for disease staging and prognosis [\n4\n,\n7\n,\n8\n].\nDespite the emerging relevance of tau-PET imaging, no consensus exists on a reference pipeline for the quantification of tau-PET. Variability in PET quantification arises from multiple methodological factors, including different tracers, choice of target/reference regions, native vs standard space processing or selection of different brain atlases [\n9\n,\n10\n]. The reference region selection depends on the radiotracer used [\n11\n]. For most tau tracers, cerebellar grey matter is chosen [\n12\n], using frequently the inferior cerebellar grey matter or the cerebellar crus.\nThe reference space selection has been demonstrated to have impact on quantification with amyloid-PET where native space processing can improve the accuracy of standardized uptake value ratios (SUVR) [\n13\n], but this has never been explored for tau-PET using\n18\nF-flortaucipir neither with any other tracer. In standard space processing tau-PET images were spatially normalized to a common template, in many cases the Montreal Neurological Institute (MNI) template, whereas, in native space processing images are analysed in the individual subject's anatomical space. Standard space processing facilitates voxel-wise analysis, whereas native space preserves anatomical information, and it is recommended in volumetric measurements [\n14\n]. Since native space method may require more computational resources and longer preprocessing times [\n13\n,\n14\n], standard space method could be a viable alternative when MRI is unavailable or to reduce the time required for processing [\n15\n].", "doc_items_refs": ["#/texts/80", "#/texts/81", "#/texts/82", "#/texts/83", "#/texts/84", "#/texts/85", "#/texts/86", "#/texts/87", "#/texts/88", "#/texts/89", "#/texts/90", "#/texts/91", "#/texts/92", "#/texts/93", "#/texts/94", "#/texts/95", "#/texts/96", "#/texts/97", "#/texts/98", "#/texts/99", "#/texts/100", "#/texts/101", "#/texts/102", "#/texts/103", "#/texts/104", "#/texts/105", "#/texts/106", "#/texts/107", "#/texts/108", "#/texts/109", "#/texts/110", "#/texts/111", "#/texts/112", "#/texts/113", "#/texts/114", "#/texts/115", "#/texts/116", "#/texts/117", "#/texts/118", "#/texts/119", "#/texts/120"], "page_nos": [], "uuid": "6d50d46f-03d9-4205-a9cf-25f79ccb0a77"}
{"doc_id": "2025__Comparison_of_two_preprocessing_methods_for_18F-Flortaucipir_PET_quantification___W4412521606", "source_path": "<redacted:source_path>", "chunk_id": 4, "source_chunk_idxs": [11, 12], "num_tokens": 485, "text": "Comparison of two preprocessing methods for 18 F-Flortaucipir PET quantification in Alzheimer's disease\nIntroduction\nGiven the lack of evidence regarding the impact of reference space selection on tau-PET quantification, the present study aims to compare two different commonly used preprocessing methods for\n18\nF-flortaucipir PET, respectively in native and standard reference space. The pipeline in the native space processing is commonly used in research [\n16\n,\n17\n], while most of clinical research series are processed in standard space [\n4\n,\n18\n,\n19\n]. Our aim was to examine whether there are differences between the results obtained by processing in native space and standard space across different target regions, in terms of the quantitative parameters obtained and their association with clinical and biological parameters, in a memory clinic population. As reference standards we used the visual assessment of tau-PET images, phospho-tau species measured in plasma, the presence of amyloid pathology and clinical severity, as well as cognitive decline.\n\nComparison of two preprocessing methods for 18 F-Flortaucipir PET quantification in Alzheimer's disease\nMethods\nParticipants\nThis study included 209 subjects from the Geneva memory clinic, including cognitively unimpaired subjects (CU,\nN\n= 62), cognitively impaired patients (CI) with mild cognitive impairment (MCI,\nN\n= 113) and dementia (\nN\n= 34). Each participant underwent clinical and neurological assessment, neuropsychological testing, and MRI scan. Inclusion criteria was to have undergone at least a tau-PET scan and a Mini-Mental State Examination (MMSE) within one-year timeframe. A subset of participants (\nn\n= 182) also underwent amyloid-PET within one year of the tau-PET assessment, and Aβ status was defined by visual rating by nuclear medicine experts. Follow-up MMSE was available for a subgroup of 126 participants at 23 ± 12 months. We classified subjects into decliners or stable based on the change from MMSE at baseline and MMSE at the last follow-up considering follow-up duration and participant's age [\n20\n].\nThe study procedures were approved by the local ethics committee and conducted in accordance with the principles of the Declaration of Helsinki and the International Conference on Harmonization Good Clinical Practice. All participants provided informed consent before taking part in the study.", "doc_items_refs": ["#/texts/121", "#/texts/122", "#/texts/123", "#/texts/124", "#/texts/125", "#/texts/126", "#/texts/127", "#/texts/128", "#/texts/129", "#/texts/130", "#/texts/131", "#/texts/132", "#/texts/133", "#/texts/136", "#/texts/137", "#/texts/138", "#/texts/139", "#/texts/140", "#/texts/141", "#/texts/142", "#/texts/143", "#/texts/144", "#/texts/145", "#/texts/146", "#/texts/147"], "page_nos": [], "uuid": "40d8c140-f66f-4ec0-9f2a-1f7bbe80e9bd"}
{"doc_id": "2025__Comparison_of_two_preprocessing_methods_for_18F-Flortaucipir_PET_quantification___W4412521606", "source_path": "<redacted:source_path>", "chunk_id": 5, "source_chunk_idxs": [13], "num_tokens": 158, "text": "Comparison of two preprocessing methods for 18 F-Flortaucipir PET quantification in Alzheimer's disease\nImaging acquisition and preprocessing\nMRI and PET acquisition\nT1-MRI images were performed at Division of Radiology of Geneva University Hospitals and all details are reported in Supplementary Materials (\nS1\n).\nPET scans were acquired at the Division of Nuclear medicine and Molecular Imaging at Geneva University Hospitals. Tau-PET imaging was acquired using\n18\nF-flortaucipir tracer, while amyloid-PET images were acquired using either\n18\nF-florbetapir (FBP) or\n18\nF-flutametamol (FMM) tracers. All details of PET acquisition are reported in Supplementary Materials (\nS1\n).", "doc_items_refs": ["#/texts/150", "#/texts/151", "#/texts/152", "#/texts/153", "#/texts/154", "#/texts/155", "#/texts/156", "#/texts/157", "#/texts/158", "#/texts/159", "#/texts/160", "#/texts/161"], "page_nos": [], "uuid": "5ff8119c-6f05-414e-ae52-4794a6c0b5c2"}
{"doc_id": "2025__Comparison_of_two_preprocessing_methods_for_18F-Flortaucipir_PET_quantification___W4412521606", "source_path": "<redacted:source_path>", "chunk_id": 6, "source_chunk_idxs": [14], "num_tokens": 388, "text": "Comparison of two preprocessing methods for 18 F-Flortaucipir PET quantification in Alzheimer's disease\nImaging acquisition and preprocessing\nMRI and Tau-PET processing\nAll tau images have been processed by two different processing methods, involving two different spaces, with the aim of comparing the two different outputs.\nNative space processing:\nT1-weighted MRI images were segmented using FreeSurfer. Each participant's mean tau-PET image was coregistered to their corresponding native T1-weighted MRI images. Images were intensity-normalized using the inferior cerebellar grey matter as a reference region, yielding in SUVR images. FreeSurfer parcellations were applied to extract mean SUVR values from all regions in the Desikan-Killiany atlas [\n21\n] in native space using PETSurfer.\nStandard space processing\n: PET standard space processing was performed using Statistical Parametric Mapping (SPM,12, Wellcome Trust centre for Neuroimaging, London, UK), running in MATLAB R2018b version 9.5 (MathWorks Inc., Sherborn, MA, USA). MRI 3D T1 images were aligned to a reference plane passing through the anterior and posterior commissures, segmented into different compartments, and normalized to the MNI space using tissue probability maps. PET images were aligned to the subject's respective T1 MRI scan and normalized to MNI space using the transformation matrix that was generated during the registration of the MRI images to the standard space. Standardized intensity normalization was performed using inferior cerebellar grey matter as a reference region resulting in SUVR images. As the cerebellar crus has also been largely used as reference region for standard space processing, we also include data derived using it as supplementary analysis. SUVR were extracted using Desikan-Killiany atlas.", "doc_items_refs": ["#/texts/163", "#/texts/164", "#/texts/165", "#/texts/166", "#/texts/167", "#/texts/168", "#/texts/169"], "page_nos": [], "uuid": "298a4a48-0a1c-43c0-bdd4-9b3bb161628a"}
{"doc_id": "2025__Comparison_of_two_preprocessing_methods_for_18F-Flortaucipir_PET_quantification___W4412521606", "source_path": "<redacted:source_path>", "chunk_id": 7, "source_chunk_idxs": [15, 16], "num_tokens": 332, "text": "Comparison of two preprocessing methods for 18 F-Flortaucipir PET quantification in Alzheimer's disease\nImaging acquisition and preprocessing\nMRI and Tau-PET processing\nAD-related target regions\nAfter obtaining the SUVR for the Desikan-Killiany atlas regions with both processing methods, global tau SUVR were calculated from specific AD regions of interest (ROIs): (a) medial temporal lobe (MTL), (b) early to late AD related areas (global AD meta-ROI) according to [\n22\n], (c) early AD meta-ROI as the most discriminative for tau status for cognitively normal population according to [\n23\n], (d) lateral temporal ROI, (e) and Braak regions. SUVR in meta-ROIs and Braak regions were calculated using a weighted approach, mean among all included regions, accounting for the volume (native space processing) or the size (standard space processing) of each region. All regions included in AD ROIs and Braak regions are reported in Supplementary Materials (\nS2\n).\n\nComparison of two preprocessing methods for 18 F-Flortaucipir PET quantification in Alzheimer's disease\nImaging acquisition and preprocessing\nPlasma biomarkers\nPlasma biomarkers (Plasma Aβ42 and Aβ40:\nN\n= 128; Plasma p-tau181 and p-tau23:\nN\n= 121; Plasma p-tau217,\nN\n= 47) were available for subgroups of patients. All details about plasma collection are reported in Supplementary Materials (\nS3\n).", "doc_items_refs": ["#/texts/171", "#/texts/172", "#/texts/173", "#/texts/174", "#/texts/175", "#/texts/176", "#/texts/177", "#/texts/179", "#/texts/180", "#/texts/181", "#/texts/182", "#/texts/183", "#/texts/184", "#/texts/185", "#/texts/186", "#/texts/187"], "page_nos": [], "uuid": "515b80e2-53d0-4969-a433-88454fc175a6"}
{"doc_id": "2025__Comparison_of_two_preprocessing_methods_for_18F-Flortaucipir_PET_quantification___W4412521606", "source_path": "<redacted:source_path>", "chunk_id": 8, "source_chunk_idxs": [17], "num_tokens": 512, "text": "Comparison of two preprocessing methods for 18 F-Flortaucipir PET quantification in Alzheimer's disease\nImaging acquisition and preprocessing\nStatistical Analysis\nDemographic differences across diagnostic groups were assessed using Kruskal-Wallis tests. For each meta-ROI and Braak region, Pearson correlation coefficients were calculated between the SUVR obtained by the two preprocessing methods across the entire sample. To compare the mean SUVR values obtained from native and standard space methods, paired t-tests were conducted, with significance set at 0.05. To quantify the amount of tau-PET positive subjects for both methods, first, threshold values for tau positivity were calculated with Youden's test for SUVR in native and standard space methods using as reference the visual classification of tau pathology as assessed by a nuclear medicine expert (VG). Receiver operating characteristic (ROC) analyses were performed to compare SUVR obtained using the two methods in discriminating visual tau status, A+ CI/A-CU status, and declining status. The DeLong test was used to compare areas under the curve (AUCs). Pearson correlations were computed for testing the correlations between plasma biomarkers and SUVR in early and global AD meta-ROIs obtained with the two methods and differences between standard space and native space correlations were compared using \"cocor\" package in R [\n24\n].\nSimilar analyses have been performed in parallel to compare SUVR obtained with standard space processing method with two different commonly used reference regions (inferior cerebellar grey matter and cerebellar crus).\nGiven the different spatial resolution of PET scanners, sensitivity analyses were run within two subgroups acquired with PET scanners with different resolution (Biograph mCT,\nN\n= 139, and Biograph Vision 600 Edge,\nN\n= 66). ROC analyses were conducted to assess the ability of SUVR obtained using the two methods in discriminating visual tau status, A + CI/A-CU status, and cognitive decline status within the two groups. To ensure comparability in sample size, 66 subjects were randomly selected from a total of 139 individuals scanned with Biograph mCT, of which 39 individuals had available follow-up MMSE scores, to match the number of follow-up cases in the group scanned with the Biograph Vision.\nAll statistical analyses were performed with R version 4.0.2 (R Foundation for statistical computing,\nhttps://www.r-project.org/\n).", "doc_items_refs": ["#/texts/189", "#/texts/190", "#/texts/191", "#/texts/192", "#/texts/193", "#/texts/194", "#/texts/195", "#/texts/196", "#/texts/197", "#/texts/198", "#/texts/199", "#/texts/200"], "page_nos": [], "uuid": "06786e0b-f514-430f-8257-8d625f9e1c30"}
{"doc_id": "2025__Comparison_of_two_preprocessing_methods_for_18F-Flortaucipir_PET_quantification___W4412521606", "source_path": "<redacted:source_path>", "chunk_id": 9, "source_chunk_idxs": [18], "num_tokens": 137, "text": "Comparison of two preprocessing methods for 18 F-Flortaucipir PET quantification in Alzheimer's disease\nResults\nParticipants\nDemographic and clinical variables are presented in Table\n1\n. Out of 209 participants, the majority were MCI patients (54%). The mean age was 70.34 ± 9.1 and MMSE 25.52 ± 4.4. Age and MMSE differed significantly between disease stages (Table\n1\n). The rate of amyloid and tau positivity frequency, and all plasma levels except for plasma p-tau231 (\np\n= 0.07) were significantly higher in the dementia group compared to the other diagnostic groups (\np", "doc_items_refs": ["#/texts/203", "#/texts/204", "#/texts/205", "#/texts/206", "#/texts/207", "#/texts/208", "#/texts/209", "#/texts/210"], "page_nos": [], "uuid": "06d2f511-3b45-42a1-88b3-01db33df2407"}
{"doc_id": "2025__Comparison_of_two_preprocessing_methods_for_18F-Flortaucipir_PET_quantification___W4412521606", "source_path": "<redacted:source_path>", "chunk_id": 10, "source_chunk_idxs": [19], "num_tokens": 474, "text": "Comparison of two preprocessing methods for 18 F-Flortaucipir PET quantification in Alzheimer's disease\nResults\nComparison of different processing methods\nSUVR obtained by the two processing methods in all analysed meta-ROIs and Braak regions showed strong and significant correlations (r &gt; 0.9,\np\n1\n).\nFig. 1\nWhen comparing the SUVR obtained from both methods, significant differences were found in all regions (\np\n2\n). Comparing the SUVR across clinical stages, there is a significantly increasing trend in SUVR for both methods along the AD spectrum, with standard space SUVR being systematically higher (Table\n2\n). When we set threshold values for native and standard space, we found a SUVR cutoff of 1.3 for the native space and 1.28 for standard space method able to discriminate between tau-positive and negative cases. Across clinical stages, both native and standard space methods consistently detected a substantial increase in the rate of tau-positive cases along the AD continuum, and low tau positivity in non-AD (A-) (Fig.\n2\n, panel A). When we examined tau positivity in non-AD individuals, we identified seven tau positive cases with the standard space approach in A-CU but all were visually classified as negative (two of them corresponding to Braak I). Among A-CI, 12 individuals were tau positive and 11 of them were visually classified as negative (2 of them were at Braak I) and one individual was visually classified as Braak V. In native space method, two tau positive cases were identified in A-CU group, both cases were classified as negative. Within A-CI group, we found two tau-positive cases and one was visually classified negative and the other as positive (Braak V). Overall standard space method identified more false positive cases compared to native space approach in all groups (Figure\nS3\n). Examples of discordant classifications (based on visual assessment and on the standard and native processing) are presented in Figure\nS4\n. Between clinical stages, SUVR for the two methods did not differ significantly (Fig.\n2\n, panel B). However, the increase of SUVR values within the methods across clinical stages was significant (Fig.\n2\n, panel B).\nFig. 2", "doc_items_refs": ["#/texts/213", "#/texts/214", "#/texts/216", "#/texts/217", "#/texts/218", "#/texts/219", "#/texts/220", "#/texts/222", "#/texts/223", "#/texts/224", "#/texts/225", "#/texts/226", "#/texts/227", "#/texts/228", "#/texts/229", "#/texts/230", "#/texts/231", "#/texts/232", "#/texts/233", "#/texts/234", "#/texts/235", "#/texts/236"], "page_nos": [], "uuid": "c45c9d97-1e1f-4c90-981b-fc1854550a60"}
{"doc_id": "2025__Comparison_of_two_preprocessing_methods_for_18F-Flortaucipir_PET_quantification___W4412521606", "source_path": "<redacted:source_path>", "chunk_id": 11, "source_chunk_idxs": [20], "num_tokens": 478, "text": "Comparison of two preprocessing methods for 18 F-Flortaucipir PET quantification in Alzheimer's disease\nResults\nComparison of different processing methods\nWhen we assess the performance of SUVR obtained with the two processing methods in discriminating visually established tau status, both demonstrated high AUC values, across all regions. However, some significant differences were observed with the native space method showing stronger discriminative power over the standard space approach for all the regions (Table\n3\n). Both methods showed high AUC results in discriminating A + CI from A-CU (AUC &gt; 0.7), and no significant differences were found between native and standard space processing. When discriminating decliner and stable individuals, SUVR in the MTL obtained with native space processing method outperformed the one obtained with standard space method (\np\n= 0.04) (Table\n3\n).\nSimilar results were demonstrated when analyzing a subgroup of scans acquired with the Biograph mCT scanner (Table\nS1\n), showing significantly higher discriminative power of native space processing over standard space in classifying tau positive and tau negative cases. High discriminative power were found for both methods in distinguishing A + CI from A-CU, with no significant difference between the two methods. In discriminating decliners and non-decliners there was no significant difference between the two processing methods (Table\nS1\n). For scans acquired using the machine with higher sensitivity and resolution, namely Biograph Vision 600 Edge, there was no significant difference between native and standard processing methods in discriminating visual tau status, A + CI/A-CU status, and declining status (Table\nS2\n).\nWhen we compared SUVR obtained with the standard space processing methods with two different reference regions, we found strong correlations between two approaches (Figure\nS1\n) and only marginal differences in discriminating patients in AD continuum (Table\nS3\n). In particular SUVR obtained using the cerebellar crus as reference region were able to better discriminate tau visual status only in MTL and Braak I. In contrast, inferior cerebellum grey matter was superior in discriminating A + CI from A-CU in early AD meta-ROI (Table\nS3\n). All these results are fully reported in the Supplementary Materials.", "doc_items_refs": ["#/texts/237", "#/texts/238", "#/texts/239", "#/texts/240", "#/texts/241", "#/texts/242", "#/texts/243", "#/texts/244", "#/texts/245", "#/texts/246", "#/texts/247", "#/texts/248", "#/texts/249", "#/texts/250", "#/texts/251", "#/texts/252", "#/texts/253", "#/texts/254", "#/texts/255", "#/texts/256", "#/texts/257"], "page_nos": [], "uuid": "33816194-8586-45ba-bbb3-23d76895b18e"}
{"doc_id": "2025__Comparison_of_two_preprocessing_methods_for_18F-Flortaucipir_PET_quantification___W4412521606", "source_path": "<redacted:source_path>", "chunk_id": 12, "source_chunk_idxs": [21, 22], "num_tokens": 510, "text": "Comparison of two preprocessing methods for 18 F-Flortaucipir PET quantification in Alzheimer's disease\nResults\nCorrelations with plasma biomarkers\nSignificant associations were found between all tau plasma biomarkers and early AD meta-ROI SUVR obtained with both methods (\np\n0.6) than other plasma biomarkers using both methods (Fig.\n3\n). Correlations between plasma biomarkers and early AD meta-ROI SUVR were not different between the two processing methods (\np\n&gt; 0.05) [\n24\n]. Comparable correlations were found using SUVR from global AD meta-ROI instead of early AD meta-ROI.\nFig. 3\nWhen we tested the standard space method using the cerebellar crus as reference regions, we found comparable correlations results with plasma biomarkers (Figure\nS2\n).\n\nComparison of two preprocessing methods for 18 F-Flortaucipir PET quantification in Alzheimer's disease\nDiscussion\nThe present study investigated the comparability of two distinct preprocessing methods for quantifying\n18\nF-flortaucipir PET and for discriminating patient groups in AD continuum. We aimed to assess whether native and standard space methods produce similar results, as the standard space method represents a faster method applicable also when MRI data is absent. The two approaches demonstrated strong and significant correlations in all considered AD-related regions and a similar capacity in differentiating AD patients from non-AD patients. Although two pipelines could capture similar overall tau deposition patterns in AD, some differences emerged favouring the native preprocessing being similar to visual reading and more accurate in quantifying tau in the regions representing the earliest disease stages.\nThe SUVR obtained from both preprocessing methods showed strong correlations across all regions, indicating a high consistency in quantifying tau and supporting robustness of both methods for detecting overall tau pathology. Our findings indicate increase in tau-positive cases in both methods along the AD spectrum, with SUVR progressively increased from A-CU to A + CI individuals, reflecting a well-established link between tau accumulation and clinical symptoms, regardless of the reference space selected in the processing pipeline, further supporting the value of tau-PET as staging marker in AD [\n25\n]. In non-AD individuals, standard space method tends to report many false tau-positive according to visual standard, meanwhile the ratio between semi-quantification and visual reads was more consistent for native space approach.", "doc_items_refs": ["#/texts/259", "#/texts/260", "#/texts/261", "#/texts/262", "#/texts/263", "#/texts/264", "#/texts/265", "#/texts/266", "#/texts/267", "#/texts/268", "#/texts/269", "#/texts/270", "#/texts/271", "#/texts/273", "#/texts/274", "#/texts/275", "#/texts/276", "#/texts/277", "#/texts/278"], "page_nos": [], "uuid": "6c9c66d0-3491-4e7e-84dd-8a091dd1a6fd"}
{"doc_id": "2025__Comparison_of_two_preprocessing_methods_for_18F-Flortaucipir_PET_quantification___W4412521606", "source_path": "<redacted:source_path>", "chunk_id": 13, "source_chunk_idxs": [23], "num_tokens": 500, "text": "Comparison of two preprocessing methods for 18 F-Flortaucipir PET quantification in Alzheimer's disease\nDiscussion\nBoth approaches showed a good ability to discriminate AD patients, defined as A + CI, visually tau-positive or cognitively decliners, as tested by ROC analyses. Specifically, both methods demonstrated strong discriminative performance between tau status as assessed visually across all regions presenting high AUC (&gt; 0.7); however, the native space method showed superior discriminative power with significantly greater values in all the regions. Previous research suggested high accuracy of tau visual assessment in identification of tau pathological change and validation of the results with postmortem information [\n26\n]. In MCI and AD, visually assessed tau positivity was associated with an increased risk of future cognitive decline [\n25\n]. Despite both preprocessing methods showing a very good performance in discriminating tau status, the native space preprocessing performed significantly better. In line with that, SUVR in MTL obtained with native space method performed better in discriminating cognitively declining participants from stable individuals compared to the standard space method. MTL is known to be the earliest site of tau accumulation making the native space method potentially more sensitive to subtle, early-stage tau pathology [\n2\n]. The native space approach may more accurately capture atrophy in small structures such as the entorhinal cortex. Using native space processing can improve the accuracy of regional quantification by preserving subject specific details and thus it can enhance sensitivity and reliability in both research and clinical settings. The highest added value resides in the identification of tau accumulation in the earliest stages. Analysing tau in the hippocampus and in MTL using\n18\nF-flortaucipir PET poses a challenge due to off-target binding in the nearby choroid plexus. The choroid plexus signal occurs in the absence of tau and it likely has other causes such as iron deposition, melanin, and mineralization [\n27\n,\n28\n]. In semi-quantification, adjusting for off-target binding can be difficult. Native space method may offer greater accuracy in discrimination of true binding and off-target signal since the ROI segmentation can be more precise compared to standard space. We found that the standard space method tends to overestimate SUVR likely due to the inclusion of off-target binding [\n10\n,\n29", "doc_items_refs": ["#/texts/279", "#/texts/280", "#/texts/281", "#/texts/282", "#/texts/283", "#/texts/284", "#/texts/285", "#/texts/286", "#/texts/287", "#/texts/288", "#/texts/289", "#/texts/290", "#/texts/291", "#/texts/292", "#/texts/293", "#/texts/294"], "page_nos": [], "uuid": "548d2f85-aefe-4079-b833-5fffd253f6cc"}
{"doc_id": "2025__Comparison_of_two_preprocessing_methods_for_18F-Flortaucipir_PET_quantification___W4412521606", "source_path": "<redacted:source_path>", "chunk_id": 14, "source_chunk_idxs": [24], "num_tokens": 277, "text": "Comparison of two preprocessing methods for 18 F-Flortaucipir PET quantification in Alzheimer's disease\nDiscussion\n]. Although the overperformance of native preprocessing on standard preprocessing was confirmed when limiting the analyses to the images acquired with a Biograph mCT scanner, no significant differences were found between native and standard space processing when images were acquired with the Biograph Vision 600 Edge scanner. The higher resolution and sensitivity of the Biograph Vision 600 Edge scanner enhances imaging accuracy and thus reduces the performance gap between the native and standard space processing, making both methods comparable even for quantification in small regions such as MTL.\nAlthough the primary focus of our paper was on how different reference spaces can influence tau quantification, we are aware that the cerebellar crus is frequently used as a reference region for tau in standard space preprocessing [\n25\n]. Therefore, we examined this method in parallel to assess how it might differ between using cerebellar crus and inferior cerebellar grey matter as reference region in quantification of tau. Results showed no major differences between the methods. There was a strong correlation between the two approaches and overall, both methods showed similar clinical performance in discriminating AD patients, suggesting that both reference regions are valid and produce comparable and similar outcomes.", "doc_items_refs": ["#/texts/295", "#/texts/296", "#/texts/297", "#/texts/298"], "page_nos": [], "uuid": "18018384-89ba-43a7-bdc3-deea6782f7fa"}
{"doc_id": "2025__Comparison_of_two_preprocessing_methods_for_18F-Flortaucipir_PET_quantification___W4412521606", "source_path": "<redacted:source_path>", "chunk_id": 15, "source_chunk_idxs": [25], "num_tokens": 331, "text": "Comparison of two preprocessing methods for 18 F-Flortaucipir PET quantification in Alzheimer's disease\nDiscussion\nGiven the emerging relevance of blood biomarkers, we tested if different methods showed similar correlations with these biomarkers as external measures of AD pathology. The correlations between plasma biomarkers and early AD meta-ROI SUVR show similar significant correlations using both methods. The biomarkers showed moderate to strong positive correlations indicating that higher plasma tau levels were associated with higher SUVR. We found the strongest correlations between p-tau217 and tau-PET, regardless of the preprocessing, and there were no differences in correlation coefficients between the two methods. In previous research, plasma p-tau217 was more effective than p-tau181 and p-tau231 in identifying tau positivity assessed by\n18\nF-flortaucipir PET [\n30\n]. P-tau217 also showed stronger associations with global tau SUVR measured by tau-PET, and with global cognition assessed with the MMSE in a memory clinic population compared to other plasma biomarkers [\n31\n]. In head-to-head comparison of plasma biomarkers in prodromal AD, p-tau217 had higher accuracy compared to other p-tau biomarkers when identifying patients with abnormal Aβ and tau status and those who are progressing to AD [\n30\n,\n32\n]. Our findings align with previous research, demonstrating significant associations with plasma biomarkers and early AD meta-ROI SUVR values computed using either the native space or standard space methods.", "doc_items_refs": ["#/texts/299", "#/texts/300", "#/texts/301", "#/texts/302", "#/texts/303", "#/texts/304", "#/texts/305", "#/texts/306", "#/texts/307", "#/texts/308", "#/texts/309"], "page_nos": [], "uuid": "966b0ea8-c535-4de1-a93c-9d761dfac36a"}
{"doc_id": "2025__Comparison_of_two_preprocessing_methods_for_18F-Flortaucipir_PET_quantification___W4412521606", "source_path": "<redacted:source_path>", "chunk_id": 16, "source_chunk_idxs": [26, 27, 28], "num_tokens": 315, "text": "Comparison of two preprocessing methods for 18 F-Flortaucipir PET quantification in Alzheimer's disease\nDiscussion\nStrengths and limitations\nThis study provides novel insights into the impact of processing space on\n18\nF-flortaucipir PET quantification, a topic that has not been investigated before. One of the strengths of this study is the use of memory clinic population which ensures the translation of our findings into clinical practice.\nHowever, some limitations should be acknowledged. Although we chose to compare the most used and well-known methods for tau quantification, we are aware that there are other reference regions, different techniques and different tracers that can be used for tau quantification. Moreover, we did not have brain tissue from postmortem evaluation to set as a gold standard.\n\nComparison of two preprocessing methods for 18 F-Flortaucipir PET quantification in Alzheimer's disease\nConclusion\nThe present study shows that native space and standard space tau-PET processing methods perform comparably well in identifying AD patients. However, native space preprocessing performs more similar to visual reading and allows a more precise semi-quantification in the mesial temporal region, suggesting that it should be preferred in studies focusing on early tau deposition.\n\nComparison of two preprocessing methods for 18 F-Flortaucipir PET quantification in Alzheimer's disease\nData availability\nAnonymized data used in this study are available upon reasonable request from the corresponding author (CB).", "doc_items_refs": ["#/texts/311", "#/texts/312", "#/texts/313", "#/texts/314", "#/texts/316", "#/texts/318"], "page_nos": [], "uuid": "171920f4-b545-4aa5-af46-1206f274a47d"}
{"doc_id": "2025__Comparison_of_two_preprocessing_methods_for_18F-Flortaucipir_PET_quantification___W4412521606", "source_path": "<redacted:source_path>", "chunk_id": 17, "source_chunk_idxs": [29], "num_tokens": 494, "text": "Comparison of two preprocessing methods for 18 F-Flortaucipir PET quantification in Alzheimer's disease\nReferences\n1. Jack CR, Knopman DS, Jagust WJ, Shaw LM, Aisen PS, Weiner MW, et al. Hypothetical model of dynamic biomarkers of the Alzheimer's pathological cascade. Lancet Neurol. 2010;9:119-28.\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n2. Villemagne VL, Barkhof F, Garibotto V, Landau SM, Nordberg A, van Berckel BNM. Molecular imaging approaches in dementia. Radiology. 2021;298:517-30.\nArticle\nPubMed\nGoogle Scholar\n3. Ossenkoppele R, van der Kant R, Hansson O. Tau biomarkers in Alzheimer's disease: towards implementation in clinical practice and trials. Lancet Neurol [Internet]. 2022;21:726-34. Available from:\nhttps://doi.org/10.1016/S1474-4422(22)00168-5\n4. Boccalini C, Ribaldi F, Hristovska I, Arnone A, Peretti DE, Mu L, et al. The impact of tau deposition and hypometabolism on cognitive impairment and longitudinal cognitive decline. Alzheimers Dement. 2024;20:221-33.\nArticle\nCAS\nPubMed\nGoogle Scholar\n5. Smith R, Cullen NC, PichetBinette A, Leuzy A, Blennow K, Zetterberg H, et al. Tau-PET is superior to phospho-tau when predicting cognitive decline in symptomatic AD patients. Alzheimers Dement. 2023;19:2497-507.\nArticle\nCAS\nPubMed\nGoogle Scholar\n6. Ossenkoppele R, Smith R, Mattsson-Carlgren N, Groot C, Leuzy A, Strandberg O, et al. Accuracy of tau positron emission tomography as a prognostic marker in preclinical and prodromal Alzheimer Disease: A head-to-head comparison against amyloid positron emission tomography and magnetic resonance imaging. JAMA Neurol. 2021;78:961-71.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/320", "#/texts/321", "#/texts/322", "#/texts/323", "#/texts/324", "#/texts/325"], "page_nos": [], "uuid": "956155b8-5592-43ae-9bf9-25e5c0f32473"}
{"doc_id": "2025__Comparison_of_two_preprocessing_methods_for_18F-Flortaucipir_PET_quantification___W4412521606", "source_path": "<redacted:source_path>", "chunk_id": 18, "source_chunk_idxs": [30], "num_tokens": 476, "text": "Comparison of two preprocessing methods for 18 F-Flortaucipir PET quantification in Alzheimer's disease\nReferences\n7. Van Rossum IA, Visser PJ, Knol DL, Van Der Flier WM, Teunissen CE, Barkhof F, et al. Injury markers but not amyloid markers are associated with rapid progression from mild cognitive impairment to dementia in alzheimer's disease. J Alzheimers Dis. 2012;29:319-27.\nArticle\nPubMed\nGoogle Scholar\n8. Jack CR, Andrews JS, Beach TG, Buracchio T, Dunn B, Graf A, et al. Revised criteria for diagnosis and staging of Alzheimer's disease: Alzheimer's association workgroup. Alzheimers Dement. 2024;20:5143-69.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n9. Bollack A, Pemberton HG, Collij LE, Markiewicz P, Cash DM, Farrar G, et al. Longitudinal amyloid and tau PET imaging in Alzheimer's disease: A systematic review of methodologies and factors affecting quantification. Alzheimers Dement. 2023;19:5232-52.\nArticle\nPubMed\nGoogle Scholar\n10. Burnham SC, Iaccarino L, Pontecorvo MJ, Fleisher AS, Lu M, Collins EC, et al. A review of the flortaucipir literature for positron emission tomography imaging of tau neurofibrillary tangles. Brain Commun [Internet]. 2024;6:1-25. Available from:\nhttps://doi.org/10.1093/braincomms/fcad305\n11. Zhang H, Wang M, Lu J, Bao W, Li L, Jiang J, et al. Parametric estimation of reference signal intensity for semi-quantification of tau deposition: A flortaucipir and [18F]-APN-1607 Study. Front Neurosci. 2021;15.\n12. Bischof GN, Endepols H, van Eimeren T, Drzezga A. Tau-imaging in neurodegeneration. Methods. 2017;130:114-23.\nArticle\nCAS\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/326", "#/texts/327", "#/texts/328", "#/texts/329", "#/texts/330", "#/texts/331"], "page_nos": [], "uuid": "828afbec-e2f1-4ee1-b636-9e12a11069c1"}
{"doc_id": "2025__Comparison_of_two_preprocessing_methods_for_18F-Flortaucipir_PET_quantification___W4412521606", "source_path": "<redacted:source_path>", "chunk_id": 19, "source_chunk_idxs": [31], "num_tokens": 487, "text": "Comparison of two preprocessing methods for 18 F-Flortaucipir PET quantification in Alzheimer's disease\nReferences\n13. Tahmi M, Bou-Zeid W, Razlighi QR. A fully automatic technique for precise localization and quantification of amyloid-b PET scans. J Nucl Med. 2019;60:1771-9.\nArticle\nCAS\nPubMed\nPubMed Central\nGoogle Scholar\n14. Kolinger GD, García DV, Willemsen ATM, Reesink FE, de Jong BM, Dierckx RAJO, et al. Amyloid burden quantification depends on PET and MR image processing methodology. PLoS ONE. 2021;16:1-19.\nArticle\nGoogle Scholar\n15. Carlson ML, Smith V, Johns E, Young CB, Vosslera H, Ward T, et al. MRI- free processing of tau PET images for early detection. Imaging Neurosci [Internet]. 2024;2. Available from:\nhttps://doi.org/10.1162/imag\\_a\\_00369\n16. Jagust WJ, Koeppe RA, Rabinovici GD, Villemagne VL, Harrison TM, Landau SM. The ADNI PET Core at 20. Alzheimers Dement. 2024;7340-9.\n17. Landau SM, Harrison TM, Baker SL, Boswell MS, Lee JQ, Taggett J, et al. Positron emission tomography harmonization in the Alzheimer's Disease Neuroimaging Initiative: A scalable and rigorous approach to multisite amyloid and tau quantification. Alzheimers Dement. 2024;1-16.\n18. Hansson O, Grothe MJ, Strandberg TO, Ohlsson T, Hägerström D, Jögi J, et al. Tau pathology distribution in Alzheimer's disease corresponds differentially to cognition-relevant functional brain networks. Front Neurosci. 2017;11.\n19. Hoenig MC, Bischof GN, Seemiller J, Hammes J, Kukolja J, Onur ÖA, et al. Networks of tau distribution in Alzheimer's disease. Brain. 2018;141:568-81.\nArticle\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/332", "#/texts/333", "#/texts/334", "#/texts/335", "#/texts/336", "#/texts/337", "#/texts/338"], "page_nos": [], "uuid": "2509c88e-5159-4f62-91b0-3b4860f99ed7"}
{"doc_id": "2025__Comparison_of_two_preprocessing_methods_for_18F-Flortaucipir_PET_quantification___W4412521606", "source_path": "<redacted:source_path>", "chunk_id": 20, "source_chunk_idxs": [32], "num_tokens": 478, "text": "Comparison of two preprocessing methods for 18 F-Flortaucipir PET quantification in Alzheimer's disease\nReferences\n20. Schneider LS, Kennedy RE, Wang G, Cutter GR. Differences in Alzheimer disease clinical trial outcomes based on age of the participants. Neurology. 2015;84:1121-7.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n21. Desikan RS, Ségonne F, Fischl B, Quinn BT, Dickerson BC, Blacker D, et al. An automated labeling system for subdividing the human cerebral cortex on MRI scans into gyral based regions of interest. Neuroimage. 2006;31:968-80.\nArticle\nPubMed\nGoogle Scholar\n22. Ossenkoppele R, Rabinovici GD, Smith R, Cho H, Scholl M, Strandberg O, et al. Discriminative accuracy of [18F]flortaucipir positron emission tomography for Alzheimer disease vs other neurodegenerative disorders. JAMA - J Am Med Assoc. 2018;320:1151-62.\nArticle\nCAS\nGoogle Scholar\n23. Mishra S, Gordon BA, Ph D, Su Y, Ph D, Christensen J, et al. AV-1451 PET Imaging of Tau Pathology in Preclinical Alzheimer Disease: 2017;171-8.\n24. Diedenhofen B, Musch J. Cocor: A comprehensive solution for the statistical comparison of correlations. PLoS ONE. 2015;10:1-12.\nArticle\nGoogle Scholar\n25. Groot C, Villeneuve S, Smith R, Hansson O, Ossenkoppele R. Tau PET imaging in neurodegenerative disorders. J Nucl Med. 2022;63:20S-26S.\nArticle\nCAS\nPubMed\nGoogle Scholar\n26. Fleisher AS, Pontecorvo MJ, Devous MD, Lu M, Arora AK, Truocchio SP, et al. Positron emission tomography imaging with [18F]flortaucipir and postmortem assessment of Alzheimer disease neuropathologic changes. JAMA Neurol. 2020;77:829-39.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar", "doc_items_refs": ["#/texts/339", "#/texts/340", "#/texts/341", "#/texts/342", "#/texts/343", "#/texts/344", "#/texts/345"], "page_nos": [], "uuid": "c50ac620-e563-4e95-be83-23f92491bd6c"}
{"doc_id": "2025__Comparison_of_two_preprocessing_methods_for_18F-Flortaucipir_PET_quantification___W4412521606", "source_path": "<redacted:source_path>", "chunk_id": 21, "source_chunk_idxs": [33], "num_tokens": 486, "text": "Comparison of two preprocessing methods for 18 F-Flortaucipir PET quantification in Alzheimer's disease\nReferences\n27. Lee CM, Jacobs HIL, Marquié M, Becker JA, Andrea NV, Jin DS, et al. 18F-Flortaucipir binding in choroid plexus: related to race and hippocampus signal. J Alzheimer Dis. 2018;62:1691-702.\nArticle\nCAS\nGoogle Scholar\n28. Pawlik D, Leuzy A, Strandberg O, Smith R. Compensating for choroid plexus based off-target signal in the hippocampus using 18F-flortaucipir PET. Neuroimage [Internet]. 2020;221:117193. Available from:\nhttps://doi.org/10.1016/j.neuroimage.2020.117193\n29. Ikonomovic MD, Abrahamson EE, Price JC, Mathis CA, Klunk WE. [F-18]AV-1451 positron emission tomography retention in choroid plexus: More than \"off-target\" binding. Ann Neurol. 2016;80:307-8.\nArticle\nPubMed\nPubMed Central\nGoogle Scholar\n30. Janelidze S, Bali D, Ashton NJ, Barthelemy NR, Vanbrabant J, Stoops E, et al. Head-to-head comparison of 10 plasma phospho-tau assays in prodromal Alzheimer's disease. Brain [Internet]. 2023;146:1592-601. Available from:\nhttps://doi.org/10.1093/brain/awac333\n31. Mendes AJ, Ribaldi F, Lathuiliere A, Ashton NJ, Janelidze S, Zetterberg H, et al. Head-to-head study of diagnostic accuracy of plasma and cerebrospinal fluid p-tau217 versus p-tau181 and p-tau231 in a memory clinic cohort. J Neurol [Internet]. 2024;271:2053-66. Available from:\nhttps://doi.org/10.1007/s00415-023-12148-5", "doc_items_refs": ["#/texts/346", "#/texts/347", "#/texts/348", "#/texts/349", "#/texts/350"], "page_nos": [], "uuid": "7713f178-1e5a-4f3a-a12f-feaf544a8c2f"}
{"doc_id": "2025__Comparison_of_two_preprocessing_methods_for_18F-Flortaucipir_PET_quantification___W4412521606", "source_path": "<redacted:source_path>", "chunk_id": 22, "source_chunk_idxs": [34, 35], "num_tokens": 280, "text": "Comparison of two preprocessing methods for 18 F-Flortaucipir PET quantification in Alzheimer's disease\nReferences\n32. Warmenhoven N, Salvadó G, Janelidze S, Mattsson-Carlgren N, Bali D, Dolado AO, et al. A Comprehensive Head-to-Head Comparison of Key Plasma Phosphorylated Tau 217 Biomarker Tests. medRxiv [Internet]. 2024;93:85-9. Available from:\nhttp://www.ncbi.nlm.nih.gov/pubmed/39006421%0A\nhttp://www.pubmedcentral.nih.gov/articlerender.fcgi?artid=PMC11245081\nDownload references\n\nComparison of two preprocessing methods for 18 F-Flortaucipir PET quantification in Alzheimer's disease\nAcknowledgements\nThe Clinical Research Centre, at Geneva University Hospital and Faculty of Medicine provided valuable support for regulatory submissions and data management. We thank the Centre for Radiopharmaceutical Sciences of ETH Zurich for providing the PET tracer for tau imaging. We acknowledge Avid Radiopharmaceuticals for providing the precursor for the tau radiotracer and emphasize that Avid was not involved in the analysis or interpretation.", "doc_items_refs": ["#/texts/351", "#/texts/352", "#/texts/354"], "page_nos": [], "uuid": "02888f28-e54e-451a-89b6-a63919d32178"}
{"doc_id": "2025__Comparison_of_two_preprocessing_methods_for_18F-Flortaucipir_PET_quantification___W4412521606", "source_path": "<redacted:source_path>", "chunk_id": 23, "source_chunk_idxs": [36], "num_tokens": 510, "text": "Comparison of two preprocessing methods for 18 F-Flortaucipir PET quantification in Alzheimer's disease\nFunding\nOpen access funding provided by University of Geneva. The Geneva Memory Clinic is funded by the following private donors under the supervision of the Private Foundation of Geneva University Hospitals: A.P.R.A.-Association Suisse pour la Recherche sur la Maladie d'Alzheimer, Genève; Fondation Segré, Genève; Race Against Dementia Foundation, London, UK; Fondation Child Care, Genève; Fondation Edmond J. Safra, Genève; Fondation Minkoff, Genève; Fondazione Agusta, Lugano; McCall Macbain Foundation, Canada; Nicole et René Keller, Genève; Fondation AETAS, Genève. Competitive research projects have been funded by: H2020 (projects n. 667375), Innovative Medicines Initiative (IMI contract n. 115736 and 115952), IMI2, Swiss National Science Foundation (projects n.320030\\_182772 and n. 320030\\_169876), VELUX Foundation. VG received funding for this research from the Swiss National Science Foundation (projects 320030\\_169876, 320030\\_185028, and 320030\\_220099), VELUX Foundation, Schmidheiny foundation and Fondation Privée of the University Hospitals of Geneva. HZ is a Wallenberg Scholar and a Distinguished Professor at the Swedish Research Council supported by grants from the Swedish Research Council (#2023-00356, #2022-01018 and #2019-02397), the European Union's Horizon Europe research and innovation programme under grant agreement No 101053962, Swedish State Support for Clinical Research (#ALFGBG-71320), the Alzheimer Drug Discovery Foundation (ADDF), USA (#201809-2016862), the AD Strategic Fund and the Alzheimer's Association (#ADSF-21-831376-C, #ADSF-21-831381-C, #ADSF-21-831377-C, and #ADSF-24-1284328-C), the European Partnership on Metrology, co-financed from the European Union's Horizon Europe Research and Innovation Programme and by the Participating States", "doc_items_refs": ["#/texts/356"], "page_nos": [], "uuid": "704cf883-a794-4171-bb99-6595d4b93e38"}
{"doc_id": "2025__Comparison_of_two_preprocessing_methods_for_18F-Flortaucipir_PET_quantification___W4412521606", "source_path": "<redacted:source_path>", "chunk_id": 24, "source_chunk_idxs": [37], "num_tokens": 211, "text": "Comparison of two preprocessing methods for 18 F-Flortaucipir PET quantification in Alzheimer's disease\nFunding\n(NEuroBioStand, #22HLT07), the Bluefield Project, Cure Alzheimer's Fund, the Olav Thon Foundation, the Erling-Persson Family Foundation, Familjen Rönströms Stiftelse, Stiftelsen för Gamla Tjänarinnor, Hjärnfonden, Sweden (#FO2022-0270), the European Union's Horizon 2020 research and innovation programme under the Marie Skłodowska-Curie grant agreement No 860197 (MIRIADE), the European Union Joint Programme- Neurodegenerative Disease Research (JPND2021-00694), the National Institute for Health and Care Research University College London Hospitals Biomedical Research Centre, the UK Dementia Research Institute at UCL (UKDRI-1003), and an anonymous donor.", "doc_items_refs": ["#/texts/356"], "page_nos": [], "uuid": "55c30080-c2f0-4a60-ab74-30742b4d1235"}
{"doc_id": "2025__Comparison_of_two_preprocessing_methods_for_18F-Flortaucipir_PET_quantification___W4412521606", "source_path": "<redacted:source_path>", "chunk_id": 25, "source_chunk_idxs": [38], "num_tokens": 495, "text": "Comparison of two preprocessing methods for 18 F-Flortaucipir PET quantification in Alzheimer's disease\nAuthor information\nAuthors and Affiliations\n1. Laboratory of Neuroimaging and Innovative Molecular Tracers (NIMTlab), Geneva University Neurocentre and Faculty of Medicine, University of Geneva, 1205, Geneva, Switzerland Elif Harput, Debora Elisa Peretti, Valentina Garibotto &amp; Cecilia Boccalini\n2. Division of Radiology, Geneva University Hospitals, Geneva, Switzerland Max Scheffler\n3. Department of Psychiatry and Neurochemistry, Institute of Neuroscience and Physiology, the Sahlgrenska Academy at the University of Gothenburg, Mölndal, Sweden Nicholas J. Ashton, Kaj Blennow &amp; Henrik Zetterberg\n4. Banner Alzheimer's Institute and University of Arizona, Phoenix, AZ, USA Nicholas J. Ashton\n5. Banner Sun Health Research Institute, Sun City, AZ, 85351, USA Nicholas J. Ashton\n6. Centre for Age-Related Medicine, Stavanger University Hospital, Stavanger, Norway Nicholas J. Ashton\n7. Clinical Neurochemistry Laboratory, Sahlgrenska University Hospital, Mölndal, Sweden Kaj Blennow &amp; Henrik Zetterberg\n8. Paris Brain Institute, ICM, Pitié-Salpêtrière Hospital, Sorbonne University, Paris, France Kaj Blennow\n9. Neurodegenerative Disorder Research Center, Division of Life Sciences and Medicine, and Department of Neurology, Institute On Aging and Brain Disorders, University of Science and Technology of China and First Affiliated Hospital of USTC, Hefei, People's Republic of China Kaj Blennow\n10. Department of Neurodegenerative Disease, UCL Institute of Neurology, Queen Square, London, UK Henrik Zetterberg\n11. UK Dementia Research Institute at UCL, London, UK Henrik Zetterberg\n12. Hong Kong Center for Neurodegenerative Diseases, Clear Water Bay, Hong Kong, China Henrik Zetterberg\n13. Wisconsin Alzheimer's Disease Research Center, University of Wisconsin School of Medicine and Public Health, University of Wisconsin-Madison, Madison, WI, USA Henrik Zetterberg\n14. Clinical Memory Research Unit, Lund University, Lund, Sweden Ruben Smith\n15. Memory Clinic, Skåne University Hospital, Malmö, Sweden Ruben Smith", "doc_items_refs": ["#/texts/359", "#/texts/360", "#/texts/361", "#/texts/362", "#/texts/363", "#/texts/364", "#/texts/365", "#/texts/366", "#/texts/367", "#/texts/368", "#/texts/369", "#/texts/370", "#/texts/371", "#/texts/372", "#/texts/373"], "page_nos": [], "uuid": "8ecc7a10-2612-4079-ac6e-93166810063d"}
{"doc_id": "2025__Comparison_of_two_preprocessing_methods_for_18F-Flortaucipir_PET_quantification___W4412521606", "source_path": "<redacted:source_path>", "chunk_id": 26, "source_chunk_idxs": [39], "num_tokens": 323, "text": "Comparison of two preprocessing methods for 18 F-Flortaucipir PET quantification in Alzheimer's disease\nAuthor information\nAuthors and Affiliations\n16. Geneva Memory Centre, Department of Rehabilitation and Geriatrics, Geneva University Hospitals, 1205, Geneva, Switzerland Giovanni B. Frisoni\n17. Laboratory of Neuroimaging of Aging (LANVIE), University of Geneva, 1205, Geneva, Switzerland Giovanni B. Frisoni\n18. Division of Nuclear Medicine and Molecular Imaging, Geneva University Hospitals, 1205, Geneva, Switzerland Valentina Garibotto\n19. CIBM, Centre for Biomedical Imaging, University of Geneva, 1205, Geneva, Switzerland Valentina Garibotto\nAuthors\n1. Elif Harput\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n2. Debora Elisa Peretti\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n3. Max Scheffler\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n4. Nicholas J. Ashton\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n5. Kaj Blennow\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n6. Henrik Zetterberg\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n7. Ruben Smith\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n8. Giovanni B. Frisoni\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n9. Valentina Garibotto\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n10. Cecilia Boccalini\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar", "doc_items_refs": ["#/texts/374", "#/texts/375", "#/texts/376", "#/texts/377", "#/texts/378", "#/texts/379", "#/texts/380", "#/texts/381", "#/texts/382", "#/texts/383", "#/texts/384", "#/texts/385", "#/texts/386", "#/texts/387", "#/texts/388"], "page_nos": [], "uuid": "e0e612c0-33c3-4408-bee4-f1fd86a672df"}
{"doc_id": "2025__Comparison_of_two_preprocessing_methods_for_18F-Flortaucipir_PET_quantification___W4412521606", "source_path": "<redacted:source_path>", "chunk_id": 27, "source_chunk_idxs": [40, 41, 42], "num_tokens": 256, "text": "Comparison of two preprocessing methods for 18 F-Flortaucipir PET quantification in Alzheimer's disease\nAuthor information\nContributions\nEH, CB and VG were responsible for the study concept and design. EH was responsible for drafting the original report, which was reviewed by all co-authors. VG was responsible for PET image acquisition. MS was responsible for MRI image acquisition. NJA, HZ, KB and RS were responsible for the biochemical analyses. EH, CB and DEP were responsible for all neuroimaging and statistical analyses. GBF was responsible for subject inclusion and clinical data acquisition. EH and CB were responsible for the interpretation of data.\n\nComparison of two preprocessing methods for 18 F-Flortaucipir PET quantification in Alzheimer's disease\nAuthor information\nCorresponding author\nCorrespondence to\nCecilia Boccalini\n.\n\nComparison of two preprocessing methods for 18 F-Flortaucipir PET quantification in Alzheimer's disease\nEthics declarations\nConsent to participate\nThe local Ethics Committee approved the imaging studies, which have been conducted under the principles of the Declaration of Helsinki and the International Conference on Harmonization Good Clinical Practice. Each subject or their relatives provided voluntary written informed consent to participate in the studies.", "doc_items_refs": ["#/texts/390", "#/texts/392", "#/texts/393", "#/texts/394", "#/texts/397"], "page_nos": [], "uuid": "73a58418-95cc-482a-bae3-3dbb9245d91a"}
{"doc_id": "2025__Comparison_of_two_preprocessing_methods_for_18F-Flortaucipir_PET_quantification___W4412521606", "source_path": "<redacted:source_path>", "chunk_id": 28, "source_chunk_idxs": [43], "num_tokens": 501, "text": "Comparison of two preprocessing methods for 18 F-Flortaucipir PET quantification in Alzheimer's disease\nEthics declarations\nCompeting interests\nVG received research support and speaker fees through her institution from Healthcare, Siemens Healthineers, Novo Nordisk. Janssen and Novartis. GBF has received support, payment, consulting fees, or honoraria through his institution for lectures, presentations, speaker bureaus, manuscript writing, or educations events from: Biogen, Roche, Diadem, Novo Nordisk, GE Healthcare, OM Pharma, and Eisai. GA has served at scientific advisory boards and consultants for Roche and Lilly and received honoraria for lectures from Lilly and Schwabe Pharma. HZ has served at scientific advisory boards and/ or as a consultant for Abbvie, Acumen, Alector, Alzinova, ALZPath, Amylyx, Annexon, Apellis, Artery Therapeutics, AZTherapies, Cognito Therapeutics, CogRx, Denali, Eisai, LabCorp, Merry Life, Nervgen, Novo Nordisk, Optoceutics, Passage Bio, Pinteon Therapeutics, Prothena, Red Abbey Labs, reMYND, Roche, Samumed, Siemens Healthineers, Triplet Therapeutics, and Wave, has given lectures in symposia sponsored by Alzecure, Biogen, Cellectricon, Fujirebio, Lilly, Novo Nordisk, and Roche, and is a co-founder of Brain Biomarker Solutions in Gothenburg AB (BBS), which is a part of the GU Ventures Incubator Program (outside submitted work). KB has served as a consultant and at advisory boards for Acumen, ALZPath, BioArctic, Biogen, Eisai, Julius Clinical, Lilly, Novartis, Ono Pharma, Prothena, Roche Diagnostics, and Siemens Healthineers; has served at data monitoring committees for Julius Clinical and Novartis; has given lectures, produced educational materials, and participated in educational programs for Biogen, Eisai, and Roche Diagnostics; and is a co-founder of Brain Biomarker Solutions in Gothenburg AB (BBS), which is a part of the GU Ventures Incubator Program, outside the work presented in this article. The other authors have no conflicts of interest to disclose.", "doc_items_refs": ["#/texts/399"], "page_nos": [], "uuid": "5df35b29-2410-4b0b-81b8-124e94124897"}
{"doc_id": "2025__Comparison_of_two_preprocessing_methods_for_18F-Flortaucipir_PET_quantification___W4412521606", "source_path": "<redacted:source_path>", "chunk_id": 29, "source_chunk_idxs": [44, 45, 46], "num_tokens": 297, "text": "Comparison of two preprocessing methods for 18 F-Flortaucipir PET quantification in Alzheimer's disease\nAdditional information\nPublisher's Note\nSpringer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations.\n\nComparison of two preprocessing methods for 18 F-Flortaucipir PET quantification in Alzheimer's disease\nSupplementary Information\nBelow is the link to the electronic supplementary material.\n\nComparison of two preprocessing methods for 18 F-Flortaucipir PET quantification in Alzheimer's disease\nRights and permissions\nOpen Access\nThis article is licensed under a Creative Commons Attribution 4.0 International License, which permits use, sharing, adaptation, distribution and reproduction in any medium or format, as long as you give appropriate credit to the original author(s) and the source, provide a link to the Creative Commons licence, and indicate if changes were made. The images or other third party material in this article are included in the article's Creative Commons licence, unless indicated otherwise in a credit line to the material. If material is not included in the article's Creative Commons licence and your intended use is not permitted by statutory regulation or exceeds the permitted use, you will need to obtain permission directly from the copyright holder. To view a copy of this licence, visit\nhttp://creativecommons.org/licenses/by/4.0/\n.\nReprints and permissions", "doc_items_refs": ["#/texts/402", "#/texts/404", "#/texts/407", "#/texts/408", "#/texts/409", "#/texts/410", "#/texts/411"], "page_nos": [], "uuid": "7c489be0-befc-48bc-b5df-ce4ff8b97dca"}
{"doc_id": "2025__Comparison_of_two_preprocessing_methods_for_18F-Flortaucipir_PET_quantification___W4412521606", "source_path": "<redacted:source_path>", "chunk_id": 30, "source_chunk_idxs": [47, 48, 49], "num_tokens": 282, "text": "Comparison of two preprocessing methods for 18 F-Flortaucipir PET quantification in Alzheimer's disease\nAbout this article\nCite this article\nHarput, E., Peretti, D.E., Scheffler, M.\net al.\nComparison of two preprocessing methods for\n18\nF-Flortaucipir PET quantification in Alzheimer's disease.\nEur J Nucl Med Mol Imaging\n(2025). https://doi.org/10.1007/s00259-025-07452-3\nDownload citation\n- Received : 09 May 2025\n- Accepted : 30 June 2025\n- Published : 19 July 2025\n- DOI : https://doi.org/10.1007/s00259-025-07452-3\n\nComparison of two preprocessing methods for 18 F-Flortaucipir PET quantification in Alzheimer's disease\nAbout this article\nKeywords\n- Tau-PET\n- Semi-quantification\n- Reference space\n- Alzheimer's disease\n\nComparison of two preprocessing methods for 18 F-Flortaucipir PET quantification in Alzheimer's disease\nAbout this article\nProfiles\n1. Cecilia Boccalini\nView author profile\nUse our pre-submission checklist\nAvoid common mistakes on your manuscript.\nAdvertisement", "doc_items_refs": ["#/texts/414", "#/texts/415", "#/texts/416", "#/texts/417", "#/texts/418", "#/texts/419", "#/texts/420", "#/texts/421", "#/texts/422", "#/texts/423", "#/texts/424", "#/texts/425", "#/texts/427", "#/texts/428", "#/texts/429", "#/texts/430", "#/texts/432", "#/texts/433", "#/texts/434", "#/texts/435"], "page_nos": [], "uuid": "647fc810-325a-47ea-8c38-550db0ffc27c"}
{"doc_id": "2025__Comparison_of_two_preprocessing_methods_for_18F-Flortaucipir_PET_quantification___W4412521606", "source_path": "<redacted:source_path>", "chunk_id": 31, "source_chunk_idxs": [50, 51, 52, 53, 54, 55], "num_tokens": 306, "text": "Comparison of two preprocessing methods for 18 F-Flortaucipir PET quantification in Alzheimer's disease\nSearch\nSearch by keyword or author\nSearch\n\nComparison of two preprocessing methods for 18 F-Flortaucipir PET quantification in Alzheimer's disease\nNavigation\n- Find a journal\n- Publish with us\n- Track your research\n\nComparison of two preprocessing methods for 18 F-Flortaucipir PET quantification in Alzheimer's disease\nNavigation\nDiscover content\n- Journals A-Z\n- Books A-Z\n\nComparison of two preprocessing methods for 18 F-Flortaucipir PET quantification in Alzheimer's disease\nNavigation\nPublish with us\n- Journal finder\n- Publish your research\n- Language editing\n- Open access publishing\n\nComparison of two preprocessing methods for 18 F-Flortaucipir PET quantification in Alzheimer's disease\nNavigation\nProducts and services\n- Our products\n- Librarians\n- Societies\n- Partners and advertisers\n\nComparison of two preprocessing methods for 18 F-Flortaucipir PET quantification in Alzheimer's disease\nNavigation\nOur brands\n- Springer\n- Nature Portfolio\n- BMC\n- Palgrave Macmillan\n- Apress\n- Discover\n- Your privacy choices/Manage cookies\n- Your US state privacy rights\n- Accessibility statement\n- Terms and conditions\n- Privacy policy\n- Help and support\n- Legal notice\n- Cancel contracts here\n173.68.96.214\nNot affiliated\nImage Hyperlink.\n© 2025 Springer Nature", "doc_items_refs": ["#/texts/437", "#/texts/438", "#/texts/440", "#/texts/441", "#/texts/442", "#/texts/444", "#/texts/445", "#/texts/447", "#/texts/448", "#/texts/449", "#/texts/450", "#/texts/452", "#/texts/453", "#/texts/454", "#/texts/455", "#/texts/457", "#/texts/458", "#/texts/459", "#/texts/460", "#/texts/461", "#/texts/462", "#/texts/463", "#/texts/464", "#/texts/465", "#/texts/466", "#/texts/467", "#/texts/468", "#/texts/469", "#/texts/470", "#/texts/471", "#/texts/472", "#/texts/473", "#/texts/474"], "page_nos": [], "uuid": "f9379d51-139f-4838-b4e1-1749c739bfd1"}
