{"doc_id": "2025__Machine_Learning_multiclassification_for_stage_diagnosis_of_Alzheimers_disease_u__W4411231219", "source_path": "<redacted:source_path>", "chunk_id": 0, "source_chunk_idxs": [0, 1, 2], "num_tokens": 384, "text": "'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion | Discover Applied Sciences\nSkip to main content\nAdvertisement\nLog in\nMenu\nFind a journal\nPublish with us\nTrack your research\nSearch\nCart\n1. Home\n2. Discover Applied Sciences\n3. Article\n\n'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\n- Research\n- Open access\n- Published: 12 June 2025\n- Volume 7 , article number 636 , ( 2025 )\n- Cite this article\nDownload PDF\nYou have full access to this\nopen access\narticle\nDiscover Applied Sciences\nAims and scope\nSubmit manuscript\n'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\nDownload PDF\n- Manash Sarma\nORCID: orcid.org/0000-0003-0020-0363\n1\n&amp;\n- Subarna Chatterjee\n1\n- 692 Accesses\n- Explore all metrics\n\n'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\nAbstract\nObjective\nThe present study explores the classification of Alzheimer's disease (AD) stages, encompassing cognitive normalcy, Mild Cognitive Impairment (MCI), and AD/Dementia, through the application of Machine Learning (ML) multiclassification algorithms. This investigation utilizes blood gene expression datasets obtained from participants in the Alzheimer's Disease Neuroimaging Initiative (ADNI) and the National Center for Biotechnology Information (NCBI). Three blood gene expression datasets of high dimensionality and low sample size (HDLSS) have been utilized in this study, with one dataset exhibiting significant class imbalance. This study integrates clinical data from electronic health records (EHRs) with gene expression datasets, which has been found to significantly enhance the accuracy of stage diagnosis.", "doc_items_refs": ["#/texts/1", "#/texts/2", "#/texts/3", "#/texts/4", "#/texts/5", "#/texts/6", "#/texts/7", "#/texts/8", "#/texts/9", "#/texts/10", "#/texts/11", "#/texts/12", "#/texts/14", "#/texts/15", "#/texts/16", "#/texts/17", "#/texts/18", "#/texts/19", "#/texts/20", "#/texts/21", "#/texts/22", "#/texts/23", "#/texts/24", "#/texts/25", "#/texts/26", "#/texts/27", "#/texts/28", "#/texts/29", "#/texts/30", "#/texts/31", "#/texts/34"], "page_nos": [], "uuid": "e677b465-6709-43f0-bb25-e6470699a886"}
{"doc_id": "2025__Machine_Learning_multiclassification_for_stage_diagnosis_of_Alzheimers_disease_u__W4411231219", "source_path": "<redacted:source_path>", "chunk_id": 1, "source_chunk_idxs": [3], "num_tokens": 241, "text": "'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\nAbstract\nMethods\nA combination of XGBoost and SFBS (\"sequential floating backward selection\") methods is utilized to select features. Our research identified a subset of 95 gene transcripts exhibiting optimal efficacy from an extensive collection of over 49,000 transcripts within the ADNI gene expression dataset. Furthermore, our analysis of two integrated NCBI datasets revealed 125 gene transcripts demonstrating superior effectiveness among more than 30,000 potential candidates. These findings resulted in the development of two distinct model categories: one derived from the ADNI dataset and the other from the integrated NCBI dataset. DL classifier is used for developing models of both categories while GB (Gradient Boost), SVM (Support Vector Machine) classifier based models are built to identify AD stages from NCBI participants. Because of high data imbalance in genomic data, border line oversampling is explored for model training and original data for validation. We have conducted a multimodal analysis and stage classification by integrating the ADNI gene expression and clinical datasets using 'Feature-Level Fusion'.", "doc_items_refs": ["#/texts/36"], "page_nos": [], "uuid": "94a7d6af-0005-40d6-a61d-656f87de93a3"}
{"doc_id": "2025__Machine_Learning_multiclassification_for_stage_diagnosis_of_Alzheimers_disease_u__W4411231219", "source_path": "<redacted:source_path>", "chunk_id": 2, "source_chunk_idxs": [4], "num_tokens": 312, "text": "'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\nAbstract\nResult\nIn the case of ADNI study participants, we obtained best multi-classification performance with 'ROC AUC' scores of 0. 76, 0.76, 0.71 for the CN, MCI, and Dementia stages, respectively. We achieved F1 scores of 0.71, 0.77, 0.53 for these same categories. For the NCBI-based model, the best AUC scores of 0.82, 0.74, and 0.79 (for CN, MCI, and AD, respectively) and F1 scores of 0.75, 0.60, and 0.77 were attained when evaluated using GSE3060 test data. When assessed with GSE3061 test data, the model achieved optimal AUC scores of 0.81, 0.75, and 0.78, and F1 scores of 0.74, 0.67, and 0.73.This research identified MAPK14, MID1, TEP1, PLG, DRAXIN, USP47 as genes associated with AD. In the context of ADNI data, the integration of clinical data with gene expression data led to an enhancement of the best F1 scores to 0.85, 0.86, and 0.83 for CN, MCI, and AD, respectively. Additionally, the ROC AUC scores were improved to 0.90, 0.85, and 0.89.", "doc_items_refs": ["#/texts/38"], "page_nos": [], "uuid": "035e2832-b403-48f0-b72d-0d56d8b5a817"}
{"doc_id": "2025__Machine_Learning_multiclassification_for_stage_diagnosis_of_Alzheimers_disease_u__W4411231219", "source_path": "<redacted:source_path>", "chunk_id": 3, "source_chunk_idxs": [5, 6], "num_tokens": 357, "text": "'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\nAbstract\nConclusion\nUsing machine learning multiclassification techniques on blood gene expression profile data from ADNI and NCBI, we achieved the most promising results to date for diagnosing multiple stages of Alzheimer's disease. This proves that the efficacy of our feature selection techniques that could find essential genes associated with AD. Highly accurate of diagnosis of stages that include MCI from genetic data can potentially provide timely alert for individuals susceptible/predisposed to AD.\n\n'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\nArticle Highlights\nIn this work, we have several key contributions at broad level:\n- Contemporary research predominantly emphasizes the distinction between Alzheimer's disease (AD) and non-AD conditions. In contrast, our investigation explores multi-stage diagnosis, encompassing mild cognitive impairment (MCI) stage, through the analysis of genetic data. This would potentially facilitate identification of individuals susceptible to AD much early.\n- The present investigation incorporates three extensively recognized, credible, and well-established genetic datasets. The two-phase feature selection method resulted in improved diagnostic accuracy for different AD stages. Our novel application of data augmentation, enhanced the performance in identification of minority class.\n- The novel feature selection technique, in conjunction with the SHAP (SHapley Additive exPlanations) tool, facilitates the identification of new genes associated with Alzheimer's disease.\n- The biological significance of the key genes identified in relation to Alzheimer's disease is mentioned.\n- We could enhance multiclassification classification performance by 'Feature-Level Fusion' of clinical data with gene expression data.\n- We have applied Wilcox signed rank Test for model comparison.", "doc_items_refs": ["#/texts/40", "#/texts/42", "#/texts/43", "#/texts/44", "#/texts/45", "#/texts/46", "#/texts/47", "#/texts/48"], "page_nos": [], "uuid": "6b0ad123-bfe8-40f2-ae81-c5d79487bb2c"}
{"doc_id": "2025__Machine_Learning_multiclassification_for_stage_diagnosis_of_Alzheimers_disease_u__W4411231219", "source_path": "<redacted:source_path>", "chunk_id": 4, "source_chunk_idxs": [7, 8, 9, 10], "num_tokens": 245, "text": "'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\nArticle Highlights\nUnraveling the genetic architecture of blood unfolded p-53 among non-demented elderlies: novel candidate genes for early Alzheimer's disease\nArticle\nOpen access\n03 May 2024\n\n'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\nArticle Highlights\nClassification and Diagnosis of Alzheimer's Disease from ADNI Dataset Using RBM Classifier\nChapter\n© 2022\n\n'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\nArticle Highlights\nXGBoost-SHAP-based interpretable diagnostic framework for alzheimer's disease\nArticle\nOpen access\n25 July 2023\n\n'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\nArticle Highlights\nExplore related subjects\nDiscover the latest articles, books and news in related subjects, suggested using machine learning.\n- Gene Expression\n- Gene Expression Analysis\n- Gene expression profiling\n- Genome-wide analysis of gene expression\n- Transcriptomics\n- Bioinformatics\nUse our pre-submission checklist\nAvoid common mistakes on your manuscript.", "doc_items_refs": ["#/texts/51", "#/texts/52", "#/texts/53", "#/texts/55", "#/texts/56", "#/texts/58", "#/texts/59", "#/texts/60", "#/texts/62", "#/texts/63", "#/texts/64", "#/texts/65", "#/texts/66", "#/texts/67", "#/texts/68", "#/texts/69", "#/texts/70"], "page_nos": [], "uuid": "4496f678-5e64-4c77-8ba6-9652af1d5131"}
{"doc_id": "2025__Machine_Learning_multiclassification_for_stage_diagnosis_of_Alzheimers_disease_u__W4411231219", "source_path": "<redacted:source_path>", "chunk_id": 5, "source_chunk_idxs": [11], "num_tokens": 291, "text": "'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\n1 Introduction\nAn AD diagnosed person develops amyloid plaque, tau, neurofibrillary in brain. There is loss of connection between the neurons of the brain. Hippocampus is the likely pace where the problem seems to start. But as the neurons die, subsequently other brain parts also get affected. This leads to problems like short-term memory loss in the initial stages. Then happens progressive problems with loss of short-term memory initially. Next, a decline happens in other cognitive faculties followed by behavioural issues. Broadly 3 stages are defined for the progression of this disease. They are CN, MCI and AD. \"MCI is attractive because it represents a transitional state between normal aging and dementia\" [\n1\n]. Vast majority of people of age 65 years or above are generally prone to AD [\n2\n]. As expectancy of life of people is increasing, AD patient count is also increasing all over the world.\nNo major cure of AD is established till date [\n3\n]. There is tremendous progress in analysis of brain, brain functions, its changes in MCI and AD stages with the clinical applications of MRI (magnetic resonance imaging) and PET (positron emission tomography) have led to tremendous development in brain analysis, understanding brain function and its changes in MCI and AD stages [\n4\n,\n5\n].", "doc_items_refs": ["#/texts/72", "#/texts/73", "#/texts/74", "#/texts/75", "#/texts/76", "#/texts/77", "#/texts/78", "#/texts/79", "#/texts/80", "#/texts/81", "#/texts/82", "#/texts/83"], "page_nos": [], "uuid": "595ac6e1-cec0-4365-bb7d-8a33a9c59885"}
{"doc_id": "2025__Machine_Learning_multiclassification_for_stage_diagnosis_of_Alzheimers_disease_u__W4411231219", "source_path": "<redacted:source_path>", "chunk_id": 6, "source_chunk_idxs": [12], "num_tokens": 407, "text": "'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\n1 Introduction\nAlternative methodologies, such as the analysis of mitochondrial dysfunction, genomic data analysis for AD diagnosis, may prove beneficial. Mitochondrial dysfunction, characterized by the impairment of mitochondrial function and consequent reduction in cellular energy production, is increasingly recognized as a potential therapeutic target for the treatment of Alzheimer's Disease [\n6\n]. Genetic analysis can predict AD risk in an individual much earlier than clinical symptoms of AD appear. Genetic factors play a major role in 80% AD cases [\n7\n]. 'Genome Wide Association Studies' (GWAS) is able to discover some AD candidate genes. However, GWAS have majorly failed to produce AD candidate genes with reliability. Thousands of genes are considered as potential AD risk factors [\n8\n,\n9\n]. But GWAS only discovers genes that are associated with some phenotypes and fail to address the genes functionality causing AD [\n10\n]. Gene expression provides the opportunity to biochemical pathway analysis, regulatory mechanisms and cellular functions to find the key AD and MCI genes. Some research utilised gene expression values from brain tissues from biopsy or autopsy-based samples [\n11\n,\n12\n]. However, various difficulties are involved with such autopsy samples for analysis. But brain dynamics, changes are also expressed in blood and large portion of gene expression in body is also found in PBMCs (Peripheral Blood Mononuclear Cells) [\n13\n]. Amyloid precursor protein expression, oxidative damage in RNA and DNA of AD brain tissue are reflected in peripheral blood and as well [\n14\n]. So, blood gene expression is getting attention as an appropriate method and diagnose AD and MCI [\n15\n,\n16\n].\nWith availability of biomarker datasets in public space, Machine learning (ML) is becoming a major support in diagnosis of a disease and the stage. ML is now widely used in disease diagnosis with increasing availability of AD datasets.", "doc_items_refs": ["#/texts/84", "#/texts/85", "#/texts/86", "#/texts/87", "#/texts/88", "#/texts/89", "#/texts/90", "#/texts/91", "#/texts/92", "#/texts/93", "#/texts/94", "#/texts/95", "#/texts/96", "#/texts/97", "#/texts/98", "#/texts/99", "#/texts/100", "#/texts/101", "#/texts/102", "#/texts/103", "#/texts/104", "#/texts/105", "#/texts/106", "#/texts/107"], "page_nos": [], "uuid": "60a7a4f5-c6ab-4bab-b3fa-3fc74367dee8"}
{"doc_id": "2025__Machine_Learning_multiclassification_for_stage_diagnosis_of_Alzheimers_disease_u__W4411231219", "source_path": "<redacted:source_path>", "chunk_id": 7, "source_chunk_idxs": [13], "num_tokens": 326, "text": "'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\n1 Introduction\nNumerous previous studies have utilized machine learning techniques for Alzheimer's disease diagnosis. Primary issues in the earlier research were lack of sufficient and authentic data samples and less accuracy in achieving performance [\n17\n]. Some AD research is done with gene expression data from human brain with good accuracy achieved. Our research focus is on AD stage diagnosis with gene expression data in a non-invasive way where gene expression samples from human blood suits our research focus. So we restricted our existing literature study to AD diagnosis with gene expression. Some important AD research with blood genome expression data has been already done using ML techniques [\n11\n,\n15\n,\n16\n,\n18\n,\n19\n,\n20\n,\n21\n]. We have reviewed earlier research papers on use of blood gene expression data for Alzheimer disease diagnosis and listed some recent studies [2017-2024] in Table\n12\nfor identification of AD from gene expression data. NCBI and ADNI datasets have been extensively employed in Alzheimer's disease (AD) diagnosis research, utilizing statistical approaches, machine learning techniques, and deep neural networks. Considerable research on AD has been conducted using genome expression data and machine learning methodologies. Huang et al. [\n22\n] introduced an SVM-based technique for classifying AD genes from human brain gene network data and whole-genome gene expression. This method achieved 84.56% accuracy and 94% ROC in categorizing AD candidate genes, offering an alternative approach to identifying AD-associated genes from over 20,000 genes on a genome-wide scale.", "doc_items_refs": ["#/texts/108", "#/texts/109", "#/texts/110", "#/texts/111", "#/texts/112", "#/texts/113", "#/texts/114", "#/texts/115", "#/texts/116", "#/texts/117", "#/texts/118", "#/texts/119", "#/texts/120", "#/texts/121", "#/texts/122", "#/texts/123", "#/texts/124", "#/texts/125", "#/texts/126", "#/texts/127", "#/texts/128"], "page_nos": [], "uuid": "e4afa5f4-a022-4407-a0b8-783a14710b8c"}
{"doc_id": "2025__Machine_Learning_multiclassification_for_stage_diagnosis_of_Alzheimers_disease_u__W4411231219", "source_path": "<redacted:source_path>", "chunk_id": 8, "source_chunk_idxs": [14], "num_tokens": 288, "text": "'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\n1 Introduction\nIn their study, Lee and Lee identified AD-related genes using DEGs, TF database, gene connectivity network data, and CFG from blood gene expression data [\n11\n]. They developed ML models using LR, L1-LR, SVM, RF, and DNN based on AD-related gene expression data. The study yielded the highest average AUC values of 0.657 for ADNI, 0.874 for ANMI, and 0.804 for ANM2 dataset with fivefold cross-validation. These outcomes indicate that blood sample gene expression data can effectively predict AD stages. However, the significant data imbalance in ADNI, where the minority dementia sample size was considerably smaller than the other two categories, resulted in a low AUC score. Moreover, despite the datasets containing three labels, including the MCI stage, multiclassification was not explored. Park et al. [\n20\n] developed a DL-based model for AD classification using integrated large-scale DNA methylation and gene expression data to create multi-omics datasets. Their model attained an accuracy of 0.823, outperforming single omics datasets. However, the multi-omics dataset was not derived from the same sample group.", "doc_items_refs": ["#/texts/129", "#/texts/130", "#/texts/131", "#/texts/132", "#/texts/133"], "page_nos": [], "uuid": "349c37d7-20dd-4e53-9e68-5879e9e951c5"}
{"doc_id": "2025__Machine_Learning_multiclassification_for_stage_diagnosis_of_Alzheimers_disease_u__W4411231219", "source_path": "<redacted:source_path>", "chunk_id": 9, "source_chunk_idxs": [15], "num_tokens": 394, "text": "'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\n1 Introduction\nRecent research has focused on disease diagnosis utilizing multimodal data, including genetic and clinical information. Enhancing genomic results with clinical data is crucial because it allows for a more comprehensive understanding of a patient's health condition by combining genetic information with their medical history, symptoms, and other relevant clinical factors, leading to more accurate diagnoses. Linking genomic data with relevant clinical information from EHRs through standardized data formats and identifiers facilitates joint analysis. AlMansoori et al. [\n23\n] created a multimodal machine learning method to differentiate between CN and MCI/AD cases. By combining gene expression profiles, clinical data, and SNP data using MI feature selection from 623 ADNI participants, they achieved an AUC performance of 0.95 in binary classification. However, when using gene expression data alone, the AUC performance decreased to 0.65. It is observed that, performance output of some of the earlier research is promising with AUC score around 80% when balanced dataset GEO datasets are used for model training/test. However, results are not promising when train and test dataset is ADNI. The score is far less when compared with other results. Primary reason for this low score is that multiple challenges are associated with ADNI gene expression data. ADNI gene expression data is of 'HDLSS' in nature [\n24\n]. It has 49,386 gene probes/gene transcripts (or features), has only 744 samples and is imbalanced as well as reflected in Table\n1\n. So, when the model is constructed and validated with same ADNI data, performance is low. The authors have worked with novel feature selection and modelling approach, however they have ignored the fact that low sample size and inherent data imbalance impact the learning of the model.", "doc_items_refs": ["#/texts/134", "#/texts/135", "#/texts/136", "#/texts/137", "#/texts/138", "#/texts/139", "#/texts/140"], "page_nos": [], "uuid": "6c2a415d-b5b9-43b1-a98b-b86f99edbd90"}
{"doc_id": "2025__Machine_Learning_multiclassification_for_stage_diagnosis_of_Alzheimers_disease_u__W4411231219", "source_path": "<redacted:source_path>", "chunk_id": 10, "source_chunk_idxs": [16], "num_tokens": 235, "text": "'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\n1 Introduction\nIn this study, we performed a multi-stage diagnosis of Alzheimer's disease (AD) stages using gene expression data from the Alzheimer's Disease Neuroimaging Initiative (ADNI) and the National Center for Biotechnology Information (NCBI) followed by multimodal analysis of ADNI gene expression and clinical data with feature level integration to achieve a comprehensive analysis. In our experiment, we treated the ADNI and the two NCBI datasets separately. All three datasets underwent a two-phase feature reduction process separately. Initially, features with minimal weight were removed using the GBX feature ranking method. The remaining features were further reduced with the SFBS algorithm. The final datasets, with reduced features, were analysed separately using classifiers and the SHAP tool. The classifiers applied multiclassification techniques for AD stage diagnosis, while the SHAP tool assessed the impact of each gene on the AD stages. Data augmentation technique is applied to increase the minority samples of the training samples of the classifiers.", "doc_items_refs": ["#/texts/141"], "page_nos": [], "uuid": "3a2445e6-8c0f-4142-84c7-cfea52efbe49"}
{"doc_id": "2025__Machine_Learning_multiclassification_for_stage_diagnosis_of_Alzheimers_disease_u__W4411231219", "source_path": "<redacted:source_path>", "chunk_id": 11, "source_chunk_idxs": [17], "num_tokens": 467, "text": "'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\n2 Material and methods\n2.1 Dataset selection and exploration\nOur study utilized three blood gene expression datasets for Alzheimer's disease (AD) stage diagnosis: GEO (Gene Expression Omnibus) GSE6030, GSE6031 [\n25\n], and ADNI [\n26\n]. The Gene expression profiling data from ADNI is collected from blood samples of 744 ADNI participants. The samples were collected in different ADNI phases, and the Affymetrix Human Genome (HG) U219 Array was used for expression profiling. The samples were passed through different QC processes and ultimately samples from 744 participants were chosen for further analysis. Each sample from these 744 participants consists of total 49,386 probe sets. Each sample from GSE6030 and GSE6031 consists of 38,323 and 32,049 number of gene transcripts respectively.\nObtaining stage diagnosis information for ADNI dataset participants proved difficult due to its limited availability. To derive this information, researchers utilized collection phase/date and patient ID data common to both study/clinical records and gene expression profiles. It's important to note that the subjects involved in genome expression profiling represent a subset of the overall study/clinical data participants.\nAs shown in Table\n2\n, the other two datasets GSE3060 (AddneuroMed Cohort batch 1), and GSE3061 (AddneuroMed Cohort batch 2) were obtained using different Illumina expression beadchip platforms. GSE3060 utilized the 'Illumina HumanHT-12 V3.0 expression beadchip', while GSE3061 employed the 'Illumina HumanHT-12 V4.0 expression beadchip'. The GSE3060 data is collected from 329 participants while GSE3061 is collected from 388 participants. We have not used one participant's sample from GSE3061 for unknown data. So, total NCBI samples from two datasets considered in our research is 716.\nBoth NCBI datasets have similar micro array settings. We noticed some difference in data statistics as shown in Table\n3\n.", "doc_items_refs": ["#/texts/144", "#/texts/145", "#/texts/146", "#/texts/147", "#/texts/148", "#/texts/149", "#/texts/150", "#/texts/151", "#/texts/152", "#/texts/153", "#/texts/154", "#/texts/155"], "page_nos": [], "uuid": "3ff1b2cc-89e5-4ac8-bf52-e5728c89bde8"}
{"doc_id": "2025__Machine_Learning_multiclassification_for_stage_diagnosis_of_Alzheimers_disease_u__W4411231219", "source_path": "<redacted:source_path>", "chunk_id": 12, "source_chunk_idxs": [18], "num_tokens": 372, "text": "'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\n2 Material and methods\n2.2 Feature selection method\nFor each gene expression dataset, quality controls steps have already been applied. So, we directly applied pre-processing/cleaning on the gene expression dataset. Normalization/scaling of data was done using 'MinMax' scaler. Min-Max scaling, a prevalent pre-processing technique in gene expression analysis, is particularly utilized when preparing data for machine learning models. This method can enhance both the performance and interpretability of the models [\n27\n]. After pre-processing, there were 48,158 gene transcripts or features for ADNI. There are 38,323 and 32,049 gene transcripts in NCBI gene expression datasets GSE63060 and GSE63060 respectively. This is 'curse of dimensionality' because of very high dimension [\n28\n]. It results in very high overfitting. Again, order of 30,000-50,000 leads to computational inefficiency as well. Some earlier research applied feature selection techniques like VAE (Variational Auto Encoder), LASSO, RFE (recursive feature elimination) [\n11\n,\n19\n]. For auto encoder techniques, we need to provide number of features to be minimized and selected features are in encoded representation. The VAE generates feature representations in a latent form, which cannot be directly mapped back to the original features. Consequently, the original feature names, such as the names of genes in this study, are not retained. While the LASSO method is effective for high-dimensional data, it tends to arbitrarily select one among correlated features and may not perform optimally when numerous relevant features are present. [\n29", "doc_items_refs": ["#/texts/157", "#/texts/158", "#/texts/159", "#/texts/160", "#/texts/161", "#/texts/162", "#/texts/163", "#/texts/164", "#/texts/165", "#/texts/166"], "page_nos": [], "uuid": "52194e35-0d05-4ea1-b15d-5788e0732ecd"}
{"doc_id": "2025__Machine_Learning_multiclassification_for_stage_diagnosis_of_Alzheimers_disease_u__W4411231219", "source_path": "<redacted:source_path>", "chunk_id": 13, "source_chunk_idxs": [19], "num_tokens": 486, "text": "'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\n2 Material and methods\n2.2 Feature selection method\n]. Sequential floating backward selection (SFBS) starts with all features, iteratively removes the worst-performing feature, and then re-evaluates the remaining features, potentially adding back a previously removed feature if it improves performance. This \"floating\" aspect, where features can be added or removed, makes it potentially superior to methods like LASSO or VAE, which are less flexible in their feature selection process. So, it is a superior feature selection technique that has the potential to identify a more optimal subset of features compared to the Least Absolute Shrinkage and Selection Operator (LASSO), particularly when addressing complex interrelationships among features. Nevertheless, it is computationally intensive, especially when applied to high-dimensional data like gene expression. XGBoost is capable of calculating feature importance using various metrics, such as gain, weight, and cover. It is highly scalable and efficient, designed to manage large datasets comprising millions or even billions of instances and features. XGBoost enables the rapid and efficient selection of a specific number of features from a comprehensive feature set, such as gene expression data, by employing the feature score. This particular set of features can be applied to SFBS, potentially yielding a more optimal subset of features that addresses complex interrelationships. Subsequently, we devise an approach for selecting crucial features that involve a two-phase process. Initially, we employ the XGBoost algorithm to compute feature scores for each attribute and rank the gene transcripts accordingly. Subsequently, we apply the SFBS algorithm to the highest-ranked gene transcripts. This dual-step method for feature selection proves more effective than alternative techniques. SFBS considers all the features combinations to get best classification score and chooses the best combination of features in an iterative way. The application of SFBS resulted in the selection of 95 features or transcript genes from the top 300 ranked transcripts identified by XGBoost in the context of ADNI gene transcripts, as illustrated in Fig.\n1\n. For NCBI datasets GSE3060 and GSE3061, the number of features selected by the SFBS are 69 and 84 out of 500 top ranked genes as shown Fig.\n3\n.\nFig. 1", "doc_items_refs": ["#/texts/167", "#/texts/168", "#/texts/169", "#/texts/170", "#/texts/171", "#/texts/172"], "page_nos": [], "uuid": "c99d35b3-5063-4188-b9a3-23adf5d80462"}
{"doc_id": "2025__Machine_Learning_multiclassification_for_stage_diagnosis_of_Alzheimers_disease_u__W4411231219", "source_path": "<redacted:source_path>", "chunk_id": 14, "source_chunk_idxs": [20], "num_tokens": 219, "text": "'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\n2 Material and methods\n2.2 Feature selection method\nAs shown in Fig.\n2\n, the graph of top 40 features, gene probe/transcript 'SCGB1D4: 11737959\\_at' is at the bottom of the graph with highest score. In shap summary plot, 'SCGB1D4:11737959\\_at' comes as most effective one followed by 'ASXL3: 11737082\\_a\\_at', are found to be 'ASXL3: 11737082\\_a\\_at', 'MAPK14: 11742204\\_a\\_at', 'TMEM30B: 11756750\\_a\\_at', 'SQLE: 11717731\\_at' (Fig.\n3\n) among others. The score graph plot lists them within top 25.\nFig. 2\nFig. 3", "doc_items_refs": ["#/texts/173", "#/texts/174", "#/texts/175", "#/texts/176", "#/texts/177", "#/texts/178", "#/texts/179"], "page_nos": [], "uuid": "0953f8bc-5c55-4165-96ce-fcc7dc79b998"}
{"doc_id": "2025__Machine_Learning_multiclassification_for_stage_diagnosis_of_Alzheimers_disease_u__W4411231219", "source_path": "<redacted:source_path>", "chunk_id": 15, "source_chunk_idxs": [21], "num_tokens": 455, "text": "'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\n2 Material and methods\n2.3 Multimodality with feature fusion\n'Feature-Level Fusion' refers to the integration of features extracted from various data sources or modalities to form a singular, robust, and comprehensive feature vector. This vector serves as an informative representation for subsequent analysis and classification [\n30\n]. We focus on two modalities of ADNI data: blood gene expression profile and clinical study datasets available on the Laboratory of Neuro Imaging (LONI) website. The 744 ADNI participants contributing to gene expression samples constitute a subset of the 2400 participants contributing to clinical study samples. 95 identified genes of ADNI gene expression data and 8 biomarkers (APOE4, PTMARRY, FDG, Hippocampus, WholeBrain, mPACCdigit, LDELTOTAL, CDRSB) of clinical study data are integrated by applying concatenation technique. The selection of eight clinical biomarkers from a total of 116 biomarkers in the ADNI clinical dataset was accomplished using the 'sequential floating backward selection' (SBSF) feature reduction technique. Prior to the application of the SBSF technique, data cleaning procedures were implemented. For non-target attributes, missing values were addressed by substituting the average value for numerical data and the 'maximum occurring value' for categorical data. In contrast, for target or label attributes, imputing null values was deemed risky, leading to the exclusion of rows with null labels. Following data cleaning and imputation, the data was normalized.\nThe dataset integration process occurs in two stages. Initially, common participants from the ADNI gene expression profile and clinical study data collection initiative were identified. Subsequently, records of these common participants were selected from the datasets. Participants contributing gene expressions are included in the clinical study data participants. Consequently, 744 records from each dataset were selected.\nfigure a\nIn the second step, a column-wise integration of the two datasets is performed, resulting in the integrated data. The integrated dataset serves as the input for the model construction, evaluation process.\nfigure b", "doc_items_refs": ["#/texts/181", "#/texts/182", "#/texts/183", "#/texts/184", "#/texts/185", "#/texts/186", "#/texts/187"], "page_nos": [], "uuid": "09b3581a-8b5a-4634-8b4b-6d3c541eddee"}
{"doc_id": "2025__Machine_Learning_multiclassification_for_stage_diagnosis_of_Alzheimers_disease_u__W4411231219", "source_path": "<redacted:source_path>", "chunk_id": 16, "source_chunk_idxs": [22], "num_tokens": 450, "text": "'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\n2 Material and methods\n2.4 Stage diagnosis model construction\nPrevious research [\n11\n] developed two NCBI-based models and one ADNI-based model after selecting common genes to validate models across datasets, such as evaluating models derived from NCBI data using ADNI data and vice versa. However, ADNI and NCBI gene expression data are collected from different micro array settings. They follow different gene naming standard. Numerous essential genes are eliminated during the selection of common genes common genes across ADNI and two NCBI datasets, thereby affecting the overall quality of the model. Therefore, this study will primarily utilize internal validation methods, eschewing external validation across the dataset.\nGiven that both NCBI datasets were collected from similar micro array settings with common gene naming standard followed, we combined the samples, resulting a total of 716 samples to construct a more generalizable model that can be independently validated with NCBI GSE3060 and GSE3061 specific test data.\nGenomic dataset is characterized by high-dimensionality, low sample size (HDLSS), and imbalanced nature. A significant class imbalance in the samples particularly in the ADNI dataset is observed in the samples. The minority class is hard to predict as there are fewer samples and so, there is less learning opportunity than that of majority samples. Most of the learning methods are biased towards the majority class, so most of the minority samples are not modelled well [\n31\n]. Though intense work happened to resolve issues with imbalanced learning, still there are many short comings [\n32\n]. No research have been done yet on classification of imbalanced gene expression data. The main problem of imbalanced classification is that because of fewer samples of minority category, the model cannot properly learn decision boundary [\n33\n]. The research methodology employed in this study involved the creation of models using two contrasting strategies: one that specifically tackled the issue of imbalanced datasets, while the other disregarded such considerations. In the result section, we have compared the result of both the approaches.", "doc_items_refs": ["#/texts/189", "#/texts/190", "#/texts/191", "#/texts/192", "#/texts/193", "#/texts/194", "#/texts/195", "#/texts/196", "#/texts/197", "#/texts/198", "#/texts/199"], "page_nos": [], "uuid": "561975c8-7a96-4714-86ff-4818cdddb57c"}
{"doc_id": "2025__Machine_Learning_multiclassification_for_stage_diagnosis_of_Alzheimers_disease_u__W4411231219", "source_path": "<redacted:source_path>", "chunk_id": 17, "source_chunk_idxs": [23], "num_tokens": 338, "text": "'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\n2 Material and methods\n2.4 Stage diagnosis model construction\n2.4.1 Multiclassification for stage diagnosis\nBoth ADNI and NCBI datasets have 3 categories corresponding to CN, MCI and AD stages of the disease. While binary classification can help identify specific disease stage like dementia/AD out of the three stages from the data, multiclassification helps identify all the stages of the disease. Many of the prior research used binary classification technique to diagnose dementia/AD from gene expression data considering MCI and CN together as belonging to non-dementia/AD category. Previous research has identified and differentiated disease stages such as CN versus AD, CN versus MCI, and MCI versus AD through binary classification. However, this approach necessitates three separate classifications, resulting in reduced data due to the exclusion of specific categories. Many researchers have favoured this binary classification due to its simplicity compared to multiclass classification. In contrast to binary classification, multiclass classification is resource-intensive and complex, particularly when the dataset is significantly imbalanced, leading to a notable decline in classification performance. Multiclass classification, which entails managing multiple categories, is inherently versatile. However, it requires the implementation of effective techniques to address class imbalance and the utilization of performance evaluation metrics such as the F1 score and AUC, rather than relying on accuracy. Given that Alzheimer's disease encompasses multiple stages, as reflected in blood gene expression biomarker data, and the objective is to diagnose these stages, a multiclassification technique has been employed.", "doc_items_refs": ["#/texts/201"], "page_nos": [], "uuid": "fba1c182-87b8-4fba-b4c1-045f603a563d"}
{"doc_id": "2025__Machine_Learning_multiclassification_for_stage_diagnosis_of_Alzheimers_disease_u__W4411231219", "source_path": "<redacted:source_path>", "chunk_id": 18, "source_chunk_idxs": [24], "num_tokens": 482, "text": "'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\n2 Material and methods\n2.4 Stage diagnosis model construction\n2.4.2 Imbalanced data handling\nAs shown in following Fig.\n4\n, there are broadly two approaches when constructing model from imbalance data. Cost-sensitive learning, ensemble learning, data weighting, resampling techniques are some of the methods used in designing classifiers from imbalanced data. However, given the limited sample size and unbalanced nature of the gene expression data, we opted for a data resampling based augmentation strategy. Compared with weighted, ensemble learning and cost-sensitive learning, oversampling/data augmentation is a better approach while dealing with severely imbalanced dataset. Oversampling/data augmentation is often a more effective and direct approach for severely imbalanced datasets, as it directly addresses the lack of minority class samples [\n29\n]. Application of oversampling for obtaining a more balanced dataset is an effective approach. Minority sample data is duplicated before fitting the model. One of the most popular method is 'Synthetic Minority Oversampling Technique', or SMOTE for short [\n34\n]. ADASYN (Adaptive Synthetic Sampling) is another method employed to tackle the issue of unbalanced datasets in machine learning, enhancing the classification accuracy for minority classes. The key distinction between ADASYN and SMOTE lies in their approach to generating synthetic samples. ADASYN creates these samples adaptively, taking into account the density distribution of minority class instances. In contrast, SMOTE produces synthetic samples by interpolating between existing minority class examples. It is found that ADASYN and SMOTE produce almost similar performance. SpringerOpen showed that SVM models performed best with ADASYN, achieving 99.67% accuracy, followed by SMOTE at 99.57% and Borderline SMOTE at 99.59% [\n35\n]. SMOTE generally performs better when the dataset has a high degree of imbalance, while ADASYN is better suited for datasets with a moderate imbalance or where the minority class is clustered tightly [\n36\n]. In research with imbalanced Ecoli datasets, SMOTE deemed to perform better than ADASYN, with a higher increase in performance [\n36", "doc_items_refs": ["#/texts/203", "#/texts/204", "#/texts/205", "#/texts/206", "#/texts/207", "#/texts/208", "#/texts/209", "#/texts/210", "#/texts/211", "#/texts/212", "#/texts/213", "#/texts/214"], "page_nos": [], "uuid": "54d5473c-cbc9-4f4b-b034-50993e403f96"}
{"doc_id": "2025__Machine_Learning_multiclassification_for_stage_diagnosis_of_Alzheimers_disease_u__W4411231219", "source_path": "<redacted:source_path>", "chunk_id": 19, "source_chunk_idxs": [25], "num_tokens": 500, "text": "'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\n2 Material and methods\n2.4 Stage diagnosis model construction\n2.4.2 Imbalanced data handling\n]. SMOTE is better than ADASYN on the basis of performance matrices such as recall, precision, F1 score in prior research and SMOTE is simple to use [\n36\n]. So, we opted for SMOTE.\nFig. 4\nThere are two popular SMOTE variants-'Tomek Links' and 'Boderline SMOTE'. Tomek Links is an under-sampling technique that removes instances from the majority class that are close to the minority class, while Borderline SMOTE is an oversampling technique where misclassified minority samples are selected for oversampling instead of blind oversampling. Random oversampling increases the likelihood of overfitting occurrence as it makes exact minority class sample copies [\n31\n]. To address this problem of overfitting, only selected samples needs to be oversampled-artificially creating additional samples of the minority class at border line can effectively augment the data. Instances that are misclassified are often ambiguous and situated near the decision boundary, where class membership may overlap. This adaptation of SMOTE is termed Borderline-SMOTE, as proposed by Han et al. in their 2005 paper titled \"Borderline-SMOTE\" [\n37\n]. Borderline-SMOTE involves selecting misclassified instances of the minority class, such as those identified by a k-nearest neighbour classification model, and generating synthetic samples that are challenging to classify. Borderline Oversampling extends SMOTE by fitting a Support Vector Machine (SVM) to the dataset and utilizing the decision boundary, as defined by the support vectors, as the basis for generating synthetic examples. This approach is predicated on the notion that the decision boundary is the region where additional minority examples are necessary. The samples at border line and the nearby ones tend to be misclassified more than the ones that are far from borderline, and so more important for classification. Due to the limited sample size of the gene expression data and to reduce risk of overfitting, the 'Borderline SMOTE' technique was selected.\nWe utilized the SMOTE-based data augmentation technique to construct all models. For comparative analysis, models based on ADNI gene expression data were developed both with and without the application of data augmentation.", "doc_items_refs": ["#/texts/215", "#/texts/216", "#/texts/217", "#/texts/218", "#/texts/219", "#/texts/220", "#/texts/221", "#/texts/222", "#/texts/223", "#/texts/224"], "page_nos": [], "uuid": "801537c3-d162-45e5-aac1-c76e291c5f7f"}
{"doc_id": "2025__Machine_Learning_multiclassification_for_stage_diagnosis_of_Alzheimers_disease_u__W4411231219", "source_path": "<redacted:source_path>", "chunk_id": 20, "source_chunk_idxs": [26], "num_tokens": 212, "text": "'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\n2 Material and methods\n2.4 Stage diagnosis model construction\n2.4.3 Classifier selection\nThis study employs deep learning, XGB and SVM classifiers for the development of two distinct categories of models-one derived from the ADNI dataset and the other from NCBI data. SVM, DL and XGBoost are different types of algorithms with distinct strengths [\n38\n]. SVM is powerful for finding optimal decision boundaries, especially in high-dimensional spaces, while XGBoost, a tree-based ensemble method excels at capturing complex patterns in the data through the combination of weak learners and can be good for imbalanced data. The machine learning research community is increasingly adopting the DL set of methods for AD diagnosis, as they often yield better results [\n39\n]. By combining data augmentation and balancing technique SMOTE, these classification algorithms are anticipated to enhance overall performance, particularly in identifying minority class samples.", "doc_items_refs": ["#/texts/226", "#/texts/227", "#/texts/228", "#/texts/229", "#/texts/230"], "page_nos": [], "uuid": "fd2270d1-4bdd-4836-9fcc-fa73b500e596"}
{"doc_id": "2025__Machine_Learning_multiclassification_for_stage_diagnosis_of_Alzheimers_disease_u__W4411231219", "source_path": "<redacted:source_path>", "chunk_id": 21, "source_chunk_idxs": [27], "num_tokens": 445, "text": "'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\n2 Material and methods\n2.4 Stage diagnosis model construction\n2.4.4 Model construction from ADNI gene expression\nIn our research, we devised two categories of models: those that integrate SMOTE and those that excludes it. The models that used SMOTE were specifically designed to address imbalanced class distributions, while the non-SMOTE models did not account for this issue. We are using k-fold cross validation technique. Cross-validation is a data resampling methodology utilized to evaluate the generalization capability of predictive models and to mitigate overfitting [\n40\n,\n41\n]. \"In k-fold cross-validation, the available learning set is partitioned into k disjoint subsets of approximately equal size. Here, fold refers to the number of resulting subsets. This partitioning is performed by randomly sampling cases from the learning set without replacement. The model is trained using k − 1 subsets, which, together, represent the training set. Then, the model is applied to the remaining subset, which is denoted as the validation set, and the performance is measured. This procedure is repeated until each of the k subsets has served as validation set\" [\n40\n]. The number of training samples is augmented by the SMOTE-based minority oversampling method where minority sample size is increased, as outlined in the preceding section. The subsequent tables present the AUC and F1 performance scores obtained from fivefold cross-validation for each model instance constructed from both biomarker categories. Figure\n5\nillustrates the SMOTE-based model construction process. The diagram demonstrates that the training data undergoes an 'oversample' step, indicating that oversampling is applied exclusively to the training dataset, not on the validation dataset. Reason is that it is necessary to do evaluation of the model with a dataset that represents the problem domain. Model evaluation with a dataset with deleted or synthesized examples would most likely provide an optimistic performance estimation [\n33\n]. In models that do not utilize SMOTE, the 'oversample' component is absent.\nFig. 5", "doc_items_refs": ["#/texts/232", "#/texts/233", "#/texts/234", "#/texts/235", "#/texts/236", "#/texts/237", "#/texts/238", "#/texts/239", "#/texts/240", "#/texts/241", "#/texts/242", "#/texts/243"], "page_nos": [], "uuid": "07ed97d7-ef8e-49eb-ae99-6c90ecf04857"}
{"doc_id": "2025__Machine_Learning_multiclassification_for_stage_diagnosis_of_Alzheimers_disease_u__W4411231219", "source_path": "<redacted:source_path>", "chunk_id": 22, "source_chunk_idxs": [28], "num_tokens": 473, "text": "'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\n2 Material and methods\n2.4 Stage diagnosis model construction\n2.4.5 Model construction from NCBI gene expression\nBased on result of SMOTE based model from ADNI gene expression, we developed only SMOTE based models that addresses imbalanced data issues. Our approach to model development differs from that used with ADNI data. In our model construction process, we combined the training datasets from both ANM1 and ANM2 data sets, then evaluated the resulting model separately with the test data from ANM1 and ANM2. Since ANM1 and ANM2 data were collected from similar microarray technical settings, the transcripts follow same gene transcript naming and data standardization, the datasets could be integrated. Integrating ANM1and ANM2 datasets, as illustrated in Fig.\n6\nhelped increase sample size and that way brought variation and diversity in the data.\nFig. 6\nNevertheless, the overall sample size was considered inadequate when using fivefold or tenfold cross-validation to generate sufficient combinations of training and testing data. So, we followed resampling based approach in place of k-fold cross validation. By employing a resampling technique, we randomly allocate 70% of the dataset for training purposes and 30% for testing in each iteration. This ensures model variations and different test data for better analysis.\nTrain and test strategies of NCBI data based models are elaborated through algorithmic steps in Fig.\n7\n. In each resampling, 70% of samples from GSE3060 and GSE3061 are integrated based on common features and then trained for model construction. The rest 30% of samples of GSE3060 (ANM1) and GSE3061 (ANM2) are separately used for testing.\nFig. 7\nThe standard parameter settings for deep learning classifier models derived from ADNI and NCBI datasets are displayed in Table\n4\n. The values of hyper-parameters were adopted from previous research [\n17\n]. The learning rate, batch size, and dropout rate were determined through grid search, while other parameters were established through heuristic experiments. Additionally, Fig.\n8\nillustrates the structure of the model.\nFig. 8", "doc_items_refs": ["#/texts/245", "#/texts/246", "#/texts/247", "#/texts/248", "#/texts/249", "#/texts/250", "#/texts/251", "#/texts/252", "#/texts/253", "#/texts/254", "#/texts/255", "#/texts/256", "#/texts/257", "#/texts/258", "#/texts/259", "#/texts/260", "#/texts/261"], "page_nos": [], "uuid": "52b49c62-8d68-4148-bdd9-24d0125c0b57"}
{"doc_id": "2025__Machine_Learning_multiclassification_for_stage_diagnosis_of_Alzheimers_disease_u__W4411231219", "source_path": "<redacted:source_path>", "chunk_id": 23, "source_chunk_idxs": [29, 30], "num_tokens": 497, "text": "'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\n2 Material and methods\n2.4 Stage diagnosis model construction\n2.4.6 Model construction from integrated ADNI data\nBased on experiments from ADNI and NCBI data, we have restricted to deep learning classifier. Similarly, we have applied SMOTE based data-augmentation on training dataset in a fivefold cross validation setup.\n\n'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\n2 Material and methods\n2.5 Test setup and strategy\nModels derived from ADNI data are evaluated using ADNI test sets, while NCBI models undergo separate testing with GSE3060 and GSE3061, utilizing 30% of the original 716 samples. As illustrated in Fig.\n7\n, in each resampling, 30% of samples from GSE3060 and GSE3061 are separately used for testing after model construction. For ADNI gene expression data models, we employ a fivefold cross-validation approach, allocating 80% of the data for training and 20% for testing in each fold. The combined GEO dataset, comprising 716 samples, is assessed using a resampling method, where 30% of samples are designated for testing and 70% for training. Our innovative strategy, depicted in Fig.\n10\n, involves isolating the test samples from GSE3060 (ANM1) and GSE3061 (ANM2) to independently evaluate NCBI-based models.\nTo evaluate NCBI models (DL, SVM, GB), we conducted a total of 10 experimental trials using test data from two datasets: GSE3060 (ANM1) and GSE3061 (ANM2). We performed five trials with each dataset, alternating between GSE3060 (ANM1) and GSE3061 (ANM2). Table\n5\nmentions number of test samples with classification information.\nIn the case of ADNI-derived information, 30 model instances are assessed using ADNI data. These models are created through fivefold cross-validation, utilizing three types of classifiers, both with and without the SMOTE technique. Regarding NCBI, 15 separate model instances undergo testing. These are produced using 5 documented model constructions, three classifier types, and exclusively employing the SMOTE technique.", "doc_items_refs": ["#/texts/263", "#/texts/265", "#/texts/266", "#/texts/267", "#/texts/268", "#/texts/269", "#/texts/270", "#/texts/271", "#/texts/272", "#/texts/273"], "page_nos": [], "uuid": "86a8d635-f05a-493b-aab4-95c703d4720d"}
{"doc_id": "2025__Machine_Learning_multiclassification_for_stage_diagnosis_of_Alzheimers_disease_u__W4411231219", "source_path": "<redacted:source_path>", "chunk_id": 24, "source_chunk_idxs": [31, 32], "num_tokens": 504, "text": "'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\n3 Result\nThis section is divided into two parts-stage diagnosis performance result and results of gene selection.\n\n'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\n3 Result\n3.1 Stage diagnosis performance\nTo assess the efficacy of our multiclassification model, we utilized the ROC AUC and F1 score as evaluation metrics. The F1 score represents the harmonic mean of precision and recall, serving as a metric that effectively balances both. Within the domains of machine learning and information retrieval, precision quantifies the accuracy of positive predictions, whereas recall assesses the model's capability to identify all relevant instances. In essence, precision emphasizes the accuracy of the model's positive predictions, while recall underscores its capacity to capture all positive cases. The Receiver Operating Characteristic (ROC) curve illustrates the True Positive Rate (sensitivity) in relation to the False Positive Rate across various classification thresholds. The Area Under the Curve (AUC) quantifies the area beneath the ROC curve, thereby encapsulating the model's overall performance. Although accuracy is a commonly used metric, it is considered inadequate for assessing model performance with imbalanced datasets [\n33\n]. Consequently, we opted not to use it. When dealing with imbalanced data, researchers have utilized various metrics. Among these, the most frequently employed approach is the receiver operating characteristics (ROC) analysis, along with the area under the ROC curve [\n42\n,\n43\n]. Other popular metrics used in imbalanced learning are based on precision and recall. F1-measure equally weights precision and recall. This variant is often used as performance metric while learning from imbalanced data [\n33\n]. For a better evaluation of the models, we have utilised cross validation and iterative resampling approach. We initially conducted several trials by temporarily adjusting the random state within the k-fold cross-validation method. Similarly, we made several trials in our iterative resampling approach. This approach was employed to control randomness, ensure the reproducibility of results, and optimize parameters, thereby facilitating the minimization of performance variations across different random states. Finally, we calculated the mean F1 and AUC scores by averaging all folds from cross-validation and iterative resampling outputs to compute the final estimate. [\n44\n].", "doc_items_refs": ["#/texts/275", "#/texts/277", "#/texts/278", "#/texts/279", "#/texts/280", "#/texts/281", "#/texts/282", "#/texts/283", "#/texts/284", "#/texts/285", "#/texts/286", "#/texts/287"], "page_nos": [], "uuid": "3768c40d-d168-4f0c-aaf4-d50f6edee3bf"}
{"doc_id": "2025__Machine_Learning_multiclassification_for_stage_diagnosis_of_Alzheimers_disease_u__W4411231219", "source_path": "<redacted:source_path>", "chunk_id": 25, "source_chunk_idxs": [33], "num_tokens": 343, "text": "'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\n3 Result\n3.1 Stage diagnosis performance\nTable\n6\npresents the AUC and F1 scores of classifiers constructed from ADNI data comparing both augmented and non-augmented data versions, utilizing SMOTE and without SMOTE. Table\n10\npresents the AUC and F1 scores classifiers constructed from NCBI data. Tables\n7\nand\n8\nillustrate mean AUC score, F1 score and confidence interval respectively for ADNI based models. Tables\n11\nand\n12\nillustrate these scores for NCBI data based models. Subsequently, Figs.\n9\nand\n10\nillustrate the ROC AUC and F1 score visualizations for the top-performing models (Fig.\n11\n; Table\n9\n).\nFig. 9\nFig. 10\nFig. 11\nUsing NCBI data, 15 distinct model instances were created. Each of these models underwent evaluation using both GSE63060 and GSE63061 test datasets, yielding a total of 30 performance results, as illustrated in Table\n10\n. Among these, the SVM model instance, when tested with GSE3060 data, achieved the highest AUC scores of 0.82, 0.74, and 0.79 for CN, MCI, and AD respectively, along with F1 scores of 0.75, 0.60, and 0.77. In contrast, the DL model instance, when tested with GSE3061 data, yielded the best AUC scores of 0.81, 0.75, and 0.78, accompanied by F1 scores of 0.74, 0.67, and 0.73 (Tables\n11\n,\n12\n,\n13\n,\n14\n).", "doc_items_refs": ["#/texts/288", "#/texts/289", "#/texts/290", "#/texts/291", "#/texts/292", "#/texts/293", "#/texts/294", "#/texts/295", "#/texts/296", "#/texts/297", "#/texts/298", "#/texts/299", "#/texts/300", "#/texts/301", "#/texts/302", "#/texts/303", "#/texts/304", "#/texts/305", "#/texts/306", "#/texts/307", "#/texts/308", "#/texts/309", "#/texts/310", "#/texts/311", "#/texts/312", "#/texts/313", "#/texts/314", "#/texts/315", "#/texts/316", "#/texts/317", "#/texts/318", "#/texts/319", "#/texts/320", "#/texts/321", "#/texts/322"], "page_nos": [], "uuid": "bf04a619-85ec-4fe6-a993-a60d222c5b80"}
{"doc_id": "2025__Machine_Learning_multiclassification_for_stage_diagnosis_of_Alzheimers_disease_u__W4411231219", "source_path": "<redacted:source_path>", "chunk_id": 26, "source_chunk_idxs": [34], "num_tokens": 492, "text": "'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\n3 Result\n3.2 AD risk gene identification\nSome of current research are using 'SHAP' explainability and feature selection tool with its visualization and other features [\n45\n]. We employ the SHAP technique on an XGBoost algorithm-based model to determine the influence of individual features or gene transcripts on the model's output for three Alzheimer's disease (AD) stages: cognitively normal (CN), mild cognitive impairment (MCI), and dementia. We have done SHAP analysis on ADNI and combined NCBI datasets. The SHAP analysis tool, when applied to datasets, generates visual outputs (Figs.\n12\n,\n13\n,\n14\n) that facilitate the interpretation of how gene transcript expression values positively or negatively influence the results-the stage classification (CN, MCI, AD) by the classifier. The XGBoost classifier model will classify outputs as CN, AD, or MCI. We consider a gene to be associated with AD risk if its expression level (either high or low) significantly influences the model to predict AD or MCI as the output. Conversely, if the gene expression has a negative impact on AD or MCI prediction, we regard it as a suppressor gene. In cases where gene expression positively affects the model's prediction of CN, we classify it as an AD suppressor gene. However, if the impact on CN prediction is negative, we categorize the gene as an AD risk factor. Through the examination of each SHAP diagram, genes were systematically classified as either contributing to Alzheimer's disease risk or acting as suppressors, with the results compiled in Table\n15\n. In Fig.\n12\n, plot at left side shows impact of each gene towards AD stage in a native. VISG4 with red colour (high feature value) is placed at negative side of the axis with high SHAP value. That indicates high expression value of VISG4 can negatively impact AD stage output. So, VISG4 is considered as suppressor gene. VISG4 is found to be indirectly inhibiting to inflammatory diseases [\n46\n] while Alzheimer's disease is linked to inflammation in the brain. Neuroinflammation, a chronic inflammatory state in the brain, is a key factor in the progression of Alzheimer's [\n47", "doc_items_refs": ["#/texts/324", "#/texts/325", "#/texts/326", "#/texts/327", "#/texts/328", "#/texts/329", "#/texts/330", "#/texts/331", "#/texts/332", "#/texts/333", "#/texts/334", "#/texts/335", "#/texts/336", "#/texts/337", "#/texts/338", "#/texts/339"], "page_nos": [], "uuid": "4b265c8e-5216-463f-8ebc-e2255cac72f5"}
{"doc_id": "2025__Machine_Learning_multiclassification_for_stage_diagnosis_of_Alzheimers_disease_u__W4411231219", "source_path": "<redacted:source_path>", "chunk_id": 27, "source_chunk_idxs": [35], "num_tokens": 196, "text": "'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\n3 Result\n3.2 AD risk gene identification\n]. Again, in the diagram, high positive SHAP value of MID1 (with red colour) on right indicates high impact to cause AD disease stage. It is found that high expression of MID1 is associated with various disease states, particularly neurodegenerative diseases disease and potentially other neurodevelopmental disorders [\n48\n,\n49\n]. Likewise, high expression value of MAPKP4 increases the risk of MCI stage as reflected in the right side of figure. Figure\n13\nis a SHAP diagram that shows impactful genes that can positively or negatively cause CN stage as output of the model. Figure\n14\nillustrates the genes that exert positive and negative influences on AD and MCI stage output, as identified in native samples from the NCBI database.\nFig. 12\nFig. 13\nFig. 14", "doc_items_refs": ["#/texts/340", "#/texts/341", "#/texts/342", "#/texts/343", "#/texts/344", "#/texts/345", "#/texts/346", "#/texts/347", "#/texts/348", "#/texts/349", "#/texts/350", "#/texts/351"], "page_nos": [], "uuid": "9b5519d4-7fce-4c62-a6be-29a662a33f7e"}
{"doc_id": "2025__Machine_Learning_multiclassification_for_stage_diagnosis_of_Alzheimers_disease_u__W4411231219", "source_path": "<redacted:source_path>", "chunk_id": 28, "source_chunk_idxs": [36], "num_tokens": 461, "text": "'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\n4 Discussion\nThe results yield several noteworthy observations: an enhancement in performance compared to previous studies, relatively suboptimal performance in identifying Alzheimer's disease (AD) stages within minority categories, the influence of data augmentation on performance, and the effects of genes on AD stages.\nPrior research predominantly concentrated on AD identification with binary classification rather than stage diagnosis and employed the area under the curve (AUC) as a performance metric, often omitting the F1 score. Our study is on multiclassification and includes F1 score as performance measurement metric. Consequently, direct comparison is not feasible. With effective feature selection technique and imbalanced data handling combination, we could find 95 effective gene transcripts/probes out of 49,386 in ADNI gene expression profile and improve earlier bench mark 'ROC AUC' score from 0.657 to 0.657 of prior research of and Al Mansoori et al. and Lee et al. respectively (as shown in Table\n16\n) in CN vs. AD binary classification to mean AUC scores 0.752, 0.696, 0.631 for CN, MCI, AD respectively in multiclassification. An increment of 10% is promising. The SVM classifier demonstrates superior performance in the context of NCBI-based models, achieving mean AUC scores of 0.814, 0.683, and 0.768.\nOur research stands out from previous studies on Alzheimer's disease that analysed blood gene expression data, as we incorporated the 'F1 score' for performance evaluation in multiclassification. Our findings indicate that the ROC AUC score for multiclassification range from 70 to 80% for both ADNI and NCBI data based models, which is on par with or surpasses the performance of binary classification methods used in previous studies for identifying AD through blood gene expression data from NCBI as well ADNI datasets. The findings suggest that our feature selection methods successfully identified 95 impactful gene transcripts from ADNI blood gene expression data and 125 gene transcripts from the NCBI ANM1 and ANM2 datasets.", "doc_items_refs": ["#/texts/353", "#/texts/354", "#/texts/355", "#/texts/356", "#/texts/357"], "page_nos": [], "uuid": "4297274c-9314-4c27-8829-737f131aed5f"}
{"doc_id": "2025__Machine_Learning_multiclassification_for_stage_diagnosis_of_Alzheimers_disease_u__W4411231219", "source_path": "<redacted:source_path>", "chunk_id": 29, "source_chunk_idxs": [37], "num_tokens": 505, "text": "'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\n4 Discussion\nUpon examining the cross-validation F1 and AUC scores across various folds, as detailed in Tables\n6\nand\n10\nfor the ADNI and NCBI models, respectively, and comparing these with the mean F1, mean AUC scores and confidence interval scores of AUC and F1 (with 95% confidence) in Tables\n7\n,\n8\n,\n11\n,\n12\n,\n13\nand\n14\n, it is evident that there is minimal variation. This suggests that our results are stable, the scores are on par with or surpass the performance of binary classification methods used in previous studies for identifying AD through blood gene expression data from both NCBI and ADNI databases. However, this performance score is low when compared to performance achieved through clinical and brain image data analysis. There are several reasons for this. First, gene expression data is generally of HDLSS nature when compared with clinical and image dataset. Other reason is that many pathways are involved with gene expression data. Before showing the clinical symptoms and reaching MCI and AD stages, gene expression is involved with different other pathways like protein expression/synthesis etc.\nAnalysis of the mean AUC and F1 score, confidence interval presented in Tables\n7\n,\n8\n,\n11\n,\n12\n,\n13\nand\n14\n, reveals that the models suffer in accurately classifying minority samples when compared with other two categories. Specifically, this issue is observed in the 'AD' stage identification for models based on the ADNI dataset and in the MCI stage identification for models based on the NCBI dataset. Figure\n11\nillustrates bar charts representing the AUC and F1 scores of NCBI-based models when assessed using the ANM1 and ANM2 datasets. It is apparent that the models suffer in identifying MCI stage that belongs to minority samples. This underperformance can be attributed to the limited number of minority samples of the imbalanced dataset, which restricts the model's ability to learn effectively. However, utilization of SMOTE data augmentation marginally increased classification performance of AD/Dementia category, the minority samples as compared to that of non-SMOTE based models. This is illustrated in Fig.\n15\nand ADNI mean performance, confidence interval performance scores as illustrated in Tables\n7\nand\n8\n. Results show data-augmentation using SMOTE could produce better classification especially in identification of the minority classes AD/dementia ADNI test samples respectively.\nFig. 15", "doc_items_refs": ["#/texts/358", "#/texts/359", "#/texts/360", "#/texts/361", "#/texts/362", "#/texts/363", "#/texts/364", "#/texts/365", "#/texts/366", "#/texts/367", "#/texts/368", "#/texts/369", "#/texts/370", "#/texts/371", "#/texts/372", "#/texts/373", "#/texts/374", "#/texts/375", "#/texts/376", "#/texts/377", "#/texts/378", "#/texts/379", "#/texts/380", "#/texts/381", "#/texts/382", "#/texts/383", "#/texts/384", "#/texts/385", "#/texts/386", "#/texts/387", "#/texts/388", "#/texts/389", "#/texts/390", "#/texts/391", "#/texts/392", "#/texts/393", "#/texts/394", "#/texts/395", "#/texts/396"], "page_nos": [], "uuid": "c1e9239d-bde1-4f2f-9c75-bae6fe0bd78c"}
{"doc_id": "2025__Machine_Learning_multiclassification_for_stage_diagnosis_of_Alzheimers_disease_u__W4411231219", "source_path": "<redacted:source_path>", "chunk_id": 30, "source_chunk_idxs": [38], "num_tokens": 432, "text": "'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\n4 Discussion\nWe employed the Wilcoxon signed-rank test, a statistical method utilized to ascertain significant differences in the performance of two models for ADNI data where data is highly imbalanced. We collected the AUC and F1 scores for CN, MCI, and AD diagnosis for each fold of cross-validation of every classifier and compared the classifiers using the 'Wilcoxon signed-rank test'. While the mean F1 and AUC scores quantitatively assist in evaluating the superior model for distinct CN, MCI, and AD stage diagnosis performance, the 'Wilcoxon signed-rank test' results indicate the significance of the model performance differences, as evidenced by the\np\nvalues highlighted in bold in Table\n9\n. It is observed that SVM based models with non-augmented data mostly fails in classifying unbalanced ADNI data, especially the AD stage, the minority samples while GBX and DL based produce better performance. Due to their inherent ability to learn complex relationships, DL can potentially mitigate the bias towards the majority class. The weakness of the soft margin optimization problem of SVM results in the hyperplanes being skewed to the minority class [\n53\n]. XGBoost (GBX), as a boosting algorithm, is particularly well-suited for handling imbalanced datasets. Its iterative approach and capacity to adjust weights based on misclassified samples enable it to concentrate on the minority class during training. Unlike algorithms that treat all samples uniformly, XGBoost assigns greater weights to misclassified instances, especially those from the minority class, thereby enhancing its effectiveness in learning from imbalanced data. Data-augmentation-based models demonstrate superior performance compared to their counterparts in diagnosing various stages, particularly in identifying the AD stage. Additionally, DL-based classifiers are identified as the most effective. Given the superior performance of models based on data augmentation, we have confined our approach to utilizing data augmentation for the model developed from NCBI data.", "doc_items_refs": ["#/texts/397", "#/texts/398", "#/texts/399", "#/texts/400", "#/texts/401", "#/texts/402", "#/texts/403"], "page_nos": [], "uuid": "b8f9e489-55e1-4cdf-a44a-3e9829c55b62"}
{"doc_id": "2025__Machine_Learning_multiclassification_for_stage_diagnosis_of_Alzheimers_disease_u__W4411231219", "source_path": "<redacted:source_path>", "chunk_id": 31, "source_chunk_idxs": [39], "num_tokens": 380, "text": "'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\n4 Discussion\nApart from performance score, we have also analysed the results using LIME plot. In Fig.\n16\n, lime plot shows different gene expression values of TEP1, SQLE, HLA-DQA1, TTC28, ZNF835 which lead to dementia. When analysed the contributing genes of a dementia test sample using LIME, the LIME result is able to confirm. This study could find APP as one of 95 important genes from 49,000 ADNI gene transcripts. APP is already a known gene allele responsible for EOAD (Early Onset Alzheimer's Disease). However, the role of known 'AD risk' allele ApoE4 could not be established. One possible reason is that if a gene alleles is not expressed sufficiently, it cannot contribute to AD in a person. This again substantiate the fact that Alzheimer's disease is caused by different factors like gene expression, gene regulation, oxidation stress, cell metabolism. Table\n17\ndelineates the biological significance of certain genes identified in our work (listed in Table\n15\nof Sect.\n3.2\n). Their association with Alzheimer's disease (AD) is already established in prior research which validated our identification of genes.\nFig. 16\nThe integration of gene expression data with clinical information can significantly enhance diagnosis by providing a deeper understanding of a patient's disease at the molecular level, enabling more precise identification of disease subtypes and improved prediction of disease progression [\n64\n,\n65\n]. By understanding how gene expression relates to clinical outcomes, researchers can develop more targeted and effective treatments for individual patients. As demonstrated by the results in Table\n11\n, the integration of gene expression data with clinical data proves to be effective and has the potential to enhance performance.", "doc_items_refs": ["#/texts/404", "#/texts/405", "#/texts/406", "#/texts/407", "#/texts/408", "#/texts/409", "#/texts/410", "#/texts/411", "#/texts/412", "#/texts/413", "#/texts/414", "#/texts/415", "#/texts/416", "#/texts/417", "#/texts/418", "#/texts/419", "#/texts/420"], "page_nos": [], "uuid": "438ce735-4ff4-4bb3-b400-e7420f77f9b1"}
{"doc_id": "2025__Machine_Learning_multiclassification_for_stage_diagnosis_of_Alzheimers_disease_u__W4411231219", "source_path": "<redacted:source_path>", "chunk_id": 32, "source_chunk_idxs": [40], "num_tokens": 428, "text": "'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\n4 Discussion\nOne limitation of this study is the inability to employ external validation of our models, specifically the validation of the ADNI-based model with NCBI data and the NCBI-based model with ADNI test data, as conducted in some prior research [\n11\n]. As previously mentioned, ADNI and NCBI gene expression data are derived from distinct microarray settings and adhere to different gene naming conventions. ADNI, the Alzheimer's Disease Neuroimaging Initiative, uses a more flexible system with lowercase italicized full gene names. NCBI Gene, on the other hand, relies heavily on the HUGO Gene Nomenclature Committee (HGNC) for official gene symbols and names [\n66\n]. Consequently, numerous essential genes are excluded during the selection of genes across ADNI and the two NCBI datasets, thereby impacting the overall quality of the model. One potential explanation for the previously reported suboptimal internal validation scores of models utilizing the ADNI dataset may be attributed to this factor. In our work we took measures to ensure the retention of all essential features. Another limitation is dataset biases-demographic distributions, study design differences etc. that can impact model generalizability. Batch effects refer to systematic variations in data that arise due to technical differences in data collection or processing across different batches. In this study, an analysis was conducted by merging the NCBI datasets ANM1 and ANM2. Although the datasets ANM1 and ANM2 were derived from two similar microarray settings, they may still exhibit minor variations in data collection. The translational applicability of this work in clinical settings may be limited due to several factors that impede the successful integration of research findings into practical clinical applications. These limitations may arise from inadequate infrastructure, communication gaps between researchers and clinicians, a lack of trained personnel etc. Additionally, scientific validity, and equitable subject selection, are crucial in ensuring the responsible and effective translation of research.", "doc_items_refs": ["#/texts/421", "#/texts/422", "#/texts/423", "#/texts/424", "#/texts/425"], "page_nos": [], "uuid": "97655b97-8e56-4cf9-a53e-71074d15df62"}
{"doc_id": "2025__Machine_Learning_multiclassification_for_stage_diagnosis_of_Alzheimers_disease_u__W4411231219", "source_path": "<redacted:source_path>", "chunk_id": 33, "source_chunk_idxs": [41], "num_tokens": 422, "text": "'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\n5 Conclusion\nIn conclusion, we explored multiple areas in this research-detection of Alzheimer's disease stages from blood gene expression data of HDLSS nature and multimodal data using ML multiclassification techniques and discovery of AD related genes. We developed a multiclassification model for precise identification of Alzheimer's disease (AD) stages, including Mild Cognitive Impairment (MCI), the transitional phase of AD. This model utilizes blood gene expression profiles from both ADNI and NCBI participants. We addressed numerous challenges and achieved the highest known F1 score and 'ROC AUC' for multiclassification of AD stages from blood gene expression data using our two step novel feature selection and data augmentation technique. Given that data augmentation using SMOTE successfully addressed imbalance issues and improved performance, exploring generative AI techniques in future research could yield promising results. Our research indicates that the integration of gene expression data with clinical information substantially enhances diagnostic accuracy, facilitating more precise identification of disease subtypes and improving the prediction of disease progression. By elucidating the relationship between gene expression and clinical outcomes, researchers can develop more targeted and effective treatments for individual patients.\nAdditionally, we have identified 'AD risk' genes and 'AD suppressor genes' that warrant further investigation in future studies. Previous research has corroborated our findings regarding the biological significance of genes associated with Alzheimer's disease (AD). Further research could be conducted on the comprehensive list of genes we have identified. Our research findings demonstrate the significant potential of blood gene expression data, combined with machine learning techniques, for diagnosing Alzheimer's disease (AD) stages. This approach offers a cost-effective alternative to expensive methods like PET and MRI scans, making it more accessible to patients. The ability to detect AD at the gene expression level before symptoms appear provides valuable time for early intervention. Moreover, the minimally invasive or non-invasive nature of this diagnostic method may encourage greater participation in screening programs.", "doc_items_refs": ["#/texts/427", "#/texts/428"], "page_nos": [], "uuid": "b133c54a-00f1-4fde-ad07-21310d422b00"}
{"doc_id": "2025__Machine_Learning_multiclassification_for_stage_diagnosis_of_Alzheimers_disease_u__W4411231219", "source_path": "<redacted:source_path>", "chunk_id": 34, "source_chunk_idxs": [42], "num_tokens": 95, "text": "'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\nAvailability of data and materials\nAll data obtained by analysing this research are from the authors and are available within the manuscript. Data used in this research are accessible from Alzheimer Disease Neuro Imaging (ADNI) database from LONI website (adni.loni.usc.edu) and National Center for Biotechnology Information (NCBI) web site.", "doc_items_refs": ["#/texts/430"], "page_nos": [], "uuid": "9ce05e26-9f74-4582-a948-a3e327374df8"}
{"doc_id": "2025__Machine_Learning_multiclassification_for_stage_diagnosis_of_Alzheimers_disease_u__W4411231219", "source_path": "<redacted:source_path>", "chunk_id": 35, "source_chunk_idxs": [43], "num_tokens": 506, "text": "'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\nReferences\n1. Angelucci F, Spalletta G, di Iulio F, Ciaramella A, Salani F, Colantoni L, Varsi AE, Gianni W, Sancesario G, Caltagirone C, Bossù P. Alzheimer's disease (AD) and mild cognitive impairment (MCI) patients are characterized by increased BDNF serum levels. Curr Alzheimer Res. 2010;7(1):15-20.\nhttps://doi.org/10.2174/156720510790274473\n.\nArticle\nGoogle Scholar\n2. Alzheimer's disease facts and figures. Alzheimers Dement. 2024;20(5):3708-821.\nhttps://doi.org/10.1002/alz.13809\n.\nArticle\nGoogle Scholar\n3. Cummings JL, Morstorf T, Zhong K. Alzheimer's disease drug development pipeline: few candidates, frequent failures. Alzheimers Res Ther. 2014;6(4):37.\nArticle\nGoogle Scholar\n4. Willette AA, Calhoun VD, Egan JM, Kapogiannis D, for the Alzheimer׳s Disease Neuroimaging Initiative. Prognostic classification of mild cognitive impairment and Alzheimer's disease: MRI independent component analysis. Psychiatry Res. 2014;224(2):81-8.\nArticle\nGoogle Scholar\n5. Gorji H, Haddadnia J. A novel method for early diagnosis of Alzheimer's disease based on pseudo Zernike moment from structural MRI. Neuroscience. 2015;305:361-71.\nArticle\nGoogle Scholar\n6. Rai SN, Singh C, Singh A, Singh MP, Singh BK. Mitochondrial dysfunction: a potential therapeutic target to treat Alzheimer's disease. Mol Neurobiol. 2020;57(7):3075-88.\nhttps://doi.org/10.1007/s12035-020-01945-y\n.\nArticle\nGoogle Scholar\n7. Tanzi RE. The genetics of Alzheimer disease. Cold Spring Harb Perspect Med. 2012;2(10): a006296.\nhttps://doi.org/10.1101/cshperspect.a006296\n.\nArticle\nGoogle Scholar", "doc_items_refs": ["#/texts/432", "#/texts/433", "#/texts/434", "#/texts/435", "#/texts/436", "#/texts/437", "#/texts/438"], "page_nos": [], "uuid": "44efcdde-74b9-4f2d-ae14-91d2d7b33b48"}
{"doc_id": "2025__Machine_Learning_multiclassification_for_stage_diagnosis_of_Alzheimers_disease_u__W4411231219", "source_path": "<redacted:source_path>", "chunk_id": 36, "source_chunk_idxs": [44], "num_tokens": 505, "text": "'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\nReferences\n8. Shen L, Jia J. An overview of genome-wide association studies in Alzheimer's disease. Neurosci Bull. 2016;32(2):183-90.\nhttps://doi.org/10.1007/s12264-016-0011-3\n.\nArticle\nGoogle Scholar\n9. Genetics. Alzheimer's disease and dementia.\nwww.alz.org/alzheimers-dementia/what-is-alzheimers/causes-and-risk-factors/genetics\n.\n10. Marian AJ. Molecular genetic studies of complex phenotypes. Transl Res. 2012;159:64-79.\nhttps://doi.org/10.1016/j.trsl.2011.08.001\n.\nArticle\nGoogle Scholar\n11. Lee T, Lee H. Prediction of Alzheimer's disease using blood gene expression data. Sci Rep. 2020;10(1):3485.\nhttps://doi.org/10.1038/s41598-020-60595-1\n.\nArticle\nGoogle Scholar\n12. Patel H, Dobson RJB, Newhouse SJ. A meta-analysis of Alzheimer's disease brain transcriptomic data. J Alzheimers Dis. 2019;68(4):1635-56.\nhttps://doi.org/10.3233/JAD-181085\n.\nArticle\nGoogle Scholar\n13. Liew CC, Ma J, Tang HC, Zheng R, Dempsey AA. The peripheral blood transcriptome dynamically reflects system wide biology: a potential diagnostic tool. J Lab Clin Med. 2006;147:126-32.\nArticle\nGoogle Scholar\n14. Saykin AJ, Shen L, Foroud TM, et al. Alzheimer's disease neuroimaging initiative biomarkers as quantitative phenotypes: genetics core aims, progress, and plans. Alzheimers Dement. 2010;6(3):265-73.\nhttps://doi.org/10.1016/j.jalz.2010.03.013\n.\nArticle\nGoogle Scholar\n15. Fehlbaum-Beurdeley P, et al. Toward an Alzheimer's disease diagnosis via high-resolution blood gene expression. Alzheimers Dement. 2010;6(1):25-38.\nArticle\nGoogle Scholar", "doc_items_refs": ["#/texts/439", "#/texts/440", "#/texts/441", "#/texts/442", "#/texts/443", "#/texts/444", "#/texts/445", "#/texts/446"], "page_nos": [], "uuid": "7b11791e-ae86-4c7a-84e6-730d0d8c7ef3"}
{"doc_id": "2025__Machine_Learning_multiclassification_for_stage_diagnosis_of_Alzheimers_disease_u__W4411231219", "source_path": "<redacted:source_path>", "chunk_id": 37, "source_chunk_idxs": [45], "num_tokens": 477, "text": "'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\nReferences\n16. Lunnon K, et al. A blood gene expression marker of early Alzheimer's disease. J Alzheimers Dis. 2013;33(3):737-53.\nArticle\nGoogle Scholar\n17. Sarma M, Chatterjee S. Identification and prediction of alzheimer based on biomarkers using 'machine learning.' In: Bhattacharjee A, Borgohain S, Soni B, Verma G, Gao XZ, editors. Machine learning, image processing, network security and data sciences. MIND 2020. Communications in computer and information science, vol. 1241. Singapore: Springer; 2020.\nGoogle Scholar\n18. Li H, et al. Identification of molecular alterations in leukocytes from gene expression profiles of peripheral whole blood of Alzheimer's disease. Sci Rep. 2017;7:14027.\nArticle\nGoogle Scholar\n19. Li X, et al. Systematic analysis and biomarker study for Alzheimer's disease. Sci Rep. 2018;8:17394.\nArticle\nGoogle Scholar\n20. Park C, Ha J, Park S. Prediction of Alzheimer's disease based on deep neural network by integrating gene expression and DNA methylation dataset. Expert Syst Appl. 2020;140: 112873.\nhttps://doi.org/10.1016/j.eswa.2019.112873\n.\nArticle\nGoogle Scholar\n21. Kalkan H, Akkaya UM, Inal-Gültekin G, Sanchez-Perez AM. Prediction of Alzheimer's disease by a novel image-based representation of gene expression. Genes. 2022;13(8):1406.\nhttps://doi.org/10.3390/genes13081406\n.\nArticle\nGoogle Scholar\n22. Huang X, Liu H, Li X, Guan L, Li J, Tellier LCAM, Yang H, Wang J, Zhang J. Revealing Alzheimer's disease genes spectrum in the whole-genome by machine learning. BMC Neurol. 2018;18:5.\nhttps://doi.org/10.1186/s12883-017-1010-3\n.\nArticle\nGoogle Scholar", "doc_items_refs": ["#/texts/447", "#/texts/448", "#/texts/449", "#/texts/450", "#/texts/451", "#/texts/452", "#/texts/453"], "page_nos": [], "uuid": "add7e5e0-9cbd-41be-b263-dfaea75b553a"}
{"doc_id": "2025__Machine_Learning_multiclassification_for_stage_diagnosis_of_Alzheimers_disease_u__W4411231219", "source_path": "<redacted:source_path>", "chunk_id": 38, "source_chunk_idxs": [46], "num_tokens": 449, "text": "'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\nReferences\n23. AlMansoori ME, Jemimah S, Abuhantash F, et al. Predicting early Alzheimer's with blood biomarkers and clinical features. Sci Rep. 2024;14:6039.\nhttps://doi.org/10.1038/s41598-024-56489-1\n.\nArticle\nGoogle Scholar\n24. Shen L, Yin Q. The classification for high-dimension low-sample size data. Pattern Recognit. 2020;130: 108828.\nArticle\nGoogle Scholar\n25. Gene Expression Omnibus (GEO). Bethesda, MD: National Center for Biotechnology Information (US). 1999. Available from\nhttps://www.ncbi.nlm.nih.gov/geo/\n.\n26. ADNI gene expression. National Institute on Aging (National Institutes of Health Grant U19AG024904): LONI Image and Data Archive (IDA). 1999. Available from\nhttps://adni.loni.usc.edu/data-samples/adni-data/genetics-related-omics/\n.\n27. Abdelwahab MM, Al-Karawi KA, Semary HE. Deep learning-based prediction of Alzheimer's disease using microarray gene expression data. Biomedicines. 2023;11(12):3304.\nhttps://doi.org/10.3390/biomedicines11123304\n.\nArticle\nGoogle Scholar\n28. Catchpoole DR, Kennedy P, Skillicorn DB, Simoff S. The curse of dimensionality: a blessing to personalized medicine. J Clin Oncol. 2010;28:723-4.\nArticle\nGoogle Scholar\n29. https://www.ibm.com/think/topics/lasso-regression#:~:text=Lasso%20regression%20can%20handle%20some,the%20features%20from%20the%20model\n.", "doc_items_refs": ["#/texts/454", "#/texts/455", "#/texts/456", "#/texts/457", "#/texts/458", "#/texts/459", "#/texts/460"], "page_nos": [], "uuid": "9b4a71c3-2656-4747-b30d-21218c96c033"}
{"doc_id": "2025__Machine_Learning_multiclassification_for_stage_diagnosis_of_Alzheimers_disease_u__W4411231219", "source_path": "<redacted:source_path>", "chunk_id": 39, "source_chunk_idxs": [47], "num_tokens": 461, "text": "'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\nReferences\n30. Shaik T, Tao X, Li L, Xie H, Velásquez JD. A survey of multimodal information fusion for smart healthcare: mapping the journey from data to wisdom. Inf Fusion. 2024;102: 102040.\nhttps://doi.org/10.1016/j.inffus.2023.102040\n.\nArticle\nGoogle Scholar\n31. Fernández A, García S, Galar M, Prati RC, Krawczyk B, Herrera F. Learning from imbalanced data sets. Cham: Springer; 2018. p. 197-226.\nGoogle Scholar\n32. Krawczyk B. Learning from imbalanced data: open challenges and future directions. Prog Artif Intell. 2016;5:221-32.\nhttps://doi.org/10.1007/s13748-016-0094-0\n.\nArticle\nGoogle Scholar\n33. Brownlee J. Imbalanced classification with python. 2020.\n34. Chawla NV, et al. SMOTE: synthetic minority over-sampling technique. Journal of Artificial Intelligence Research. 2002;16:321-57.\nhttps://doi.org/10.1613/jair.953\n.\nArticle\nGoogle Scholar\n35. Mujahid M, Kına E, Rustam F, et al. Data oversampling and imbalanced datasets: an investigation of performance for machine learning and feature engineering. J Big Data. 2024;11:87.\nhttps://doi.org/10.1186/s40537-024-00943-4\n.\nArticle\nGoogle Scholar\n36. Halim AM, Dwifebri M, Nhita F. Handling imbalanced data sets using SMOTE and ADASYN to improve classification performance of ecoli data sets. Build Inf Technol Sci. 2023;5(1):246-53.\nhttps://doi.org/10.47065/bits.v5i1.3647\n.\nArticle\nGoogle Scholar", "doc_items_refs": ["#/texts/461", "#/texts/462", "#/texts/463", "#/texts/464", "#/texts/465", "#/texts/466", "#/texts/467"], "page_nos": [], "uuid": "e939f313-656b-4d39-a61e-06b8c8ffe7a4"}
{"doc_id": "2025__Machine_Learning_multiclassification_for_stage_diagnosis_of_Alzheimers_disease_u__W4411231219", "source_path": "<redacted:source_path>", "chunk_id": 40, "source_chunk_idxs": [48], "num_tokens": 500, "text": "'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\nReferences\n37. Han H, Wang WY, Mao BH. Borderline-SMOTE: a new over-sampling method in imbalanced data sets learning. In: Huang DS, Zhang XP, Huang GB, editors. Advances in intelligent computing. ICIC 2005. Lecture notes in computer science, vol. 3644. Berlin: Springer; 2005.\nGoogle Scholar\n38. Abdumalikov S, Kim J, Yoon Y. Performance analysis and improvement of machine learning with various feature selection methods for EEG-based emotion classification. Appl Sci. 2024;14:10511.\nhttps://doi.org/10.3390/app142210511\n.\nArticle\nGoogle Scholar\n39. Sarma M, Chatterjee S. Etiology of late-onset Alzheimer's disease, biomarker efficacy, and the role of machine learning in stage diagnosis. Diagnostics. 2024;14:2640.\nhttps://doi.org/10.3390/diagnostics14232640\n.\nArticle\nGoogle Scholar\n40. Berrar D. Cross-validation. In: Encyclopedia of bioinformatics and computational biology. Amsterdam: Elsevier; 2018. p. 542-5.\nGoogle Scholar\n41. Duda RO, Hart PE, Stork DG. Pattern classification. New York: Wiley; 2001.\nGoogle Scholar\n42. Cardenas A, Baras J. B-ROC curves for the assessment of classifiers over imbalanced data sets. In: Proceedings of the twenty-first national conference on artificial intelligence, Boston, MA, USA. 2006. p. 1581-1584.\n43. Flach P, Hernandez-Orallo J, Ferri C. A coherent interpretation of AUC as a measure of aggregated classification performance. In: Proceedings of the 28th inter-national conference on machine learning (ICML-11), New York, NY, USA. 2011. p. 657-664.\n44. Forman G, Scholz M. Apples-to-apples in cross-validation studies: pitfalls in classifier performance measurement. SIGKDD Explor. 2010;12(1):49-57.\nhttps://doi.org/10.1145/1882471.1882479\n.\nArticle\nGoogle Scholar", "doc_items_refs": ["#/texts/468", "#/texts/469", "#/texts/470", "#/texts/471", "#/texts/472", "#/texts/473", "#/texts/474", "#/texts/475"], "page_nos": [], "uuid": "d06677cb-c30d-411c-8e78-fd24d27e4053"}
{"doc_id": "2025__Machine_Learning_multiclassification_for_stage_diagnosis_of_Alzheimers_disease_u__W4411231219", "source_path": "<redacted:source_path>", "chunk_id": 41, "source_chunk_idxs": [49], "num_tokens": 448, "text": "'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\nReferences\n45. Marcilio WE, Eler DM. From explanations to feature selection: assessing SHAP values as feature selection mechanism. In: 2020 33rd SIBGRAPI conference on graphics, patterns and images (SIBGRAPI). 2020. p. 340-347.\n46. Liu B, Cheng L, Gao H, Zhang J, Dong Y, Gao W, Yuan S, Gong T, Huang W. The biology of VSIG4: implications for the treatment of immune-mediated inflammatory diseases and cancer. Cancer Lett. 2023;553:15996.\nArticle\nGoogle Scholar\n47. Kinney JW, Bemiller SM, Murtishaw AS, Leisgang AM, Salazar AM, Lamb BT. Inflammation as a central mechanism in Alzheimer's disease. Alzheimers Dement. 2018;4:575-90.\nhttps://doi.org/10.1016/j.trci.2018.06.014\n.\nArticle\nGoogle Scholar\n48. Baldini R, Mascaro M, Meroni G. The MID1 gene product in physiology and disease. Gene. 2020;747: 144655.\nhttps://doi.org/10.1016/j.gene.2020.144655\n.\nArticle\nGoogle Scholar\n49. Heinz A, Schilling J, van Roon-Mom W, Krauß S. The MID1 protein: a promising therapeutic target in Huntington's disease. Front Genet. 2021;12: 761714.\nhttps://doi.org/10.3389/fgene.2021.761714\n.\nArticle\nGoogle Scholar\n50. Bhattarai P, et al. Rare genetic variation in fibronectin 1 (FN1) protects against APOEε4 in Alzheimer's disease. Acta Neuropathol. 2024;147(1):70.\nhttps://doi.org/10.1007/s00401-024-02721-1\n.\nArticle\nGoogle Scholar", "doc_items_refs": ["#/texts/476", "#/texts/477", "#/texts/478", "#/texts/479", "#/texts/480", "#/texts/481"], "page_nos": [], "uuid": "45b24ad7-0941-48ed-905e-9412a337c6af"}
{"doc_id": "2025__Machine_Learning_multiclassification_for_stage_diagnosis_of_Alzheimers_disease_u__W4411231219", "source_path": "<redacted:source_path>", "chunk_id": 42, "source_chunk_idxs": [50], "num_tokens": 418, "text": "'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\nReferences\n51. Guerreiro RJ, Gustafson DR, Hardy J. The genetic architecture of Alzheimer's disease: beyond APP, PSENs and APOE. Neurobiol Aging. 2012;33(3):437-56.\nhttps://doi.org/10.1016/j.neurobiolaging.2010.03.025\n.\nArticle\nGoogle Scholar\n52. Seto M, Weiner RL, Dumitrescu L, Hohman TJ. Protective genes and pathways in Alzheimer's disease: moving towards precision interventions. Mol Neurodegener. 2021;16(1):29.\nhttps://doi.org/10.1186/s13024-021-00452-5\n.\nArticle\nGoogle Scholar\n53. Akbani R, Kwek S, Japkowicz N. Applying support vector machines to imbalanced datasets. In: Boulicaut JF, Esposito F, Giannotti F, Pedreschi D, editors. Machine learning: ECML 2004. Lecture notes in computer science, vol. 3201. Berlin: Springer; 2004.\nGoogle Scholar\n54. Alam J, Scheper W. Targeting neuronal MAPK14/p38α activity to modulate autophagy in the Alzheimer disease brain. Autophagy. 2016;12(12):2516-20.\nhttps://doi.org/10.1080/15548627.2016.1238555\n.\nArticle\nGoogle Scholar\n55. Winter J, Basilicata MF, Stemmler MP, Krauss S. The MID1 protein is a central player during development and in disease. Front Biosci. 2016;21(3):664-82.\nhttps://doi.org/10.2741/4413\n.\nArticle\nGoogle Scholar", "doc_items_refs": ["#/texts/482", "#/texts/483", "#/texts/484", "#/texts/485", "#/texts/486"], "page_nos": [], "uuid": "53d12d15-0c24-4914-af32-5b13fe926772"}
{"doc_id": "2025__Machine_Learning_multiclassification_for_stage_diagnosis_of_Alzheimers_disease_u__W4411231219", "source_path": "<redacted:source_path>", "chunk_id": 43, "source_chunk_idxs": [51], "num_tokens": 450, "text": "'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\nReferences\n56. Baker SK, Chen ZL, Norris EH, Revenko AS, MacLeod AR, Strickland S. Blood-derived plasminogen drives brain inflammation and plaque deposition in a mouse model of Alzheimer's disease. Proc Natl Acad Sci USA. 2018;115(41):E9687-96.\nhttps://doi.org/10.1073/pnas.1811172115\n.\nArticle\nGoogle Scholar\n57. Tavares IA, Touma D, Lynham S, Troakes C, Schober M, Causevic M, Garg R, Noble W, Killick R, Bodi I, Hanger DP, Morris JD. Prostate-derived sterile 20-like kinases (PSKs/TAOKs) phosphorylate tau protein and are activated in tangle-bearing neurons in Alzheimer disease. J Biol Chem. 2013;288(21):15418-29.\nhttps://doi.org/10.1074/jbc.M112.448183\n.\nArticle\nGoogle Scholar\n58. Tawarayama H, Yamada H, Amin R, Morita-Fujimura Y, Cooper HM, Shinmyo Y, Tanaka H, Ikawa S. Draxin-mediated regulation of granule cell progenitor differentiation in the postnatal hippocampal dentate gyrus. Neuroscience. 2020;431:184-92.\nhttps://doi.org/10.1016/j.neuroscience.2020.02.005\n.\nArticle\nGoogle Scholar\n59. Hou W, Cai J, Shen P, Zhang S, Xiao S, You P, Tong Y, Li K, Qi Z, Luo H. Identification of FXYD6 as the novel biomarker for glioma based on differential expression and DNA methylation. Cancer Med. 2023;12(24):22170-84.\nhttps://doi.org/10.1002/cam4.6752\n.\nArticle\nGoogle Scholar", "doc_items_refs": ["#/texts/487", "#/texts/488", "#/texts/489", "#/texts/490"], "page_nos": [], "uuid": "415870b5-0437-41c8-b656-6976da79544c"}
{"doc_id": "2025__Machine_Learning_multiclassification_for_stage_diagnosis_of_Alzheimers_disease_u__W4411231219", "source_path": "<redacted:source_path>", "chunk_id": 44, "source_chunk_idxs": [52], "num_tokens": 503, "text": "'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\nReferences\n60. De Leon-Oliva D, Garcia-Montero C, Fraile-Martinez O, Boaru DL, García-Puente L, Rios-Parra A, Garrido-Gil MJ, Casanova-Martín C, García-Honduvilla N, Bujan J, et al. AIF1: function and connection with inflammatory diseases. Biology. 2023;12:694.\nhttps://doi.org/10.3390/biology12050694\n.\nArticle\nGoogle Scholar\n61. Yang X, Xu Y. Mutations in the ATP13A2 gene and Parkinsonism: a preliminary review. Biomed Res Int. 2014;2014: 371256.\nhttps://doi.org/10.1155/2014/371256\n.\nArticle\nGoogle Scholar\n62. Szablewski L. Glucose transporters in brain: in health and in Alzheimer's disease. J Alzheimers Dis. 2017;55(4):1307-20.\nhttps://doi.org/10.3233/JAD-160841\n.\nArticle\nGoogle Scholar\n63. Askarova A, Yaa RM, Marzi SJ, Nott A. Genetic risk for neurodegenerative conditions is linked to disease-specific microglial pathways. PLoS Genet. 2025;21(4): e1011407.\nhttps://doi.org/10.1101/2024.08.29.610255\n.\nArticle\nGoogle Scholar\n64. Verma G, Rebholz-Schuhmann D, Madden MG. Enabling personalised disease diagnosis by combining a patient's time-specific gene expression profile with a biomedical knowledge base. BMC Bioinformatics. 2024;25:62.\nhttps://doi.org/10.1186/s12859-024-05674-0\n.\nArticle\nGoogle Scholar\n65. Molla G, Bitew M. Revolutionizing personalized medicine: synergy with multi-omics data generation, main hurdles, and future perspectives. Biomedicines. 2024;12:2750.\nhttps://doi.org/10.3390/biomedicines12122750\n.\nArticle\nGoogle Scholar", "doc_items_refs": ["#/texts/491", "#/texts/492", "#/texts/493", "#/texts/494", "#/texts/495", "#/texts/496"], "page_nos": [], "uuid": "93faf168-3b1e-4b63-ac5c-c1f44423eb0e"}
{"doc_id": "2025__Machine_Learning_multiclassification_for_stage_diagnosis_of_Alzheimers_disease_u__W4411231219", "source_path": "<redacted:source_path>", "chunk_id": 45, "source_chunk_idxs": [53, 54, 55, 56], "num_tokens": 311, "text": "'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\nReferences\n66. Bruford EA, Braschi B, Denny P, Jones TEM, Seal RL, Tweedie S. Guidelines for human gene nomenclature. Nat Genet. 2020;52(8):754-8.\nhttps://doi.org/10.1038/s41588-020-0669-3\n.\nArticle\nGoogle Scholar\nDownload references\n\n'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\nFunding\nThe authors did not receive funding from any organization for the submitted work.\n\n'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\nAuthor information\nAuthors and Affiliations\n1. Department of CSE, Ramaiah University of Applied Sciences, #470-P, Peenya 4th Phase, Bengaluru, Karnataka, 560058, India Manash Sarma &amp; Subarna Chatterjee\nAuthors\n1. Manash Sarma\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n2. Subarna Chatterjee\nView author publications\nSearch author on:\nPubMed\nGoogle Scholar\n\n'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\nAuthor information\nContributions\nManash Sarma contributed to conceptualization, methodology, software writing, test and validation and original draft writing. Subarna Chatterjee contributed to supervising.", "doc_items_refs": ["#/texts/497", "#/texts/498", "#/texts/500", "#/texts/503", "#/texts/504", "#/texts/505", "#/texts/506", "#/texts/508"], "page_nos": [], "uuid": "c0dcfe93-d9a0-4732-9d29-783939b80736"}
{"doc_id": "2025__Machine_Learning_multiclassification_for_stage_diagnosis_of_Alzheimers_disease_u__W4411231219", "source_path": "<redacted:source_path>", "chunk_id": 46, "source_chunk_idxs": [57, 58, 59, 60, 61, 62], "num_tokens": 399, "text": "'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\nAuthor information\nCorresponding author\nCorrespondence to\nManash Sarma\n.\n\n'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\nEthics declarations\nEthics approval and consent to participate\nAll authors affirm their accountability for all aspects of the work.\n\n'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\nEthics declarations\nCompeting interests\nThe authors declare no competing interests.\n\n'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\nAdditional information\nPublisher's Note\nSpringer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations.\n\n'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\nSupplementary Information\nBelow is the link to the electronic supplementary material.\n\n'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\nRights and permissions\nOpen Access\nThis article is licensed under a Creative Commons Attribution 4.0 International License, which permits use, sharing, adaptation, distribution and reproduction in any medium or format, as long as you give appropriate credit to the original author(s) and the source, provide a link to the Creative Commons licence, and indicate if changes were made. The images or other third party material in this article are included in the article's Creative Commons licence, unless indicated otherwise in a credit line to the material. If material is not included in the article's Creative Commons licence and your intended use is not permitted by statutory regulation or exceeds the permitted use, you will need to obtain permission directly from the copyright holder. To view a copy of this licence, visit\nhttp://creativecommons.org/licenses/by/4.0/\n.\nReprints and permissions", "doc_items_refs": ["#/texts/510", "#/texts/511", "#/texts/512", "#/texts/515", "#/texts/517", "#/texts/520", "#/texts/522", "#/texts/525", "#/texts/526", "#/texts/527", "#/texts/528", "#/texts/529"], "page_nos": [], "uuid": "7a6602b6-e4ca-44e7-9e8c-0f71ab412b90"}
{"doc_id": "2025__Machine_Learning_multiclassification_for_stage_diagnosis_of_Alzheimers_disease_u__W4411231219", "source_path": "<redacted:source_path>", "chunk_id": 47, "source_chunk_idxs": [63, 64, 65], "num_tokens": 263, "text": "'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\nAbout this article\nCite this article\nSarma, M., Chatterjee, S. 'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion.\nDiscov Appl Sci\n7\n, 636 (2025). https://doi.org/10.1007/s42452-025-07237-1\nDownload citation\n- Received : 30 September 2024\n- Accepted : 30 May 2025\n- Published : 12 June 2025\n- DOI : https://doi.org/10.1007/s42452-025-07237-1\n\n'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\nAbout this article\nKeywords\n- Disease stage diagnosis\n- Blood gene expression\n- Data imbalance\n- Multiclassification\n- F1 score\n- AD risk gene\n- SHAP and LIME\n\n'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\nAbout this article\nProfiles\n1. Manash Sarma\nView author profile\nUse our pre-submission checklist\nAvoid common mistakes on your manuscript.\nAdvertisement", "doc_items_refs": ["#/texts/532", "#/texts/533", "#/texts/534", "#/texts/535", "#/texts/536", "#/texts/537", "#/texts/538", "#/texts/539", "#/texts/540", "#/texts/542", "#/texts/543", "#/texts/544", "#/texts/545", "#/texts/546", "#/texts/547", "#/texts/548", "#/texts/550", "#/texts/551", "#/texts/552", "#/texts/553"], "page_nos": [], "uuid": "18997691-e546-40f3-a1f9-1af062257341"}
{"doc_id": "2025__Machine_Learning_multiclassification_for_stage_diagnosis_of_Alzheimers_disease_u__W4411231219", "source_path": "<redacted:source_path>", "chunk_id": 48, "source_chunk_idxs": [66, 67, 68, 69, 70, 71], "num_tokens": 282, "text": "'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\nSearch\nSearch by keyword or author\nSearch\n\n'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\nNavigation\n- Find a journal\n- Publish with us\n- Track your research\n\n'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\nNavigation\nDiscover content\n- Journals A-Z\n- Books A-Z\n\n'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\nNavigation\nPublish with us\n- Journal finder\n- Publish your research\n- Language editing\n- Open access publishing\n\n'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\nNavigation\nProducts and services\n- Our products\n- Librarians\n- Societies\n- Partners and advertisers\n\n'Machine Learning' multiclassification for stage diagnosis of Alzheimer's disease utilizing augmented blood gene expression and feature fusion\nNavigation\nOur brands\n- Springer\n- Nature Portfolio\n- BMC\n- Palgrave Macmillan\n- Apress\n- Discover\n- Your privacy choices/Manage cookies\n- Your US state privacy rights\n- Accessibility statement\n- Terms and conditions\n- Privacy policy\n- Help and support\n- Legal notice\n- Cancel contracts here\n173.68.96.214\nNot affiliated\nImage Hyperlink.\n© 2025 Springer Nature", "doc_items_refs": ["#/texts/555", "#/texts/556", "#/texts/558", "#/texts/559", "#/texts/560", "#/texts/562", "#/texts/563", "#/texts/565", "#/texts/566", "#/texts/567", "#/texts/568", "#/texts/570", "#/texts/571", "#/texts/572", "#/texts/573", "#/texts/575", "#/texts/576", "#/texts/577", "#/texts/578", "#/texts/579", "#/texts/580", "#/texts/581", "#/texts/582", "#/texts/583", "#/texts/584", "#/texts/585", "#/texts/586", "#/texts/587", "#/texts/588", "#/texts/589", "#/texts/590", "#/texts/591", "#/texts/592"], "page_nos": [], "uuid": "273fdb49-cebb-4f8e-aac4-403e51674df3"}
