{"doc_id": "2025__Editorial_Advanced_fNIRS_applications_in_neuroscience_and_neurological_disorders__W4414261891", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Editorial_Advanced_fNIRS_applications_in_neuroscience_and_neurological_disorders__W4414261891.doctags", "chunk_id": 0, "source_chunk_idxs": [0, 1, 2, 3, 4, 5], "num_tokens": 442, "text": "&lt;!-- image --&gt;\n&lt;!-- image --&gt;\n\nOPEN ACCESS\nEDITED AND REVIEWED BY Jan Kassubek, University of Ulm, Germany * CORRESPONDENCE Huiuting Qiao\nqht@buaa.edu.cn\nRECEIVED 16 August 2025 ACCEPTED 21 August 2025 PUBLISHED 12 September 2025\n\nCITATION\nQiao H, Zhang D, Dong W and Wang D (2025) Editorial: Advanced fNIRS applications in neuroscience and neurological disorders. Front. Neurol. 16:1686834. doi: 10.3389/fneur.2025.1686834\n\nCOPYRIGHT\n© 2025 Qiao, Zhang, Dong and Wang. This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms.\n\nEditorial: Advanced fNIRS applications in neuroscience and neurological disorders\nHuiuting Qiao$^{1}$*, Dan Zhang$^{2}$, Wentian Dong$^{3}$and Daifa Wang$^{1}$\n$^{1}$Key Laboratory of Innovation and Transformation of Advanced Medical Devices, Ministry of Industry and Information Technology, National Medical Innovation Platform for Industry-Education Integration in Advanced Medical Devices (Interdiscipline of Medicine and Engineering), School of Biological Science and Medical Engineering, Beihang University, Beijing, China, $^{2}$Department of Psychological and Cognitive Sciences, Tsinghua University, Beijing, China, $^{3}$Peking University Sixth Hospital, Peking University Institute of Mental Health, NHC Key Laboratory of Mental Health (Peking University), National Clinical Research Center for Mental Disorders (Peking University Sixth Hospital), Beijing, China\n\nKEYWORDS\nfNIRS application, neurodevelopment, cognitive function, disorders of consciousness, rehabilitation, psychiatry", "doc_items_refs": ["#/pictures/0", "#/pictures/1", "#/texts/1", "#/texts/2", "#/texts/3", "#/texts/5", "#/texts/7", "#/texts/12", "#/texts/13", "#/texts/15"], "page_nos": [1], "uuid": "0d8265f4-dd62-47f2-9145-35691f03d685"}
{"doc_id": "2025__Editorial_Advanced_fNIRS_applications_in_neuroscience_and_neurological_disorders__W4414261891", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Editorial_Advanced_fNIRS_applications_in_neuroscience_and_neurological_disorders__W4414261891.doctags", "chunk_id": 1, "source_chunk_idxs": [6], "num_tokens": 452, "text": "Editorial on the Research Topic\nAdvanced fNIRS neurological disorders\napplications\nin\nneuroscience\nand\nFunctional near-infrared spectroscopy (fNIRS) has rapidly emerged as a powerful neuroimaging tool that offers unique advantages for the investigation of brain function and neurological disorders. Using near-infrared light, fNIRS monitors changes in cortical blood oxygenation that reflect cortical neural activity and enable researchers and clinicians to study brain function in real time and in a non-invasive manner. Unlike many conventional imaging techniques, fNIRS is available in portable and wearable forms, making it suitable for use in real-world settings. The technology is highly resistant to motion artifacts and electromagnetic interference, imposing minimal constraints on the testing environment. As a result, fNIRS can be employed at the bedside or in clinical rehabilitation environments, even with patients who have difficulty remaining still or who have implants, such as pacemakers, that would typically prevent neuroimaging. Owing to these features, fNIRS opens up unparalleled opportunities to study the human brain in action. It deepens our understanding of neural mechanisms in both health and disease, and holds promise for earlier diagnoses and more personalized, precision medicine approaches in neurology.\nThis Research Topic aims to showcase recent advancements in the application of fNIRS in the fields of neuroscience and neurological disorders. A total number of 22 articles have been included: they highlight the utility of fNIRS in probing brain function and cognitive neural mechanisms, along with its clinical relevance in the diagnosis, assessment, mechanistic understanding and evaluation of rehabilitation outcomes in neurological conditions. The findings presented in this Research Topic not only affirm fNIRS as a powerful neuroimaging tool but also underscore its potential to advance diagnostic precision, therapeutic monitoring, and personalized interventions in the management of neurological disorders.\nThe collected articles underscore the remarkable versatility of fNIRS, which has been applied to a broad range of neurological and psychiatric conditions. On the neurodevelopmental front, a comprehensive review in this Research Topic surveyed fNIRS studies on numerous childhood disorders, including cerebral palsy, autism spectrum disorder, attention-deficit/hyperactivity disorder (ADHD),", "doc_items_refs": ["#/texts/17", "#/texts/18", "#/texts/19", "#/texts/20", "#/texts/21", "#/texts/22", "#/texts/23", "#/texts/24"], "page_nos": [1], "uuid": "42286059-4e35-4c53-bae7-bbd12a981539"}
{"doc_id": "2025__Editorial_Advanced_fNIRS_applications_in_neuroscience_and_neurological_disorders__W4414261891", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Editorial_Advanced_fNIRS_applications_in_neuroscience_and_neurological_disorders__W4414261891.doctags", "chunk_id": 2, "source_chunk_idxs": [7], "num_tokens": 511, "text": "Editorial on the Research Topic\nand neonatal brain injuries (Wang, Zou, Huang, Zhang, et al.). In another original study, Bian et al. used fNIRS to monitor prefrontal cortex activity during verbal fluency tasks in children with ADHD. In a separate original study in this Research Topic, Wang, Zou, Huang, Wu, et al. employed fNIRS to investigate its therapeutic effects, reporting that repetitive cranial magnetic stimulation (rTMS) combined with standard care led to greater improvements in ADHD symptoms and prefrontal connectivity than standard care alone. The unique advantages of fNIRS -such as safety, non-invasiveness, wearability, compatibility with other modalities, and tolerance for movement -make it especially suitable for pediatric populations, enabling safe and reliable monitoring of neural changes even in young or inattentive children undergoing neuromodulation (Gao et al.).\nIn another domain, cognitive function and impairment stand to benefit from fNIRS innovations. Liu et al. explored healthy cognitive processing using fNIRS, showing that binocular color fusion -a demanding visual task -elicited significantly stronger prefrontal connectivity and higher activation than binocular rivalry. The study indicates that fNIRS can accurately track advanced perceptual -cognitive processes. Ruan et al. demonstrated that combining fNIRS-derived cortical oxygenation features with plasma biomarkers markedly improved the ability to distinguish Alzheimer ' s disease from Lewy body dementia in older adults. [Choi et al.] used fNIRS as a cognitive assessment tool and found that a 6-month herbal medicine and acupuncture program for patients with mild cognitive impairment led to cognitive improvement accompanied by increased prefrontal activation. Given its strong motion-tolerant capability for monitoring brain activity during complex perceptual tasks, fNIRS was also applied to assess cortical activation in stroke survivors performing combined balance and cognitive tasks (He et al.). These results highlight fNIRS ' ability to evaluate how cognitive load influences motor networks in rehabilitation scenarios, while allowing patients to perform upright activities that would be infeasible inside traditional neuroimaging scanners. Yang and Wang further noted that fNIRS ' high temporal resolution and portability complement fMRI ' spatial precision. These combined approaches enable robust brain mapping and extend neuroimaging to populations or settings that are impractical for fMRI alone, which is particularly valuable for researching cognitive mechanisms.", "doc_items_refs": ["#/texts/27", "#/texts/28"], "page_nos": [1], "uuid": "ce036596-753d-4df0-ac8c-264cd89ca8a9"}
{"doc_id": "2025__Editorial_Advanced_fNIRS_applications_in_neuroscience_and_neurological_disorders__W4414261891", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Editorial_Advanced_fNIRS_applications_in_neuroscience_and_neurological_disorders__W4414261891.doctags", "chunk_id": 3, "source_chunk_idxs": [8], "num_tokens": 288, "text": "Editorial on the Research Topic\nSeveral contributions focused on using fNIRS in cases of severe brain injury and coma, areas in which traditional assessments are ineffective. Disorders of consciousness -such as coma, vegetative state, and minimally conscious state -present a diagnostic challenge because patients cannot communicate. Liang et al. used resting-state fNIRS to show that patients who later regained higher levels of consciousness exhibited stronger frontaloccipital connectivity than those who remained in a vegetative state, demonstrating the value of the technique for noninvasively probing residual brain networks and predicting outcomes. Zhang T. et al. applied fNIRS to assess pain processing in patients with disorders of consciousness and found minimal overt cortical activation but markedly enhanced connectivity among somatosensory, motor, and prefrontal areas. This illustrates the technique ' s sensitivity to coordinated network responses even in low-cooperative patients. [Wang N. et al.] reviewed fNIRS applications in disorders of consciousness, highlighting its portability, real-time monitoring\ncapability, and compatibility with interventions such as braincomputer interfaces and neuromodulation. Zhao et al. described a neuromodulation trial protocol that employs fNIRS alongside EEG and behavioral assessments to track therapy-induced brain changes, underscoring its role as a safe, repeatable bedside tool for patients who are unsuitable for conventional neuroimaging.", "doc_items_refs": ["#/texts/29", "#/texts/33"], "page_nos": [1], "uuid": "be7b2775-f0dc-4158-956f-234bdb320d8a"}
{"doc_id": "2025__Editorial_Advanced_fNIRS_applications_in_neuroscience_and_neurological_disorders__W4414261891", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Editorial_Advanced_fNIRS_applications_in_neuroscience_and_neurological_disorders__W4414261891.doctags", "chunk_id": 4, "source_chunk_idxs": [9], "num_tokens": 503, "text": "Editorial on the Research Topic\nIn the field of rehabilitation, fNIRS enables objective, motiontolerant monitoring of brain activity in real-world therapeutic contexts. Zhang, Wang, et al. demonstrated that, in contrast to clinical scales, fNIRS can quantitatively evaluate rehabilitation efficacy, with increased cortical oxygenation and connectivity providing neurophysiological support for the effectiveness of poststroke spasticity interventions. Xiao et al. showed that, despite normal behavioral balance metrics, fNIRS can detect subtle central changes and compensatory strategies in musculoskeletal pain disorders, offering a more sensitive indicator of postural control deficits than standard measures. Xu et al. reported that functional electrical stimulation during walking in hemiparetic stroke patients reduced contralesional premotor cortex activation, illustrating how wearable fNIRS can capture gait-related neural changes in over-ground settings. Expanding its application to orthopedic rehabilitation, Cao et al. used wireless fNIRS to reveal reduced frontal -parietal activation during stair climbing in patients 3 months after anterior cruciate ligament reconstruction, suggesting neuroplastic changes following knee injury.\nIn the field of psychiatry, fNIRS offers a non-invasive, portable, and task-compatible means of detecting disorder-specific neural alterations in populations that are often difficult to assess with conventional neuroimaging techniques. Zhang, Tian, et al. showed that patients with schizophrenia who display auditory hallucinations exhibit altered frontotemporal activation patterns during verbal fluency tasks, demonstrating fNIRS ' ability to capture symptom-specific brain dysfunction. Ding et al. reported that patients with depression, anxiety, or insomnia exhibit distinct reductions in task-based prefrontal connectivity, supporting the use of fNIRS as a tool for differentiating executive deficits across heterogeneous psychiatric disorders. Chen D. et al. developed a free-association semantic task for perinatal depression, revealing that prefrontal oxyhemoglobin changes correlate with symptom severity. This highlights the applicability of fNIRS in lowcooperative populations. In postpartum women, Chen X. et al. further linked insomnia-related disruptions in prefront -temporal connectivity and network efficiency to mood symptoms, illustrating how real-time, portable fNIRS monitoring can reveal subclinical brain changes outside of traditional laboratory environments.", "doc_items_refs": ["#/texts/34", "#/texts/35"], "page_nos": [1], "uuid": "324c5207-53fa-4c04-ab1b-3e4cf1f340ec"}
{"doc_id": "2025__Editorial_Advanced_fNIRS_applications_in_neuroscience_and_neurological_disorders__W4414261891", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Editorial_Advanced_fNIRS_applications_in_neuroscience_and_neurological_disorders__W4414261891.doctags", "chunk_id": 5, "source_chunk_idxs": [10], "num_tokens": 283, "text": "Editorial on the Research Topic\nBeyond clinical and laboratory settings, Si et al. demonstrated the feasibility of using a wearable fNIRS oximeter for continuous monitoring of cerebral oxygen saturation in participants during high-altitude expeditions. This type of monitoring is critical for preventing brain injuries associated with both acute and chronic high-altitude exposure. The findings highlight the robustness of fNIRS under extreme, mobile conditions and its potential for managing brain oxygenation during environmental or exerciserelated challenges, thereby extending neuromonitoring far beyond the confines of the clinic.\nTaken together, the contributions to Advanced fNIRS Applications in Neuroscience and Neurological Disorders demonstrate that fNIRS has become a mainstream neuroimaging\nmodality. No longer a niche technique, it is now shedding new light on brain function across ages and disorders-from illuminating the underpinnings of childhood ADHD and autism, to tracking recovery in stroke and disorders of consciousness, to augmenting our ability to diagnose subtle cognitive impairment. The key message of this editorial collection is that fNIRS's non-invasiveness and portability are more than mere conveniences-they are gateways to groundbreaking research avenues and transformative clinical applications. In the years ahead, fNIRS is poised to play an increasingly vital role in both research and clinical practice, driving progress in brain science and improving outcomes for individuals with neurological and psychiatric conditions.", "doc_items_refs": ["#/texts/36", "#/texts/37", "#/texts/40"], "page_nos": [1], "uuid": "c1d8372d-4aa6-4bdc-af6a-255915f6f7bd"}
{"doc_id": "2025__Editorial_Advanced_fNIRS_applications_in_neuroscience_and_neurological_disorders__W4414261891", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Editorial_Advanced_fNIRS_applications_in_neuroscience_and_neurological_disorders__W4414261891.doctags", "chunk_id": 6, "source_chunk_idxs": [11, 12, 13, 14], "num_tokens": 261, "text": "Author contributions\nHQ: Writing - original draft. DZ: Writing - review &amp; editing. WD: Writing - review &amp; editing. DW: Writing - review &amp; editing.\n\nConflict of interest\nThe authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest.\nThe author(s) declared that they were an editorial board member of Frontiers, at the time of submission. This had no impact on the peer review process and the final decision.\n\nGenerative AI statement\nThe author(s) declare that Gen AI was used in the creation of this manuscript. for grammar checking and language polishing.\nAny alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us.\n\nPublisher's note\nAll claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher.", "doc_items_refs": ["#/texts/42", "#/texts/44", "#/texts/47", "#/texts/49", "#/texts/50", "#/texts/52"], "page_nos": [1], "uuid": "1f2270f1-af2d-4b0a-b3f7-be0c89940954"}
