{"doc_id": "2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180.doctags", "chunk_id": 0, "source_chunk_idxs": [0, 1], "num_tokens": 430, "text": "&lt;!-- image --&gt;\nReview\n\nMechanistic Insights and Translational Therapeutics of Neurovascular Unit Dysregulation in Vascular Cognitive Impairment\nLi-shan Lin 1 , Yu-qi Huang 2 , Jia-yi Xu 1 , Jun-ming Han 3 , Sheng Wu 2 , Yin-zhi Jin 1 , Chao Han 1 , Wei-kang Hu 2 , Zi-xuan Xu 2 , Takuya Sasaki 4 , Chu Tong 5,6,7, * , Ying-Mei Lu 1, *\n$^{1}$Key Laboratory of Modern Toxicology of Ministry of Education; School of Basic Medical Sciences, Nanjing Medical University, 211166 Nanjing, Jiangsu, China\n- $^{2}$School of Basic Medical Sciences, Nanjing Medical University, 211166 Nanjing, Jiangsu, China\n- $^{3}$Department of Neurosurgery, Nanjing Drum Tower Hospital, The Affiliated Hospital of Nanjing University Medical School, 210008 Nanjing, Jiangsu, China\n- $^{4}$Department of Pharmacology, Graduate School of Pharmaceutical Sciences, Tohoku University, 980-8578 Sendai, Japan\n- $^{5}$Medical Basic Research Innovation Center for Cardiovascular and Cerebrovascular Diseases of Ministry of Education, School of Pharmacy, Nanjing Medical University, 211166 Nanjing, Jiangsu, China\n- $^{6}$International Joint Laboratory for Drug Target of Critical Illnesses, School of Pharmacy, Nanjing Medical University, 211166 Nanjing, Jiangsu, China $^{7}$Jiangsu Key Laboratory of Drug Targets and Translational Medicine for Cardio-cerebrovascular Diseases, School of Pharmacy, Nanjing Medical\nUniversity, 211166 Nanjing, Jiangsu, China\n- *Correspondence: chutong@njmu.edu.cn (Chu Tong); lufx@njmu.edu.cn (Ying-Mei Lu)\nAcademic Editor: Bettina Platt\nSubmitted: 30 April 2025 Revised: 18 July 2025 Accepted: 23 July 2025 Published: 28 August 2025", "doc_items_refs": ["#/pictures/0", "#/texts/0", "#/texts/2", "#/texts/3", "#/texts/4", "#/texts/5", "#/texts/6", "#/texts/7", "#/texts/8", "#/texts/9", "#/texts/10", "#/texts/11", "#/texts/12"], "page_nos": [1], "uuid": "09f9fc02-1659-4111-903c-a814b8d6fa17"}
{"doc_id": "2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180.doctags", "chunk_id": 1, "source_chunk_idxs": [2], "num_tokens": 422, "text": "Abstract\nCognitive impairment represents a progressive neurodegenerative condition with severity ranging from mild cognitive impairment (MCI) to dementia and exerts significant burdens on both individuals and healthcare systems. Vascular cognitive impairment (VCI) represents a heterogeneous clinical continuum, spanning a spectrum from subcortical ischemic VCI (featuring small vessel disease, white matter lesions, and lacunar infarcts) to mixed dementia, where vascular and Alzheimer's-type pathologies coexist. While traditionally linked to macro- and microvascular dysfunction, the mechanisms underlying VCI remain complex. However, contemporary research has gone beyond structural vascular damage, highlighting the neurovascular unit (NVU) as a critical mediator. Emerging evidence demonstrates that cerebral endothelial cells within the NVU not only regulate oxygen and nutrient transport but also orchestrate neuroinflammatory signaling and neurovascular coupling (NVC). Crucially, endothelial dysfunction initiates a self-perpetuating cycle of NVU dysregulation characterized by: (1) NVC impairment through diminished nitric oxide bioavailability and calcium signaling defects, (2) blood-brain barrier (BBB) breakdown via tight-junction protein degradation and pericyte detachment, and (3) neuroinflammation driven by endothelial-derived cytokine release and leukocyte infiltration. By integrating recent advances in NVU biology, we have established a framework to inform clinical strategies for early diagnosis and targeted therapies, which we outline in this review. Moreover, proactive management of vascular risk factors (e.g., hypertension, diabetes) in presymptomatic stages may mitigate the progression from vascular injury to irreversible dementia, underscoring its preventive potential. These insights reinforce the idea that preserving NVU integrity represents a pivotal approach to mitigating the global dementia burden.\nKeywords: brain vascular disorders; clinical progression; cognitive impairments; neurovascular coupling; pathology", "doc_items_refs": ["#/texts/14", "#/texts/15"], "page_nos": [1], "uuid": "f46d55d9-6d5c-418a-9b9e-86799a7792f9"}
{"doc_id": "2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180.doctags", "chunk_id": 2, "source_chunk_idxs": [3], "num_tokens": 511, "text": "1. Introduction\nCognitive impairment, a defining feature of central nervous system (CNS) disorders, advances along a continuum from mild cognitive impairment to dementia, posing an escalating public health challenge [1-3]. The World Health Organization estimated that there are 55 million dementia cases worldwide, with vascular contributions implicated in over 20% of these diagnoses [3-5]. Evolving from Loeb's \"vascular dementia\" concept (1985) to Hachinski's broader vascular cognitive impairment (VCI) framework (1990s), this nosology now encompasses cerebrovascular-driven\ncognitive pathologies from preclinical vascular injury to overt dementia [4]. According to international criteria (VASCOG/ISTAART-AA) [6], VCI subtypes are defined by cerebrovascular lesion patterns. The most prevalent form is subcortical ischemic VCI, caused by small vessel disease and marked by white matter hyperintensities, lacunes, and microinfarcts. Other subtypes include multi-infarct dementia, strategic infarct dementia, hemorrhagic VCI, and mixed dementia (vascular and Alzheimer's pathology). Subcortical ischemic VCI represents the majority of cases, especially in elderly populations. VCI has demonstrated bidirectional interactions with neurodegenerative processes;\nThis is an open access article under the CC BY 4.0 license.\ncerebrovascular dysfunction not only independently causes cognitive decline but also accelerates Alzheimer's pathology [5], often manifesting decades before symptom onset [7]. Although disease-modifying therapies remain elusive, early vascular-risk management (e.g., hypertension control) shows preventive efficacy against cognitive deterioration [8]. The neurovascular unit (NVU) paradigm has revolutionized VCI research, shifting focus from isolated vascular lesions to dynamic neuron-glia-endothelium interactions.\nThe present review systematically examines: (1) the structural and functional organization of the NVU; (2) the mechanistic contributions of NVU components to the pathogenesis of VCI; and (3) current diagnostic and therapeutic strategies targeting the NVU. By synthesizing recent advances in neurovascular biology, we highlight the translational potential of preserving NVU integrity to mitigate cognitive decline across the cerebrovascular-neurodegenerative spectrum.", "doc_items_refs": ["#/texts/17", "#/texts/18", "#/texts/20", "#/texts/22", "#/texts/23"], "page_nos": [1], "uuid": "060c8e1f-9709-4438-b867-31f3c7b2e32b"}
{"doc_id": "2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180.doctags", "chunk_id": 3, "source_chunk_idxs": [4], "num_tokens": 437, "text": "2. The Physiological Function of the NVU\nThe NVU was formally conceptualized in 2001; it highlighted the intricate functional and structural interdependence between neural networks and the cerebral vascular system [9]. This multicellular ensemble integrates neural components (neurons, microglia, and astrocytes) with vascular components (endothelial cells, pericytes, and vascular smooth-muscle cells) through dynamic extracellular matrix-mediated interactions [10]. Contemporary research has underscored three critical roles of the NVU: (1) regulating cerebral blood flow to match neuronal metabolic demands [11]; (2) maintaining the structural integrity of the blood-brain barrier (BBB) [12]; and (3) facilitating metabolic homeostasis via the astrocyte-neuron lactate shuttle, which supports neuronal oxidative phosphorylation [12]. The selective permeability of the BBB is primarily governed by endothelial tight-junction proteins, including zonula occludens-1 (ZO-1), claudin-5, and occludin, which restrict paracellular diffusion [13]. Additionally, endothelial cells express specialized transport proteins (e.g., glucose transporters) and receptors (e.g., transferrin receptors), which enable regulated transcellular transport of essential nutrients and signaling molecules between systemic circulation and the CNS [14]. A hallmark of NVU functionality is neurovascular coupling (NVC)-the dynamic coordination between neuronal activity and regional cerebral blood flow [15]. Astrocytes act as intermediaries in this process by detecting synaptic neurotransmitter release and modulating vascular responses to ensure adequate delivery of oxygen and nutrients during periods of heightened neuronal activity [16]. Growing evidence has implicated NVU dysfunction in the pathogenesis of neurological disorders, particularly VCI. Principal pathological features include BBB disruption, impaired NVC, and dysregulated\nmetabolic crosstalk, all of which contribute to neuronal injury and cognitive decline.", "doc_items_refs": ["#/texts/25", "#/texts/27"], "page_nos": [1], "uuid": "a8dc1b80-7813-441f-859c-e1694b1300e6"}
{"doc_id": "2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180.doctags", "chunk_id": 4, "source_chunk_idxs": [5], "num_tokens": 512, "text": "2.1 The NVU\nAs the structural and functional foundation of the NVU, the cerebral vascular system constitutes a highly organized network responsible for delivering oxygen and nutrients to the brain and eliminating metabolic waste. This system consists of capillaries, arteries, and veins [17], originating from the Circle of Willis at the base of brain and branching into pial arteries and arterioles that traverse the cortical surface [18]. These vessels follow an outward-to-inward vascularization pattern, establishing a dense collateral network capable of rapidly redistributing blood flow during ischemic events [10]. The architecture of the NVU varies markedly across distinct vascular segments. Pial arteries are encased by multiple layers of smooth-muscle cells and transition into penetrating arterioles, which travel into the brain parenchyma through cerebrospinal-fluid-filled perivascular spaces [19]. Penetrating arterioles feature thinner smooth-muscle cell layers. As they progress deeper into the parenchyma and narrow into parenchymal arterioles, smooth-muscle cells become discontinuous or single-layered, and the perivascular space undergoes stenosis. At this level, vessels are enesthesaid by astrocyte endfeet, with sparse neuronal projections attaching to the vascular basement membrane [20,21]. Capillaries, the smallest vessels, are devoid of smooth-muscle cells. Instead, pericytes cover approximately 30% of their circumference, and astrocyte endfeet envelop the remaining 70%, forming polarized connections that mediate bidirectional neurovascular signaling via astrocyte-neuron junctions [22,23]. Brain capillaries, as the core anatomical basis of the BBB, achieve their selective permeability through several features: tight junctions between endothelial cells (e.g., claudin-5, occludin) that limit paracellular diffusion [24]; suppressed levels of endothelial transcytosis, which reduce nonspecific molecular transport; and targeted expression of transporters (e.g., glucose transporter 1 (GLUT1), L-type amino acid transporter 1 (LAT1)) on endothelial membranes, enabling regulated solute exchange between the circulation and the CNS. This hierarchical organization-from macroscale arteries to microscale capillaries-ensures", "doc_items_refs": ["#/texts/29"], "page_nos": [1], "uuid": "1e8c47e3-d71a-4a9f-a1b5-564a6e21c7d3"}
{"doc_id": "2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180.doctags", "chunk_id": 5, "source_chunk_idxs": [6, 7], "num_tokens": 464, "text": "2.1 The NVU\ntight integration of vascular, glial, and neural elements, collectively maintaining the homeostatic microenvironment of the brain (Fig. 1).\nWhile NVU structure is increasingly well characterized, a key challenge is whether experimental models can replicate its physiological functions. In vitro systems often reproduce BBB features like tight junctions [25], but complex processes such as NVC, waste clearance, and immune surveillance require coordinated multicellular interactions. Current organoid or bioengineered models capture some structural aspects [26] but lack the spatial\n&lt;!-- image --&gt;\nand signaling complexity of in vivo NVU dynamics. Thus, advancing from structural mimicry to functional validation is critical for evaluating model fidelity and translational relevance.\nA functional analysis of the NVU must move beyond structural features to explore its dynamic roles in cerebral homeostasis. The following sections examine core NVU functions including BBB regulation, blood flow control, metabolic coupling, and neuroimmune interactions, and evaluate how well current models replicate them, highlighting both the complexity of the NVU and the challenges in developing effective disease models.\n\n2.2 Functions of the NVU\nThe NVU orchestrates four core fundamental physiological functions through highly coordinated, dynamic interactions among its cellular components, governed by molecular signaling pathways (Fig. 2). First, The NVU maintains BBB integrity and tightly regulates selective molecular exchange between the systemic circulation and brain parenchyma, primarily through endothelial tight junctions and specialized transporters. Second, the NVU dynamically modulates cerebral blood flow by coupling neuronal activity to vascular responses, ensuring precise spatiotemporal delivery of oxygen and nutrients to meet regional metabolic demands. Third, the NVU provides critical metabolic support and maintains neurotransmitter homeostasis, with astrocytes playing a central role by supplying energy substrates and recycling neurotransmitters to maintain efficient synaptic function. Finally, the NVU mediates immune surveillance and regulates neuroinflammation through a bidirectional communication network involving microglia, endothelial cells, astrocytes, and perivascular macrophages, which collectively balance protective immune responses with the prevention of neurotoxicity.", "doc_items_refs": ["#/texts/29", "#/texts/30", "#/pictures/1", "#/texts/31", "#/texts/32", "#/texts/34"], "page_nos": [1], "uuid": "e28d42e7-f6e7-4be8-9d3e-86483642740c"}
{"doc_id": "2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180.doctags", "chunk_id": 6, "source_chunk_idxs": [8], "num_tokens": 228, "text": "2.2.1 Maintenance of BBB Integrity and Molecular Exchange\nThe NVU preserves the brain's immune-privileged microenvironment by regulating BBB function. Endothelial cells establish a selective barrier through tight junctions (e.g., claudins, occludin) and specialized transporters (e.g., GLUT1) (Fig. 2), which govern the trafficking of ions, nutrients, and xenobiotics between the circulation and brain parenchyma. Astrocytic endfoot further reinforce BBB integrity by secreting fas ligand (CD95L) to restrict peripheral immune cell infiltration, while pericytes stabilize endothelial junctions and secrete vascular endothelial growth factor A (VEGF-A) to promote endothelial survival (Fig. 2). Microglia contribute transiently by preserving barrier function during vascular injury, recruited via endothelial-derived chemokines. Together, these mechanisms safeguard the CNS from harmful substances while permitting regulated metabolic exchange.\n&lt;!-- image --&gt;", "doc_items_refs": ["#/texts/36", "#/pictures/2"], "page_nos": [1], "uuid": "2c2f8058-be44-4e50-bd33-9ed592d13b32"}
{"doc_id": "2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180.doctags", "chunk_id": 7, "source_chunk_idxs": [9], "num_tokens": 315, "text": "2.2.2 Cerebral Blood Flow Regulation\nThe NVU mediates NVC to dynamically match blood flow to the brain's metabolic demands. As illustrated in Fig. 2, this process involves coordinated signaling across multiple cell types. Vascular endothelial cells release vasoactive mediators such as nitric oxide (NO), prostaglandins, and endothelin in response to shear stress and metabolic cues. Capillary Kir2.1 channels propagate retrograde electrical signals to upstream arterioles, synchronizing vascular tone across brain regions (Fig. 2). Neurons modulate blood flow via glutamate-induced Ca 2 $^{+}$signaling, triggering NO and prostaglandin synthesis. GABAergic interneurons release neuropeptide Y and NO for bidirectional vascular control. Astrocytes amplify neuronal activity by releasing Ca 2 $^{+}$-dependent prostaglandins and EETs, acting on pericytes and smooth muscle cells to adjust vessel diameter. Microglia modulate hemodynamics via purinergic P2Y12 receptors, particularly during hypoperfusion (Fig. 2). Subcortical neuromodulators such as acetylcholine and serotonin exert regulatory influence via perivascular astrocytic endfeet. This multilayered system ensures precise spatiotemporal perfusion, sustaining cognitive function and metabolic homeostasis.", "doc_items_refs": ["#/texts/38"], "page_nos": [1], "uuid": "49ec6dde-1bd6-4d48-8501-ef09221857cc"}
{"doc_id": "2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180.doctags", "chunk_id": 8, "source_chunk_idxs": [10], "num_tokens": 359, "text": "2.2.3 Metabolic and Nutritional Coupling\nThe NVU functions as an integrated entity, characterized by tightly coordinated metabolic and nutritional interdependencies among its cellular components. This intricate network maintains cerebral metabolic homeostasis through precise intercellular regulatory mechanisms. Endothelial cells released NO modulates astrocytic aerobic glycolysis through Hif-1 α upregulation, which is a critical adaptive mechanism for metabolic coordination [27]. These endothelial cells also provide lactate as an essential metabolic substrate for pericytes; deficiency in this lactate transfer triggers pericyte apoptosis and subsequent compromise of the BBB (Fig. 2) [28]. The VEGF family exhibits bidirectional regulatory functions, with classical VEGFs demonstrating neurotrophic effects by promoting neurogenesis, neuronal migration, axonal guidance, and oligodendrocyte precursor cell mobility [29]. Endothelium-derived semaphorin 3G (Sema3G) guides synaptic maturation through activating the neuropinol-2/PlexinA4 pathway [30]. Conversely, non-endothelial components actively regulate endothelial development through complementary mechanisms. Pericytes enhance vascular and neural growth via exosomal delivery of VEGF-A [31], whereas astrocytes promote BBB maturation through Src-suppressed C kinase substrate (SSeCKS)-mediated amplification of angiotensin I-dependent endothelial tight-junction formation in co-culture models. Neuronal regulation is exemplified by perivascular-neuron-derived Semaphorin 3E (Sema3E), which orchestrates vascular patterning", "doc_items_refs": ["#/texts/40"], "page_nos": [1], "uuid": "6f02f7c1-0e18-44b7-ae93-163f7fb790d7"}
{"doc_id": "2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180.doctags", "chunk_id": 9, "source_chunk_idxs": [11, 12], "num_tokens": 457, "text": "2.2.3 Metabolic and Nutritional Coupling\nFigure caption: Fig. 1. The structural features of the NVU. Different structures of the NVU depend on the different types of vascular networks. This diagram presents a cross-sectional anatomy of penetrating arteries and intraparenchymal arteries. It demonstrates the interactive network among the vascular wall, basal lamina, ensheathing astrocyte endfoot processes, perivascular pericytes, neuronal synapses, and microglial cells. The right panel magnifies structural details of the NVU. The icons representing neuron, microglia, astrocyte, pericyte, and VSMC were created using BioRender.com and subsequently modified. NVU, neurovascular unit; VSMC, vascular smooth muscle cell.\nthrough Plexin-D1-receptor activation on endothelial tip cells (see Fig. 2) [32]. This intricate metabolic symbiosis creates a vulnerable interdependence-the functional integrity of each NVU component relies critically on support from other cellular elements. Disruption of any single constituent initiates cascading dysfunction across the unit, ultimately manifesting as pathological states. The vulnerability of this mutually dependent system underscores the importance of preserving NVU homeostasis for neurological health.\n\n2.2.4 Immune Surveillance and Neuroinflammation Regulation\nThe neuroimmune interface in the CNS operates through bidirectional crosstalk, with cellular constituents of the NVU coordinating immune surveillance via intricate ligand-receptor networks. Endothelial CD36 and toll-like receptor 4 (TLR4) mediate innate immune sensing (Fig. 2). CD36-mediated signaling in endothelial cells drives neurotoxic neutrophil activation via colony stimulating factor 3 (CSF3) production and amplifies interleukin (IL)-1 β -induced endothelial dysfunction, thereby exacerbating post-ischemic brain injury [33,34]. Pathologically elevated CD36 expression also has been shown to correlate with hypertensive BBB disruption\n&lt;!-- image --&gt;", "doc_items_refs": ["#/pictures/3", "#/texts/43", "#/texts/46", "#/pictures/4"], "page_nos": [1], "uuid": "f9a834a8-c319-425f-a38d-503d834c6f7e"}
{"doc_id": "2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180.doctags", "chunk_id": 10, "source_chunk_idxs": [13], "num_tokens": 457, "text": "2.2.4 Immune Surveillance and Neuroinflammation Regulation\nFigure caption: Fig. 2. Key molecules mediating the physiology and pathology of the NVU components. The upper sankey diagram elucidates the regulatory network of key molecules on cellular physiological functions within the NVU. The left column lists critical molecules, the middle column details their corresponding functions, and the right column identifies cell types in the NVU. Colored lines between the three columns visually map specific molecular-function-cell associations, collectively clarifying molecular-mediated neurovascular interactions and providing a framework for investigating therapeutic targets in brain diseases. The lower sankey diagram systematically maps the multidimensional network linking biomolecules, pathological processes, and different cell types in NVU. The left panel lists key molecules, the center panel outlines the corresponding pathophysiological events, and the right panel labels associated cells. Colored lines connect the three panels to visualize specific associations. Color schemes differentiate functional modules, while the width and color intensity of the lines reflect the strength or regulatory direction of the associations, collectively elucidating the molecular mechanisms underlying neurovascular dysregulation. GLUT1, glucose transporter 1; CD36, cluster of differentiation 36; CD95L, fas ligand; LRP-1, low density lipoprotein receptor-related protein 1; NOS3, nitric oxide synthase 3; NPY, neuropeptide Y; EP4, prostaglandin E2 receptor 4; PDGF, platelet-derived growth factor; IGF2, insulin-like growth factor 2; ANGPT2, angiopoietin 2; AQP4, aquaporin-4; IL-4, interleukin 4; IL-13, interleukin 13; IL-10, interleukin 10; CCL5, CC motif chemokine ligand 5; CX3CL1, C-X3-C motif chemokine ligand 1; MMPs, matrix metalloproteinases; BBB, blood-brain barrier.\n&lt;!-- image --&gt;", "doc_items_refs": ["#/pictures/5", "#/pictures/6"], "page_nos": [1], "uuid": "27b3f035-c70d-45f1-9351-5bd22465405f"}
{"doc_id": "2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180.doctags", "chunk_id": 11, "source_chunk_idxs": [14], "num_tokens": 344, "text": "3. NVU Dysfunction in VCI\nDysfunction of the NVU is a critical contributor to VCI (Fig. 2). Damage to the NVU impairs the integrated signaling among neurons, glia, pericytes, and endothelial cells that is essential for maintaining cerebral homeostasis. A hallmark of NVU dysfunction is BBB breakdown, which affects the delivery of oxygen and nutrients to the brain and allows inflammatory mediators and neurotoxic substances to infiltrate brain tissue [45]. This dual pathology-compromised metabolic support and heightened neuroinflammation-is compounded by the reduced clearance of toxic metabolites, such as amyloidβ and hyperphosphorylated tau, that accumulate due to impaired perivascular waste drainage [46]. The downstream consequences are multifactorial: chronic hypoperfusion triggers neuronal dysfunction and synaptic loss; neuroinflammatory pathways propagate white matter lesions; and the synergy of vascular injury with amyloid/tau pathologies accelerates neurodegeneration. These processes collectively manifest as progressive cognitive decline, ranging from mild executive dysfunction to overt dementia. It is important to note that NVU impairment creates a vicious cycle-neuroinflammation further damages the BBB, and metabolic stress exacerbates neuronal vulnerability. Therefore, preserving NVU integrity is not only critical for preventing VCI onset but also represents a therapeutic target to mitigate disease progression. Therapeutic approaches to re-establish NVC, stabilize the BBB, and enhance perivascular clearance mechanisms may offer synergistic benefits in halting cognitive deterioration.", "doc_items_refs": ["#/texts/51"], "page_nos": [1], "uuid": "1b9f1717-a29b-40dc-9a4a-d210e483d32c"}
{"doc_id": "2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180.doctags", "chunk_id": 12, "source_chunk_idxs": [15], "num_tokens": 288, "text": "3.1 Endothelial-Pericyte Communication in VCI\nDynamic crosstalk between endothelial cells and pericytes, along with the precise regulation of pericyte activity, plays a pivotal role in angiogenesis and vascular homeostasis. As illustrated in Fig. 2, these interactions are mediated by key molecular pathways including platelet-derived growth factor B (PDGFB)/PDGF receptor β (PDGFR β ) signaling, Angpt2 regulation, and GLUT1-mediated metabolic coupling. Furthermore, endothelial immune receptors (CD36 and TLRs) contribute to vascular dysfunction during inflammatory responses, demonstrating the dual role of these molecular systems in both physiological maintenance and pathological injury. Notably, recent studies have suggested that pericyte degeneration may underlie up to 50% of dementia cases, primarily through mechanisms involving BBB disruption and leakage [47]. Pericyte dysfunction drives pathological cascades characterized by aberrant endothelial transcytosis, dysregulation of molecular transporters, and aberrant presentation of leukocyte adhesion molecules. In adult murine models with pericyte deficiency induced by partial loss of PDGFB/PDGFR β signaling, Angpt2 deficiency exacerbates BBB leakage and induces profound endothelial\n&lt;!-- image --&gt;", "doc_items_refs": ["#/texts/53", "#/pictures/7"], "page_nos": [1], "uuid": "2055c89f-b514-45b0-bfd5-bcd17ce6acc0"}
{"doc_id": "2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180.doctags", "chunk_id": 13, "source_chunk_idxs": [16], "num_tokens": 254, "text": "3.1 Endothelial-Pericyte Communication in VCI\ncell heterogeneity (Fig. 2). These vascular abnormalities correlate with diminished cerebral oxygen delivery, myelin degradation, proliferation of neurotoxic astrocytes, and neuronal injury, ultimately leading to progressive cognitive deterioration [48]. Furthermore, metabolic crosstalk between endothelial cells and pericytes is essential for BBB integrity. Endothelial-cell-derived lactate serves as a critical metabolic substrate for pericytes. Impaired lactate production, due to endothelial Glut1 deficiency, disrupts cerebral pericyte coverage and compromises BBB function [28]. Additionally, the lipoprotein receptor low density lipoprotein receptor-related protein 1 (LRP1) in pericytes regulates cerebrovascular stability and BBB integrity in an apolipoprotein E (APOE) isoform-dependent manner. Notably, APOE4-expressing SmLrp1 - / - mice demonstrate pronounced cerebrovascular astrogliosis and BBB breakdown, underscoring the interplay between LRP1 signaling and APOE variants in VCI [49].", "doc_items_refs": ["#/texts/54"], "page_nos": [1], "uuid": "88123583-2206-4cb1-bb98-6e812ce894b3"}
{"doc_id": "2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180.doctags", "chunk_id": 14, "source_chunk_idxs": [17], "num_tokens": 453, "text": "3.2 Endothelial-Neuron Communication in VCI\nNeuron-derived cwcv and kazal like domains proteoglycan 1 (SPOCK1) regulates BBB permeability by modulating extracellular matrix remodeling and endothelial transcytosis, as well as indirectly impairing pericyte-endothelial interactions [50]. These structural deficits may contribute to VCI by allowing neurotoxic substances to infiltrate the brain. Recent studies have highlighted the role of neuronal mitochondrial dysfunction in VCI pathogenesis. In murine models of chronic cerebral hypoperfusion (CCH), neuronal peroxisome proliferator-activated receptor γ coactivator 1 α (PGC-1 α ) expression is significantly downregulated [51]. Overexpression of PGC-1 α mitigates cognitive deficits by upregulating mitochondrial antioxidants (e.g., superoxide dismutase) and uncoupling proteins, thereby suppressing reactive oxygen species (ROS) overproduction and cellular oxidative injury. Environmental-risk exposures, particularly a high-salt diet, exacerbate VCI through endothelial dysfunction. A high-salt diet (HSD) inhibits endothelial nitric oxide synthase (eNOS) function, resulting in impaired NO bioavailability. This NO deficiency decreases S-nitrosylation of neuronal calpain, resulting in calpain hyperactivation. Calpain hyperactivation in turn triggers cyclin-dependent kinase 5-mediated tau hyperphosphorylation and aggregation, a hallmark of tauopathy, ultimately contributing to synaptic damage and cognitive impairment (Fig. 2). This pathway underscores the critical role of vascular-endothelial metabolic modulation in linking systemic risk exposures to neurodegenerative progression. Notably, L-arginine supplementation (an NO precursor) reverses p-Tau accumulation and prevents cognitive decline in high-salt-diet models [52].\n&lt;!-- image --&gt;", "doc_items_refs": ["#/texts/56", "#/pictures/8"], "page_nos": [1], "uuid": "46a80c85-5ddc-4e67-a81a-9e6f60f31fa9"}
{"doc_id": "2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180.doctags", "chunk_id": 15, "source_chunk_idxs": [18], "num_tokens": 345, "text": "3.3 Endothelial-Glia Communication in VCI\nAstrocytes serve as essential guardians of the BBB, playing critical roles in both structural maintenance and functional regulation. Age-related pathological changes in astrocyte function significantly contribute to VCI. Comparative studies have revealed that aged mice develop reactive astrogliosis marked by hypertrophic GFAP + processes, contrasting with the quiescent phenotype in young counterparts. Mechanistically, astrocyte-specific deletion of transient receptor potential ankyrin 1 (TRPA1) exacerbates CCH-induced VCI by impairing leukemia inhibitory factor (LIF) production, highlighting a neuroprotective signaling axis [53]. Concurrently, aged astrocytes demonstrate pathological mislocalization of aquaporin-4 (AQP4) channels at perivascular endfeet, disrupting the polarization required for efficient cerebrospinal fluid-interstitial fluid (CSF-ISF) exchange. This age-related AQP4 dysregulation can be mitigated through overexpression of slit guidance ligand 2 (Slit2), which preserves channel polarization, enhances paravascular clearance, and ameliorates age-related cognitive impairments [54]. Emerging therapeutic strategies target these astrocyte mechanisms. Remarkably, optogenetically driven 40 Hz gamma oscillation stimulation enhanced amyloid clearance via a brain-lymphatic mechanism contingent on restored AQP4 polarization at astrocyte endfeet, demonstrating the translational potential of modulating gliosocular communication [55].", "doc_items_refs": ["#/texts/58"], "page_nos": [1], "uuid": "2de23c4a-b0e7-4eba-bcbf-4feab7767b0e"}
{"doc_id": "2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180.doctags", "chunk_id": 16, "source_chunk_idxs": [19], "num_tokens": 382, "text": "3.3 Endothelial-Glia Communication in VCI\nIn VCI progression, microglia fluctuate between neurotoxic and reparative states. At baseline, microglia adopt a surveillant (\"resting\") phenotype, but vascular insults such as CCH or ischemic events trigger activation. Activated microglia bifurcate into two functionally distinct polarization states: the pro-inflammatory, pro-inflammatory M1 phenotype, or the cytoprotective M2 phenotype [56]. The M1 phenotype is marked by elevated ionized calcium-binding adapter molecule 1 (Iba1) immunoexpression, amoeba-like morphological transformation, and release of cytokines (e.g., IL-1 β , TNF α ), chemokines, and ROS. These mediators amplify neuroinflammation by inducing endothelial adhesion molecules (e.g., vascular cell adhesion molecule-1 (VCAM-1), intercellular adhesion molecule-1 (ICAM-1)), enhancing leukocyte infiltration, and disrupting BBB integrity. Notably, microglial activation is amplified in bilateral common carotid artery stenosis models, in which Iba1 + cell density correlates with white-matter damage and cognitive decline [57]. Genetic studies have further revealed that Nrf2 deficiency intensifies CCH-induced microgliosis and white-matter pathology, whereas microglial receptor-interacting protein kinase 2 (RIPK2) drives post-stroke neuroinflammation [58,59]. M1 phenotype microglia exacerbate vascular injury through multiple mechanisms: ROS production inhibits endothelial proliferation and angiogenesis, impairing", "doc_items_refs": ["#/texts/59"], "page_nos": [1], "uuid": "ba195ed8-fe5e-4f88-b24f-3cf7e536267e"}
{"doc_id": "2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180.doctags", "chunk_id": 17, "source_chunk_idxs": [20], "num_tokens": 508, "text": "3.3 Endothelial-Glia Communication in VCI\nvascular repair; and matrix metalloproteinases (MMPs), primarily MMP-2 and MMP-9, mediate the proteolysis of tight-junction proteins (e.g., claudins, occludin) and contribute to extracellular matrix degradation, accelerating BBB breakdown and white-matter damage [60,61]. Sustained cytokine release perpetuates a feedforward loop of endothelial activation and leukocyte recruitment. Conversely, M2 polarization-induced by anti-inflammatory signals (IL-4, IL-13, IL-10)-shifts microglia toward a reparative phenotype. M2 phenotype microglia upregulate surface receptors (CD206, CD163), cytosolic enzymes (arginase1), and secretory proteins (YM1), and secrete anti-inflammatory cytokines (IL-10, TGFβ ) to resolve inflammation and promote tissue repair [40]. Cross-talk with endothelial cells further modulates this balance; endothelial-derived CCL5 binds microglial CCR5, enhancing Claudin5 expression and transiently stabilizing the BBB during acute inflammation [39]. Similarly, neuronal C-X3-C motif chemokine ligand 1 (CX3CL1) recruits microglia to injury sites via C-X3-C motif chemokine receptor 1 (CX3CR1) signaling, enabling localized phagocytosis and damage containment [62].\nHowever, new evidence has challenged the simplistic binary classification of microglial polarization. Recent transcriptomic and fate-mapping studies have revealed that microglia exist along a spectrum of activation states, with overlapping M1/M2 signatures and region-specific phenotypic heterogeneity. In chronic vascular injury, microglia may adopt \"disease-associated microglia\" (DAM) or \"white-matter-associated microglia\" (WAM) phenotype, exhibiting both pro-inflammatory and reparative traits depending on disease stage and microenvironmental cues. This plasticity underscores a dynamic rather than dichotomous activation model, suggesting that context-dependent reprogramming of microglial states may be more therapeutically relevant than promoting a fixed polarization outcome.", "doc_items_refs": ["#/texts/61", "#/texts/62"], "page_nos": [1], "uuid": "d9b44ce8-25f9-4174-8ddc-b88e6fd1b14e"}
{"doc_id": "2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180.doctags", "chunk_id": 18, "source_chunk_idxs": [21], "num_tokens": 339, "text": "3.3 Endothelial-Glia Communication in VCI\nWe therefore interpret microglial polarization as a continuum modulated by temporal and spatial factors including BBB disruption, endothelial signaling, and systemic comorbidities such as diabetes or aging. The seemingly contradictory findings regarding microglial roles in VCI may reflect this dynamic interplay, in which early M1-like responses mediate debris clearance and barrier defense, but sustained activation exacerbates vascular injury unless appropriately resolved or transitioned toward repair. Targeting the polarization \"switch points\" or the modulating microglial signaling pathways (e.g., triggering receptor expressed on myeloid cells 2 (TREM2), NLR family pyrin domain containing 3 (NLRP3), signal transducer and activator of transcription 3 (STAT3)) may offer more nuanced therapeutic strategies than targeting binary M1/M2 modulation alone.\nTo recapitulate, VCI arises from a dysregulated interplay of endothelial, pericyte, neuronal, and glial\ndysfunction, promoted by environmental stressors and CCH. This pathological crosstalk disrupts NVU homeostasis, initiating cascades of BBB breakdown, oxidative damage, tau-mediated neurodegeneration, and chronic neuroinflammation. Ultimately, these mechanisms converge to drive white-matter injury, synaptic loss, and progressive cognitive decline, thereby positioning NVU-centric therapies as critical interventions (Fig. 3). These interconnected pathways highlight the need for multi-target interventions to restore NVU function.", "doc_items_refs": ["#/texts/63", "#/texts/64", "#/texts/66"], "page_nos": [1], "uuid": "4130e6b7-bf41-44ad-a845-15653e1fceed"}
{"doc_id": "2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180.doctags", "chunk_id": 19, "source_chunk_idxs": [22, 23], "num_tokens": 398, "text": "4. Preclinical Models Supporting Mechanistic Insights\nAnimal models of VCI are essential for understanding the underlying mechanisms and for developing potential therapies. These models often involve inducing CCH, such as through bilateral common-carotid-artery occlusion (BCCAO) in rats or bilateral carotid-artery stenosis (BCAS) in mice, to mimic the reduced blood flow observed in human VCI. Other models may involve genetic modifications, such as introducing human Neurogenic locus notch homolog protein 3 ( NOTCH3 ) mutations to simulate cerebral autosomal dominant arteriopathy with subcortical infarcts and leucoencephalopathy (CADASIL). These models help researchers study the resulting white-matter lesions, BBB dysfunction, neuroinflammation activation, and cognitive impairment. However, these models usually do not fully replicate the complexity of human VCI, as the human brain's vascular structure and cognitive functions are more intricate. Additionally, inducing CCH or genetic modifications in animals may not accurately reflect the gradual and multifactorial nature of VCI development in humans. The heterogeneity in responses among different animal species and strains to induced conditions poses significant challenges to the generalization of findings. Despite these limitations, animal models remain a crucial tool, providing valuable insights into the pathophysiology of VCI and guiding the development of targeted treatments.\n\n4.1 BCCAO Version of the CCH Model\nThe BCCAO model replicates the pathological features of chronic ischemic cerebrovascular disease by reducing cerebral blood flow and inducing sustained cerebral hypoperfusion [63]. It results in neuronal degeneration, white-matter lesions, and heightened BBB permeability. It serves as a model for investigating the impact of chronic ischemia on brain structure and function, as well as for assessing potential neuroprotective therapies.", "doc_items_refs": ["#/texts/68", "#/texts/70"], "page_nos": [1], "uuid": "c3338e20-94ba-48c4-97d1-315c7ce0fc21"}
{"doc_id": "2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180.doctags", "chunk_id": 20, "source_chunk_idxs": [24], "num_tokens": 506, "text": "4.2 Hypertension Model\nThe gene-mutation models such as the spontaneously hypertensive rat strain or the salt-sensitive hypertensive rat strain are used to simulate disease induced by hypertension such as cerebral microvascular disease, white-matter\n&lt;!-- image --&gt;\nFigure caption: Fig. 3. Aberrant signaling transduction of NVU components in vascular cognitive dementia. Disturbances of the NVU signaling pathway can result in chronic cerebral hypoperfusion, BBB breakdown, pericyte dysfunction, reduced neuronal activity, neuroinflammation, and white-matter lesions, which in turn contribute to VCI. The downward arrow indicates a decrease (downregulation), while the upward arrow represents an increase (upregulation). IEG, immediate early genes; GFAP, glial fibrillary acidic protein; PGC1 -α , peroxisome proliferator activated receptor γ coactivator-1 α ; SOD2, superoxide dismutase 2; PRX3, peroxiredoxin 3; GPX, glutathione peroxidase; Nrf2, nuclear factor erythroid 2-related factor 2; RIPK2, receptor-interacting serine/threonine kinase 2; IFN γ , interferon-gamma; TNF α , tumor necrosis factor-alpha; BBB, blood-brain barrier; HSD, high-salt diet; eNOS, endothelial nitric oxide synthase; ICAM-1, intercellular adhesion molecule-1; IGF2, insulin-like growth factor 2; PDGFB, platelet-derived growth factor B; ANGPT2, angiopoietin 2; SPOCK1, kazal like domains proteoglycan 1; GLUT1, glucose transporter 1; AQP4, aquaporin-4; TRPA1, transient receptor potential ankyrin 1; LIF, leukemia inhibitory factor; VCI, vascular cognitive impairment; VEGF-B, vascular endothelial growth factor B; CXCL1, C-X-C motif chemokine ligand 1. The icons representing neuron, microglia, astrocyte, pericyte, endothelia cell and leukocyte were created using BioRender.com and subsequently modified.", "doc_items_refs": ["#/texts/72", "#/pictures/9", "#/pictures/10"], "page_nos": [1], "uuid": "d07a22a7-8168-4662-953c-a2dea1de04bd"}
{"doc_id": "2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180.doctags", "chunk_id": 21, "source_chunk_idxs": [25, 26, 27, 28], "num_tokens": 453, "text": "4.2 Hypertension Model\ndamage and cognitive impairment, to study the effects of hypertension on cerebrovascular and cognitive function and to evaluate the therapeutic effect of antihypertensive drugs on VCI [64,65].\n\n4.3 Cerebral Microhemorrhage Model\nCerebral microhemorrhage is induced by injection of collagenase [65]. The cerebral microhemorrhage can lead to a local inflammatory reaction, BBB break, and neuron damage, in order to simulate cerebral microvascular disease. It can be used to study the pathological mechanism, prevention, and treatment strategy of cerebral microhemorrhage [4,63].\n&lt;!-- image --&gt;\n\n4.4 APOE ε 4 Transgenic Mice\nThe APOE gene serves as a crucial genetic marker for VCI. Notably, the APOE ε 4 allele is intimately linked to cerebrovascular diseases and cognitive decline. Across diverse ethnic populations, individuals carrying the APOE ε 4 allele face an elevated risk of developing VCI, particularly when accompanied by other cardiovascular risk factors such as hypertension and diabetes [66]. Gene-editing techniques are used to construct APOE ε 4 -gene knock-in mice. The APOE ε 4 allele is linked to cerebrovascular pathology and cognitive dysfunction. Mice with cerebrovascular pathology, white-matter damage, and\ncognitive impairment can be used to study the role of the APOE ε4 allele in VCI in order to provide evidence for clinical gene-related therapeutic strategies [67,68].\n\n4.5 NOTCH3 Mutant Mice\nCADASIL represents the most prevalent inherited cause of stroke and vascular dementia in adults. The disorder is associated with mutations in the NOTCH3 gene, which encodes a transmembrane receptor predominantly expressed in the smooth-muscle cells of systemic arteries [68]. Mouse models carrying human NOTCH3 mutations have been developed to mimic CADASIL pathology. NOTCH3 mutation results in cerebral microvascular disease, white-matter damage, and cognitive impairment, thus providing valuable tools for investigating the disease mechanisms and potential therapeutic interventions for CADASIL [69,70].", "doc_items_refs": ["#/texts/74", "#/texts/76", "#/pictures/11", "#/texts/78", "#/texts/80", "#/texts/82"], "page_nos": [1], "uuid": "63f949d9-e7f1-4669-aa75-b5ae96fd9cfc"}
{"doc_id": "2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180.doctags", "chunk_id": 22, "source_chunk_idxs": [29, 30], "num_tokens": 421, "text": "4.6 Additional Preclinical Models of VCI\nIn addition to the classic models such as BCAO, BCAS, hypertensive rats, and genetically modified mice (e.g., APOE ε4 and NOTCH3 ), a variety of complementary preclinical models has been developed to simulate diverse pathological processes underlying vascular cognitive impairment (VCI). Those models were designed to target specific risk factors and mechanisms, such as endothelial dysfunction, metabolic disorders, aging, and post-stroke pathology. Together, they contribute to a more comprehensive understanding of VCI pathogenesis and offer broader platforms for testing mechanism-based therapeutic strategies.\nFor example, endothelial-specific gene-knockout models (e.g., eNOS $^{/}$, Pdgfb $^{/}$) allow for the study of BBB breakdown and cerebrovascular inflammation. Models combining high-fat diet and streptozotocin-induced diabetes mimic metabolic-syndrome-related VCI. Aging models like senescence-accelerated mouse prone 8 (SAMP8) or chronic D-galactose administration are used to replicate age-associated vascular and cognitive decline. Hyperhomocysteinemia models, such as Cystathionine β -synthase (CBS)-deficient mice or high-methionine diets, reproduce small-vessel disease and white-matter injury. Additionally, stroke-based models, including photothrombotic infarction or middle-cerebral-artery occlusion (MCAO), serve as valuable tools to investigate post-ischemic cognitive impairment.\nThe integration of these diverse models enables researchers to capture the multifactorial nature of human VCI. A summary of representative additional models is provided in Table 1 (Ref. [71-78]).\n\n5.1 Drug Treatment of VCI\nThe development of effective therapies for VCI remains hindered by the complexity and heterogeneity of its pathological features, which overlap with multiple CNS", "doc_items_refs": ["#/texts/84", "#/texts/85", "#/texts/86", "#/texts/89"], "page_nos": [1], "uuid": "72ddb273-c120-4b15-9e2e-18e36e6c8f18"}
{"doc_id": "2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180.doctags", "chunk_id": 23, "source_chunk_idxs": [31], "num_tokens": 511, "text": "5.1 Drug Treatment of VCI\ndisorders. VCI encompasses a spectrum of vascular-related cognitive disfunction, ranging from subcortical ischemic vascular dementia to mixed pathologies with coexisting Alzheimer's disease features. This diversity manifests in highly variable underlying mechanisms, including small vessel disease, chronic hypoperfusion, white matter degeneration, and neuroinflammation. Such etiological variability not only contributes to therapeutic uncertainty but also complicates the translation of uniform pharmacological interventions into clinically meaningful outcomes. To date, no animal model has fully replicated the diverse neuropathological changes observed in VCI, which has significantly slowed translational research progress. Preclinical studies in animal models have suggested that targeting key pathogenic mechanisms-such as chronic cerebral ischemia, neuroinflammation, oxidative stress, or white-matter injury-may improve cognitive outcomes. For instance, interventions promoting oligodendrocyte-precursor-cell proliferation and differentiation have demonstrated potential for remyelination and mitigation of white-matter injury-related cognitive decline [79]. Despite these preclinical insights, no disease-modifying therapies for vascular dementia have been approved globally, and current clinical strategies remain largely symptom-based. Several pharmacological agents have been evaluated in clinical trials. Cholinesterase inhibitors (e.g., donepezil, rivastigmine) and N-methyl-D-aspartate (NMDA) receptor blockers (e.g., memantine), currently approved for Alzheimer's disease, have shown limited efficacy in VCI. A key limitation is that these drugs modulate cholinergic or glutamatergic pathways, which are more central to AD pathology, rather than targeting vascular-specific mechanisms such as endothelial dysfunction, BBB disruption, or impaired NVC. Furthermore, their therapeutic effects may be further attenuated in VCI subtypes characterized by predominant white matter damage or executive dysfunction but relatively intact hippocampal pathology, highlighting the need for mechanism-driven, subtype-specific treatment strategies. Meta-anyses have indicated that there were only marginal cognitive improvements and minimal functional benefits after six months of treatment. Other symptomatic approaches under investigation include: (1) Cerebrolysin: A porcine brain-derived peptide preparation containing neurotrophic factors, amino", "doc_items_refs": ["#/texts/91"], "page_nos": [1], "uuid": "1cba5fc3-c25d-43ae-8681-e7201a6a1653"}
{"doc_id": "2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180.doctags", "chunk_id": 24, "source_chunk_idxs": [32], "num_tokens": 505, "text": "5.1 Drug Treatment of VCI\nacids, and small peptides. Although the underlying mechanisms require further investigation, the treatment appears to stimulate neurogenesis and enhance synaptic plasticity. Meta-analyses reported modest benefits in cognitive performance and global functioning in VCI patients, though its requirement for repeated intravenous infusions limits practicality for widespread use [80-82]. (2) Actovegin: A calf-blood-derived protein extract proposed to enhance glucose utilization and oxygen\n&lt;!-- image --&gt;\nuptake. Preliminary studies have suggested that Actovegin treatment produced neuroprotective effects in post-stroke cognitive impairment and mild-to-moderate VCI, with one trial that reported cognitive improvements after six months of therapy [83-85]. (3) Nimodipine: A calcium-channel blocker with vasoactive and neuroprotective properties. The report of a 52-week trial of nimodipine treatments showed no significant global cognitive benefits but noted selective improvements in executive function when compared to a placebo [86,87]. Similar to donepezil and memantine, these therapeutic agents are typically assessed in clinically heterogeneous cohorts that include patients with pure vascular pathology, mixed dementia, or indeterminate etiology. This inadequate stratification masks true treatment effects and likely contributes to the inconsistent therapeutic outcomes observed across clinical trials. Importantly, many phase III trials, despite rigorous design, have returned neutral or negative results due to challenges such as insufficient duration, insensitive outcome measures, and lack of biomarker-guided inclusion criteria. For instance, the large-scale Phase III trial VaD-301 (donepezil) demonstrated only modest improvements in cognitive scores, with no significant benefits on global function or quality of life [88]. Similarly, the MEM-MD-02 Phase III trial of memantine in vascular dementia failed to achieve clinically meaningful outcomes despite early cognitive gains [89]. The effects of cerebrolysin treatment were small (Cohen's d ~ 0.25), and the results of Actovegin treatment, although promising in some studies, lacked consistent large-scale replication [90]. Nimodipine treatment's selective cognitive benefits further underscored the variability in trial outcomes. These results emphasize the need for more refined trial methodologies tailored specifically to VCI pathophysiology.", "doc_items_refs": ["#/texts/91", "#/pictures/12", "#/texts/92"], "page_nos": [1], "uuid": "ba8b94a7-fcbb-4bdf-9fef-d5db20eb132b"}
{"doc_id": "2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180.doctags", "chunk_id": 25, "source_chunk_idxs": [33], "num_tokens": 419, "text": "5.1 Drug Treatment of VCI\nMost VCI trials use randomized, double-blind, placebo-controlled designs over 6-12 months. However, heterogeneous inclusion criteria, varied cognitive measures, and a lack of VCI-specific scales limit interpretation. Multi-center trials like ARTEMIDA (Actovegin) and ADVANCE (donepezil) aim to improve standardization and statistical power.\nTaken together, these trials highlight critical lessons for future therapeutic development: (1) the need for rigorous patient stratification based on imaging or biomarker-defined subtypes; (2) the importance of adopting multi-domain cognitive outcome measures rather than relying solely on global scales; (3) a shift toward mechanism-based therapies addressing upstream vascular pathology rather than late-stage symptoms; and (4) the integration of personalized medicine strategies, leveraging digital phenotyping, advanced neuroimaging, and genomic profiling to guide treatment selection. Incorporating these insights into clinical trial design may enhance the translational success of emerging VCI therapeutics. Table 2 (Ref. [84,91-96]) summarizes representative clinical trials,\n&lt;!-- image --&gt;\nincluding agent, trial phase, duration, primary endpoints, and main outcomes.\nEmerging therapeutic strategies are designed to address VCI through novel mechanisms. Non-invasive neuromodulation uses transcranial magnetic stimulation (TMS) to enhance cortical plasticity [97]. The regenerative approaches is based on inducing pluripotent stem cell (iPSC)-based therapies to repair damaged neural networks [98]. CRISPR-based interventions target pathogenic mutations or enhancing neuroprotective pathways [99]. Preclinical studies have suggested that these modalities may synergize with pharmacological treatments to amplify cognitive recovery [88,90]. However, rigorous clinical validation is needed to establish their safety and efficacy in VCI populations.", "doc_items_refs": ["#/texts/93", "#/texts/94", "#/pictures/13", "#/texts/95", "#/texts/96"], "page_nos": [1], "uuid": "edcf2197-b246-4e2e-8861-1ea8d461c61f"}
{"doc_id": "2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180.doctags", "chunk_id": 26, "source_chunk_idxs": [34], "num_tokens": 260, "text": "5.2 Early Intervention for Risk Factors\nResults from a large number of epidemiological and simulation studies have suggested that early interventions for modifiable risk factors may be more likely to delay or even prevent dementia than does drug therapy. Several studies have shown that strict control of blood pressure can reduce the risk of vascular dementia. Education in adolescence can raise the basic level of cognition and reduce the risk of dementia by about 7%/year in a dose-dependent manner [63]. Actively socializing and exercising can minimize the effects of diabetes on cognitive function [88]. In addition, a healthy diet rich in polyunsaturated fatty acids and antioxidants also helps to prevent dementia. Therefore, keeping healthy habits while controlling vascular risk factors may be an effective strategy for the prevention and treatment of dementia.\nRecent cohort studies, including the Finnish Geriatric Intervention Study to Prevent Cognitive Impairment and Disability (FINGER) and SPRINT-MIND, support the efficacy of multidomain interventions in mitigating cognitive decline. The FINGER trial showed that combining physical activity, cognitive training, nutrition, and vascular risk control reduced cognitive deterioration in at-risk elderly individuals [100]. SPRINT-MIND further demonstrated that intensive blood pressure control (\n&lt;!-- image --&gt;", "doc_items_refs": ["#/texts/98", "#/texts/99", "#/pictures/14"], "page_nos": [1], "uuid": "ef0278a3-817f-4f7d-a901-f2b9963fd8d6"}
{"doc_id": "2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180.doctags", "chunk_id": 27, "source_chunk_idxs": [35], "num_tokens": 488, "text": "Table 1. Representative animal models of VCI.\n| Animal model                                              | Method                                                             | Predominant cause                                              | Vascular pathology                                                                                                                                             | NVU lesions                                                                            | References   |\n|-----------------------------------------------------------|--------------------------------------------------------------------|----------------------------------------------------------------|----------------------------------------------------------------------------------------------------------------------------------------------------------------|----------------------------------------------------------------------------------------|--------------|", "doc_items_refs": ["#/tables/0"], "page_nos": [1], "uuid": "14167de2-6269-46b3-a5cb-8ee14ff7d65a"}
{"doc_id": "2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180.doctags", "chunk_id": 28, "source_chunk_idxs": [36], "num_tokens": 463, "text": "Table 1. Representative animal models of VCI.\n| Chronic cerebral hypop- erfusion model                    | Rate: BCCAO model                                                  | Chronic cerebral hypop- erfusion Multiple cerebral infarctions | BBB disruption, white-matter lesions, vascular basement membrane disorder Cerebral small-vessel disease, enlarged perivascular spaces, parenchymal rarefaction | Astrocyte endfeet alterations, proliferation, neuronal loss                            | [71]         |\n| Hypertension model                                        | Spontaneously hypertensive rats, high-salt diet                    | Multiple cerebral infarctions                                  | Cerebral small-vessel disease, enlarged perivascular spaces, parenchymal rarefaction                                                                           | Neuronal loss, astrocyte proliferation                                                 |              |\n| Cerebral microhemorrhage model                            | Colagenase injection                                               | Cerebral hemorrhage                                            | Inflammatory response, BBB disruption, cerebral vascular wall rupture                                                                                          | Neuronal injury                                                                        | [73]         |\n| APOE ε4 transgenic mice                                   | APOE ε4 gene knock-in                                              | Neuroinflammation                                              | Cerebrovascular disease, exacerbated amyloid-beta and tau protein pathology, BBB disruption                                                                    | Astrocyte and microglial proliferation, cerebral white matter injury                   | [74]         |\n| Endothelial-specific knockout mice (e.g., Pdgfb , Glut1 ) | Genetic modification                                               | Impaired endothelial signaling                                 | BBB breakdown, reduced CBF, neuroinflammation                                                                                                                  | Endothelial apoptosis, pericyte loss, BBB leakage, impaired transporter function       | [75]         |\n| STZ-induced diabetes mice                                 | High-fat diet, streptozotocin injection                            | Metabolic inflammation                                         | Oxidative stress, microvascular rarefaction, white matter degeneration                                                                                         | Endothelial dysfunction, astrocyte metabolic dysregulation, impaired glucose transport | [76]         |\n| Aging-related mouse SAMP8 mice                            | D-galactose-induced aging CBS-deficient mice; high-methionine diet | Physiological aging                                            | White-matter rarefaction, tau hyperphosphorylation                                                                                                             | Reduced astrocyte support, impaired NVC, chronic inflammation                          | [77]         |", "doc_items_refs": ["#/tables/0"], "page_nos": [1], "uuid": "1312eabd-b845-460e-9e5a-be3072a8d58c"}
{"doc_id": "2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180.doctags", "chunk_id": 29, "source_chunk_idxs": [37, 38], "num_tokens": 196, "text": "Table 1. Representative animal models of VCI.\n| Hyperhomocysteinemia model                                | Elevated homocysteine levels                                       | Small-vessel disease, demyelination                            | Small-vessel disease, demyelination                                                                                                                            | Vascular endothelial damage, oligodendrocyte stress, astrocyte reactivity              | [78]         |\nAPOE, apolipoprotein E; BCCAO, bilateral common-carotid-artery occlusion; BCAS, bilateral carotid-artery stenosis; SAMP8, senescence-accelerated mouse prone 8; NVC, neurovascular coupling; CBF, cerebral blood flow; STZ, streptozotocin; CBS, cystathionine β-synthase; VCI, vascular cognitive impairment.\n\nTable 2. Representative Clinical Trials for Pharmacological Interventions in VCI.\n\nTable 2. Representative Clinical Trials for Pharmacological Interventions in VCI.", "doc_items_refs": ["#/tables/0", "#/texts/103", "#/texts/107", "#/tables/1"], "page_nos": [1], "uuid": "0e20f15c-dee1-4b84-97a0-849a4c7eec6a"}
{"doc_id": "2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180.doctags", "chunk_id": 30, "source_chunk_idxs": [39], "num_tokens": 507, "text": "Table 2. Representative Clinical Trials for Pharmacological Interventions in VCI.\n| Drug           | Phase/Design                                     | Sample                              | Duration    | Primary Outcome                                  | Main Findings                                                  | Reference   |\n|----------------|--------------------------------------------------|-------------------------------------|-------------|--------------------------------------------------|----------------------------------------------------------------|-------------|\n| Donepezil      | Phase III, RCT, double-blind, placebo-controlled | Mixed VCI/AD patients               | 24-52 weeks | Cognitive function (ADAS-cog, MMSE)              | Modest improvements in cognition; no global function benefit   | [91]        |\n| Rivastigmine   | Phase III, RCT, placebo-controlled               | Probable VCI (subcortical ischemia) | 24 weeks    | ADAS-cog, Clinician's Interview-Based Impression | Mild cognitive improvement in executive function               | [92]        |\n| Memantine      | Phase III, RCT, placebo-controlled               | VCI patients                        | 28 weeks    | ADAS-cog, global function                        | No significant benefit compared with placebo                   | [93]        |\n| Cerebrolysin   | Meta-analysis (multiple RCTs)                    | VCI/post-stroke dementia            | 4-24 weeks  | Cognitive tests (MMSE, ADAS-cog), global scales  | Modest improvement; requires IV infusions                      | [94]        |", "doc_items_refs": ["#/tables/1"], "page_nos": [1], "uuid": "c05bb420-109d-494f-b41b-e95152e207bb"}
{"doc_id": "2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180.doctags", "chunk_id": 31, "source_chunk_idxs": [40], "num_tokens": 212, "text": "Table 2. Representative Clinical Trials for Pharmacological Interventions in VCI.\n| Actovegin      | Phase II, multicenter, double-blind RCT          | Post-stroke cognitive impairment    | 6 months    | ADAS-cog+ , executive and memory scores          | Significant cognitive benefit vs. placebo                      | [84]        |\n| Nimodipine     | Phase III, RCT, placebo-controlled               | Mild-to-moderate VCI                | 52 weeks    | Cognitive domains (e.g., executive function)     | No global benefit, but improved executive function in subgroup | [95]        |\n| TMS (non-drug) | Pilot trial, open-label                          | Elderly with cognitive impairment   | 2-6 weeks   | Working memory, attention                        | Preliminary benefit; larger controlled studies needed          | [96]        |\nADAS-Cog, Alzheimer's disease assessment scale-cognitive subscale; TMS, transcranial magnetic stimulation; RCT, randomized controlled trial.\n&lt;!-- image --&gt;", "doc_items_refs": ["#/tables/1", "#/texts/108", "#/pictures/15"], "page_nos": [1], "uuid": "f40bf344-216d-48f5-b544-db81706ca661"}
{"doc_id": "2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180.doctags", "chunk_id": 32, "source_chunk_idxs": [41], "num_tokens": 496, "text": "Table 3. Representative biomarkers for VCI and research progress.\n| Biomarker Type   | Representative Markers                         | Clinical Relevance                                                 | Research Findings & Advances                                                                                   | References   |\n|------------------|------------------------------------------------|--------------------------------------------------------------------|----------------------------------------------------------------------------------------------------------------|--------------|\n| Neuroimaging     | WMH, lacunes, microbleeds, brain atrophy, CSVD | Reflect cerebrovascular damage and structural brain changes in VCI | WMH and lacunes are emphasized in diagnostic criteria; CMBs and PVSs not yet fully integrated                  | [103]        |\n| Genetic          | fMRI, DCE-MRI PET (amyloid, tau, inflammation) | Detect molecular pathology linked to mixed dementia                | Reveal early BBB breakdown and perfusion deficits in VCI PET biomarkers aid differentiation between AD and VCI | [115]        |\n| Genetic          | MTHFR C677T                                    | Increase homocysteine level; increase the risk of vascular injury  | Linked to impaired methylation, vascular dysfunction                                                           | [104,105]    |\n| Genetic          | NOTCH3                                         | Monogenic cause of CADASIL                                         | GOM deposition disrupts small vessels, early cognitive decline                                                 | [68,106]     |", "doc_items_refs": ["#/tables/2"], "page_nos": [1], "uuid": "f81fb6cb-6649-4d7e-92d2-1bf8820b9d4d"}
{"doc_id": "2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180.doctags", "chunk_id": 33, "source_chunk_idxs": [42], "num_tokens": 438, "text": "Table 3. Representative biomarkers for VCI and research progress.\n| Genetic          | APOE ε4                                        | BBB damage, amyloid deposition                                     | Acts synergistically with vascular risks in VCI pathogenesis                                                   | [107]        |\n| Genetic          | COLA1/2                                        | Structural defect in vessel wall                                   | Related to hereditary CSVD and hemorrhagic stroke                                                              | [108,109]    |\n| Genetic          | HTRA1                                          | Impaired protease activity in CARASIL, CSVD                        | Contributes to impaired TGF-β signaling and vessel fibrosis                                                    | [110]        |\n| Genetic          | PICALM                                         | Decrease A β clearance, increase vascular burden                   | GWAS-linked risk locus in AD/VCI overlap                                                                       | [111]        |\n| Genetic          | ACE polymorphisms                              | Vascular tone and perfusion                                        | Linked to hypertension, ischemic stroke and cognitive decline                                                  | [112]        |\n| Genetic          | IL-1 β , IL-6, TNF-α                           | Increase in plasma/CSF in VCI                                      | IL-6 elevation specific to VCI; may aid in subtype classification                                              | [118]        |\n| Genetic          | QUIN/KYNA ratio                                | Reflects balance between neurotoxic and neuroprotective            | High QUIN/KYNA ratio correlates with hippocampal damage and memory loss                                        | [113]        |\n| Genetic          | ROCK1/2                                        | BBB integrity and neuroinflammation                                | ROCK activation loosens tight junctions, increase cytokine influx                                              | [114]        |\n| Genetic          | CRP                                            | Marker of systemic inflammation                                    | Associated with dementia risk in population cohorts                                                            | [119]        |\nWMH, white-matter hyperintensity; CADASIL, cerebral autosomal dominant arteriopathy with subcortical infarcts and leukoencephalopathy; CSVD, cerebral small-vessel disease; fMRI, functional magnetic resonance imaging; DCE-MRI, dynamic contrast-enhanced magnetic resonance imaging; QUIN/KYNA ratio, quinolinic acid/kynurenic acid ratio; PET, positron emission tomography.", "doc_items_refs": ["#/tables/2", "#/texts/111"], "page_nos": [1], "uuid": "f37901d3-a5ff-4c59-b133-2425f5e3c805"}
{"doc_id": "2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180.doctags", "chunk_id": 34, "source_chunk_idxs": [43, 44], "num_tokens": 365, "text": "6. Biomarker Advances for VCI Diagnosis and Therapeutic Monitoring\nCurrently, the diagnostic paradigm for VCI hinges predominantly on a combination of clinical assessments, radiological evaluations including diffuse white-matter hyperintensities, ischemic strokes, lacunes and microbleeds, neurocognitive scales, and pathological examinations. However, most tools lack sensitivity and objectivity, and pathological diagnosis is invasive. Therefore, identifying early, non-invasive biomarkers is critical for timely intervention in individuals at risk of mild VCI. Recent research has identified several promising biomarker categories (Table 3, Ref. [68,103-119]).\n\n6.1 Neuroimaging Biomarkers\nImaging biomarkers are critical for VCI diagnosis and monitoring, with MRI preferred over CT for its higher resolution and sensitivity to cerebrovascular changes. Key imaging features of VCI include white-matter hyperintensities (WMH), brain atrophy, lacunar infarcts, microbleeds, and cerebral small-vessel disease (CSVD) [103]. Advanced modalities like functional MRI (fMRI) and dynamic contrast-enhanced MRI (DCE-MRI) help assess cerebral perfusion and BBB integrity, and positron emission tomography (PET) imaging provides molecular-level insights by detecting amyloid, tau, and inflammatory markers. Despite the growing utility of imaging in VCI, current diagnostic guidelines emphasize WMH and infarcts in strategic locations but have yet to incorporate findings like cerebral microbleeds (CMBs) and perivascular spaces (PVsS). Moreover, there remains a lack of standardized imaging criteria and minimum technical requirements in MRI and CT for the diagnosis of VCI.", "doc_items_refs": ["#/texts/113", "#/texts/115"], "page_nos": [1], "uuid": "5be75794-c170-4085-bb08-5051b287a703"}
{"doc_id": "2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180.doctags", "chunk_id": 35, "source_chunk_idxs": [45, 46], "num_tokens": 476, "text": "6.2 Genetic Biomarkers\nSeveral key gene variants have been closely linked to increased VCI risk. The MTHFR gene C677T mutation elevates homocysteine, causing endothelial damage [104, 105]. NOTCH3 mutations, associated with CADASIL, result in extracellular domain aggregation and granular osmiophilic material deposition, impairing small-vessel function [68,106]. The APOE ε4 allele is linked to BBB dysfunction [107], while COL4A1/2 mutations compromise vascular integrity [108,109]. HTRA1 gene mutations underlie cerebral autosomal dominant arteriopathy with subcortical infarcts and leukoencephalopathy (CADASIL) and CSVD through loss of protease function, leading to impaired vascular homeostasis [110]. PICALM affects A β clearance [111], and ACE polymorphisms are associated with vascular risk and cognitive decline [112]. Together, these genetic markers not only help identify high-risk individuals but also provide mechanistic insights and therapeutic targets for precision medicine approaches in VCI.\n&lt;!-- image --&gt;\n\n6.3 Inflammatory Markers\nInflammatory biomarkers play a key role in the pathogenesis of VCI, particularly post-stroke cognitive impairment. Persistent inflammation post-stroke-especially with comorbid diabetes-leads to neuronal loss and microglial activation. Activation of the IDO-kynurenine pathway results in an elevated quinolinic acid/kynurenic acid (QUIN/KYNA) ratio, which correlates with cognitive decline [113]. Elevated IL-1 β , IL-6, and TNF α levels are found in both plasma and CSF of VCI patients, with IL-6 showing specificity for vascular dementia [120]. ROCK1/2 activation disrupts the BBB [114], while biomarkers like LCN2, glial fibrillary acidic protein (GFAP), NEFL, GDF15, and LTBP2 show promise for early detection [121]. Future efforts should validate these markers in longitudinal studies and integrate them with imaging and genetic data for improved diagnosis and trial design.", "doc_items_refs": ["#/texts/117", "#/pictures/16", "#/texts/119"], "page_nos": [1], "uuid": "ed7c060d-d797-4913-a90a-c7bde472678c"}
{"doc_id": "2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180.doctags", "chunk_id": 36, "source_chunk_idxs": [47], "num_tokens": 384, "text": "7. Future Prospects\nVCI, originating from cerebrovascular pathology, ranks among the leading causes of dementia alongside Alzheimer's disease. The pathogenesis of VCI involves multifactorial mechanisms, with vascular dysfunction driven by inflammation, hypoperfusion, and oxidative stress serving as central contributors. These processes induce vascular endothelial injury and impair NVC, perpetuating BBB breakdown and pathological immunological activation. A hallmark consequence is cerebrovascular disease-associated white-matter injury, marked by demyelination and axonal degeneration, which directly accelerates cognitive deterioration. These findings collectively highlight the indispensable role of vascular endothelial cells in safeguarding NVU homeostasis and sustaining cognitive health.\nDespite progress in deciphering discrete pathological pathways, comprehensive mechanistic insights remain elusive, underscoring the need for systematic, interand multidisciplinary research. The shared phenotypic features of VCI and other neurodegenerative diseases, along with its pathological heterogeneity, have hindered the development of animal models that accurately replicate the progression of the human condition. This translational gap continues to hamper advances in diagnostics and targeted therapies. Consequently, prioritizing the development of physiologically relevant VCI models is critical to unraveling disease mechanisms, identifying biomarkers, and catalyzing therapeutic innovation [88]. To date, no therapies effectively modify VCI progression [122]. Current pharmacological approaches-largely repurposed from Alzheimer's disease therapies-have yielded limited cognitive improvements even after extended use. Addressing this unmet need demands a dual focus: accelerating the translation of basic discoveries into\nnovel drug targets, and optimizing clinical trial frameworks for VCI-specific therapies [123].", "doc_items_refs": ["#/texts/121", "#/texts/122", "#/texts/124"], "page_nos": [1], "uuid": "628c3dfb-39a3-4b32-9fdf-0e9e591f4e9e"}
{"doc_id": "2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180.doctags", "chunk_id": 37, "source_chunk_idxs": [48], "num_tokens": 512, "text": "7. Future Prospects\nEqually vital is the preemptive management of vascular risk factors (e.g., diabetes, hypertension) and early NVU preservation, both of which may help delay, or prevent, cognitive decline. However, scalable early-diagnostic systems and standardized intervention protocols remain underdeveloped. Population-wide vascular risk mitigation, though resource-intensive and requiring long-term commitment, holds proven potential for reducing VCI incidence [123]. Notably, stroke prevention represents a strategic priority, as stroke survivors face markedly elevated VCI risk. In the absence of disease-modifying drugs, presumptomatic vascular optimization through nonpharmacological strategies-such as lifestyle modifications, blood pressure control, and metabolic regulation-emerges as a cornerstone for VCI prevention. Proactive cerebrovascular health preservation may not only diminish VCI prevalence but also may decelerate its pathological trajectory, thereby improving quality-adjusted life years for patients and caregivers. Such multidomain interventions promise to extend functional autonomy in aging populations while alleviating the escalating socioeconomic burden of dementia on global healthcare systems.\nLooking ahead, advancing VCI research requires an interdisciplinary framework. Integrating brain organoid models with multi-omics technologies (e.g., transcriptomics, proteomics, metabolomics, and epigenomics) enables cell-type and time-resolved dissection of NVU dysfunction, overcoming the limitations of traditional animal models and facilitating biomarker discovery.\nTo support early diagnosis and therapeutic monitoring, we suggest the construction of a \"neurovascular unit steady-state quantitative index system\" aimed at quantitatively assessing NVU health under both physiological and pathological conditions. This system could integrate key parameters such as endothelial integrity, NVC efficiency, BBB permeability, and inflammatory cytokine profiles, offering a composite score reflective of NVU homeostasis.\nEmerging technologies further expand NVU research potential: brain-computer interfaces (BCIs) could enable real-time monitoring of neurovascular dynamics [124], while microfluidic brain-on-a-chip systems allow for patient-specific modeling and drug testing. When combined with artificial intelligence, these innovations promise to shift VCI research toward predictive and mechanism-based paradigms.\nCollectively, these interdisciplinary innovations will not only enhance our understanding of NVU-centered disease processes but also pave the way for precision medicine strategies aimed at preserving cognitive health throughout the lifespan.", "doc_items_refs": ["#/texts/125", "#/texts/126", "#/texts/127", "#/texts/128", "#/texts/129"], "page_nos": [1], "uuid": "a1631957-b9c4-4a89-864e-9e1a25894225"}
{"doc_id": "2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180.doctags", "chunk_id": 38, "source_chunk_idxs": [49, 50, 51, 52, 53], "num_tokens": 247, "text": "Author Contributions\nYML and CT conceived the perspective of the work. CT, LSL, YQH, and JYX drafted the manuscript. CT, LSL, YQH, JMH, and SW designed the figure. YZJ, CH, WKH, JYX and ZXX collect and sort references. TS reviewed the manuscript and designed the tables. TS and YML modified the manuscript. All authors contributed to editorial changes in the manuscript. All authors read and approved the final manuscript. All authors have participated sufficiently in the work and agreed to be accountable for all aspects of the work.\n\nEthics Approval and Consent to Participate\nNot applicable.\n\nAcknowledgment\nNot applicable.\n\nFunding\nThis work was supported by the National Key Research and Development Program of China (2022YFE0108600 to Y.M.L.).\n\nConflict of Interest\nThe authors declare no conflict of interest. Ying-Mei Lu is serving as one of the Editorial Board members of this journal. We declare that Ying-Mei Lu had no involvement in the peer review of this article and has no access to information regarding its peer review. Full responsibility for the editorial process for this article was delegated to Bettina Platt.", "doc_items_refs": ["#/texts/132", "#/texts/134", "#/texts/136", "#/texts/138", "#/texts/140"], "page_nos": [1], "uuid": "47a20c6f-e79b-40a4-a488-e11886d7099f"}
{"doc_id": "2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180.doctags", "chunk_id": 39, "source_chunk_idxs": [54], "num_tokens": 506, "text": "References\n- [2] Gorelick PB, Scuteri A, Black SE, Decarli C, Greenberg SM, Iadecola C, et al . Vascular contributions to cognitive impairment and dementia: a statement for healthcare professionals from the american heart association/american stroke association. Stroke. 2011; 42: 2672-2713. https://doi.org/10.1161/STR.0b 013e3182299496.\n- [2] Yiengprugsawan VS, Browning CJ. Non-communicable Diseases and Cognitive Impairment: Pathways and Shared Behavioral Risk Factors Among Older Chinese. Frontiers in Public Health. 2019; 7: 296. https://doi.org/10.3389/fpubh.2019.00296.\n- [3] Livingston G, Sommerlad A, Orgeta V, Costafreda SG, Huntley J, Ames D, et al . Dementia prevention, intervention, and care. Lancet. 2017; 390: 2673-2734. https://doi.org/10.1016/ S0140-6736(17)3163-6.\n- [4] Linh TTD, Hsieh YC, Huang LK, Hu CJ. Clinical Trials of New Drugs for Vascular Cognitive Impairment and Vascular Dementia. International Journal of Molecular Sciences. 2022; 23: 11067. https://doi.org/10.3390/ijms231911067.\n- [5] Markus HS, Schmidt R. Genetics of Vascular Cognitive Impairment. Stroke. 2019; 50: 765-772. https://doi.org/10. 1161/STROKEAHA.118.020379.\n- [6] Sachdev P, Kalaria R, O'Brien J, Skoog I, Alladi S, Black SE, et al . Diagnostic criteria for vascular cognitive disorders: a VASCOG statement. Alzheimer Disease and Associated Disorders. 2014; 28: 206-218. https://doi.org/10.1097/WAD. 0000000000000034.\n- [7] Verdelho A, Wardlaw J, Pavlovic A, Pantoni L, Godefroy\n&lt;!-- image --&gt;\n&lt;!-- image --&gt;", "doc_items_refs": ["#/texts/142", "#/texts/143", "#/texts/144", "#/texts/145", "#/texts/146", "#/texts/147", "#/texts/148", "#/pictures/17", "#/pictures/18"], "page_nos": [1], "uuid": "a61bfa66-9d36-4f8c-ab03-88ec965fdaec"}
{"doc_id": "2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180.doctags", "chunk_id": 40, "source_chunk_idxs": [55], "num_tokens": 494, "text": "References\n- [25] Pérez-López A, Torres-Suárez AI, Martín-Sabroso C, Aparicio-Blanco J. An overview of in vitro 3D models of the blood-brain barrier as a tool to predict the in vivo permeability of nanomedicines. Advanced Drug Delivery Reviews. 2023; 196: 114816. https://doi.org/10.1016/j.addr.2023.114816.\n- [26] Yi SA, Zhang Y, Rathnam C, Pongkulapa T, Lee KB. Bioengineering Approaches for the Advanced Organoid Research. Advanced Materials. 2021; 33: e2007949. https://doi.org/10.1002/adma.202007949.\n- [27] Kierans SJ, Taylor CT. Regulation of glycolysis by the hypoxia-inducible factor (HIF): implications for cellular physiology. The Journal of Physiology. 2021; 599: 23-37. https://doi.org/10.1113/JP280572.\n- [28] Lee HW, Xu Y, Zhu X, Jang C, Choi W, Bae H, et al . Endothelium-derived lactate is required for pericyte function and blood-brain barrier maintenance. The EMBO Journal. 2022; 41: e109890. https://doi.org/10.15252/embj.2021109890.\n- [29] Apte RS, Chen DS, Ferrara N. VEGF in Signaling and Disease: Beyond Discovery and Development. Cell. 2019; 176: 1248-1264. https://doi.org/10.1016/j.cell.2019.01.021.\n- [30] Tan C, Lu NN, Wang CK, Chen DY, Sun NH, Lyu H, et al . Endothelium-Derived Semaphorin 3G Regulates Hippocampal Synaptic Structure and Plasticity via Neuropilin-2/PlexinA4. Neuron. 2019; 101: 920-937. e13. https://doi.org/10.1016/j.neuron.2018.12.036.", "doc_items_refs": ["#/texts/149", "#/texts/150", "#/texts/151", "#/texts/152", "#/texts/153", "#/texts/154"], "page_nos": [], "uuid": "412ff7b1-34b5-44cf-aee9-c2d28fca7dfd"}
{"doc_id": "2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180.doctags", "chunk_id": 41, "source_chunk_idxs": [56], "num_tokens": 503, "text": "References\n- [31] Zhang Y, Neng L, Sharma K, Hou Z, Johnson A, Song J, et al . Pericytes control vascular stability and auditory spiral ganglion neuronal survival. eLife. 2023; 12: e83486. https://doi.org/10. 7554/eLife.83486.\n- [32] Ding JB, Oh WJ, Patatini BL, Gu C. Semaphorin 3E-Plexin-D1 signaling controls pathway-specific synapse formation in the striatum. Nature Neuroscience. 2011; 15: 215-223. https://doi i.org/10.1038/nn.3003.\n- [33] Chen Y, Zhang J, Cui W, Silverstein RL. CD36, a signaling receptor and fatty carrier that regulates cell membrane metabolism and fate. The Journal of Experimental Medicine. 2022; 219: e20211314. https://doi.org/10.1084/jem.20211314.\n- [34] Salvador B, Arranz A, Francisco S, Córdoba L, Punzón C, Llamas MÁ, et al . Modulation of endothelial function by Toll like receptors. Pharmacological Research. 2016; 108: 46-56. https://doi.org/10.1016/j.phrs.2016.03.038.\n- [35] Li J, Li M, Ge Y, Chen J, Ma J, Wang C, et al . β-amyloid protein induces mitochondracy-dependent ferroptosis through the CD36/PINK/PARKIN pathway leading to blood-brain barrier destruction in Alzheimer's disease. Cell &amp; Bioscience. 2022; 12: 69. https://doi.org/10.1186/s1358-022-00807-5.\n- [36] Lively S, Schlicher LC. Microglia Responses to Pro-inflammatory Stimuli (LPS, IFNγ+TNF α ) and Reprogramming by Resolving Cotykinics (IL-4, IL-10). Frontiers in Cellular Neuroscience. 2018; 12: 215. https://doi.org/10.3389/fncel.2018.00215.", "doc_items_refs": ["#/texts/155", "#/texts/156", "#/texts/157", "#/texts/158", "#/texts/159", "#/texts/160"], "page_nos": [], "uuid": "1132a7b8-ef33-4123-8268-36d94ac9966f"}
{"doc_id": "2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180.doctags", "chunk_id": 42, "source_chunk_idxs": [57], "num_tokens": 313, "text": "References\n- [37] Daupheine SM, Karans A. Lipopolysaccharide signaling in endothelial cells. Laboratory Investigation; a Journal of Technical Methods and Pathology. 2006; 86: 9-22. https://doi i.org/10.1038/labinvest3700366.\n- [38] Uemura MT, Maki T, Ihara M, Lee VMY, Trojanowski JQ. Brain Microvascular Pericytes in Vascular Cognitive Impairment and Dementia. Frontiers in Aging Neuroscience. 2020; 12: 80. https: //doi.org/10.3389/fnagi.2020.00080.\n- [39] Haruwaka K, Ikegami A, Tachibana Y, Ohno N, Konishi H, Hashimoto A, et al . Dual microglia effects on blood brain barrier permeability induced by systemic inflammation. Nature Communications. 2019; 10: 5816. https://doi.org/10.1038/ s41467-019-13812-z.\n- [40] Lan X, Han X, Li Q, Yang QW, Wang J. Modulators of microglial activation and polarization after intracerebral haemorrhage. Nature Reviews. Neurology. 2017; 13: 420-433.\nhttps://doi.org/10.1038/nrneurol.2017.69.", "doc_items_refs": ["#/texts/161", "#/texts/162", "#/texts/163", "#/texts/164", "#/texts/167"], "page_nos": [1], "uuid": "0730ebdb-1b58-4923-80ff-810252cb7234"}
{"doc_id": "2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180.doctags", "chunk_id": 43, "source_chunk_idxs": [58], "num_tokens": 501, "text": "References\n- [41] Lu Y, Chen X, Liu X, Shi Y, Wei Z, Feng L, et al . Endothelial TFEB signaling-mediated autophagic disturbance initiates microglial activation and cognitive dysfunction. Autophagy. 2023; 19: 1803-1820. https://doi.org/10.1080/15548627.2022. 2162244.\n- [42] Willis EF, MacDonald KPA, Nguyen QH, Garrido AL, Gillespie ER, Harley SBR, et al . Repopulating Microglia Promote Brain Repair in an IL-6-Dependent Manner. Cell. 2020; 180: 833-846.e16. https://doi.org/10.1016/j.cell.2020.02.013.\n- [43] Bechmann I, Steiner B, Gimsa U, Mor G, Wolf S, Beyer M, et al . Astrocyte-induced T cell elimination is CD95 ligand dependent. Journal of Neuroimmunology. 2002; 132: 60-65. https://doi.or g/10.1016/s0165-5728(02)00311-9.\n- [44] Haymour L, Jean M, Smulski C, Legembre P, CD95 (Fas) and CD95L (FasL)-mediated non-canonical signaling pathways. Biochimica et Biophysica Acta. Revises on Cancer. 2023; 1878: 9004. https://doi.org/10.1016/j.bbcann.2023.189004.\n- [45] Sweeney MD, Sagare AP, Zlokovic BV. Blood-brain barrier breakdown in Alzheimer disease and other neurodegenerative disorders. Nature Reviews. Neurology. 2018; 14: 133-150. https://doi.org/10.1038/nrneurol.2017.188.\n- [46] Rajmohan R, Reddy PH. Amyloid-Beta and Phosphorylated Tau Accumulations Cause Abnormalities that Synapses of Alzheimer's disease Neurons. Journal of Alzheimer's Disease. 2017; 57: 975-999. https://doi.org/10.3233/JAD-160612.", "doc_items_refs": ["#/texts/168", "#/texts/169", "#/texts/170", "#/texts/171", "#/texts/172", "#/texts/173"], "page_nos": [], "uuid": "d779d30c-3530-4bcd-b666-ad4f8425fd57"}
{"doc_id": "2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180.doctags", "chunk_id": 44, "source_chunk_idxs": [59], "num_tokens": 461, "text": "References\n- [47] Segarra M, Aburko MR, Hefendl J, Acker-Pallet A. Neurovascular Interactions in the Nervous System. Annual Review of Cell and Developmental Biology. 2019; 35: 615-635. https://doi.org/10.1146/annurev-cellbio-100818-125142.\n- [48] Mªe MA, He L, Nordling S, Vazquez-Liebanas E, Nahar K, Jung B, et al . Single-Cell Analysis of Blood-Brain Barrier Response to Pericyte Loss. Circulation Research. 2021; 128: e46-e62. ht ttps://doi.org/10.1161/CIRCRESAHA.120.317473.\n- [49] Oue H, Yamazaki Y, Qiao W, Yuanxin C, Ren Y, Kuri A, et al . LRP1 in vascular mural cells modulates cerebrovascular integrity and function in the presence of APOE4 JCI. Insight. 2023; 8: e163822. https://doi.org/10.1172/jci.insight.163822.\n- [50] O'Brown NM, Patel NB, Hartmann U, Klein AM, Gu C, Megason SG. The secreted neuronal signal Spock1 promotes blood-brain barrier development. Developmental Cell. 2023; 58: 1534-1547.e6. https://doi.org/10.1016/j.devcel.2023.06.005.\n- [51] Zhao Y, Zhang J, Zheng Y, Zhang Y, Zhang XJ, Wang H, et al . NAD + improves cognitive function and reduces neuroinflammation by ameliorating mitochondrial damage and decreasing ROS production in chronic cerebral hypoperfusion models through Sirt1/PGC-1α pathway. J Neuroinflammation. 2021;18: 207. https://doi.org/10.1186/s12974-021-02508-", "doc_items_refs": ["#/texts/174", "#/texts/175", "#/texts/176", "#/texts/177", "#/texts/178"], "page_nos": [], "uuid": "66a92846-d41b-4d7b-9676-73be054eff3c"}
{"doc_id": "2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180.doctags", "chunk_id": 45, "source_chunk_idxs": [60], "num_tokens": 424, "text": "References\n- [52] Faraco G, Hochnera K, Segarra S, Schaeffer S, Santisteb MM, Menon A, et al . Dietary salt promotes cognitive impairment through tau phosphorylation. Nature. 2019; 574: 686-690. https://doi.org/10.1038/s4158-019-1688-z.\n- [53] Kakae M, Nakajima H, Torobi S, Kawashita A, Miyaniaraho M, Morishima M, et al . The astrocytic RTPA1 channel mediates an intrinsic protective response to vascular cognitive impairment via LIF production. Science Advances. 2023; 9: eadh0102. http s://doi.org/10.1126/sciadv.adh0102.\n- [54] Li G, He X, Li H, Wu Y, Guan Y, Liu S, et al . Overexpression of Slit2 improves function of the paravascular pathway in the aging mouse brain. International Journal of Molecular Medicine. 2018; 42: 1935-1944. https://doi.org/10.3892/ijmm.2018.3802.\n- [55] Wu W, Zhao Y, Cheng X, Xie X, Zeng Y, Tao Q, et al . Modulation of glyphatic system by visual circuit activation alleviates memory impairment and apathy in a mouse model of Alzheimer's disease. Nature Communications. 2025; 16: 63. https://doi.org/10.1038/s41467-024-255678-w.\n- [56] Orihuela R, McPherson CA, Harry GJ. Microglial M1/M2 polarization and metabolic states. British\nJournal of Pharmacology. 2016; 173: 649-665. https://doi.org/10.1111/bph.13139.", "doc_items_refs": ["#/texts/179", "#/texts/180", "#/texts/181", "#/texts/182", "#/texts/183", "#/texts/184"], "page_nos": [1], "uuid": "7aa57888-7216-4c04-843e-9f411c4e40d9"}
{"doc_id": "2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180.doctags", "chunk_id": 46, "source_chunk_idxs": [61], "num_tokens": 473, "text": "References\n- [57] Ma X, Shin YJ, Yoo JW, Park HS, Kim DH. Extracellular vesicles derived from Porphyromonas gingivalis induce trigeminal nerve-mediated cognitive impairment. Journal of Advanced Research. 2023; 54: 293-303. https://doi.org/10.1016/j.jare.2023.02.006.\n- [58] Sigfridsson E, Marongoni M, Hardingen GE, Horsburgh K, Fowler JH. Deficiency of Nrf2 exacerbates white matter damage and microglia/macrophage levels in a mouse model of vascular cognitive impairment. Journal of Neuroinflammation. 2020; 17: 367. https://doi.org/10.1186/s12974-020-02038-2.\n- [59] Larochelle J, Tishko RJ, Yang C, Ge Y, Phan LT, Gunraj RE, et al . Receptor-interacting protein kinase 2 (RIPK2) profoundly contributes to post-stroke neuroinflammation and behavioral deficits with microglia as unique perpetrators. Journal of Neuroinflammation. 2023; 20: 221. https://doi.org/10.1186/ s12974-023-02907-6.\n- [60] Lively S, Schlichter LC. The microglial activation state regulates migration and roles of matrix-dissolving enzymes for invasion. Journal of Neuroinflammation. 2013; 10: 75. https://doi.org/10. 1186/1742-2094-10-75.\n- [61] Ruan Z, Zhang D, Huang R, Sun W, Hou L, Zhao J, et al . Microglial Activation Damages Dopaminergic Neurons through MMP-2/-9-Mediated Increase of Blood-Brain Barrier Permeability in a Parkinson's Disease Mouse Model. International Journal of Molecular Sciences. 2022; 23: 2793. https://doi.org/10.3390/ijms23052793.", "doc_items_refs": ["#/texts/185", "#/texts/186", "#/texts/187", "#/texts/188", "#/texts/189"], "page_nos": [], "uuid": "e441bbc5-f1b9-418a-91d3-0206e53ae0f0"}
{"doc_id": "2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180.doctags", "chunk_id": 47, "source_chunk_idxs": [62], "num_tokens": 437, "text": "References\n- [62] Cotter R, Williams C, Ryan L, Erichsen D, Lopez A, Peng H, et al . Fractalkine (CXCL1) and brain inflammation: Implications for HIV-1-associated dementia. Journal of Neurovirolology. 2002; 58: 585-998. https://doi.org/10.1080/13550280290100950.\n- [63] Duncombe J, Kitamura A, Hase Y, Ihara M, Kalaria RN, Horsburg K. Chronic cerebral hypoperfusion: a key mechanism leading to vascular cognitive impairment and dementia. Closing the translational gap between rodent models and human vascular cognitive impairment and dementia. Clinical Science (London, England: 1979). 2017; 131: 2451-2468. https://doi.org/10.1042/CS20160727.\n- [64] Badji A, Youwakim J, Cooper A, Westman E, Marseglia A. Vascular cognitive impairment - Past, present, and future challenges. Ageing Research Reviews. 2023; 90: 102042. https: //doi.org/10.1016/j.arr.2023.102042.\n- [65] Santisteb MM, Aledeca C, Carnevale D. Hypertension, Neurovascular Dysfunction, and Cognitive Impairment. Hypertension (Dallas, Tex.: 1979). 2023; 80: 22-34. https://doi.org/10.1161/HYPERTENSIONAHA.122.18085.\n- [66] Smith JR, Pike JR, Gottesman RF, Knopman DS, Lutsey PL, Palta P, et al . Contribution of Modifiable Midlife and Late-Life Vascular Risk Factors to Incident Dementia. JAMA Neurology. 2025; 8: 644-654. https://doi.org/10.1001/jamaneurol.2025. 1495.", "doc_items_refs": ["#/texts/190", "#/texts/191", "#/texts/192", "#/texts/193", "#/texts/194"], "page_nos": [], "uuid": "681090b3-2d58-49fe-a782-5b2101c78385"}
{"doc_id": "2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180.doctags", "chunk_id": 48, "source_chunk_idxs": [63], "num_tokens": 323, "text": "References\n- [67] Corder EH, Saunders AM, Strittmatter WJ, Schmechel DE, Gaskell PC, Small GW, et al . Gene dose of apolipoprotein E type 4 allele and the risk of Alzheimer's disease in late onset families. Science (New York, N.Y.). 1993; 261: 921-923. https: //doi.org/10.1126/science.8346443.\n- [68] Joutel A, Monet-Leprêtre M, Gosele C, Baron-Menguy C, Hammes A, Schmidt S, et al . Cerebrovascular dysfunction and microcirculation rarefaction precede white matter lesions in a mouse genetic model of cerebral ischemic small vessel disease. The Journal of Clinical Investigation. 2010; 120: 433-445. https://doi.org/10.1172/JCI39733.\n- [69] Morris HE, Neves KB, Nilsen M, Montezano AC, MacLean MR, Touyz RM. Notch3/Hes5 Induces Vascular Dysfunction in Hypoxia-Induced Pulmonary Hypertension Through ER Stress and Redox-Sensitive Pathways. Hypertension (Dallas, Tex.:\n&lt;!-- image --&gt;\n1979). 2023; 80: 1683-1696. https://doi.org/10.1161/HYPERT ENSIONAHA.122.20449.", "doc_items_refs": ["#/texts/195", "#/texts/196", "#/texts/197", "#/pictures/19", "#/texts/198"], "page_nos": [1], "uuid": "4c8e0e7f-4982-4017-a4d8-9ace4517da62"}
{"doc_id": "2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180.doctags", "chunk_id": 49, "source_chunk_idxs": [64], "num_tokens": 420, "text": "References\n- [70] Li Y, Hai S, Zhou Y, Dong BR. Cholinesterase inhibitors for rarer dementias associated with neurological conditions. The Cochrane Database of Systematic Reviews. 2015; 2015: CD009444. https://doi.org/10.1002/14651858.CD009444.pub3.\n- [71] Madigan JB, Wilcock DM, Hainsworth AH. Vascular Contributions to Cognitive Impairment and Dementia: Topical Review of Animal Models. Stroke. 2016; 47: 1953-1959. https://doi.org/10.1161/STROKEAHA.116.012066.\n- [72] Saito H, Togashi H, Yoshioka M, Nakamura S, Minami M, Parvez H. Animal models of vascular dementia with emphasis on stroke-prone spontaneously hypertensive rats. Clinical and Experimental Pharmacology &amp; Physiology. Supplement. 1995; 22: S257-S259. https://doi.org/10.1111/j.1440-1681.1995.tb 02906.x.\n- [73] Sumbria RK, Grigoryan MM, Vasilevko V, Krasieva TB, Scadeng M, Dvornikova AK, et al . A murine model of inflammation-induced cerebral microbleeds. Journal of Neuroinflammation. 2016; 13: 218. https://doi.org/10.1186/s12974-016-0693-5.\n- [74] Li Y, Macyczko JR, Liu CC, Bu G. ApoE4 reduction: An emerging and promising therapeutic strategy for Alzheimer's disease. Neurobiology of Aging. 2022; 115: 20-28. https://doi.org/10.1016/j.neurobiolaging.2022.003.011.", "doc_items_refs": ["#/texts/199", "#/texts/200", "#/texts/201", "#/texts/202", "#/texts/203"], "page_nos": [], "uuid": "740b1169-afb3-4dcb-a8e0-17c5b1cae12f"}
{"doc_id": "2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180.doctags", "chunk_id": 50, "source_chunk_idxs": [65], "num_tokens": 469, "text": "References\n- [75] Veys K, Fan Z, Ghobrial M, Bouché A, Garcia-Caballero M, Vriens K, et al . Role of the GLUT1 Glucose Transporter in Postnatal CNS Angiogenesis and Blood-Brain Barrier Integrity. Circulation Research. 2020; 127: 466-482. https://doi.org/10. 1161/CIRCRESAHA.119.316463.\n- [76] Rom S, Zuluaga-Ramirez V, Gajghate S, Seliga A, Winfield M, Heldt NA, et al . Hyperglycemia-Driven Neuroinflammation Compromises BBB Leading to Memory Loss in Both Diabetes Mellitus (DM) Type 1 and Type 2 Mouse Models. Molecular Neurobiology. 2019; 56: 1883-1896. https://doi.org/10.1007 s12035-018-1195-5.\n- [77] Cheng XR, Zhou WX, Zhang YX. The behavioral, pathological and therapeutic features of the senescence-accelerated mouse prone 8 strain as an Alzheimer's disease animal model. Ageing Research Reviews. 2014; 13: 13-37. https://doi.org/10.1016/j. arr.2013.10.002.\n- [78] Yin YL, Chen Y, Ren F, Wang L, Zhu ML, Lu JX, et al . Nitrosative stress induced by homocysteine thiolactone drives vascular cognitive impairments via GTP cyclohydrolase 1 S-nitrosylation in vivo. Redox Biology. 2022; 58: 102540. https://doi.org/10.1016/j.redox.2022.102540.\n- [79] Tepavčević V, Lubetzki C. Oligodendrocyte progenitor cell recruitment and remyelination in multiple sclerosis: the more, the merrier? Brain. 2022; 145: 4178-4192. https://doi.org/10. 1093/brain/awac307.", "doc_items_refs": ["#/texts/204", "#/texts/205", "#/texts/206", "#/texts/207", "#/texts/208"], "page_nos": [], "uuid": "a9241989-3d31-40e8-bf09-b8425008f26b"}
{"doc_id": "2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180.doctags", "chunk_id": 51, "source_chunk_idxs": [66], "num_tokens": 430, "text": "References\n- [80] Gavrilova SI, Alvarez A. Cerebrosulin in the therapy of mild cognitive impairment and dementia due to Alzheimer's disease: 30 years of clinical use. Medicinal Research Reviews. 2021; 41: 2775-2803. https://doi.org/10.1002/med.21722.\n- [81] Ziganshina LE, Abakumova T, Nurkhametova D, Ivanchenko K. Cerebrolysin for acute ischaemic stroke. The Cochrane Database of Systematic Reviews. 2023; 10: CD007026. https://doi.org/ 10.1002/14651858.CD007026.pub7.\n- [82] Hong Z, Moessler H, Bornstein N, Brainin M, Heiss WD, CASTA-Investigators. A double-blind, placebo-controlled, randomized trial to evaluate the safety and efficacy of Cerebrolysin in patients with acute ischaemic stroke in Asia-CASTA. International Journal of Stroke. 2009; 4: 406-412. https://doi.org/10.1111/j.1747-4949.2009.00340.x.\n- [83] Achar KN, Al-Nakib B. Takayasu's arteritis and ulcerative colitis. The American Journal of Gastroenterology. 1986; 81: 1215-1217.\n- [84] Guekht A, Skoog I, Edmundson S, Zakharov V, Korczyn\n&lt;!-- image --&gt;\nAD. ARTEMIDA Trial (A Randomized Trial of Efficacy, 12 Months International Double-Blind Actovegin): A Randomized Controlled Trial to Assess the Efficacy of Actovegin in Poststroke Cognitive Impairment. Stroke. 2017; 48: 1262-1270. https://doi.org/10.1161/STROKEAHA.116.014321.", "doc_items_refs": ["#/texts/209", "#/texts/210", "#/texts/211", "#/texts/212", "#/texts/213", "#/pictures/20", "#/texts/214"], "page_nos": [1], "uuid": "507863e1-5285-44d0-a750-ec43be37a93f"}
{"doc_id": "2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180.doctags", "chunk_id": 52, "source_chunk_idxs": [67], "num_tokens": 443, "text": "References\n- [85] la Fleur P, Baizhaxynova A, Reynen E, Kaunelis D, Galiyeva D. Actovegin in the management of patients after ischemic stroke: A systematic review. PloS One. 2022; 17: e0270497. https://doi i.org/10.1371/journal.pone.0270497.\n- [86] Langley MS, Sorkin EM. Nimodipine. A review of its pharmacodynamic and pharmacokinetic properties, and therapeutic potential in cerebrovascular disease. Drugs. 1989; 37: 669-699. https://doi.org/10.2165/ 00003495-1989370500-00004.\n- [87] Weigl M, Tenze G, Steinlechner B, Skirthladze K, Reining G, Bernardo M, et al . A systematic review of currently available pharmacological neuroprotective agents as a sole intervention before anticipated or induced cardiac arrest. Resuscitation. 2005; 65: 21-39. https://doi.org/10.1016/j.resuscitation.2004.11.004.\n- [88] Battle CE, Abdul-Rahim AH, Shenkin SD, Hewitt J, Quinn TJ. Cholinesterase inhibitors for vascular dementia and other vascular cognitive impairments: a network meta-analysis. The Cochrane Database of Systematic Reviews. 2021; 2: CD013306. https://doi.org/10.1002/14651858.CD013306.pub2.\n- [89] McShane R, Westey MJ, Roberts E, Minakaran N, Schneider L, Farrimond LE, et al . Memantine for dementia. The Cochrane Database of Systematic Reviews. 2019; 3: CD003154. https:// doi.org/10.1002/14651858.CD003154.pub6.", "doc_items_refs": ["#/texts/215", "#/texts/216", "#/texts/217", "#/texts/218", "#/texts/219"], "page_nos": [], "uuid": "d2a114a6-e0e6-4d8b-838f-3e619e8f6d87"}
{"doc_id": "2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180.doctags", "chunk_id": 53, "source_chunk_idxs": [68], "num_tokens": 432, "text": "References\n- [90] Faroq MU, Min J, Goshgarian C, Gorelick PB. Pharmacotherapy for Vascular Cognitive Impairment. CNS Drugs. 2017; 31: 759-776. https://doi.org/10.1007/ s40263-017-0459-3.\n- [91] Diaz-Galvan P, Lonrenzon G, Mohanty R, Mårtensson G, Cavedo E, Lista S, et al . Differential response to donepezil in MRI subtypes of mild cognitive impairment. Alzheimer's Research &amp; Therapy. 2023; 15: 117. https://doi.org/10.1186/ s13195-023-01223-2.\n- [92] Erjkinntti T, Skoogi LI, Lane R, Andrews C. Potential long-term effects of rivastigine on disease progression may be linked to drug effects on vascular changes in Alzheimer brains. International Journal of Clinical Practice. 2003; 57: 756-760.\n- [93] Wilcock G, Mbiöhus J, Hjöstfler A, MMM 500 group. A double-blind, placebo-controlled multicentre study of memantine in mild to moderate vascular dementia (MM500). International Clinical Psychopharmacology. 2002; 17: 297-305. https://doi.org/10.1097/00004850-200211000-00005.\n- [94] Guekht AB, Moessler H, Novak PH, Gusev IE, Cerebrolysin Investigators. Cerebrolysin in vascular dementia: improvement of clinical outcome in a randomized, double-blind, placebo-controlled multicenter trial. Journal of Stroke and Cerebrovascular Diseases. 2011; 20: 310-318. https://doi.org/10.1016/j.jstrokeerebrovasdis.2010.01.012.", "doc_items_refs": ["#/texts/220", "#/texts/221", "#/texts/222", "#/texts/223", "#/texts/224"], "page_nos": [], "uuid": "43a3d6ec-cff2-4819-9854-dd5ccc02d3a1"}
{"doc_id": "2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180.doctags", "chunk_id": 54, "source_chunk_idxs": [69], "num_tokens": 348, "text": "References\n- [95] Salvadori E, Poggessi A, Donnin I, Rinnoci V, Chiti G, Squitieri M, et al . Efficacy and Safety of the Association of Nimodipine and Choline Alphasocerate in the Treatment of Cognitive Impairment in Patients with Cerebral Small Vessel Disease. The CONVaD Trial. Drugs &amp; Aging. 2021; 38: 481-491. https://doi.org/10.1007/s40266-021-00852-8.\n- [96] Bortoletto M, Pelliciari MC, Rodella C, Miniussi C. The interaction with task-induced activity is more important than polarization: a tDCS study. Brain Stimulation. 2015; 8: 269-276. https://doi.org/10.1016/j.brs.2014.11.006.\n- [97] Hallett M. Transcranial magnetic stimulation: a primer. Neuron. 2007; 55: 187-199. https://doi.org/10.1016/j.neuron.2007.06.026.\n- [98] Kim JH, Kang HY, Lee J, Kim JH, Geum D, Park DH. Efficacy of Human-Induced Pluripotent Stem\nCell-Derived Neural Progenitor Cell Replacement Therapy in a Vascular Dementia Animal Model. Tissue Engineering and Regenerative Medicine. 2025; 22: 339-349. https://doi.org/10.1007/s13770-025-00706-z.", "doc_items_refs": ["#/texts/225", "#/texts/226", "#/texts/227", "#/texts/228", "#/texts/231"], "page_nos": [1], "uuid": "32ff0e7b-7e31-44af-8e52-3eb8739c941a"}
{"doc_id": "2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180.doctags", "chunk_id": 55, "source_chunk_idxs": [70], "num_tokens": 493, "text": "References\n- [99] Bhardwaj S, Kesari KK, Rachamalla M, Mani S, Ashraf GM, Jha SK, et al . CRISPR/Cas9 gene editing: New hope for Alzheimer's disease therapeutics. Journal of Advanced Research. 2022; 40: 207-221. https://doi.org/10.1016/j.jare . 2021.07.001.\n- [100] Ngandu T, Lehtisalo J, Solomon A, Levalahti E, Ahtiluoto S, Antikainen R, et al . A 2 year multidomain intervention of diet, exercise, cognitive training, and vascular risk monitoring versus control to prevent cognitive decline in at-risk elderly people (FINGER): a randomised controlled trial. Lancet. 2015; 385: 2255-2263. https://doi.org/10.1016/s14040-6736(1560)46061-5.\n- [101] SPRINT MIND Investigators for the SPRINT Research Group, Williamson JD, Pajewski NM, Auchus AP, Bryan RN, Chelune G, et al . Effect of Intensive vs Standard Blood Pressure Control on Probable Dementia: A Randomized Clinical Trial. JAMA. 2019; 321: 553-561. https://doi.org/10.1001/jama.2018.21442.\n- [102] Low A, Prats-Sedano MA, Stefaniak JD, McKiernan EF, Carter SF, Douvani ME, et al . CAIDE dementia risk score relates to severity and progression of cerebral small vessel disease in healthy midlife adults: the PREVENT-Dementia study. Journal of Neurology, Neurosurgery, and Psychiatry. 2022; 93: 481-490. https://doi.org/10.1136/jnnp-2021-327462.\n- [103] Clancy U, Kancheva AK, Valdés Hernández MDC, Jochems ACC, Muñoz Maniega S, Quinn TJ, et al . Imaging Biomarkers of VCI: A Focused Update. Stroke. 2024; 55: 791-800. https://doi.org/10.1161/STROKEAHA.123.0444171.", "doc_items_refs": ["#/texts/232", "#/texts/233", "#/texts/234", "#/texts/235", "#/texts/236"], "page_nos": [], "uuid": "79e1385b-3cea-44fb-a6aa-fd6e0f10b5aa"}
{"doc_id": "2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180.doctags", "chunk_id": 56, "source_chunk_idxs": [71], "num_tokens": 467, "text": "References\n- [104] Chapman J, Wang N, Treves TA, Korczyn AD, Bornstein NM. ACE, MTHFR, factor V Leiden, and APOE polymorphisms in patients with vascular and Alzheimer's dementia. Stroke. 1998; 29: 1401-1404. https://doi.org/10.1161/01.29.7.1401.\n- [105] Pollak RD, Pollak A, Idelson M, Bejarano-Achache A, Doron D, Blumenfeld A. The C677T mutation in the methylenetetrahydrofolate reductase (MTHFR) gene and vascular dementia. Journal of the American Geriatrics Society. 2000; 48: 664-668. https://doi.org/10.1111/j.1532-5415.2000. tb04725.x.\n- [106] Chabriat H, Joutel A, Dichgans M, Tournier-Lasserve E, Bousser MG. Cadasil. The Lancet. Neurology. 2009; 8: 643-653. https://doi.org/10.1016/S1474-4422(09)70127-9.\n- [107] Chuang YF, Hayden KM, Norton MC, Tschanz J, Breitner JCS, Welsh-Bohmer KA, et al . Association between APOE epsilon4 allele and vascular dementia: The Cache County study. Dementia and Geriatric Cognitive Disorders. 2010; 29: 248-253. https://doi.org/10.1159/000285166.\n- [108] Jeanne M, Labelle-Dumais C, Jorgensen J, Kauffman WB, Mancini GM, Favor J, et al . COL4A2 mutations impair COL4A1 and COL4A2 secretion and cause hemorrhagic stroke. American Journal of Human Genetics. 2012; 90: 91-101. https://doi.org/10.1016/j.ajhg.2011.11.022.", "doc_items_refs": ["#/texts/237", "#/texts/238", "#/texts/239", "#/texts/240", "#/texts/241"], "page_nos": [], "uuid": "0f4995fd-2123-40f9-84cf-71e7a0009dfb"}
{"doc_id": "2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180.doctags", "chunk_id": 57, "source_chunk_idxs": [72], "num_tokens": 190, "text": "References\n- [109] Van Agtmael T, Schlotzer-Schrehardt U, McKie L, Brownstein DG, Lee AW, Cross SH, et al . Dominant mutations of Col4a1 result in basement membrane defects which lead to anterior segment dysgenesis and glomerulopathy. Human Molecular Genetics. 2005; 14: 3161-3168. https://doi.org/10.1093/hmg/dd i348.\n- [110] Verdura E, Hervé D, Scharrer E, Amador MDM, Guyant-Maréchal L, Philippi A, et al . Heterozygous HTRA1 mutations are associated with autosomal dominant cerebral small vessel disease. Brain. 2015; 138: 2347-2358.\nhttps://doi.org/10.1093/brain/awv155.", "doc_items_refs": ["#/texts/242", "#/texts/243", "#/texts/245"], "page_nos": [1], "uuid": "5696c559-6474-45c7-8d3d-18c3d188b0ee"}
{"doc_id": "2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180.doctags", "chunk_id": 58, "source_chunk_idxs": [73], "num_tokens": 460, "text": "References\n- [111] Stork SE, Hartz AMS, Bernard J, Wolf A, Kachlmeier A, Mahringer A, et al . The concerted amyloid-beta clearance of LRP1 and ABCB1/P-gp across the blood-brain barrier is linked by PICAML. Brain, Behavior, and Immunity. 2018; 73: 21-33. https://doi.org/10.1016/j.bbi.2018.07.017.\n- [112] Richard F, Berr C, Amant C, Helbecque N, Amouyel P, Alpérovitch A. Effect of the angiotensin I-converting enzyme I/D polymorphism on cognitive decline. The EVA Study Group. Neurobiology of Aging. 2000; 21: 75-80. https://doi.org/10. 1016/s0197-4580(99)00102-5.\n- [113] Cogo A, Mangin G, Maïer B, Callebert J, Mazighi M, Chabriat H, et al . Increased serum QUIN/KYNA is a reliable biomarker of post-stroke cognitive decline. Molecular Neurodegeneration. 2021; 16: 7. https://doi.org/10.1186/s13024-020-004-421.\n- [114] Lee EC, Hong DY, Lee DH, Park SW, Lee JY, Jeong JH, et al . Inflammation and Rho-Associated Protein Kinase-Induced Brain Changes in Vascular Dementia. Biomedicines. 2022; 10: 446. https://doi.org/10.3390/biomedicines10020446.\n- [115] Choi JD, Moon Y, Kim HJ, Yim Y, Lee S, Moon WJ. Choroid Plexus Volume and Permeability at Brain MRI within the Alzheimer Disease Clinical Spectrum. Radiology. 2022; 304: 635-645. https://doi.org/10.1148/radiol.24004.", "doc_items_refs": ["#/texts/246", "#/texts/247", "#/texts/248", "#/texts/249", "#/texts/250"], "page_nos": [], "uuid": "9f2fcbba-9797-468c-a8af-eebc09f65829"}
{"doc_id": "2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180.doctags", "chunk_id": 59, "source_chunk_idxs": [74], "num_tokens": 482, "text": "References\n- [116] Yoo HS, Jeong SH, Oh KT, Lee S, Sohn YH, Ye BS, et al . Interrelation of striatal dopamine, brain metabolism and cognition in dementia with Lewy bodies. Brain. 2022; 145: 44844-448. https://doi.org/10.1093/brain/awac084.\n- [117] Wang MY, Chen KL, Huang YY, Chen SF, Wang RZ, Zhang Y, et al . Clinical utility of cerebrospinal fluid Alzheimer's disease biomarkers in the diagnostic workup of complex patients with cognitive impairment. Translational Psychiatry. 2025; 15: 130. https://doi.org/10.1038/s41398-025-03345-z.\n- [118] Liu S, Fan M, Xu JX, Yang LJ, Qi CC, Xia QR, et al . Exosomes derived from bone-marrow mesenchymal stem cells alleviate cognitive decline in AD-like mice by improving BDNE-related neuropathology. Journal of Neuroinflammation. 2022; 19: 35. https://doi.org/10.1186/s12974-022-02393-2.\n- [119] Slaney C, Sallis HM, Jones HJ, Dardani C, Charge Inflammation Working Group, Tilling K, et al . Association between inflammation and cognition: Triangulation of evidence using a population-based cohort and Mendelian randomization analyses. Brain, Behavior, and Immunity. 2023; 110: 30-42. https://doi.org/10.1016/j.bbi.2023.02.010.\n- [120] Zuliani G, Ranzini M, Guerra G, Rossi L, Munari MR, Zurlo A, et al . Plasma cytokines profile in older subjects with late onset Alzheimer's disease or vascular dementia. Journal of Psychiatric Research. 2007; 41: 686-693. https://doi.org/10.1016/j.jpsychir es.2006.02.008.", "doc_items_refs": ["#/texts/251", "#/texts/252", "#/texts/253", "#/texts/254", "#/texts/255"], "page_nos": [], "uuid": "7cc57166-faf2-4390-b1a7-28ee4eb2b02a"}
{"doc_id": "2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Mechanistic_Insights_and_Translational_Therapeutics_of_Neurovascular_Unit_Dysreg__W4414066180.doctags", "chunk_id": 60, "source_chunk_idxs": [75], "num_tokens": 324, "text": "References\n- [121] Guo Y, You J, Zhang Y, Liu WS, Huang YY, Zhang YR, et al . Plasma proteomic profiles predict future dementia in healthy adults. Nature Aging. 2024; 4: 247-260. https://doi.org/10. 1038/s43587-023-00565-0.\n- [122] Rundek T, Tolema A, Ariko T, Fagerli EA, Camargo CJ. Vascular Cognitive Impairment(VCI). Neurotherapeutics. 2022; 19: 68-88. https://doi.org/10.1007/s13311-01170-y.\n- [123] van der Flier WM, Skoog I, Schneider JA, Pantoni L, Mok V, Chen CLH, et al . Vascular cognitive impairment. Nature Reviews. Disease Primers. 2018; 4: 18003. https://doi.org/10. 1038/nrdp.2018.3.\n- [124] Zhang H, Jiao L, Yang S, Li H, Jiang X, Feng J, et al . Brain-computer interfaces: the innovative key to unlocking neurological conditions. International Journal of Surgery. 2024; 110: 5745-5762. https://doi.org/10.1097/JS9. 0000000000002022.\n&lt;!-- image --&gt;", "doc_items_refs": ["#/texts/256", "#/texts/257", "#/texts/258", "#/texts/259", "#/pictures/21"], "page_nos": [1], "uuid": "f79b5e97-febf-4f10-878e-1473ea7b75b8"}
