{"doc_id": "2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552.doctags", "chunk_id": 0, "source_chunk_idxs": [0, 1, 2, 3, 4], "num_tokens": 398, "text": "Canadian Journal on Aging / La Revue canadienne du vieilissement\n\nArticle\nCite this article: Hutchinson, M., Gilhuly, J., Ramsden, G., Lee, C., Tripp, D., Collingwood, B., Fineczko, J., McAiney, C., McGilton, K.S., McVie, M., &amp; Bethell, J. (2025). Listed to but Rarely Heard: A Scoping Review of Resident Engagement in the Organizational Design and Governance of their Long-Term Care Homes. Canadian Journal on Aging / La Revue canadienne du vieillissement\nhttps://doi.org/10.1017/S0714980825100263\nReceived: 17 September 2024\nAccepted: 28 July 2025\n\nKeywords:\naging; long-term care homes; LTCH; LTC; resident engagement\n\nMots-clés:\nFoyers de soins de longue durée; FSLD; SLD; engagement des résidents; vieillissement\n\nCorresponding author:\nLa correspondance et les demandes de tirésàpart doivent être adressées à : Correspondence and requests for offprints should be sent to: Molly Hutchinson, Dalla Lana School of Public Health, University of Toronto, 613 -867-0729, Toronto, ON (molly.hutchinson@mail.utoronto.ca).\n© The Author(s), 2025. Published by Cambridge University Press on behalf of The Canadian Association on Gerontology. This is an Open Access article, distributed under the terms of the Creative Commons Attribution licence ( http://creativecommons.org/licenses/by/4.0 ), which permits unrestricted re-use, distribution and reproduction, provided the original article is properly cited.\n&lt;!-- image --&gt;", "doc_items_refs": ["#/texts/0", "#/texts/3", "#/texts/4", "#/texts/5", "#/texts/6", "#/texts/8", "#/texts/10", "#/texts/12", "#/texts/13", "#/pictures/0"], "page_nos": [1], "uuid": "39eb966b-3492-4954-8ac5-bad49637de34"}
{"doc_id": "2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552.doctags", "chunk_id": 1, "source_chunk_idxs": [5, 6], "num_tokens": 464, "text": "Listened to but Rarely Heard: A Scoping Review of Resident Engagement in the Organizational Design and Governance of their Long-Term Care Homes\nMolly Hutchinson 1 , Jim Gilhuly 2 , Gale Ramsden 2 , Chloe Lee 2 , Dee Tripp 2 , Beryl Collingwood 2 , Julia Fineczko 3 , Carrie McAiney 4 ,5 , Katherine S. McGilton 6 , Melissa McVie 2 and Jennifer Bethell 5 ,7\n$^{1}$Dalla Lana School of Public Health, University of Toronto, Toronto, ON, Canada; $^{2}$Ontario Association of Residents' Councils, Markham, ON, Canada; $^{3}$Lawrence Bloomberg Faculty of Nursing, University of Toronto, Toronto, ON, Canada; $^{4}$School of Public Health Sciences, University of Waterloo, Toronto, ON, Canada; $^{5}$Schlegel-UW Research Institute for Aging, Waterloo, ON, Canada; $^{6}$KITE Research Institute, Toronto Rehabilitation Institute, University Health Network, Toronto, ON, Canada and $^{7}$Institute of Health Policy, Management and Evaluation, University of Toronto, Toronto, ON, Canada\n\nAbstract\nEngaging residents of long-term care homes (LTCHs) in their home's environment, programs, and operations is required in some jurisdictions and could improve resident quality of life and other outcomes. This scoping review summarized existing research on resident engagement in LTCH organizational design and governance, including associated enablers, barriers, approaches, and outcomes. The database search yielded 5,580 records (after deduplication), and 62 articles covering 59 studies were included. These studies predominantly described Residents' Councils ( n = 38; 64%) and enablers or barriers pertaining to resident and home perspectives, as well as implementation and sustainability infrastructure. Few studies described approaches to considerations of resident diversity ( n = 8; 14%) or the presence of dementia and/or cognitive impairment ( n = 12; 20%). Ten studies reported quantitative data evaluating resident engagement, and only four with resident-reported outcomes. Robust, evidenceinformed frameworks that are co-designed with residents, staff, and others in the LTCH sector are needed to engage residents in their LTCHs.", "doc_items_refs": ["#/texts/15", "#/texts/16", "#/texts/18"], "page_nos": [1], "uuid": "e1d04056-d6f7-478e-bbb4-c66f8783d701"}
{"doc_id": "2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552.doctags", "chunk_id": 2, "source_chunk_idxs": [7], "num_tokens": 282, "text": "Résumé\nL'engagement des résidents de foyers de soins de longue durée (FSLD) dans l'environnement, les programmes et les opérations est requis dans certains foyers et pourrait améliorer la qualité de vie et d'autres résultats. Cette revue résume la recherche sur l'engagement des résidents dans l'organisation et la gouvernance, les facilitateurs, les obstacles, les approches et les résultats. La base de données contient 5 580 enregistrements dont 62 articles couvrant 59 études décrivant principalement les conseils des résidents ( n = 38; 64%), les facilitateurs ou obstacles selon les résidents et les foyers, ainsi que l'exécution et la durabilité. Peu d'études décrivaient les approches à la diversité ( n = 8; 14%) ou à la neurodégénérescence ( n = 12; 20%). Dix études présentent des données quantitatives évaluant l'engagement des résidents et seulement quatre, des résultats signalés par eux. Des cadres robustes, conçus avec les résidents et le personnel, sont nécessaires.", "doc_items_refs": ["#/texts/20"], "page_nos": [1], "uuid": "d5a23cf4-e29d-4534-8dec-5d0e0e2c5cc8"}
{"doc_id": "2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552.doctags", "chunk_id": 3, "source_chunk_idxs": [8], "num_tokens": 452, "text": "Background\nLong-term care homes (LTCHs), also known as nursing homes or care homes, are care settings that provide residents with housing, specialized comprehensive around-the-clock nursing care, and help with daily activities (Ontario Long-Term Care Association [OLTCA], n.d.). In 2021, nearly 200,000 people were living in over 2,000 LTCHs across Canada, most of whom were older adults with complex health needs, including sensory, mobility, and cognitive difficulties (Canadian Institute for Healthcare Information, 2021). It is anticipated that the reliance on LTCHs will continue to grow and that the population residing in LTCHs will continue to change (Ng et al., 2020).\nLTCHs have evolved from a system built and modelled on acute care, characterized by a 'custodial attitude to care', focused on maintaining physical health, while largely neglecting psychological and social needs (Emodi, 1977, p. 13). Under this model, residents were regarded\nas passive recipients of care, rather than active contributors to their communities and citizens of their homes. More recently, there has been a growing effort to formalize, protect, and advocate for residents' rights. For example, Ontario's Fixing Long-Term Care Act, 2021, provides new and expanded protections for resident rights (Fixing Long-Term Care Act, 2021). Moreover, LTCHs across the country have championed and supported efforts to ensure that residents have an active role in making decisions in their homes (Armstrong et al., 2019).\nResident engagement in organizational design and governance refers broadly to the integration of resident values, experiences, and perspectives into home-level decision-making processes, in roles such as advisors and members of councils or committees (Carman et al., 2013). Meaningful resident engagement is critical to promoting the rights and dignity of those living in LTCHs. Moreover, effective shared decision-making practices engage residents meaningfully and ensure their input into the home (e.g., policies and services), thereby promoting the autonomy, quality of life, social connection, and sense of home of those living in LTCHs (Lynch et al., 2022; Moving Forward Coalition, 2024).", "doc_items_refs": ["#/texts/23", "#/texts/24", "#/texts/28", "#/texts/29"], "page_nos": [1], "uuid": "7dcae470-e4be-4152-b15c-5e6395592b50"}
{"doc_id": "2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552.doctags", "chunk_id": 4, "source_chunk_idxs": [9, 10], "num_tokens": 351, "text": "Background\nCulture change in LTCHs, emphasizing greater inclusion of residents in decision-making, is described in the literature. However, limited knowledge has been formalized regarding the implementation, strengths, and barriers of alternative forms of resident engagement (Shura et al., 2011). Residents' Councils, as one prominent approach to engagement, have been adopted in jurisdictions across Canada (Parmar et al., 2019; Staempfl et al., 2025) and internationally (Moving Forward Coalition, 2024). Residents' Councils are organized groups of LTCH residents who meet regularly to address topics of interest or concern in the home (Ontario Association of Residents' Councils, 2012). LTCH legislation and regulations differ significantly between each province and territory (Keefe et al., 2024), thus impacting the membership, structure, procedures, and powers of Residents' Councils in different Canadian jurisdictions. To our knowledge, previous systematic reviews of the literature have not addressed the role of residents in the organizational design and governance of their LTCHs.\n\nObjectives\nThe purpose of this review is to map the existing knowledge on approaches to engaging LTCH residents in the organizational design and governance of their homes, as well as to summarize the reported barriers and enablers of engagement, considerations of diversity, dementia, and cognitive change/impairment, and approaches to evaluation. This scoping review is the first component of a three-part collaborative research project that will culminate in the creation of a toolkit/resource to facilitate meaningful resident engagement in the organizational design and governance of their homes (Lee et al., 2024). The findings from this study will be used to develop evidence-informed, resident-oriented content for the toolkit/resource.", "doc_items_refs": ["#/texts/30", "#/texts/32"], "page_nos": [1], "uuid": "c63fdb17-3630-4eb2-ae6f-e9b33ad83a43"}
{"doc_id": "2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552.doctags", "chunk_id": 5, "source_chunk_idxs": [11, 12], "num_tokens": 314, "text": "Methods\nThis review followed the approach that was previously described in the published protocol paper (Lee et al., 2024). The objectives, research questions, methods (Arksey &amp; O'Malley, 2005; Levac et al., 2010), and approach to reporting (Tricco et al., 2018) (see Supplementary Material 1), all defined a priori, remained largely unchanged from the protocol. However, with very few studies\nreporting relevant findings, research questions 3, 4, and 5 were not reported using the RE-AIM framework, as was described in the protocol.\n\nStep 1: Identifying the research question\nThe following research questions were developed through deliberations with the Ontario Association of Residents' Councils, a provincial not-for-profit organization with a mandate to support and encourage residents in creating and sustaining effectively operating Residents' Councils:\n- 1. How have LTCH residents been engaged in the organizational design and governance of LTCHs?\n- 2. What are the reported barriers and enablers to this engagement?\n- 3. How have considerations of diversity (e.g., related to age, gender expression and identity, culture, disability, education, ethnicity, language, religion, race, sexual orientation, and socioeconomic status) been integrated into this engagement?\n- 4. How have considerations of dementia and cognitive impairment been integrated into this engagement?\n- 5. How has the impact of this engagement been evaluated, including with resident-centred outcomes, resident-centred experiences, resident/family/team member satisfaction, or health economic outcomes?", "doc_items_refs": ["#/texts/34", "#/texts/36", "#/texts/38", "#/texts/39", "#/texts/40", "#/texts/41", "#/texts/42", "#/texts/43"], "page_nos": [1], "uuid": "10d606fd-ac1c-479c-a7c2-0221617ff31e"}
{"doc_id": "2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552.doctags", "chunk_id": 6, "source_chunk_idxs": [13, 14], "num_tokens": 405, "text": "Search strategy\nAn information specialist created, refined, and executed a search strategy in consultation with the research team to conduct an electronic database search for grey and academic literature. Eight databases were searched: MEDLINE, CINAHL (EBSCO), CINFO, Web of Science, Sociological Abstracts (ProQuest), Embase and Embase Classic (Ovid), Emcare Nursing (Ovid), and AgeLine (EBSCO). The search was first conducted in Medline, and then translated to the other databases. These databases were chosen for their emphasis on biomedical, behavioural, life, and social sciences, nursing, and aging. The strategy was constructed to identify studies that describe resident engagement in organizational design and governance (see Supplementary Material 2). This entailed searching for sources with an overlap of three key concepts: (1) long-term care; (2) organizational decision making; and (3) resident engagement. The search strategy also specifically included terms for Residents' Councils, as they are an established approach to resident engagement, but it was not limited to only this approach to engagement. The search was not restricted by language, publication location, publication date (up to the date of the search in January 2023), or study design. Articles without full-text availability were excluded. Relevant association, government, or organization reports were found via keyword searches on websites of Canadian and American organizations that are reputable to the LTCH sector. When searching the organizations' websites, key search terms, website or organization name, URL, and date of the search were recorded. Other relevant literature was identified through feedback from collaborators and by scanning the reference lists of relevant reviews and included references.\n\nEligibility criteria\nReports of original data were included, and protocols, reviews, letters, and editorials that summarized other studies were excluded. Eligible grey literature types were conference proceedings, theses,\n\nTable 1. Family and patient engagement framework levels of engagement, adapted from Carman and colleagues, 2013.", "doc_items_refs": ["#/texts/46", "#/texts/48", "#/texts/51", "#/tables/0"], "page_nos": [1], "uuid": "d611fc7b-ef5a-4035-9b9c-e1fc3b2bec64"}
{"doc_id": "2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552.doctags", "chunk_id": 7, "source_chunk_idxs": [15], "num_tokens": 495, "text": "Eligibility criteria\n|                                                 | Consultation                                                                           | Involvement                                                                                                 | Partnership                                                                                                                      |\n|-------------------------------------------------|----------------------------------------------------------------------------------------|-------------------------------------------------------------------------------------------------------------|----------------------------------------------------------------------------------------------------------------------------------|\n| Direct care (Resident level)                    | Residents receive information about their health and daily routines.                   | Residents are asked about their preferences for care and daily routines.                                    | Decisions are based on resident preferences and, if applicable, family input, medical evidence, and clinical judgment.           |\n| Organizational design & governance (Home level) | LTCH surveys residents about their experience in the home.                             | LTCH involves residents as advisors, committee members or in other similar capacities.*                     | Residents are equal contributors at LTCH committees.*                                                                            |", "doc_items_refs": ["#/tables/0"], "page_nos": [1], "uuid": "f525f142-54d2-49d9-9ece-f1d1979e009d"}
{"doc_id": "2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552.doctags", "chunk_id": 8, "source_chunk_idxs": [16], "num_tokens": 303, "text": "Eligibility criteria\n| Policy making (System level)                    | A public agency conducts focus groups or surveys with residents to ask their opinions. | Residents' recommendations about research priorities are used by a public agency to make funding decisions. | Residents have equal representation on agency committees that make decisions about how to allocate resources within LTCH sector. |\n*The boxes highlighted in grey indicate the two levels of engagement that were included in the review.\ndissertations, association reports, and government reports. Due to project feasibility, news articles, blogs, and social media were excluded from our grey literature search. To be included, studies needed to describe or analyze: (1) an adult population living in LTCH(s), nursing home(s), care home(s), assisted living, retirement home(s), or other centers that provide or have access to around-the-clock care for residents and (2) resident engagement at the home level, defined as resident involvement or partnership in organizational design and governance, as defined from an adapted version of Carman et al.'s (2013) Family and Patient Engagement Framework (see Table 1). Studies were categorized as resident partnerships when residents were described as having leadership, ownership, or significant influence over decision-making or if residents made up at least half of council or committee members. Studies were categorized as describing resident involvement when residents were involved in decision-making processes as advisors or council members, but their engagement did not meet the threshold of partnership previously described.", "doc_items_refs": ["#/tables/0", "#/texts/52", "#/texts/53"], "page_nos": [1], "uuid": "a361a1d2-ac7a-40ee-aca7-8b98bf3821a5"}
{"doc_id": "2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552.doctags", "chunk_id": 9, "source_chunk_idxs": [17], "num_tokens": 287, "text": "Step 3: Study selection\nSources retrieved through database searches were deduplicated in EndNote and then collated into Covidence for further deduplication, title and abstract screening, full-text review, and data extraction (Covidence, 2024). All reviewers met to discuss their decisions on a pilot set of 15 references to optimize congruence. Next, at the screening stage, the title and abstract of each reference were independently screened by two reviewers (JB, JF, SH, JL, KM, SV, CL) and any discrepancies were resolved through discussion and consensus. References included at the screening stage were then retrieved and uploaded into Covidence for full-text review. Similar to the screening stage, at full-text review, two reviewers (JB, ND, JF, SH, JL, KM, CL) independently reviewed the complete reference against the study inclusion criteria and, if excluded, recorded the primary reason for exclusion. Any discrepancies were resolved through discussion and consensus. Finally, data from each reference were independently extracted by two reviewers (JB, ND, SH, CL, JL) and, at this stage, discrepancies were resolved by a third reviewer (JB or CL). Grey literature was screened based on executive summaries or tables of content, followed by a full-text review.", "doc_items_refs": ["#/texts/55"], "page_nos": [1], "uuid": "e71a0775-e046-4e5e-886b-a8bcee57eab2"}
{"doc_id": "2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552.doctags", "chunk_id": 10, "source_chunk_idxs": [18, 19], "num_tokens": 399, "text": "Step 4: Charting the data\nTwo reviewers independently extracted data and excerpts from each reference in Covidence, including information on the author(s), year of publication, study location, description of the study population and setting, aims of the study, outcome measures,\nand relevant results. The project team designed a data extraction form (see Supplementary Material 3), tested the form on 10 references, and then adjusted the form as needed, including to describe resident involvement in the research process (i.e., as participant, partner/collaborator or author), whether the engagement initiative(s) being described directly resulted from a research project, and the number and size of facilities included in the study.\n\nStep 5: Collating, summarizing, and reporting results\nThe data were analyzed using the Framework Method as an approach to thematic analysis and qualitative content analysis that seeks to compare data within and across a matrix (Gale et al., 2013). This method does not require the use of a particular epistemological, philosophical, or theoretical approach; rather, it provides a process for generating and summarizing key themes (Gale et al., 2013). This approach is compatible with inductive and deductive theme generation. In the protocol, the Family and Patient Engagement Framework (Carman et al., 2013) was used to define the focus of the review and PRISM/RE-AIM (Holtrop et al., 2021) was described as a guiding framework for four of the five research questions. In the initial deductive analysis, both frameworks were used to construct initial codes and additional codes were added, as required. Each excerpt was revisited to ensure complete and consistent coding. Once all the data were coded and descriptive variables were extracted, the results were compiled into a matrix using Microsoft Excel. All analysis was conducted using Dedoose, a cloud-based qualitative and mixed methods data management and analysis platform (Dedoose, 2024).", "doc_items_refs": ["#/texts/57", "#/texts/59", "#/texts/61"], "page_nos": [1], "uuid": "f2e16d65-fc53-42fc-a948-09598864ae50"}
{"doc_id": "2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552.doctags", "chunk_id": 11, "source_chunk_idxs": [20, 21], "num_tokens": 412, "text": "Step 6: Consulting with LTC sector partners\nLTCH residents were integral to the planning, development, analysis, and production of the scoping review. Two co-authors (JG and GR) living in LTCHs were members of the project team and collaborators in preparing the study protocol (Lee et al., 2024), executing the study (including interpreting findings), and translating findings to academic and non-academic audiences (including co-developing and co-delivering presentations). Their ongoing input was obtained through regular online meetings. In addition, partners in the LTCH sector, including community organizations, managers, administrators, staff, and residents, provided input during presentations of the methods and preliminary results at a brainXchange (https://brainxchange. ca/) webinar hosted in partnership with the Alzheimer Society of Canada and the Canadian Consortium of Neurodegeneration in\nAging in March 2024 and the Walk with Me Conference hosted by the Research Institute for Aging in May 2024.\n\nSelection of sources of evidence\nA total of 8,870 sources were collected from databases. No sources were added from the grey literature search, as none of the relevant sources that were identified met the inclusion criteria. A total of 3,290 duplicates were automatically removed by Covidence and Endnote or removed by hand. A total of 5,580 articles were screened based on their titles and abstracts, and 5,418 were excluded. Of the remaining 162 articles, 14 articles were unable to be retrieved, 86 articles were excluded based on the review's inclusion and exclusion criteria, and 62 articles were selected to undergo data extraction and analysis (see Figure 1 for PRISMA flowchart and see Supplementary Material 4 for the list of excluded studies).\nComplete references for the 62 included articles are listed in Supplementary Material 5. In two instances, multiple articles were written on the same study, resulting in a total of 59 studies. In the results, numbers and proportions are reported in reference to the 59 studies, unless otherwise indicated.", "doc_items_refs": ["#/texts/63", "#/texts/66", "#/texts/69", "#/texts/70"], "page_nos": [1], "uuid": "dd064e13-4675-4933-8c6b-3277144a8858"}
{"doc_id": "2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552.doctags", "chunk_id": 12, "source_chunk_idxs": [22], "num_tokens": 336, "text": "Study characteristics\nCharacteristics of individual sources of data are included in Table 2 and summarized in Tables 3 and 4. Most of the studies were conducted in the United States ( n = 33; 56%). Categorized according to decade, most of the 62 articles were published between 2010 and 2019 ( n = 22; 35%); however, a large proportion were also published in the 1980s ( n = 17; 27%). Many of the articles were commentaries ( n = 30; 48%) that aimed to describe specific examples of engagement initiatives.\nVery few studies reported on the characteristics of the residents who participated. Of the 16 studies (27%) that reported health status information, health conditions included reduced cognitive health ( n = 11), physical frailty or mobility challenges ( n = 6), vision and hearing impairment ( n = 2), chronic illness or long-term disability ( n = 2), and multiple sclerosis ( n = 1). Descriptors of good health included being alert, active, independent, and cognitively able. Of the 13 studies (22%) that reported resident age, eight studies reported a mean age of 80 years or older. Ten studies reported age ranges for which the mean minimum and maximum ages were 70 and 86 years old, respectively. Of the 12 studies (20%) that reported gender distribution, 10 reported that most participants were women and two reported that most participants were men. There was no differentiation made between biological sex and gender identity. The four studies (7%) that reported education\nFigure caption: Figure 1. PRISMA flowchart summarizing study selection.\n\nTable 2. Characteristics of included articles", "doc_items_refs": ["#/texts/72", "#/texts/73", "#/pictures/1", "#/texts/77", "#/tables/1"], "page_nos": [1], "uuid": "ebded305-0dc1-4827-b334-c2e2214ca866"}
{"doc_id": "2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552.doctags", "chunk_id": 13, "source_chunk_idxs": [23], "num_tokens": 471, "text": "Study characteristics\n| References                              | Country         | Setting(s)                                                      | Study type   | Aim(s)                                                                                                                                                                                                                                |\n|-----------------------------------------|-----------------|-----------------------------------------------------------------|--------------|---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| Abma and Baur (2014)*                   | the Netherlands | Residential care                                                | Qualitative  | Explore nursing home staff experiences of co-designing nursing home services with residents.                                                                                                                                          |\n| Abma and Baur (2015)*                   | the Netherlands | Residential care                                                | Qualitative  | Present a care-ethics approach to resident involvement in residential care decisions through a case study.                                                                                                                            |", "doc_items_refs": ["#/tables/1"], "page_nos": [1], "uuid": "6531f823-b524-4e45-9d95-cf0160824121"}
{"doc_id": "2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552.doctags", "chunk_id": 14, "source_chunk_idxs": [24], "num_tokens": 508, "text": "Study characteristics\n| American Health Care Association (1976) | United States   | Skilled care; Intermediate care; Residential care               | Mixed        | Investigate and describe the status, purpose, and structure of Residents' Councils in the United States.                                                                                                                              |\n| Amirkhanyan et al. (2019)               | United States   | Nursing home                                                    | Quantitative | Examine the relationship between client participation, as a form of citizen participation, and organizational performance in nursing homes in the United States.                                                                      |\n| Assisted Living (1998)                  | United States   | Assisted living                                                 | Qualitative  | Illustrate the role of Residents' Councils and their leaders through an interview with a Residents' Council leader.                                                                                                                   |\n| Atlas and Morris (1971)                 | United States   | County Infirmary                                                | Commentary   | Describe the role and function of 'resident governments' as instruments for change in 'public institutions for indigent elderly'.                                                                                                     |\n| Bahr (1980)                             | United States   | Nursing home                                                    | Commentary   | Describe how the Residents' Council of the DeKalb County Nursing Home has impacted the hiring process of staff members.                                                                                                               |\n| Barney (1987)                           | United States   | Nursing home                                                    | Commentary   | Evaluate the model and progress of a community council initiative, intended as a new nursing home-focused organization designed to bring community and resources into the home.                                                       |\n| Baur et al. (2010)**                    | the Netherlands | Nursing homes; Residential care; Sheltered home facilities      | Qualitative  | Describe researcher experiences with a responsive evaluation project on the participation of client councils in policy processes in a residential care and nursing home organization.                                                 |\n| Baur and Abma (2011)**                  | the Netherlands | Nursing home; Residential care; Sheltered home facilities       | Qualitative  | Examine the interactions between Residents' Councils and managers in two residential care homes to investigate the feasibility of Habermaslan communicative action.                                                                   |\n| Baur and Abma (2012)*                   | the Netherlands | Residential care                                                | Qualitative  | Describe how a small group of residents, calling themselves 'The Taste Buddies', developed a joint vision to improve their home's meals through a project encouraging resident engagement in their homes.                             |\n| Baur et al. (2013)                      | the Netherlands | Residential care                                                | Qualitative  | Describe the perspectives of multiple stakeholders, including residents, volunteers, and staff members, on the PARTNER approach to resident engagement.                                                                               |\n| Berge et al. (2022)                     | Sweden          | Nursing home                                                    | Qualitative  | Explore nursing home staff experiences with co-designing nursing home services with residents.                                                                                                                                        |", "doc_items_refs": ["#/tables/1"], "page_nos": [1], "uuid": "b732f43f-2b76-4647-9cf9-80a481c3b5e8"}
{"doc_id": "2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552.doctags", "chunk_id": 15, "source_chunk_idxs": [25], "num_tokens": 277, "text": "Study characteristics\n| Boelsma et al. (2014)                   | the Netherlands | Residential care; Nursing home                                  | Qualitative  | Describe the interests of long-term care residents regarding facility improvement through a collective policy agenda-setting project.                                                                                                 |\n| Bonifas et al. (2013)                   | United States   | Assisted living                                                 | Mixed        | Present findings from a study comparing empowerment opportunities in two resident council groups in assisted living facilities under different leadership models: a resident leadership model and an administrative leadership model. |\n| Clarke (1980)                           | United States   | Nursing home; Skilled nursing facility                          | Commentary   | Share findings from a review of committees at Morningside House Nursing Home.                                                                                                                                                         |\n| Devitt and Checkoway (1982)             | United States   | Long-term care; Nursing home; Assisted living, Residential care | Qualitative  | Report on a pilot study to facilitate resident participation in Residents' Councils in central Illinois.                                                                                                                              |\n| Dimon (1999)                            | UK              | Nursing home                                                    | Commentary   | Describe the process of effectively establishing a Residents' Committee.                                                                                                                                                              |\n| Downey (1971)                           | United States   | Patient institutions                                            | Commentary   | Describe the changing landscape of Residents' Councils and their role in responding to 'consumer-oriented times'.                                                                                                                     |\n| Elliott (1989)                          | Canada          | Long-term care                                                  | Commentary   | Describe the process of effectively establishing a Residents' Committee.                                                                                                                                                              |\n\nTable 2. Continued", "doc_items_refs": ["#/tables/1", "#/texts/81", "#/tables/2"], "page_nos": [1], "uuid": "1fb2f7d0-9255-4e32-bdbc-0100620eaaab"}
{"doc_id": "2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552.doctags", "chunk_id": 16, "source_chunk_idxs": [26], "num_tokens": 470, "text": "Study characteristics\n| References                 | Country       | Setting(s)                            | Study type   | Aim(s)                                                                                                                                                                                         |\n|----------------------------|---------------|---------------------------------------|--------------|------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| Friedman (1975)            | United States | Long-term care                        | Commentary   | Describe the experience of a volunteer group called the Resident Welcoming Committee.                                                                                                          |\n| Gagnon et al. (2014)       | Canada        | Nursing home                          | Qualitative  | Describe the role of mechanisms of public participation in nursing home management and governance.                                                                                             |\n| Gagnon et al. (2017)       | Canada        | Residential care; Long-term care      | Qualitative  | Describe how long-term care home committees reveal information and concerns previously unknown to management and examine the factors that affect management receptivity to committee feedback. |\n| Gibson et al. (1993)       | Australia     | Nursing home                          | Mixed        | Present data on the impact of a program to monitor standards on residents' rights in nursing homes.                                                                                            |", "doc_items_refs": ["#/tables/2"], "page_nos": [1], "uuid": "51811785-feca-4ce3-aebf-e50f08fe3cd9"}
{"doc_id": "2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552.doctags", "chunk_id": 17, "source_chunk_idxs": [27], "num_tokens": 496, "text": "Study characteristics\n| Glasser et al. (1988)      | United States | Skilled nursing facility              | Quantitative | Report findings from a national survey of administrators of 4,504 nursing homes investigating mechanisms for handling ethical dimensions in patient care.                                      |\n| Grossman and Weiner (1988) | United States | Nursing home Skilled nursing facility | Commentary   | Describe and discuss mechanisms and programs that can anticipate, identify, and resolve problems that reduce the quality of life in institutional environments.                                |\n| Grover (1982)              | United States | Restorative care center               | Commentary   | Describe the purpose and impact of Residents' Councils.                                                                                                                                        |\n| Hewitt et al. (2013)       | Guyana        | Residential care                      | Qualitative  | Describe the practical and ethical challenges from the implementation of a participatory project to analyze and improve the quality of life in a residential home in Guyana.                   |\n| Hoffman (2013)             | United States | Senior Living                         | Commentary   | Describe the application of design principles related to control over one's space to a design project for a senior living community.                                                           |\n| Hubbard et al. (1992)      | United States | Nursing home                          | Commentary   | Describe the nature and impact of the Hebrew Home of Greater Washington's political and social action group on its residents.                                                                  |\n| Hutchings (1999)           | Canada        | Long-term care                        | Commentary   | Describe an education strategy designed to assist nursing staff in the process of 'learning to surrender' the service providers' needs to direct client decision-making.                       |\n| Kavaler and Brant (1972)   | United States | Nursing home                          | Commentary   | Examine the distribution, operations, and impacts of Residents' Councils in New York City.                                                                                                     |\n| Knight et al. (2010)       | UK            | Care facility Care home               | Quantitative | Examine the impact of resident empowerment on their quality of life, in the context of a move into a new care facility in South-West England.                                                  |\n| Knowlton (1983)            | United States | Nursing home                          | Commentary   | Describe a staff member's perspective on the importance of Residents' Councils to resident independence.                                                                                       |\n| Leedahl et al. (2017)      | United States | Nursing home                          | Quantitative | Examine civic engagement among nursing home residents and the personal characteristics that predict group membership, Residents' Council participation, volunteering, and voting.              |\n| Lewis (1995)               | United States | Nursing home                          | Commentary   | Describe several programs that offer traditional and innovative ways to support resident independence.                                                                                         |", "doc_items_refs": ["#/tables/2"], "page_nos": [1], "uuid": "56773932-b17c-4839-9591-380aad5886c6"}
{"doc_id": "2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552.doctags", "chunk_id": 18, "source_chunk_idxs": [28], "num_tokens": 314, "text": "Study characteristics\n| McDermott (1989)           | United States | Nursing home                          | Commentary   | Describe a program designed to empower nursing home residents initiated at the Cambridge Nursing Home in Cambridge, Massachusetts.                                                             |\n| Meyer (1991)               | United States | Nursing home                          | Qualitative  | Present data that examines the activities and effectiveness of Residents' Councils.                                                                                                            |\n| Miller (1986)              | UK            | Nursing home                          | Commentary   | Describe the impact of a residents' committee that was actively involved in the governance of Jubilee House, a nursing home.                                                                   |\n| Mitchell and Koch (1997)   | Australia     | Nursing home                          | Qualitative  | Describe the perspectives of residents and their significant others on home decisions that impact their lives.                                                                                 |\n| Newmark (1963)             | United States | Homes for the Aged                    | Commentary   | Describe the Residents' Council at a Jewish Home in Atlanta.                                                                                                                                   |\n| Nusberg (1984)             | UK            | Community Centre                      | Commentary   | Describe formalized resident participation in their homes.                                                                                                                                     |\n| Nyanguru (1987)            | Zimbabwe      | Residential care                      | Qualitative  | Examine the impact of different approaches to care in two residential care facilities on resident quality of life.                                                                             |\n| O'Dwyer and Timonen (2010) | Ireland       | Nursing home                          | Qualitative  | Analyze the operations of a Residents' Council in an Irish facility.                                                                                                                           |\n| Parmar et al. (2019)       | Canada        | Continuing care                       | Mixed        | Develop and evaluate the effectiveness of a toolkit for resident engagement, alongside networking meetings, in promoting successful councils.                                                  |\n(Continued)\n\nTable 2. Continued", "doc_items_refs": ["#/tables/2", "#/texts/82", "#/texts/87", "#/tables/3"], "page_nos": [1], "uuid": "dab33ace-0cbe-4b55-9d43-4f726722b362"}
{"doc_id": "2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552.doctags", "chunk_id": 19, "source_chunk_idxs": [29], "num_tokens": 512, "text": "Study characteristics\n| References                       | Country         | Setting(s)                                      | Study type   | Aim(s)                                                                                                                                                                                                          |\n|----------------------------------|-----------------|-------------------------------------------------|--------------|-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| Petitpoisson and Devincey (2012) | France          | Nursing home                                    | Commentary   | Describe the role of a 'council of social life' in creating a place for exchange and sharing of concerns regarding the home and services related to welcoming new residents.                                    |\n| Reingold et al. (1987)           | United States   | Home for the Aged                               | Commentary   | Describe Merit Grams as an alternative to tipping for recognizing long-term care home staff at the Hebrew Home.                                                                                                 |\n| Sander (1988)                    | UK              | Nursing home                                    | Commentary   | Describe the role of the Residents' Committee at Jubilee House.                                                                                                                                                 |\n| Schwartz (1977)                  | United States   | Nursing home                                    | Commentary   | Describe the staff development program at the Flushing Manor Nursing Home and the program's initiative to encourage peer discussions on sexuality and aging among residents.                                    |", "doc_items_refs": ["#/tables/3"], "page_nos": [1], "uuid": "94da8e05-3fdf-4789-966c-a37433906407"}
{"doc_id": "2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552.doctags", "chunk_id": 20, "source_chunk_idxs": [30], "num_tokens": 507, "text": "Study characteristics\n| Shura et al. (2011)              | United States   | Assisted living; nursing home                   | Qualitative  | Advance the process of culture change within long-term care and assisted living settings through participatory action research focused on resident capacity building and nourishing the culture change process. |\n| Sikorska-Simmons (2007)          | United States   | Assisted living                                 | Quantitative | Examine the impacts of organizational policies on resident perceptions of their autonomy in assisted living.                                                                                                    |\n| Skrajner et al. (2012)           | United States   | Long-term care; nursing home                    | Quantitative | Evaluate the effectiveness of a Resident-Assisted Programming training regimen for residents in long-term care facilities to fill the role of group activity leaders.                                           |\n| Uhlenhopp (1983)                 | United States   | Long-term care                                  | Commentary   | Describe observed benefits and rewards of an effective Residents' Council.                                                                                                                                      |\n| van Geen (1997)                  | the Netherlands | Residential care                                | Qualitative  | Provide a procedure for client empowerment and quality control in residential care homes.                                                                                                                       |\n| Wagner (2008)                    | United States   | Nursing home                                    | Mixed        | Develop an instrument that could be used to evaluate Residents' Councils.                                                                                                                                       |\n| Wald (1978)                      | United States   | Geriatric center                                | Commentary   | Describe a mural painting initiative organized by the home's Residents' Council.                                                                                                                                |\n| Wichita (1980)                   | United States   | Care facility                                   | Commentary   | Describe a human rights initiative in a nursing home that grew into a Residents' Council that is involved in polycumbing.                                                                                       |\n| Wilson and Kirby (2003)          | Australia       | Aged care hostels                               | Quantitative | Report the results of surveys administered to resident, resident and staff, and family and staff committees in South Australian aged care hostels.                                                              |\n| Wilson and Kirby (2005)          | Australia       | Low-level residential aged care facility (RACF) | Quantitative | Investigate factors affecting the functioning of Residents' Committees in South Australian low-level residential aged care facilities.                                                                          |\n| Wilson and Kirby (2006)          | Australia       | Low-level residential aged care facility (RACF) | Quantitative | Examine the level and types of resident decision-making in Residents' Committees in a low-level residential aged care facility and resident satisfaction with their decision-making power.                      |\n| Znidarsich et al. (2016)         | United States   | Skilled nursing facility                        | Qualitative  | Evaluate the status, impact, and success of a recently formed Resident and Family Council.                                                                                                                      |", "doc_items_refs": ["#/tables/3"], "page_nos": [1], "uuid": "2035bc58-9ab1-45be-825f-d974e03ea1df"}
{"doc_id": "2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552.doctags", "chunk_id": 21, "source_chunk_idxs": [31], "num_tokens": 456, "text": "Study characteristics\n| Zuidgeest et al. (2011)          | The Netherlands | Nursing home; Residential care                  | Quantitative | Examine the extent to which client councils are able to exercise their rights to be consulted and give their consent, as well as their role in measuring client experiences with the CQ-index.                  |\nNote: Complete references for the 62 included articles are listed in Supplementary Material.\n*Abma and Baur (2014), Abma and Baur (2015), and Baur and Abma (2012) were all based on the same participatory action research project.\n**Baur et al. (2010) and Baur and Abma (2011) were also based on the same study conducted in several nursing homes and residential care homes.\nTable 3. Summary of study characteristics\n\n|                                      | Number of studies   | Proportion of studies   |\n|--------------------------------------|---------------------|-------------------------|\n| Setting Type                         |                     |                         |\n| Long-Term Care                       | 42                  | 71%                     |\n| Residential Care or Assisted Living  | 10                  | 17%                     |\n| Both                                 | 7                   | 12%                     |\n| Country in which Study was Conducted |                     |                         |\n| United States                        | 33                  | 56%                     |\n| The Netherlands                      | 6                   | 10%                     |\n| Australia                            | 5                   | 8%                      |\n| Canada                               | 5                   | 8%                      |\n| United Kingdom                       | 5                   | 8%                      |\n| France                               | 1                   | 2%                      |\n| Guyana                               | 1                   | 2%                      |\n| Ireland                              | 1                   | 2%                      |\n| Sweden                               | 1                   | 2%                      |\n| Zimbabwe                             | 1                   | 2%                      |\n| Number of Facilities                 |                     |                         |\n| 1                                    | 29                  | 49%                     |\n| 2-100                                | 20                  | 34%                     |\n| > 100                                | 5                   | 8%                      |\n| Not noted                            | 5                   | 8%                      |\n| Level of Engagement                  |                     |                         |\n| Involvement                          | 31                  | 53%                     |\n| Partnership                          | 28                  | 47%                     |", "doc_items_refs": ["#/tables/3", "#/texts/88", "#/texts/89", "#/texts/90", "#/texts/93", "#/tables/4"], "page_nos": [1], "uuid": "b350ab1f-ded2-46c4-a6a3-9e8cad1ae175"}
{"doc_id": "2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552.doctags", "chunk_id": 22, "source_chunk_idxs": [32], "num_tokens": 129, "text": "Study characteristics\nlevels reported that the majority of the residents engaged had completed a minimum of a high school education. Of the three studies (5%) that reported participant race or ethnicity, two reported that all participants were White and one reported that two of the participants had Indonesian backgrounds. One study reported that the two homes included in the research were from areas with different socioeconomic statuses.\nJust under 50% ( n = 26) of the studies included residents in the research, either as participants (36%; n = 21), partners/collaborators (7%; n = 4), or author (2%; n = 1).", "doc_items_refs": ["#/texts/94", "#/texts/95"], "page_nos": [1], "uuid": "fcce889c-43bd-4858-81b3-62eeec8acfab"}
{"doc_id": "2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552.doctags", "chunk_id": 23, "source_chunk_idxs": [33], "num_tokens": 498, "text": "How have LTCH residents been engaged in the organizational design and governance of LTCHs?\nOf the 59 studies, 53% ( n = 31) were classified as describing resident involvement and 47% ( n = 28) were classified as describing resident partnership in their home. Methods of engagement included Residents' Councils ( n = 38), resident involvement in home-level decisions outside of a dedicated council or committee ( n = 9), resident groups ( n = 5), education projects ( n = 2), other committees ( n = 2), and other forms of engagement ( n = 3). 83% ( n = 49) of the studies described ongoing engagement initiatives, whereas 17% ( n = 10) described an engagement process that was initiated through the research project in the study.\nRoughly half, 53% ( n = 31), of studies described the method of resident recruitment for engagement, namely, that residents were\nTable 4. Summary of article characteristics\n\n|                                      | Number of articles   | Proportion of articles   |\n|--------------------------------------|----------------------|--------------------------|\n| Study Type                           |                      |                          |\n| Commentary                           | 30                   | 48%                      |\n| Qualitative                          | 17                   | 27%                      |\n| Quantitative                         | 10                   | 16%                      |\n| Mixed                                | 5                    | 8%                       |\n| Year of Publication (by decade)      |                      |                          |\n| 1960-1969                            | 1                    | 2%                       |\n| 1970-1979                            | 7                    | 11%                      |\n| 1980-1989                            | 17                   | 27%                      |\n| 1990-1999                            | 9                    | 15%                      |\n| 2000-2009                            | 5                    | 8%                       |\n| 2010-2019                            | 22                   | 35%                      |\n| 2020-2022                            | 1                    | 2%                       |\n| Authorship Team Affiliations*        |                      |                          |\n| Includes Research Institution(s)     | 39                   | 63%                      |\n| Includes LTCH(s) as Staff            | 20                   | 32%                      |\n| Includes Third Party Organization(s) | 8                    | 13%                      |\n| Includes LTCH(s) as Resident(s)      | 1                    | 2%                       |\n*Sum is greater than 100% for studies that include multiple authors.", "doc_items_refs": ["#/texts/97", "#/texts/98", "#/texts/100", "#/tables/5", "#/texts/101"], "page_nos": [1], "uuid": "d261df3e-2681-4437-b816-bbbabe199963"}
{"doc_id": "2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552.doctags", "chunk_id": 24, "source_chunk_idxs": [34], "num_tokens": 367, "text": "How have LTCH residents been engaged in the organizational design and governance of LTCHs?\nelected ( n = 14), were recommended or selected by staff ( n = 14), volunteered ( n = 13), or initiated the engagement process ( n = 2). Some studies described a change to the method of resident recruitment over time; for example, in two studies, the residents were meant to be elected, but were later selected by staff, and in two other studies, representatives that were originally selected were later elected. 27% ( n = 16) of studies described relatives as involved in the engagement process, primarily as council or group members ( n = 12).\nAll 59 studies reported one or more organization-level area of engagement, including communication and relationships between residents and LTCH staff ( n = 24), community building between residents ( n = 20), and organizational policies, practices, and procedures concerned with food ( n = 23), resident grievances ( n = 18), activities and outings ( n = 16), general quality improvement ( n = 15), general home policies and regulations ( n = 14), spatial design ( n = 12), resident rights ( n = 10), resident care ( n = 8), staff behaviour and hiring ( n = 7), hospitality ( n = 4), fundraising ( n = 3), communication around the deaths of other residents ( n = 3), and other ( n = 10). 17% ( n = 10) of studies also described a focus on areas for improvement at the level of individual residents, including resident empowerment ( n = 9) and supporting resident wellness ( n = 6). Finally, 10% ( n = 6) of studies also referenced resident engagement in policymaking across the LTCH sector.", "doc_items_refs": ["#/texts/102", "#/texts/103"], "page_nos": [1], "uuid": "befcb29e-234c-49ec-bdeb-e982b2128ace"}
{"doc_id": "2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552.doctags", "chunk_id": 25, "source_chunk_idxs": [35], "num_tokens": 445, "text": "Barriers\nOf the 59 studies, 54% ( n = 32) described barriers to engagement.\nPerspectives: Barriers were related to both resident and home perspectives. For residents, this included residents feeling that their efforts would not make a difference in their homes ( n = 8), a feeling among residents that they did not deserve more influence ( n = 2), and a lack of knowledge among residents regarding engagement opportunities ( n = 2). Residents' fear of retaliation by staff was cited as a direct barrier to engagement ( n = 7), while residents not participating ( n = 11), experiencing discomfort expressing concerns ( n = 3), and avoiding conflict ( n = 2) were also described. Tendency for discussion forums to focus on individual resident grievances ( n = 6) was also cited as a barrier. For homes, a lack of consistent participation or supportive attitude from staff ( n = 11), staff interference in meetings ( n = 10), and staff discomfort receiving criticism from residents ( n = 5) were cited as barriers.\nCharacteristics: Barriers were described primarily for residents, including inadequate opportunities for the engagement of residents with cognitive impairments ( n = 11), residents' vision, hearing, and mobility impairments ( n = 6), and residents' difficulties communicating their concerns ( n = 4).\nImplementation and sustainability infrastructure: Meeting logistics and dynamics were identified as organizational barriers, including failures to provide appropriate amplification devices so that everyone could hear and be heard ( n = 5); communicate and schedule consistent meetings ( n = 5); meet in rooms conducive to uninterrupted and collaborative discussions ( n = 3); and circulate relevant and accessible meeting minutes and resources ( n = 1). The length of the meetings, the facilitation style, and repetitive discussions were each referenced once as barriers to active engagement. Staff turnover ( n = 2) was also identified as a barrier.\nExternal environment: 19% ( n = 11) of studies described external barriers to resident engagement, including social norms ( n = 9), such as stereotypes of resident capacity for leadership, and resources ( n = 5), such as funding and policies.", "doc_items_refs": ["#/texts/106", "#/texts/109", "#/texts/110", "#/texts/111", "#/texts/112"], "page_nos": [1], "uuid": "2da4e647-4f9c-4128-aa11-336d05274dd8"}
{"doc_id": "2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552.doctags", "chunk_id": 26, "source_chunk_idxs": [36], "num_tokens": 447, "text": "Enablers\nOf the 59 studies, 73% ( n = 43) described enablers.\nPerspectives: Enablers were related to both resident and home perspectives, including positive staff attitude ( n = 16), positive relationships between staff or researchers and residents ( n = 8), the ability of staff and residents to find common ground ( n = 5), and staff dedication ( n = 2). Additionally, support from volunteers and relatives was cited as an enabler ( n = 3).\nImplementation and sustainability infrastructure: Staff involvement in the engagement processes was described as an enabler, including specifically collaborating with residents to establish agenda items or address resident concerns ( n = 22), attending meetings ( n = 21), leading or facilitating meetings ( n = 18), providing administrative or logistical support ( n = 11), providing general support ( n = 5), and leading the establishment of residents' committees ( n = 4). 15% ( n = 9) of studies described specific practices as enablers, including continuous evaluation ( n = 4), resident training ( n = 2), continuity planning ( n = 1), continual recruitment ( n = 1), and social service involvement ( n = 1). 42% ( n = 25) of studies described meeting practices as enablers, including strong leadership and facilitation ( n = 7), attention to council composition ( n = 6), communication between meetings ( n = 4), an established mandate or terms of reference ( n = 4), open discussion ( n = 4), agenda setting by residents ( n = 3), meeting minutes ( n = 3), involvement of a neutral third-party ( n = 2), opportunities for socializing ( n = 2), and others ( n = 7).\nHow have considerations of diversity been integrated into this engagement?\nOf the 59 studies, eight (14%) referenced efforts to include diverse individuals. Four studies described accommodations for disabilities, including providing voice amplification devices at meetings ( n = 3) and ensuring wheelchair accessibility ( n = 1). Three studies referred to generally recruiting diverse residents. One study described including ethnically diverse residents using language interpreters.", "doc_items_refs": ["#/texts/114", "#/texts/115", "#/texts/116", "#/texts/118", "#/texts/119"], "page_nos": [1], "uuid": "06f341fe-8f6c-4813-b3f1-11e98e6e02cb"}
{"doc_id": "2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552.doctags", "chunk_id": 27, "source_chunk_idxs": [37], "num_tokens": 419, "text": "How have considerations of dementia and cognitive impairment been integrated into this engagement?\nOf the 59 studies, 20% ( n = 12) described approaches to engaging residents with dementia or cognitive impairment. Of these, three studies described that they were explicitly excluded. Nine studies described efforts to include residents with dementia or cognitive impairment, including establishing open eligibility criteria ( n = 5), involving representatives for cognitively impaired residents ( n = 3), providing memory aids such as flip chart notes and content refreshers ( n = 3), and implementing a modified version of the engagement which included informal and private conversations ( n = 1).\nHow has the impact of this engagement been evaluated, including with resident-centred outcomes, resident-centred experiences, resident/family/team member satisfaction, or health economic outcomes?\nAll 59 studies described potential outcomes of resident engagement. Most studies postulated positive outcomes for residents (e.g., increased autonomy, influence, fulfillment, quality of life, and improved health) and the LTCH (e.g., increased sense of community, improved relationships between residents and staff, new or changed services, programming and policies, and improved staff satisfaction). Despite the descriptions of potential impacts, very few studies provided data to substantiate the impacts of engagement on residents or LTCHs. In particular, of the 15 quantitative or mixed methods studies, only 10 evaluated resident engagement with process or outcome measures. These included measures of the engagement process ( n = 3), quality of care ( n = 2), resident empowerment ( n = 1), and resident health and well-being ( n = 1) as reported by researchers, LTCH managers, or staff. The four studies with resident-reported outcomes related to influence ( n = 2), autonomy ( n = 1) and, for one study, multiple outcomes including satisfaction, identification with staff, identification with residents, comfort, life satisfaction, and physical health ( n = 1). All 10 studies, except one that assessed the impacts of involving residents in decisions about home decor, were observational.", "doc_items_refs": ["#/texts/121", "#/texts/122", "#/texts/123"], "page_nos": [1], "uuid": "be0507b3-b4fb-43ba-b61d-920a14390e0a"}
{"doc_id": "2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552.doctags", "chunk_id": 28, "source_chunk_idxs": [38], "num_tokens": 502, "text": "Discussion\nThis review identified and analyzed 62 publications that described findings from 59 studies on resident engagement in the organizational design and governance of their LTCH. The results demonstrate that little is reported in the literature about how residents are engaged in their LTCHs. Although this review found multiple examples of approaches to engaging residents in their LTCH, (e.g., Residents' Councils) as well as descriptions of a range of areas in which they had influence (e.g., services, programming, and policies), there were also important gaps. Few studies reported on resident characteristics, and even fewer addressed considerations of\nresident diversity in their engagement. Moreover, the literature provided little insight into approaches to engaging residents with dementia or cognitive impairment. While all studies postulated positive impacts for residents and LTCHs, the review identified very few studies that evaluated the processes and outcomes of resident engagement. These studies also provided limited insight into resident experiences of engagement; over half of the included articles did not offer resident perspectives (i.e., include residents as study participants or partners/collaborators).\nDespite spanning six decades and multiple countries, the research on resident engagement in their LTCHs has been relatively stagnant. Katan (1988) describes the research on resident engagement in LTCHs as lacking in its consideration of participation avenues other than Residents' Councils and in its examination of empirical evidence. Based on the literature at the time of writing, Katan (1988) argues that the following barriers limit resident participation in organizational governance: low capacity for participation (due to cognitive and physical impairments), a lack of experience in roles of influence, feelings of powerlessness, a focus on a residents' individual needs, insufficient guidelines and policies to support resident engagement in some countries, and institutional barriers to integrating resident engagement into organizational operations and culture. Moreover, Katan (1991) argues that the level and quality of Residents' Councils of most LTCHs is low and that there are significant barriers to establishing effective 'internal democracy' (p. 175). The literature that has followed these articles, spanning more than three decades, identifies many of the same challenges, especially organizational culture, feelings of powerlessness, and resident capacity for participation. Although periods of legislative change in the United States (Institute of Medicine, 1986) and international initiatives (World Health Organization, 2017) targeting the LTCH sector potentially spurred jumps in publications in the 1980s and 2010s, respectively, the number of articles published on resident engagement in organizational design and governance has been limited overall.", "doc_items_refs": ["#/texts/125", "#/texts/128", "#/texts/129"], "page_nos": [1], "uuid": "b23a5078-d036-45b8-a152-035a42aeef27"}
{"doc_id": "2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552.doctags", "chunk_id": 29, "source_chunk_idxs": [39], "num_tokens": 227, "text": "Discussion\nThis review identified multiple barriers to engagement, including those that align with previous research. For example, fear of retaliation has been documented in Canada and the United States as a barrier to LTCH residents reporting concerns or abuse (Baumann et al., 2024; Caspi, 2024). Fear of retaliation can reduce residents' willingness to express their concerns and, by extension, hinder their participation in engagement initiatives. Study findings identified the importance of the power dynamic between staff and residents, thereby highlighting the importance of establishing safe, comfortable, and constructive communication between residents and their LTCHs. At the organizational level, staff involvement and access to the administration were described as a tangible indication of commitment to resident engagement; staff involvement and support, intrinsically connected to leadership support for resident engagement, were argued to be a critical component of developing a home culture that protects and promotes resident rights. Taken together, the literature highlights the important roles of staff and leadership for effective resident engagement; however, given the potential for both positive and negative impacts, staff involvement should also be a key area for evaluation when assessing the success of resident engagement processes.", "doc_items_refs": ["#/texts/130"], "page_nos": [1], "uuid": "9ae6b14e-b83e-4e60-bdd6-e7aa34cd7e82"}
{"doc_id": "2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552.doctags", "chunk_id": 30, "source_chunk_idxs": [40], "num_tokens": 321, "text": "Research gaps\nThis scoping review highlighted several research gaps.\nFirst, few studies addressed engagement of residents living with dementia or cognitive impairment. In LTCHs, considerations of\ndementia and cognitive impairment are particularly salient, given that 76% of those entering LTCHs are living with mild to severe cognitive impairment (OLTCA, n.d.). Moreover, there are studies describing the importance of adaptively engaging LTCH residents with dementia and cognitive impairment in the planning and delivery of home activities and services, to ensure that all residents can participate in the tasks and activities that matter to them (Tak et al., 2014).\nSecond, very few studies described the residents who are engaged in their homes or efforts to address issues of diverse representation in this context. Social determinants of health, including but not limited to race, socioeconomic status, disability, gender, and immigration status, shape the lives of those living inside and outside of LTCHs (Perez et al., 2022). Katan (1991) describes the profile of the 'active resident' as more assertive and achievement-oriented, more likely to have previously participated in participatory frameworks, which is associated with higher socioeconomic status, and in a state of better physical and mental health, compared to less active residents. One study included in this review tested demographic, health, and social integration variables predicting Residents' Council involvement (Leedahl et al., 2017); however, more research and improved reporting are needed to describe those who participate in resident engagement initiatives and thereby rationalize and improve approaches to inclusion.", "doc_items_refs": ["#/texts/132", "#/texts/133", "#/texts/135", "#/texts/136"], "page_nos": [1], "uuid": "147cad7d-4eef-4382-931d-049a3f915da0"}
{"doc_id": "2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552.doctags", "chunk_id": 31, "source_chunk_idxs": [41], "num_tokens": 481, "text": "Research gaps\nThird, many of the included articles were commentaries, rather than qualitative, quantitative, or mixed methods research articles. Few studies were based on empirical data, and very few included resident-reported outcomes. The evaluation of LTCHs has traditionally focused on residents' physical health outcomes (Kirkham et al., 2024), whereas the primary goals described for resident engagement are related to outcomes such as increased autonomy, influence, fulfillment, quality of life, and improved health. Measures developed specifically for the contexts of resident engagement in LTCHs may be promising in this regard, including assessing process (e.g., Residents' Council effectiveness) (Staempfli et al., 2025; Wagner, 2008), as well as resident-reported outcomes such as quality of life (Hoben et al., 2022), social connection (Dewan et al., 2024), and sense of home (Rijnaard et al., 2016). Further research is needed to study the association between resident engagement and outcomes for residents and LTCHs, including through both observational and intervention research, to develop an evidence base of effective interventions.\nFourth, although many of the identified barriers and enablers align with more recent research studying the effectiveness of Residents' Councils (Staempfli et al., 2025), it is likely that resident perspectives are still underrepresented or do not reflect the current context of LTCHs. In fact, other barriers were raised in consultation with residents about the current findings. For example, perceptions among residents of their own lack of ability to participate in or contribute to home-level decision-making reinforce that resident engagement continues to be challenged by upstream structural determinants of health, including stigma associated with LTCHs (Dobbs et al., 2008), that can manifest as self-stigma. Further, residents and others described the need to move beyond 'ticking the box', such as where LTCHs engage residents only at the end of the decision-making or only at the lowest level of participation; resources will need to incorporate the spectrum of engagement (International Association for Public Participation, n.d.) to encourage residents and LTCHs to reflect on current conditions and develop goals for engagement.\nFifth, most of the existing research articles are written by LTCH staff members and researchers, and few represent the experiences", "doc_items_refs": ["#/texts/137", "#/texts/138", "#/texts/139"], "page_nos": [1], "uuid": "40bcaa4f-a116-459f-aaf3-5a4488260cee"}
{"doc_id": "2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552.doctags", "chunk_id": 32, "source_chunk_idxs": [42], "num_tokens": 451, "text": "Research gaps\nof residents. Yet, there are many individuals living in LTCHs who are capable of and eager to advocate for themselves and their fellow residents. This glaring absence of resident voices does not align with principles of patient-oriented research, nor does it signal that the existing research reflects resident priorities or values (Mader et al., 2018). Ultimately, it is a barrier to developing effective evidence-based engagement strategies, since including the endusers of research, in this case, residents, is critical to producing relevant and useful findings (Munce et al., 2023). To that end, researchers must prioritize resident voices, including through resident engagement, in the research processes that seek to describe and affect their daily lives.\nSixth, although the review focused on engagement within the home, some studies also described community involvement, such as through advocacy, civic engagement, participation on community councils, community publications, fundraising, and community events. Community involvement increased the capacity for communication and advocacy across LTCHs, which allowed residents to share advice, experience, and collective power. The description of the power of resident engagement that extends into the community highlights an important area for future research. Similarly, this review focused on resident engagement at the level of organizational design and governance. Given the larger social and political context that drives funding, personnel, objectives, and regulations in LTCHs, systems-level approaches to resident engagement represent an important area of future research and policy development.\nFinally, none of the articles included in the review discussed the implications of the COVID-19 pandemic for resident engagement. The limitations imposed during the COVID-19 pandemic have renewed discourse about residents' rights, including decisionmaking within the home (Crea-Arsenio &amp; Baumann, 2022) and, consequently, may have had impacts on knowledge, attitudes and methods of resident engagement within the home. There is already emerging literature on the impact of the COVID-19 pandemic on different facets of resident engagement in decision-making in their homes, such as the impact of restricted family visits on resident quality of life and the role of staff in advocating for residents' needs (Keefe et al., 2024).", "doc_items_refs": ["#/texts/142", "#/texts/143", "#/texts/144"], "page_nos": [1], "uuid": "786eed35-61b7-44f7-94a4-eafc48584cde"}
{"doc_id": "2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552.doctags", "chunk_id": 33, "source_chunk_idxs": [43], "num_tokens": 454, "text": "Recommendations for policy and practice\nLTCHs and community partners who work with LTCH residents must be supported to enact concrete and measurable action plans to engage residents in their homes. Some jurisdictions require specific feedback mechanisms, such as the duty of LTCH licensees under the Fixing Long-Term Care Act, 2021, to have established procedures for collecting and responding to complaints and issues reported by Residents' Councils (Ontario Association of Residents' Councils, 2012). Yet, despite such policies, distrust persists both in the ability of residents to have their voices heard and LTCHs to address the barriers to resident engagement. LTCHs must be supported to integrate resident voices in decision-making in the home, including with flexible and inclusive processes, to ensure that diverse voices are included and that residents' input is documented and acted on.\nSynthesizing existing research and resident perspectives into a customizable toolkit for resident engagement, as an articulated goal for this project, could help to support implementation of effective engagement strategies. However, given the limited research evidence found in this review, such a toolkit must consider resident\nexperiences and data on resident engagement beyond the scope of published academic research, including pre-existing models of effective resident engagement, perspectives shared through consultations, and other available resources pertaining to resident lived experience. Findings from other areas may also be useful, including engaging residents with dementia through 'authentic partnerships' (Dupuis et al., 2012) and, more generally, applying principles of effective engagement (National Consumer Council, 2008).\nAlignment with the culture change movement within the LTCH sector is also central to establishing and promoting mechanisms for resident engagement. Broadly, person-centred relationships between residents and LTCH staff increase dialogue and help to bridge disconnects between the values, priorities, and needs of management, staff, and residents through relational empowerment (Baur &amp; Abma, 2011). Staff and management have a reciprocal relationship with organizational culture, where they both influence and are influenced by it and are thus central to culture change. Relational empowerment mediates the tension between resident involvement and staff support by leveraging the respective strengths of both parties. Relationships and communication, as highlighted in this review, are necessary to address structural barriers to engagement and transform culture from within.", "doc_items_refs": ["#/texts/146", "#/texts/147", "#/texts/149", "#/texts/150"], "page_nos": [1], "uuid": "98f51f59-cf26-45ea-880a-e46ae35d9f52"}
{"doc_id": "2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552.doctags", "chunk_id": 34, "source_chunk_idxs": [44], "num_tokens": 234, "text": "Limitations\nTo our knowledge, this review was the first to broadly map and summarize the literature on resident engagement in the organizational governance of their LTCHs. However, we acknowledge certain limitations and, in particular, the likelihood that some relevant literature was not included. First, the concept of resident engagement was not easily translated into the search strategy for electronic databases. Recognizing this challenge, we worked with an information specialist to develop the search strategy, and it was translated into multiple databases; it is a strength that, through our search, we identified articles published in different contexts (e.g., over time and across jurisdictions and types of LTCHs). Second, our search of the grey literature was completed through online searches of websites. Our search of electronic databases showed that more than half of the included articles were published before the year 2000; given this interest, it is likely that relevant grey literature (i.e., association, government, or organization reports) was produced during this time, and thus, prior to widespread dissemination through organizational websites. Therefore, it is likely that there was relevant grey literature that was not identifiable or retrievable through our search strategy.", "doc_items_refs": ["#/texts/152"], "page_nos": [1], "uuid": "f9da7a34-c4c8-4468-aeef-e10dc4b26a4a"}
{"doc_id": "2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552.doctags", "chunk_id": 35, "source_chunk_idxs": [45], "num_tokens": 445, "text": "Conclusion\nThere is a small body of research, spanning decades, that describes resident engagement in the organizational design and governance of their LTCHs. Although existing research describes approaches, barriers, and enablers to engagement, there is relatively little empirical evidence on effective strategies for resident engagement in organizational design and governance, and little is known about the residents involved in these initiatives. With few frameworks, theories, or approaches for recording, reporting, and improving resident engagement, residents, researchers, and LTCHs must collaborate to develop an evidence base that will support accessible and meaningful engagement opportunities for those living in LTCHs. The development of resources that target resident engagement in the organizational governance and design of their homes,\nas well as provide pathways for a comprehensive evaluation of the dynamic engagement process, is crucial for ensuring consistent and meaningful resident engagement.\nThe right to shape the place that they call home is fundamental to residents' dignity and must be promoted for the well-being of all residents. The phrase 'nothing about residents without residents', adapted from disability justice activism, denotes the importance of including residents in the decisions that are made about their lives (Scotch, 2009). It is a call to action for LTCHs, community partners, government, and researchers to transform processes to include resident voices. In embracing relational empowerment and implementing principles of co-design, power imbalances can be reshaped to strengthen mutual respect, cooperation, and collaborative action. 'Nothing about residents without residents' is a constant reminder of the spirit and purpose of resident engagement and is the foundational principle of this work.\nSupplementary material. The supplementary material for this article can be found at http://doi.org/10.1017/S0714980825100263.\nAcknowledgements. We are grateful for the support and involvement of the entire Ontario Association of Residents' Councils (OARC) team, including Jennifer Langston, Julie Garvey, Melissa Matheson, and Stephanie Ventura. We are also grateful for the involvement of Neha Dewan and Sobhnek Hothei in the article selection and data extraction process. We are also grateful for the help of Florence Letarte in translating the abstract and title of the paper.", "doc_items_refs": ["#/texts/154", "#/texts/157", "#/texts/158", "#/texts/159", "#/texts/160"], "page_nos": [1], "uuid": "e70094b0-a336-47e6-96af-53908d4a0af4"}
{"doc_id": "2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552.doctags", "chunk_id": 36, "source_chunk_idxs": [46], "num_tokens": 103, "text": "Conclusion\nFinancial support. This research was supported by grants from: (1) Canadian Frailty Network (Technology Evaluation in the Elderly Network), which is supported by the Government of Canada through the Networks of Centres of Excellence (NCE) program; (2) Perley Health (ECR2022-014) and (3) Canadian Institutes of Health Research (185624). JB and KSM are supported by the Walter &amp; Maria Schroeder Institute for Brain Innovation and Recovery.", "doc_items_refs": ["#/texts/161"], "page_nos": [1], "uuid": "45919c64-44fa-4e7e-9ae3-7ce06ecb133d"}
{"doc_id": "2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552.doctags", "chunk_id": 37, "source_chunk_idxs": [47], "num_tokens": 480, "text": "References\nArksey, H., &amp; O'Malley, L. (2005). Scoping studies: Towards a methodological framework. International Journal of Social Research Methodology , 8 (1), 19-32. https://doi.org/10.1080/1364557032000119616\nArmstrong, P., Banerjee, A., Hugh, A., Braedley, S., Choiniere, J., Lowndes, R., &amp; Struthers, J. (2019). Models for long-term residential care: A summary of the consultants . Report to Long-Term Care Homes and Services, City of Toronto. https://www.toronto.ca/wp-content/uploads/2022/11/9118-Models-for-Longterm-Residential-Care-SSLTC-Council-Issue-Note-130891.pdf\nBaumann, A., Crea-Arsenio, M., Smith, V., Antonipillai, V., &amp; Idriss-Wheeler, D. (2024). Abuse in Canadian long-term care homes: A mixed methods study.\nBMJ Open Quality , 13 (2), 1-6. https://doi.org/10.1136/bmjoq-2023-002639 Baur, V. E., &amp; Abma, T. A. (2011). Resident councils between lifeworld and system: Is there room for communicative action? Journal of Aging Studies , 25 (4), 390-396. https://doi.org/10.1016/j.jaging.2011.03.001.\nCarman, K. L., Dardess, P., Maurer, M., Sofaer, S., Adams, K., Bechtel, C., &amp; Sweeney, J. (2013). Patient and family engagement: A framework for understanding the elements and developing interventions and policies. Health Affairs , 32 (2), 223-231. https://doi.org/10.1377/hlthaff.2012.1133", "doc_items_refs": ["#/texts/163", "#/texts/164", "#/texts/165", "#/texts/166", "#/texts/167"], "page_nos": [1], "uuid": "fb150016-93eb-4121-bbe3-712f0869b24c"}
{"doc_id": "2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552.doctags", "chunk_id": 38, "source_chunk_idxs": [48], "num_tokens": 474, "text": "References\nCaspi, E. (2024). Residents' fear of retaliation in America's nursing homes: An exploratory study. Journal of Applied Gerontology , 43 (5), 497-514. https:// doi.org/10.1177/07334648231214413\nCanadian Institute for Health Information. (2021) How many long-term care beds are there in Canada? https://www.cihi.ca/en/how-many-long-termcare-beds-are-there-in-canada\nCovidence systematic review software . (2024). [Computer software]. Veritas Health Innovation. www.covidence.org.\nCrea-Arsenio, M., &amp; Baumann, A. (2022). Rights versus risks: The impact of isolation on residents and families in long-term care. Healthcare Policy , 17 (Special Issue), 133-144. https://www.longwoods.com/content/26849/health\ncare-policy/rights-versus-risks-the-impact-of-isolation-on-residents-and-fami lies-in-long-term-care\nDedoose (Version 9.0.17) cloud application for managing, analyzing, and presenting qualitative and mixed method research data. (2024). [macOS]. SocioCultural Research Consultants, LLC. hwww.dedoose.com\nDewan, N., Sommerlad, A., Chapman, H., Banerjee, S., Corazzini, K., Edvardsson, D., Liougas, M. P., Livingston, G., McGilton, K. S., O'Rourke, H. M., &amp; Bethell, J. (2024). Assessing social connection for long-term care home residents: Systematic review using consensus-based standards for the selection of health measurement instruments guidelines. Alzheimer's &amp; Dementia: Translational Research &amp; Clinical Interventions , 10 (3), e12492. https://doi. org/10.1002/trc2.12492", "doc_items_refs": ["#/texts/168", "#/texts/169", "#/texts/170", "#/texts/171", "#/texts/173", "#/texts/174", "#/texts/175"], "page_nos": [1], "uuid": "b3a1491e-b31e-400b-a8aa-929263c8ec84"}
{"doc_id": "2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552.doctags", "chunk_id": 39, "source_chunk_idxs": [49], "num_tokens": 378, "text": "References\nDobbs, D., Eckert, J. K., Rubinstein, B., Keimig, L., Clark, L., Frankowski, A. C., &amp; Zimmerman, S. (2008). An ethnographic study of stigma and ageism in residential care or assisted living. The Gerontologist , 48 (4), 517-526. https:// doi.org/10.1093/gerent.48.4175\nDupuis, S. L., Gillies, J., Carson, J., Whyte, C., Genoe, R., Loiselle, L., &amp; Sadler, L. (2012). Moving beyond patient and client approaches: Mobilizing 'authentic partnerships' in dementia care, support and services. Dementia , 11 (4), 427-452. https://doi.org/10.1177/1471301211421063\nEmodi, B. (1977). A history of long-term care facilities for the elderly in Canada . Canada Mortgage and Housing Corporation. https://publications.gc.ca/site/ eng/9.82386/publication.html\nFixing Long Term Care Act, S.O. 2021, c.39, Schedule. 1, s. 3.\nGale, N. K., Heath, G., Cameron, E., Rashid, S., &amp; Redwood, S. (2013). Using the framework method for the analysis of qualitative data in multi-disciplinary health research. BMC Medical Research Methodology , 13 (1), 117. https://doi. org/10.1186/1471-2288-13-117", "doc_items_refs": ["#/texts/176", "#/texts/177", "#/texts/178", "#/texts/179", "#/texts/180"], "page_nos": [1], "uuid": "4f80c8a2-0182-427b-bc7c-5c3ef660c2d0"}
{"doc_id": "2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552.doctags", "chunk_id": 40, "source_chunk_idxs": [50], "num_tokens": 474, "text": "References\nHoben, M., Banerjee, S., Beeber, A. S., Chamberlain, S. A., Hughes, L., O'Rourke, H. M., Stajduar, K., Shrestha, S., Devkota, R., Lam, J., Simons, I., Dymchuk, E., Corbett, K., &amp; Estrabooks, C. A. (2022). Feasibility of routine quality of life measurement for people living with dementia in long-term care. Journal of the American Medical Directors Association , 23 (7), 1221-1226. https://doi. org/10.1016/j.jamda.2021.07.018\nHoltrop, J. S., Estabrooks, P. A., Gaglio, B., Harden, S. M., Kessler, R. S., King, D. K., Kwan, B. M., Ory, M. G., Rabin, B. A., Shelton, R. C., &amp; Glasgow, R. E. (2021). Understanding and applying the RE-AIM framework: Clarifications and resources. Journal of Clinical and Translational Science , 5 (1), e126. https://doi.org/10.1017/cts.2021.789\nInstitute of Medicine (US) Committee on Nursing Home Regulation. (1986). Improving the quality of Care in Nursing Homes . National Academies Press (US). http://www.ncbi.nlm.nih.gov/books/NBK217556/\nInternational Association for Public Participation. (n.d.). IAP2 Spectrum Evolution [Webpage]. https://www.iap2.org/page/SpectrumEvolution\nInvolve &amp; National Consumer Council. (2008). Deliberative Public Engagement: Nine Principles . National Consumer Council. https://www.involve.org.uk/ sites/default/files/uploads/docuemnt/Deliberative-public-engagement-nineprinciples\\_0.pdf", "doc_items_refs": ["#/texts/181", "#/texts/182", "#/texts/183", "#/texts/184", "#/texts/185"], "page_nos": [1], "uuid": "4311012e-51d6-4267-a008-319d17c238b5"}
{"doc_id": "2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552.doctags", "chunk_id": 41, "source_chunk_idxs": [51], "num_tokens": 505, "text": "References\nKatan, J. (1988). Participation of residents in old age homes: The idea and its implementation. Activities, Adaptation &amp; Aging , 12 (1-2), 43-57. https://doi. org/10.1300/J016v12n01\\_04\nKatan, J. (1991). Democratic processes in old age homes: Supporting and hindering factors. Journal of Gerontological Social Work , 17 (1-2), 163-181. https://doi.org/10.1300/J083v17n01\\_13\nKeefe, J. M., Taylor, D., Irwin, P., Hande, M. J., &amp; Hubley, E. (2024). Do residential long-term care policies support family involvement in residents' quality of life in four Canadian provinces? Journal of Aging &amp; Social Policy , 36 (1), 43-68. https://doi.org/10.1080/08959420.2022.2138066.\nKirkham, J., Keng, A., Conn, D., Benjamin, S., Seitz, D., Rivard, M.-F., Martinussen , B., Grief, C., Checkland, C., &amp; Rabiner, K. (2024). Timely Yet Long Overdue: Canadian Standards for Long-Term Care Homes. Canadian Geriatrics Journal , 27 (1), 76-79. https://doi.org/10.5770/cgj.27.706\nLee, C., Tripp, D., McVie, M., Fineczko, J., Ramsden, G., Hothi, S., Langston, J., Gilhuly, J., Collingwood, B., McAiney, C., McGilton, K. S., &amp; Bethell, J. (2024). Empowering Ontario's long-term care residents to shape the place they call home: A codesign protocol. BMJ Open , 14 (2), e077791. https://doi. org/10.1136/bmjopen-2023-077791", "doc_items_refs": ["#/texts/186", "#/texts/187", "#/texts/188", "#/texts/189", "#/texts/190"], "page_nos": [1], "uuid": "2aebf188-06e6-43f4-8f2e-87cc54f0c4de"}
{"doc_id": "2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552.doctags", "chunk_id": 42, "source_chunk_idxs": [52], "num_tokens": 388, "text": "References\nLeedahl, S. N., Sellon, A. M., &amp; Gallopyn, N. (2017). Factors predicting civic engagement among older adult nursing home residents. Activities, Adaptation &amp; Aging , 41 (3), 197-219. https://doi.org/10.1080/01924788.2017.1310581\nLevac, D., Colquhoun, H., &amp; O'Brien, K. K. (2010). Scoping studies: Advancing the methodology. Implementation Science , 5 (1), 69. https://doi.org/ 10.1186/1748-5908-5-69\nLynch, B., Ryan, A. A., O'Neill, M., &amp; Penney, S. (2022). The factors that influence care home residents' and families' engagement with decisionmaking about their care and support: An integrative review of the literature. BMC Geriatrics , 22 , 873. https://doi.org/10.1186/s12877-022-03503-8\nMader, L. B., Harris, T., Kläger, S., Wilkinson, I. B., &amp; Hiemstra, T. F. (2018). Inverting the patient involvement paradigm: Defining patient led research. Research Involvement and Engagement , 4 (1), 21. https://doi.org/10.1186/ s40900-018-0104-4\nMoving Forward Coalition. (2024). A guide to strengthening resident councils . Moving Forward Nursing Home Quality Coalition. https:// nursinghomeactionguides.org/strengthening-resident-councils/", "doc_items_refs": ["#/texts/193", "#/texts/194", "#/texts/195", "#/texts/196", "#/texts/197"], "page_nos": [1], "uuid": "311f3639-571d-44c8-9ad9-a035813dfe86"}
{"doc_id": "2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552.doctags", "chunk_id": 43, "source_chunk_idxs": [53], "num_tokens": 503, "text": "References\nMunce, S. E., Gray, C. S., Pomeroy, B. C., Bayley, M., Kokorelias, K. M., Luong, D., Biddiss, E., Cave, T., Braga, P., Chew-Graham, C. A., Colquhoun, H., Dadich, A., Dainty, K. N., Elliott, M., Feng, P., Goldhar, J., Hamilton, C. B., Harvey, G., Kastner, M., . . . Kuluski, K. (2023). Development of the preferred components for co-Design in Research Guideline and Checklist: Protocol for a scoping review and a modified Delphi process. JMIR Research Protocols , 12 (1), e50463. https://doi.org/10.2196/50463\nNg, R., Lane, N., Tanuseputro, P., Mojaverian, N., Talarico, R., Wodchis, W. P., Bronskill, S. E., &amp; Hsu, A. T. (2020). Increasing complexity of new nursing home residents in Ontario, Canada: A serial cross-sectional study. Journal of the American Geriatrics Society , 68 (6), 1293-1300. https://doi.org/10.1111/ jgs.16394\nOntario Association of Residents' Councils. (2012). Supporting your home's residents' council: A resource guide for residents' council leadership teams, residents' council assistants and administrators . Ontario Association of Residents' Councils. https://www.ontarc.com/documents/ResourceGuide/ 2023RG\\_Complete.pdf\nOntario Long Term Care Association. (n.d.). About Long-Term Care. [Webpage]. https://www.oltca.com/about-long-term-care/\nParmar, J., Babiuk, J.-A., Classen, K., Hurst, J., Haq, A., &amp; Sacrey, L.-A. R. (2019). Establishing effective resident and family councils: A pilot project to increase", "doc_items_refs": ["#/texts/198", "#/texts/199", "#/texts/200", "#/texts/201", "#/texts/202"], "page_nos": [1], "uuid": "3e2b798c-3b96-461b-9f54-242599fe9994"}
{"doc_id": "2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552.doctags", "chunk_id": 44, "source_chunk_idxs": [54], "num_tokens": 421, "text": "References\nfamily and resident engagement in Alberta's continuing care sites. Healthcare Quarterly (Toronto, Ont.), 22 (2), 47-52. https://doi.org/10.12927/hcq.2 019.25905\nPerez, F. P., Perez, C. A., &amp; Chumbiaucia, M. N. (2022). Insights into the social determinants of health in older adults. Journal of Biomedical Science and Engineering , 15 (11), 261-268. https://doi.org/10.4236/ jbise.2022.1511023\nRijnaard, M. D., van Hoof, J., Janssen, B. M., Verbeek, H., Pocornie, W., Eijkelenboom, A., Beerens, H. C., Molony, S. L., &amp; Wouters, E. J. M. (2016). The factors influencing the sense of home in nursing homes: A systematic review from the perspective of residents. Journal of Aging Research , 2016 (1), 6143645. https://doi.org/10.1155/2016/6143645\nScotch, R. K. (2009). Nothing about us without us\": Disability rights in America. OAH Magazine of History , 23 (3), 17-22. https://doi.org/10.1093/maghls/ 23.3.17\nShura, R., Siders, R. A., &amp; Dannefer, D. (2011). Culture change in long-term care: Participator action research and the role of the resident. The Gerontologist , 51 (2), 212-225. https://doi.org/10.1093/geront/gnq099", "doc_items_refs": ["#/texts/203", "#/texts/204", "#/texts/205", "#/texts/206", "#/texts/207"], "page_nos": [1], "uuid": "d7cb9aa7-a32f-47f8-b294-4f7cfe0f4ea3"}
{"doc_id": "2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Listened_to_but_Rarely_Heard_A_Scoping_Review_of_Resident_Engagement_in_the_Orga__W4414866552.doctags", "chunk_id": 45, "source_chunk_idxs": [55], "num_tokens": 450, "text": "References\nStaempfiL, S., Havaei, F., Dawson, L., Novek, S., Slater, K., Kaulius, M., &amp; Ahmed, A. (2025). Raise your voice: How to increase the effectiveness of resident and family councils in long-term care homes. Canadian Journal on Aging/La Revue Canadienne Du Vieillanceissement , 1-10. https://doi.org/10.1017/ S0714980825000029\nTak, S. H., Kedia, S., Tongumpun, T. M., &amp; Hong, S. H. (2014). Activity engagement: Perspectives from nursing home residents with dementia. Educational Gerontology , 41 (3), 182-192. https://doi.org/10.1080/036012 77.2014.937217\nTricco, A. C., Lillie, E., Zarin, W., O'Brien, K. K., Colquhoun, H., Levac, D., Moher, D., Peters, M. D. J., Horsley, T., Weeks, L., Hempel, S., Akl, E. A., Chang, C., McGowan, J., Stewart, L., Hartling, L., Aldcroft, A., Wilson, M. G., Garritty, C., ... Strauss, S. E. (2018). PRISM extension for scoping reviews (PRISMA-SCr): Checklist and explanation. Annals of Internal Medicine , 169 (7), 467-473. https://doi.org/10.7326/M118-0850\nWagner, J. A. (2008). Nursing home resident councils: Development of an instrument to evaluate their effectiveness . University of WisconsinMadison.\nWorld Health Organization. (2017). Global strategy and action plan on ageing and health . World Health Organization.", "doc_items_refs": ["#/texts/208", "#/texts/209", "#/texts/210", "#/texts/211", "#/texts/212"], "page_nos": [1], "uuid": "1846608f-c71a-45a1-baad-82dc506cdba1"}
