{"doc_id": "2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538.doctags", "chunk_id": 0, "source_chunk_idxs": [0, 1], "num_tokens": 312, "text": "&lt;!-- image --&gt;\n&lt;!-- image --&gt;\n\nOPEN ACCESS\nEDITED BY\nChristopher S. Y. Benwell,\nUniversity of Dundee, United Kingdom\nREVIEWED BY\nNicco Reggente, Institute for Advanced Consciousness Studies, United States Ronald P. M. H. Lay,\nLASALLE College of the Arts, Singapore\n*CORRESPONDENCE\nAndrea Calderone\nandrea.calderone95@gmail.com\nRECEIVED 03 July 2025\nACCEPTED 24 September 2025\nPUBLISHED 09 October 2025\nCITATION\nCalderone A, De Luca R, Calapai R, Mirabile A, Quartarone A and Calabrø RS (2025) Beauty in the shadow of neurodegenerative disease: a narrative review on aesthetic experience, neural mechanisms, and therapeutic frontiers. Front. Hum. Neurosci. 19:1658617. doi: 10.3389/fnhum.2025.1658617\nCOPYRIGHT\n© 2025 Calderone, De Luca, Calapai, Mirabile, Quartarone and Calabrø. This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms.", "doc_items_refs": ["#/pictures/0", "#/pictures/1", "#/texts/1", "#/texts/2", "#/texts/3", "#/texts/4", "#/texts/5", "#/texts/6", "#/texts/7", "#/texts/8", "#/texts/9", "#/texts/10", "#/texts/11", "#/texts/12", "#/texts/13", "#/texts/14", "#/texts/15", "#/texts/16"], "page_nos": [1], "uuid": "6e7eb289-63a6-424b-8071-77ebb05673a7"}
{"doc_id": "2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538.doctags", "chunk_id": 1, "source_chunk_idxs": [2], "num_tokens": 406, "text": "Beauty in the shadow of neurodegenerative disease: a narrative review on aesthetic experience, neural mechanisms, and therapeutic frontiers\nAndrea Calderone*, Rosaria De Luca, Rosalia Calapai, Alessio Mirabile, Angelo Quartarone and Rocco Salvatore Calabrø\nIRCCS Centro Neurolesi Bonino Pulejo, Messina, Italy\nNeuroaesthetics, an emerging field at the intersection of neuroscience, psychology, and the arts, offers new perspectives on the biological and cognitive mechanisms of aesthetic experience. This narrative review explores the convergence of neuroaesthetics and neurodegenerative disorders, focusing on Alzheimer's disease, Parkinson's disease, frontotemporal dementia, and Huntington's disease. Drawing on evidence from neuroimaging, neuropsychology, and clinical studies, we examine how neurodegenerative processes differentially disrupt the neural systems of the \"aesthetic triad\": sensory-motor, emotion-valuation, and meaning-knowledge. Such disruptions not only impair patients' ability to perceive and create art but may also reveal unexpected creative capacities. We discuss the therapeutic potential of arts-based interventions, highlighting the benefits of personalized and technologypriven approaches, including immersive virtual reality and digital art platforms, to enhance neurorehabilitation and psychological wellbeing. The \"Michelangelo effect,\" where engagement in meaningful aesthetic activities supports learning, motivation, and resilience, exemplifies this translational potential. Our synthesis underscores clinical, neuroscientific, and rehabilitative implications, while noting ongoing challenges such as the need for standardized outcomes and interdisciplinary collaboration. Integrating neuroaesthetic principles into neurorehabilitation may help preserve cognitive and motor functions and enrich quality of life and selfconcept in people with neurodegenerative disease. Future research should optimize these approaches to ensure meaningful benefits for patients.", "doc_items_refs": ["#/texts/21", "#/texts/22", "#/texts/23"], "page_nos": [1], "uuid": "68c00038-ec90-45dd-976d-c28ec1563bc8"}
{"doc_id": "2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538.doctags", "chunk_id": 2, "source_chunk_idxs": [3, 4], "num_tokens": 160, "text": "KEYWORDS\nneuroaesthetics, neurodegenerative diseases, Alzheimer's disease, Parkinson's disease, frontotemporal dementia, Huntington's disease, aesthetic experience, neurorehabilitation\n\n1 Introduction\nAesthetic experience, how organisms register, evaluate, and imbue patterned stimuli with significance, arises from entwined biological computations and socio-cultural practices rather than a single, universal essence of \"beauty.\" In this review, we adopt a plural and reflexive stance: we consider \"beauty\" a family of experiences shaped by bodies, histories, and contexts, even as we examine shared neural mechanisms with translational relevance for neurodegenerative disease (Chatterjee and Vartanian, 2014; Leder and Nadal, 2014; Masuda", "doc_items_refs": ["#/texts/25", "#/texts/27"], "page_nos": [1], "uuid": "4ada5907-e75d-478e-a6ec-d0bfa9d67927"}
{"doc_id": "2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538.doctags", "chunk_id": 3, "source_chunk_idxs": [5], "num_tokens": 473, "text": "1 Introduction\net al., 2008). By aligning mechanistic models of prediction, valuation, and meaning with sociocultural diversity, we set the stage for a clinically oriented account of how aesthetic engagement can be leveraged in vulnerable brains. We write from a clinicalneuroscience perspective and do not presume a single global definition of art or beauty; where possible, we triangulate mechanistic accounts with cross-cultural evidence and make our assumptions explicit. This desire to create, experience, and respond to beauty is not simply cultural or symbolic; it is biologically rooted and influences how we think, feel, and behave toward one another (Kim and Lee, 2018). In recent decades, a completely new field of science, called neuroaesthetics, has emerged to address these very questions: What happens in the brain when we experience beauty? What insights can we gain by applying our knowledge to some of the most human health problems? Neuroaesthetics, situated at the intersection of neuroscience, psychology, and the arts, examines how perceivers transform patterned sensory inputs into affectively valued, contextually meaningful experiences across modalities (Magsamen, 2019). It aims to chart the intricate pathways through which sensory input becomes beauty and how, say, art or music and other forms of expression captivate cognitive, emotional, and reward systems in the brain (Cinzia and Vittorio, 2009). Using state-of-the-art technology, including functional magnetic resonance imaging (fMRI), electroencephalography (EEG), and eye tracking, scientists are now unraveling the neural pathways that subtend the appreciation of visual art, music, and literature (Arioli et al., 2025). Converging evidence now couples ' neuroimaging with psychophysiology during art-making itself (e.g., cortisol reduction after visual art-making, EEG alpha changes post-drawing, and HRV modulation across materials), strengthening causal interpretations about reward, regulation, and meaning-making (Kaimal et al., 2016; Belkofer et al., 2014; HaiblumItskovitch et al., 2018).\nThe \" aesthetic triad \" model offers an attractive conceptualization suggesting that the experience of aesthetics", "doc_items_refs": ["#/texts/30", "#/texts/31"], "page_nos": [1], "uuid": "cd82bc11-3c59-4562-b83d-af8c8972a15e"}
{"doc_id": "2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538.doctags", "chunk_id": 4, "source_chunk_idxs": [6], "num_tokens": 452, "text": "1 Introduction\nresults from the interplay between three principal neural systems: the sensory-motor system, the emotion-valuation system, and the meaning-knowledge system (Hendriks I. et al., 2019). Complementary appraisal frameworks emphasize multi-stage processing and expectation, underscoring that aesthetic responses are co-constructed by perceivers and contexts rather than fixed properties of stimuli (Chatterjee and Vartanian, 2014; Leder and Nadal, 2014). These mechanisms not only process the physical features of art (symmetry, color, motion) but also assign an emotional value to these feelings, as well as contextual (personal, cultural) meaning (Bara et al., 2022). However, aesthetic experience is by no means a homogenous process. Individual differences abound, shaped by genetic, developmental, cultural, and contextual factors (Germine et al., 2015). Cross-cultural studies show reliable differences in attention and preference, for instance, more contextinclusion in East Asian image composition versus object-focused composition in many Western traditions, highlighting the risk of universalizing any single canon (Masuda et al., 2008; Bodurogl et al., 2009). At the same time, neuroimaging demonstrates that personally meaningful aesthetic appeal recruits ' association networks beyond modality-specific cortices, suggesting a shared biological vocabulary onto which diverse traditions map (Vessel et al., 2019; Bao et al., 2016). Figure 1 illustrates the aesthetic triad (sensory-motor, emotion-valuation, and meaning-knowledge systems) and highlights their cross-links during aesthetic appraisal. Expertise, but also familiarity and even information on the provenance of an artwork, can shape our emotional and neural responses, thus revealing the intricate relationship between subjective appraisal and shared underlying neural systems (Else et al., 2015; Vartanian and Kaufman, 2013). If aesthetic experience is plural and context-shaped yet biologically instantiated, it raises an additional clinical question: what happens when disease limits the capacity of the brain to sense, assign value to, and act upon beauty?\n&lt;!-- image --&gt;", "doc_items_refs": ["#/texts/32", "#/pictures/2"], "page_nos": [1], "uuid": "56943cdf-4906-42b0-a436-1d8a646b8e0f"}
{"doc_id": "2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538.doctags", "chunk_id": 5, "source_chunk_idxs": [7], "num_tokens": 405, "text": "1 Introduction\nNeurodegenerative diseases, including Alzheimer's disease (AD), Parkinson's disease (PD), frontotemporal dementia (FTD), and Huntington's disease (HD), are some of the deadliest, fastestspreading, and most prevalent conditions of our age, stealing memory, movement, language, and, ultimately, self. With an aging world population, these are a growing challenge to healthcare, families, and society (Wilson et al., 2023; Kouli et al., 2018; Ulugut and Pijnenburg, 2023; Gadhave et al., 2024; Tesco and Lomoio, 2022; Erkkinen et al., 2018a). The meeting of neuroaesthetics and neurodegenerative disease is a frontier, scientifically and clinically. It encourages us to wonder not only what is lost to disease, but also what might be retained, or even paradoxically amplified. Curiously, some people with frontotemporal dementia experience a surge of creative energy and create labors of uncommon emotional intensity and depth (Shdo et al., 2022). In still other cases, artists with AD or having suffered from a stroke exhibit a change in style, less intricate or more abstract, or a new form of expression, mirroring the plasticity of the artistic mind in the shadow of neural decline (Holmbom Larsen and Lodos, 2024; Petcu et al., 2016). Clinically, the therapeutic value of the arts-based intervention is increasingly acknowledged for mobilizing cognitive, emotional, and social profiles of patients living with dementia (Emblad and Mukaetaovladinska, 2021). Now music therapy, dance, visual art, and even museum visits are being formally prescribed by doctors for a range of patient needs, including for conditions that are known to be on the decline (Schneider, 2018).", "doc_items_refs": ["#/texts/37"], "page_nos": [1], "uuid": "06378e8e-eed0-4305-ae90-0ae9ef416e45"}
{"doc_id": "2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538.doctags", "chunk_id": 6, "source_chunk_idxs": [8], "num_tokens": 434, "text": "1 Introduction\nWithin this context, the aim of this narrative review is to systematically chart the research on where the fields of neuroaesthetics and neurodegenerative diseases intersect. We aim to elucidate the critical themes and methodological insights that are still in high demand in this realm. To avoid cultural essentialism, we interpret empirical findings through multi-stage appraisal models and cross-cultural evidence that locate aesthetic responses at the intersection of sensory prediction, valuation, and learned meaning. Embarking on this journey, we are aware that neuroaesthetics is a relatively young field and it still has to face several conceptual and methodological challenges. Yet the deep human hunger for beauty, for meaning, and for relationships endures, despite the crumbling of the neurological structures that sustain them. By bridging the worlds of neuroscience, art, and clinical practice, we hope to pave the way for new pathways for research and care. In framing this bridge, we also consider peak aesthetic experiences, commonly reported as chills or frisson, not as epiphenomenal \"gobosehumps,\" but as temporally precise neuromodulatory events that bind reward, attention, and meaning-making and can be purposefully harnessed in vulnerable brains. In what follows, we treat chills as testable mechanisms, rather than metaphors, linking the aesthetic triad to clinically relevant outcomes through measurable changes in learning signals, motivation, and memory consolidation (Schoeller and Perlovsky, 2016; Schoeller et al., 2024). Finally, because aesthetic engagement is being mobilized for vulnerable populations, we explicitly surface issues of ethics, safety, risk, and potential harm. We treat these not as afterthoughts but as design constraints for responsible research and care, spanning consent (including process consent in dementia), privacy of biosignals, cybersickness and overstimulation risks in immersive settings, and equity of\naccess through culturally safe, person-centered protocols (Madary and Metzinger, 2016; Jensen et al., 2024).", "doc_items_refs": ["#/texts/38", "#/texts/42"], "page_nos": [1], "uuid": "a9566fed-9ed1-4c48-8e18-cc2f53e51d53"}
{"doc_id": "2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538.doctags", "chunk_id": 7, "source_chunk_idxs": [9], "num_tokens": 512, "text": "2 The neuroscientific roots of beauty and artistic perception\nSince its introduction by Semir Zeki in 1999, neuroaesthetics has enjoyed a flourishing period of research and development (Zeki et al., 2020; Glennon and Zeki, 2022). Its roots go back much further. At the turn of the last century, 19th-century insight into evolutionary biology and psychology can be traced in particular to Charles Darwin, Gustav Fechner, and Wilhelm Wundt. Starting with the work of these three scholars, constituents for sensory perception and the aesthetic responses it evokes begin to be placed upon a firmer foundation in knowledge; their conceptual breakthroughs spell out how deeply woven into our very nature as an animal (Brattico et al., 2025). At its core, neuroaesthetics aims to untangle the biological underpinnings and neural circuitry that go into the enigmatic and sometimes profoundly personal experience of beauty. The parallelism hypothesis of Zeki, which proposes an inherent similarity between artistic creativity and cerebral organization, is a central theme in this search. Both the artists and the brain, Zeki claims, simplify and stress fundamental visual characteristics in a way that cuts through the innumerable possibilities of visual images, drawing attention to a common underlying urge to understand the visual world (Clarke et al., 2013; Pepperell, 2011; Di Dio et al., 2007; Zeki, 2019). This notion has been the basis of much empirical work in the field of artistic creation and perception, loosing quite radically the separation between art and neuroscience. Methodologically, the growth of neuroaesthetics has coincided with the use of advanced neuroscientific instruments such as fMRI and EEG, which have thus far provided researchers with a unique insight into how aesthetic perceptual experiences engage various parts of the brain (Skov, 2019; Vartanian and Goel, 2004). Especially, a developing literature of metaanalyses converges on the notion of visual aesthetic experience as being subserved by a widespread bilateral neural network, encompassing early occultal visual areas, the ventral visual stream, the fusiform face area, the parahippocampal place area, and the fusiform body area, as well as limbic structures including the amygdala and insula (Jensen et al., 2024). Consistent with this, personally meaningful aesthetic episodes engage default-mode and valuation networks beyond", "doc_items_refs": ["#/texts/44"], "page_nos": [1], "uuid": "7de6c084-f220-4bef-9671-87195785cc66"}
{"doc_id": "2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538.doctags", "chunk_id": 8, "source_chunk_idxs": [10], "num_tokens": 477, "text": "2 The neuroscientific roots of beauty and artistic perception\nlow-level feature detectors, linking appraisal to autobiographical processing (Pelowski et al., 2017). These regions can be differentially engaged with different types of art content (e.g., faces, landscapes, abstract shapes), suggesting that the brain response to art is finely specific to content.\nIn addition to visual processing, more abstract emotional and cognitive evaluations of beauty involve the medial orbitofrontal cortex, anterior cingulate cortex, and ventral striatum (Boccia et al., 2016). These areas are involved in the reward circuit of the brain and are frequently associated with affective valuation and hedonic pleasure (Rolls, 2023a). Importantly, the orbitofrontal cortex transforms perceptual input and affectively modulates the subjective assessment of beauty, with the release of neurotransmitters, including dopamine in the striatum, being the neuronal correlate of intrinsic reward associated with beauty experiences (Schultz, 2015; Rolls et al., 2020). It is this biochemical substrate that mirrors the one shared by all\nreward-stimulating behaviors, including those related to eating (Rolls, 2023b) and social bonding, indicating that to experience beauty is not a luxury but an essential aspect of our cognitive functions related to motivation, learning, and memory (Kringelbach, 2005). Beyond this anatomical mapping, peak aesthetic pleasure unfolds dynamically over time: anticipation recruits dorsal striatal circuitry, whereas consummation engages ventral striatum, aligning aesthetic experience with separable phases of dopaminergic signaling (Blood and Zatorre, 2001). Contemporary models therefore interpret chills as moments of precision-weighted prediction error within hierarchical generative models of music and vision, a computation that tags salient patterns and meanings for prioritized encoding and subsequent approach behavior (Schoeller et al., 2024). This time-resolved perspective naturally embeds the triad's meaning-knowledge system: when a motif returns, a harmonic tension resolves, or a narrative reframes, the co-occurrence of insight and reward is not incidental but mechanistically coupled (Schoeller and Perlovsky, 2016).", "doc_items_refs": ["#/texts/44", "#/texts/45", "#/texts/48"], "page_nos": [1], "uuid": "c5ec43b0-9943-4b5f-942b-07b7738d627e"}
{"doc_id": "2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538.doctags", "chunk_id": 9, "source_chunk_idxs": [11], "num_tokens": 489, "text": "2.1 The biological basis of aesthetic preference: symmetry and evolution\nResearch on the human brain's sensitivity to symmetry, proportionality, and regularity in visual inputs lends credence to the notion that perception and evaluation are linked because symmetry and proportionality cannot be observed before being evaluated (Keefe et al., 2018). While probabilistic preferences for symmetry and proportionality are widely observed, their expression is shaped by cultural learning, genre conventions, and task context; claims of universality are therefore hypotheses to be tested against cross-cultural data. Not only do humans like symmetry in visual stimuli, but non-human primates also prefer such stimuli, implying that a mechanism for detecting and appreciating visual harmony has survived evolution (Sasaki et al., 2005; Little and Griffey, 2020). Crosscultural and evolutionary psychology research has shown that the preference for specific face and body traits is universal across the human race, implying that aesthetic preference is, to some extent, biologically derived (Little et al., 2011; Fiala et al., 2021). Beyond that, neuroimaging has also found that the insular cortex and anterior cingulate cortex get turned on during moments of particularly strong aesthetic experience, particularly when art provokes deep personal emotional responses (Morita et al., 2014). These areas are involved not only in reward but also in emotion awareness and interoceptive states, highlighting the dual nature of the aesthetic experience as an interoceptive and sensory phenomenon (Brown et al., 2011). Curiously, these networks are more active in people with greater openness to experience or training in the arts, implying a level of plasticity in how the brain attends to beauty (Medford and Critchley, 2010). Recent findings suggest that aesthetic pleasure can also benefit memory and learning, potentially due to its recruiting of attention and emotional arousal, which promote the encoding and consolidation of visual information (Mansueto et al., 2025; Ponzio and Mather, 2014; Belfi et al., 2019).\nYet, this emerging research is not free from conceptual and methodological difficulties. Some have worried about the potential for reductionism, for instance, to reduce complex, culturally embedded experiences with art to just another kind of neural activation or preference rating (Bilsky, 2017). Indeed, because as immensely helpful", "doc_items_refs": ["#/texts/50", "#/texts/51"], "page_nos": [1], "uuid": "115f0e94-bad2-4b2d-878e-bb58e0dd167b"}
{"doc_id": "2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538.doctags", "chunk_id": 10, "source_chunk_idxs": [12], "num_tokens": 283, "text": "2.1 The biological basis of aesthetic preference: symmetry and evolution\nas the quantitative neuroaesthetic approaches are as indicators and as neural correlates, they should be part and parcel of a general and nuanced understanding of what we can call the contextual, symbolic, and subjective/cognitive dimensions of aesthetic experiences (Pearce et al., 2016). A central challenge for the field, as it continues to grow and evolve, will be to strike the balance between these two extremes, ensuring that the neurobiological perspective not only enriches other, variously informed views of the profound and multilayered nature of art but also enriches them in return. From this vantage, symmetry and proportionality do not merely please because they are regular; they scaffold the predictive models that allow meaningful surprise. Cadential delays, motif recurrences, or perspectival reveals work precisely because the brain has inferred structure and is primed to register precision-weighted violations, a sequence that culminates in chills and durable encoding (Schoeller et al., 2024; Blood and Zatorre, 2001). Methodologically, isolating chills requires convergent markers, time-locked self-report, piloerection sensors, electrodermal activity, and stimuli with controlled expectation profiles to distinguish peak aesthetic response from generic arousal.", "doc_items_refs": ["#/texts/55"], "page_nos": [1], "uuid": "f077d950-13c2-4013-ad57-80cbc8170659"}
{"doc_id": "2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538.doctags", "chunk_id": 11, "source_chunk_idxs": [13], "num_tokens": 495, "text": "3 Neurodegenerative disorders and aesthetic experience\nAs we push beyond the foundational landscape of neuroaesthetics into the lived experience of neurodegenerative disease, we face a paradox: the architectures of meaning within life itself, those that give us the ability to perceive beauty, to connect emotionally to art, and to make, are among the first to be compromised. To avoid overgeneralization, we explicitly distinguish disease-general mechanisms from syndrome-specific phenomena and note constraints introduced by sampling frames (e.g., clinic-based, Western-centric) and retrospective caregiver reports. We prioritize convergent evidence from neuroimaging, psychophysiology, and behavior, and we call for preregistered protocols with objective peak-response markers such as piloerection sensors and electrodermal activity to disambiguate specific aesthetic mechanisms from generic arousal (Wassiliwizky et al., 2015; Grewe et al., 2007; Salimpoor et al., 2011). These disorders, in which there is a gradual, selective neuronal decline and widespread propagation of pathology in vulnerable networks, provide a special window upon the most fundamental aspects of human experience (Crutch et al., 2001; Dugger and Dickson, 2017). Clinical syndromes of neurodegenerative diseases, for which their characteristic approaches are developing, are unique representations of points of convergence between impaired long-range networks, emotional responses, and expertise needed to perceive creativity and beauty (Brattico and Varankaitė, 2019). Delving into the study of aesthetic experience in the context of neurodegeneration is more than an academic curiosity; it presents an ideal setting for explaining the distributed facilities and integrative dynamics of aesthetic networks in the brain (Alluri et al., 2012). Each condition, whether AD, PD, frontotemporal dementia, or Huntington's, is a clinical condition that selectively sabotages neural systems necessary for the perception, appreciation, and creation of art and beauty (Chaudhary et al., 2022). Yet, as pathology assays, the brain is not infrequently an open book of vulnerability and resilience: networks splinter, capacities are dissociated, and, in certain instances, novel capabilities arise (Dugger and Dickson, 2017).", "doc_items_refs": ["#/texts/57"], "page_nos": [1], "uuid": "9447f718-1bfc-4057-8d41-ae7c011597f9"}
{"doc_id": "2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538.doctags", "chunk_id": 12, "source_chunk_idxs": [14], "num_tokens": 202, "text": "3 Neurodegenerative disorders and aesthetic experience\nTo shed light on these dynamics, we now analyze the influence of the most frequent neurodegenerative diseases on art experience and art production. A cross-cutting theme helps organize this terrain: anhedonia, blunted reward sensitivity, emerges across AD, PD, FTD, and HD and frequently intertwines with late-life depressive syndromes that may foreshadow or accompany neurodegeneration. Conceptualizing aesthetic interventions as tools to restore hedonic tone aligns with evidence that chills recalibrate dopaminergic learning signals, mitigate maladaptive ruminative cognition, and increase approach motivation in depressed patients (Schoeller et al., 2024; Jain et al., 2025). This framing elevates arts-based care from supportive enrichment to mechanistically grounded neuromodulation with testable predictions for memory consolidation, effortful engagement, and mood.", "doc_items_refs": ["#/texts/60"], "page_nos": [1], "uuid": "c7fe0ede-e3a2-4d75-a2a9-ff39d582a75f"}
{"doc_id": "2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538.doctags", "chunk_id": 13, "source_chunk_idxs": [15], "num_tokens": 512, "text": "3.1 Alzheimer ' s disease: the gradual dimming of aesthetic worlds\nAD, which has been acknowledged as a prototype of progressive cognitive impairment, also provides a striking example of loss of aesthetic experience. At the earliest stages, AD focuses on the medial temporal lobes, including the hippocampus and entorhinal cortex, before progressively spreading into the temporo-parietal association cortices and frontal lobes. These are, after all, the substrates on which memory, meaning, and affect are organized, central also to the aesthetic triad (Menon and Levitin, 2005). The aesthetic existence of patients with AD is clinically characterized by an insidious and gradual stripping away. Neuroimaging investigations indicate that when patients are exposed to art or music, they have reduced activation of the ventral visual stream and medial orbitofrontal cortex, as well as a reduction of subjective reports of pleasure and an impairment of their ability to make aesthetic judgments (Chaudhary et al., 2022; Menon and Levitin, 2005; Silveri et al., 2015). This appears not just as \" not liking art \" but as a fracturing of the capability to engage with artistic complexity. Indeed, patients ' responses tend to favor simplicity, formality, and familiar stimuli, compensating little for abstraction or novelty (Leder et al., 2004; Zaidel, 2015). Nonetheless, the emotional power of art can still be reached. A growing literature indicates that aspects of musical memory can remain relatively resilient in AD, particularly recognition of familiar melodies and affective responses to personally salient music, despite severe episodic memory deficits, supporting patient-tailored playlists and caregiver-led music engagement (Cuddy and Duffin, 2005; Jacobsen et al., 2015; Vanstone and Cuddy, 2010). In line with individualized music evidence, personalized listening reduces agitation more reliably than generic ' relaxation ' music, underscoring the need to calibrate familiarity, tempo, and arousal and to monitor for rare agitation spikes (Park and Pringle Specht, 2009; Belenchia, 2023; Gerdner, 2000). Through observational studies, some patients with early-stage AD can even be reached with music they once knew or even just familiar artwork (Cuddy and Duffin, 2005; Vanstone et al., 2009). Recent papers suggest that although a change in music experience is often reported by patients and", "doc_items_refs": ["#/texts/62"], "page_nos": [1], "uuid": "84f8ca38-26ea-4d53-97d5-4ab04a87c45f"}
{"doc_id": "2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538.doctags", "chunk_id": 14, "source_chunk_idxs": [16], "num_tokens": 506, "text": "3.1 Alzheimer ' s disease: the gradual dimming of aesthetic worlds\ncarers, music perception can be preserved for well-known music as well as more global effective response to music and known visual art in the early to mid-stages of the disease, despite widespread high-level cognitive deficits that prevent the spontaneous interpretation or analysis of complex artistic material ' s meaning\n(Arroyo-Anlló et al., 2019). For instance, quantitative data from behavioral and physiological research have supported the notion that, when they listen to personal music, patients with AD express similar affective reactions (e.g., artificial movements, vocalization, or physiological arousal) independently from the presence of verbal recall or recognition deficits (Cuddy et al., 2015; Baird and Samson, 2015; Vink et al., 2013; Särkämö et al., 2013).\nThe persistent central nervous system awakening response to the negative, noxious events accordingly highlights the relative independence of the cognitive from the emotional processing systems (McKhann et al., 2011). As AD progresses, there is a decrease in generative creativity. Art generated by formerly capable artists is diminished in complexity, nuance, and repetitiousness, which, respectively, are indicative of the loss of executive function and/or semantic memory (Formazzari, 2005; Miller, 2005). However, procedural memory, the memory for how one performs well-learned activities, can last unusually long, such that an annesiac can still play a familiar tune even if other abilities are lost (Cavaco et al., 2004). This dissociation highlights the hierarchical arrangement of artistic cognition. Set against this backdrop, selective vulnerability of ventral tegmental area (VTA) dopaminergic neurons in AD models suggests that deficits in reward prediction and motivational drive may emerge before widespread cortical failure (Krashia et al., 2022). Because chills engage VTA-strali plots and amplify precision-weighted prediction errors, familiar-but-surprising musical or visual sequences may transiently lift hedonic tone and enhance consolidation in mild stages, leveraging preserved affective and procedural channels while limiting cognitive load (Schoeller et al., 2024; Blood and Zatorre, 2001). Practically, this argues for session designs built around personalized playlists with graded tension-release and objective chill markers to titrate difficulty and prevent habituation.", "doc_items_refs": ["#/texts/62", "#/texts/66", "#/texts/67"], "page_nos": [1], "uuid": "78ffac53-c730-4f89-8db6-9df164aa0291"}
{"doc_id": "2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538.doctags", "chunk_id": 15, "source_chunk_idxs": [17], "num_tokens": 383, "text": "3.2 Parkinson ' s disease: the disruption of reward and the body ' s dialogue with art\nPD, a common neurodegenerative movement disorder, is not merely a physiological disorder. The essential pathology, degeneration of dopaminergic neurons in the substantia nigra with resulting depletion of dopamine from basal ganglia and interconnected frontostriatal circuits, not only affects movement control but also impairs motivation, hedonic tone, and emotional expressiveness (Kalia and Lang, 2015; Weintraub and Miamkonyan, 2019; Radad et al., 2023). Aesthetic participation in PD is thus doubly constrained. On one hand, motor symptoms interfere directly with the production of art: tremor, rigidity, and bradykinesia disrupt the flow of brush, bow, or pen (Thaut and Abiru, 2010; Bologna et al., 2016; Rios-Urrego et al., 2019). On the other hand, non-motor symptoms such as apathy and anhedonia sap the will to engage with beauty at all (Sipos-Lascu et al., 2021; Skorvanek et al., 2015). Neurophysiological studies indicate a muted response in the ventral striatum when individuals with PD are exposed to rewarding or aesthetically pleasing stimuli, a neural correlate of the diminished \" reward \" response to art (Martínez-Horta et al., 2014; Muhammed et al., 2016). However, the outlook is not entirely negative. Some patients who are treated for pharmacological restoration with dopaminergic tone, particularly dopamine agonists, have paradoxical episodes in which they find themselves flooded with creative energy, which they may manifest compulsively. Reports detail", "doc_items_refs": ["#/texts/69"], "page_nos": [1], "uuid": "e32d3ba3-bf58-49be-8ef2-8018d3dadc8b"}
{"doc_id": "2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538.doctags", "chunk_id": 16, "source_chunk_idxs": [18], "num_tokens": 378, "text": "3.2 Parkinson ' s disease: the disruption of reward and the body ' s dialogue with art\npeople who, after starting such medications, suddenly develop a newfound interest in an art form or start producing notably more work, sometimes to an obsessional degree (Marafioti et al., 2025; Lhommée et al., 2014; Schwingenschuh et al., 2010). While the condition, which researchers have dubbed \"dopaminergic artistic emergence,\" has been associated with the neurochemical pathways involved in impulse control disorders, it provides an extraordinary example of the fragile chemical tightrope that underpins the creative urge (Muhammed et al., 2016; Marafioti et al., 2025). Reviews document medication-associated surges in artistic output in a subset of patients, underscoring the narrow therapeutic window between restored motivation and impulse-control risk and the need for systematic monitoring in high-salience interventions (Inzelberg, 2013; Voon et al., 2011). On the phenomenological level, persons with PD commonly report a powerful, if not painful, experience of frustration and loss, as the vivid pictures or music that populate their minds fail to translate themselves faithfully into the gross extent of the motor domain (Gökçal et al., 2017). Many patients describe a continued internal world of artistic vision or music even as the body's ability to translate those visions into action was progressively eroded (Canesi et al., 2012). If there is a gap between internal creativity and external performance, emotional responses will span from anger to sadness and may result in creative responses such as moving from performance to appreciating passively or finding new alternative, less physically demanding vehicles to come to expression (Pee et al., 2025).", "doc_items_refs": ["#/texts/72"], "page_nos": [1], "uuid": "1be1ed95-4f36-472e-915d-5597a0459c3c"}
{"doc_id": "2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538.doctags", "chunk_id": 17, "source_chunk_idxs": [19, 20], "num_tokens": 401, "text": "3.2 Parkinson ' s disease: the disruption of reward and the body ' s dialogue with art\nFurthermore, our investigation is in line with others in that, in certain instances, motor deficiency is responsible for limiting creative output, but not beauty perception and emotion, when participants are exposed to familiar melodies, visual art, or poetry (Humphies et al., 2021; Lauring et al., 2019). The fact that the visual pleasure response persevered in the presence of physical limitations is evidence of the multi-level nature of the human brain, on which sensory, emotional, and cognitive networks are deeply entwined but can also at least partly function with great independence. Within this framework, peak aesthetic responses can be used to restore reward learning in sessions that explicitly manipulate expectancy, tempo ramps, rhythmic syncopations, and cadential delays, to drive dorsal-then-ventral striatal phases and counter ventral hyporesponsivity (Blood and Zatorre, 2001). Meta-analytic and clinical evidence confirms high rates of apathy and reward-learning alterations in PD, aligning with blunted ventral striatal responses to incentives and supporting mechanistic rationales for aesthetic protocols that manipulate expectancy and salience (den Brok et al., 2015). Converging evidence from anhedonic depression shows chills-evoked improvements in reward learning and approach motivation, motivating parallel protocols in PD with outcomes spanning apathy, effort-based decision-making, and computational learning metrics (Jain et al., 2025). Because dopaminergic therapy can lower thresholds for impulsive reward seeking, monitoring for impulse-control symptoms should be integrated when designing high-salience aesthetic sessions.\n\n3.3 Frontotemporal dementia: the unleashing and Unraveling of creative potential\nIn the field of the neuroscience of creativity and aesthetics, FTD, comprising a heterogeneous group of disorders involving the", "doc_items_refs": ["#/texts/73", "#/texts/75"], "page_nos": [1], "uuid": "b9b99f13-c1c0-4462-bc26-7fa5d0fbcb91"}
{"doc_id": "2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538.doctags", "chunk_id": 18, "source_chunk_idxs": [21], "num_tokens": 498, "text": "3.3 Frontotemporal dementia: the unleashing and Unraveling of creative potential\nfrontotemporal lobes bilaterally, profiles as one of the most fascinating clinical entities studied to date (Bang et al., 2015; Seeley et al., 2008). The clinical patterns, behavioral, semantic, and non-fluent aphasies, they disassemble separate components of the aesthetic brain (Rascovsky et al., 2011; Gorno-Tempini et al., 2011). Nowhere is the interrelationship between neural degeneration and creativity more starkly portrayed than in the phenomenon of paradoxical artistic emergence observed in behavioral FTD. Clinical observations and imaging work have characterized artistic behavior in FTD, often with right-hemisphere visuospatial disinhibition and prefrontal atrophy, yielding prolific yet affectively flattened output (Friedberg et al., 2023; Miller and Miller, 2013; Peet et al., 2021; Erkkinen et al., 2018b). Patients who had previously shown little or no interest in the arts can become so absorbed in painting, sculpture, music, and poetry that the artwork itself becomes obsessive, the images vivid or delicately detailed, or the composition compulsively repeated (Rankin et al., 2007). Functional imaging suggests an explanation in the form of disinhibition of posterior right-hemisphere visuospatial regions 'released' from the metaplastic control of the atrophic prefrontal cortex. These individuals may stand for hours before the easel with a mixture of creative and pathological compulsion (Ward et al., 2023; Agosta et al., 2012). Their work frequently is not coherent narratively but instead is more emotionally salient or visually complex, marking a move away from goal-oriented construction to a less conscious, more procedural, mode of expression (Antonioni et al., 2023). What caregivers and families often express, with some combination of awe and alarm, is this artistic transformation. And these accounts are evocative precisely because they capture the paradox of FTD, in which the degradation of frontal regulatory circuits unleashes new species of artistic behavior even as it impairs judgment and run-of-the-mill creativity (Miller et al., 1998; Carlsson et al., 2000).", "doc_items_refs": ["#/texts/79"], "page_nos": [1], "uuid": "9f552f99-1f0c-44eb-b23a-d55512f069e1"}
{"doc_id": "2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538.doctags", "chunk_id": 19, "source_chunk_idxs": [22], "num_tokens": 453, "text": "3.3 Frontotemporal dementia: the unleashing and Unraveling of creative potential\nNonetheless, it is important to point out that this is not a general observation in FTD. Especially the semantic variant, where conceptual knowledge is consistently eroded, distorts the texture of aesthetic experience. People with semantic dementia might begin to find it difficult to recognize familiar objects, faces, or the symbolic content in paintings or sculptures and subsequently disengage with narrative or contextual aspects of art that evoked personal significance (Snowden, 1999). This dissociation, formal exploration with diminished semantic appraisal, motivates stimulus sets that orthogonally manipulate content semantics and low-level structure to parse which components of peak aesthetic responses are preserved across FTD phenotypes (Rouse et al., 2024). What's more, their interaction with art is primarily concerned with its formal aspects (color, pattern, and texture) isolated from its more profound emotional or representational context. The works that ensued were sometimes successful for their technical brilliance but more often felt emotionally flat or repetitive, the divide between intellectual intent and affective response clearly visible (Drago et al., 2006). This change provides a striking example of the experiential and generative role of art, a product of the bedrock interaction between perceptual, cognitive, and affective networks. The extent to which damage to these networks can both lead to extraordinary bursts of creativity and the utter impoverishment of meaning in FTD indicates the subtle balance that underpins our unique ability to feel and form aesthetic experiences (Ilchovska et al., 2025). Because chills depend on the integration of prediction, violation, and meaning, behavioral-variant FTD may preserve sensory surprise yet distort narrative appraisal, whereas\nsemantic-variant presentations may blunt chills by severing symbolic links that imbue patterns with significance (Schoeller and Perlovsky, 2016). Future studies should pair content-manipulated stimuli with piloerection sensors to parse formal versus semantic contributions to peak responses and to explain why some FTD phenotypes show prolific output that is affectively \"flat.\"", "doc_items_refs": ["#/texts/80", "#/texts/83"], "page_nos": [1], "uuid": "75498ee0-3b79-4941-b73a-cd8e0e69859c"}
{"doc_id": "2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538.doctags", "chunk_id": 20, "source_chunk_idxs": [23], "num_tokens": 512, "text": "3.4 Huntington's disease: fractured rhythms of perception and pleasure\nHD, an autosomal-dominant neurodegenerative disease involving progressive degeneration of the striatum that eventually includes the cortex, offers a unique problem for the neural circuits that support aesthetic experience (Ross and Tabrizi, 2011; Novak and Tabrizi, 2010). The inexorable spread of HD-mediated neuronal death disrupts not only the sensory-motor networks that are required for artistic production but also the affective-appraisal networks that create emotional reactions to beauty and creativity (Kirkwood et al., 1999; Niccolini and Politis, 2014). Motor symptoms like chorea, dystonia, and severe incoordination can extremely affect the exercise of painting, music playing, or any other artistic expression (Schwartz et al., 2019). But the aesthetic consequences of HD are not limited to motor rendering; they penetrate deep into the patient's emotional, motivational landscape. Clinically, patients affected by HD often recall a slow reduction of their participation in creative activities and enjoyments. This disconnection is not just a consequence of the effects of physical disability on the mind, but all too frequently it expresses a deeper attrition of desire and pleasure in artistic participation (Atkins et al., 2024). This subjective finding is supported by functional neuroimaging that reveals lower activation of the ventral striatum and orbitofrontal cortex upon reward in patients compared to control subjects (Pardina-Torner et al., 2024; Eidelberg and Surmeier, 2011). These data share some clinical features with the core apathy and anhedonia symptoms (Atkins et al., 2024). Large-scale clinical and imaging synthesizes emphasize motivational syndromes as core features of HD and implicate striatal-orbitofrontal circuit compromise during reward processing, supporting short, personalized, high-salience aesthetic blocks with objective engagement markers (Ross et al., 2014; van Duijn et al., 2010). So while a patient does not lose the ability to perceive beauty in the world, in music, art, or nature, often the emotional response is lost that produces the sense of wonder or joy at having the privilege to experience it. On the cognitive front, the very executive deficits that define HD add yet another layer of complexity to life with aesthetics. Deficits in planning, organization, and", "doc_items_refs": ["#/texts/85"], "page_nos": [1], "uuid": "e7bca46e-58fa-41c0-b0c6-20c546627ae8"}
{"doc_id": "2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538.doctags", "chunk_id": 21, "source_chunk_idxs": [24], "num_tokens": 475, "text": "3.4 Huntington's disease: fractured rhythms of perception and pleasure\nabstraction could restrict understanding of the complexity of artistic creations, musical narratives, or symbolic content (Schwartz, 2010). This flattening or blunting, an inability to connect deeply to the sources of beauty, for many is one of the most distressing aspects of the disorder, not only because it means pleasure is lost, but also because it means a vital aspect of selfhood is gone (Atkins et al., 2024).\nMoreover, it is important to recognize that people living with HD may perceive and respond to art in many ways. In those who have strong family support and/or a good therapist, simply being around good music, pictures, and aesthetically friendly environments can be a kind of comfort. Such moments may be helpful to intentionally foster from a clinical and research perspective, for even the briefest and subtlest connections to a larger sense of personhood have the potential\nto support dignity and emotional wellbeing among those with HD (Schwartz et al., 2019). Given striatal degeneration, HD constitutes a stringent test for chills-based strategies: if expectancy-driven sequences still elicit phasic dopaminergic responses, transient gains in engagement and mood may be achievable; however, effects are likely smaller and more fatiguable than in PD/AD, warranting short, highly personalized blocks with objective chill detection and effort-based decision tasks to separate hedonic from motor effects. In light of striatal compromise and fatigue liability, short, personalized aesthetic blocks with embedded chill detection and adverse-event logging are advisable to separate hedonic from motor limits (Lundin et al., 2023; Simón-Vicente et al., 2024). These attempts illustrate the importance of 'person-centered' interventions that respect and encourage the remaining modes of expression and communication that may be present even as the disease progresses. For a better understanding of the topic Figure 2 maps the Aesthetic Triad onto syndrome-specific vulnerabilities in neurodegenerative disease (e.g., medial temporal/ valuation in AD; dorsal-ventral striatal phases in PD; semantic/ narrative integration in FTD; striatal-orbitofrontal reward in HD).", "doc_items_refs": ["#/texts/85", "#/texts/86", "#/texts/90"], "page_nos": [1], "uuid": "82dcd632-5a90-4944-bffd-99beb8ee5ac8"}
{"doc_id": "2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538.doctags", "chunk_id": 22, "source_chunk_idxs": [25], "num_tokens": 181, "text": "4 Painting new pathways: neuroaesthetic at the frontier of neurorehabilitation\nThe merging of neuroaesthetics and neurorehabilitation is changing how patients with neurodegenerative conditions such as AD, PD, and dementias are treated. Unlike traditional neurorehabilitation, which is generally focused on repetitive, sensory-motor training, the neuroaesthetic approach is based on the acknowledgment of the complexity of the relationship between sensory, emotional, cognitive,\nFigure caption: FIGURE 2\nCross-walk between triad components and syndrome-specific vulnerabilities (AD: medial temporal/valuation; PD: dorsal-ventral striatal phases; FTD: semantic/narrative integration; HD: striatalorbitofrontal reward) (cited at the end of the 3.4 paragraph).", "doc_items_refs": ["#/texts/92", "#/pictures/3", "#/texts/94"], "page_nos": [1], "uuid": "1d3ea6ce-91c4-4a32-9ac1-60d09b783322"}
{"doc_id": "2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538.doctags", "chunk_id": 23, "source_chunk_idxs": [26], "num_tokens": 512, "text": "4 Painting new pathways: neuroaesthetic at the frontier of neurorehabilitation\nand motor functions (Oliva et al., 2023). New frontiers in neuroaesthetics show that observing and producing art activate large networks in the brain related to reward, motivation, memory, and action planning (Nadal and Chatterjee, 2019; Welke et al., 2021). These findings offer potential suggestions on ways that the therapeutic properties of arts and beauty may be utilized to increase participation, optimize neuroplasticity, and protect the psychological wellbeing of those with progressive neurological disease. Importantly, the interventions have been developed to be personalized and scalable to diverse neurodegenerative populations; for example, using new technologies such as immersive virtual reality (VR) and digital art platforms (Vessel et al., 2012; Aldridge and Bethel, 2021; Fu et al., 2023). Converging evidence from public health and rehabilitation syntheses suggests that arts-based and music-based interventions can improve mood, engagement, and some functional outcomes across neurological conditions, while underscoring the need for standardized endpoints and equity-aware implementation (Fancourt and Finn, 2019). VR-enhanced rehabilitation shows small-to-moderate benefits for upper-limb function and activities of daily living in stroke when compared with dose-matched conventional therapy, supporting the scalability of immersive art protocols while motivating rigorous controls for novelty effects (Laver et al., 2017). These results are consistent with an increasing number of reports indicating that art-based or aesthetics-based interventions may prevent the progressive degradation of remaining cognitive-motor capacities in patients with PD and/or AD and can even ameliorate negative conditions (e.g., apathy and depression) often encountered in both disorders (Li Y. et al., 2024; Marco and Redolat, 2023). Positioning anedoma and its sequelae of apathy and effort aversion as a primary target clarifies why aesthetic protocols can outperform control activities: peak responses appear to deliver precision-weighted dopaminergic signals that support engagement, consolidation, and willingness to exert effort, rather than mere distraction (Schoeller et al., 2024). The authors present neuroaesthetics as an intriguing tool to be used in neurorehabilitation and possibly a fundamental component in the design of a new model", "doc_items_refs": ["#/texts/97"], "page_nos": [1], "uuid": "bdf76a2a-d954-40a8-bf8e-34488c3c22be"}
{"doc_id": "2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538.doctags", "chunk_id": 24, "source_chunk_idxs": [27], "num_tokens": 139, "text": "4 Painting new pathways: neuroaesthetic at the frontier of neurorehabilitation\nof care for such a disease, intended not only to maintain as much as possible the abilities in the more general sense but also to enrich meaning, self-concept, dignity, and quality of life as a whole. The Michelangelo effect is a great example of such a translational trajectory and the mediator of the new, neuroaesthetic-based rehabilitation strategies (Salera et al., 2024). In the next paragraph, we present the Michelangelo effect in its neurobiological context and demonstrate how this concept can be exploited from the perspective of motor and cognitive routines.", "doc_items_refs": ["#/texts/97"], "page_nos": [1], "uuid": "23c5181f-582f-4c05-b3eb-9bb8ade330f9"}
{"doc_id": "2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538.doctags", "chunk_id": 25, "source_chunk_idxs": [28], "num_tokens": 406, "text": "4.1 The Michelangelo effect: clinical applications of neuroaesthetics in neurorehabilitation\nThe \" Michelangelo effect \" refers to the fact that being involved in an aesthetically meaningful activity (such as making or observing art) positively influences skill learning and execution, motivation, and perception of effort (Iosa et al., 2022). Clinical findings, especially based on recent work conducted in stroke populations, emphasize the effectiveness of immersive virtual art therapy protocols based on neuroaesthetic guidelines. For example, De Giorgi et al. (2023), exemplify this strategy with a study where stroke patients engaged in\nvirtual art therapy (VAT), where patients were presented with environments that resembled the ones in which masterpieces of art were painted. Compared with an age-matched group who received standard rehabilitation only, the VAT group made significantly greater gains on upper extremity function, including both Barthel Index (a measure of independence in activities of daily living) and pinch strength (which doubled). Moreover, participants in the virtual art therapy group reported lower rates of muscle fatigue and greater engagement on therapy days, and quantitative findings supported the association between participation in therapy and functional outcomes (De Giorgi et al., 2023). This was supported by preliminary pilot studies (Iosa et al., 2022), suggesting that artistic stimuli presented in a virtual environment would improve not only the kinematics of movements but also the physical demand required by the patients and the task accuracy, as compared with control conditions. To strengthen causal inference, future \" Michelangelo \" protocols should incorporate preregistered control arms matched on therapist contact and task difficulty, physiological peak-response markers (e.g., pileroection, electrodermal activity), and blinded ratings of movement quality, thereby isolating aesthetic-specific mechanisms from generic attentional arousal (Wassiliwizky et al., 2015; Grewe et al., 2007).", "doc_items_refs": ["#/texts/99", "#/texts/103"], "page_nos": [1], "uuid": "31f78fc2-b80c-44e7-ac04-c2e16f9c8834"}
{"doc_id": "2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538.doctags", "chunk_id": 26, "source_chunk_idxs": [29], "num_tokens": 289, "text": "4.1 The Michelangelo effect: clinical applications of neuroaesthetics in neurorehabilitation\nIt is worth mentioning that the significance and emotional valence of the aesthetic stimulus seem to play an important role: patients operate with more involvement and better memory, more peacefulness, and less anxiousness when exposed to known or personally meaningful works of art (Kliem et al., 2022). This claim of the Michelangelo effect has been extended beyond painting or even 2D tasks to 3D digital sculpting tasks. Participants sculpting famous works, such as Michelangelo's David or the Venus de Milo, in VR showed lower jerk and more coordinated bimanual movements relative to those sculpting highly irregular non-artistic shapes, especially during first exposures (Pascucci et al., 2024). While total times for the completed sets of these teaching sculptures were greater, the experience of fatigue was not higher, indicating the role that beauty and aesthetic engagement can play in buffering declining effort over a longer or more challenging task (Iosa et al., 2022). Furthermore, relationships between performance, perceived beauty, and the enjoyment of the task indicate that the art-related motivational \" lift \" is driven by a combination of neural-sensory priming, emotional arousal, and cognitive involvement (Kirsch and Cross, 2018; Sturm et al., 2023).", "doc_items_refs": ["#/texts/104"], "page_nos": [1], "uuid": "529b0b04-1417-42da-8f45-9413e0467a64"}
{"doc_id": "2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538.doctags", "chunk_id": 27, "source_chunk_idxs": [30], "num_tokens": 403, "text": "4.1 The Michelangelo effect: clinical applications of neuroaesthetics in neurorehabilitation\nEvidence from immersive VR and virtual embodiment shows that body-ownership illusions and agency can modulate motivation and neurorehabilitative outcomes, providing a principled route to personalize aesthetic engagement and effort allocation (Slater and Sanchez-Vives, 2016; Buetler et al., 2022). At the mechanistic level, protocols can also be engineered to elicit chills by shaping expectancy, controlled repetition, harmonic tension, and motif return in order to engage dorsal-then-ventral striatal phases that support learning and pleasure (Blood and Zatorre, 2001). Personalization is now feasible: predictive models can estimate, from brief calibration and personlevel features, the probability of a peak response and adapt stimulus parameters in real time to maximize chills while maintaining safety and tolerability (Schoeller et al., 2024). Embedding objective chill markers (e.g., pileroection, electrodermal activity) and preregistered control conditions will help distinguish specific aesthetic mechanisms from novelty or generic arousal. Direct evidence of dopaminergic involvement in peak aesthetic pleasure, via striatal dopamine release\nFigure caption: FIGURE 3\nA circular pathway shows how aesthetic engagement (center-left) catalyzes three downstream effects, increased motivation (top-right; contributing to ↑ function), improved performance (bottom-right), and reduced fatigue (bottom-left). Peripheral icons indicate enabling domains (art, emotion, movement, brain) and the role of digital tools (e.g., VR/interactive media) as delivery amplifiers. Curved arrows depict feedback loops whereby motivational lift and performance gains further reinforce engagement over time, while lower perceived effort buffers fatigue during longer or more demanding tasks (cited at the end of the 4.1 paragraph).", "doc_items_refs": ["#/texts/105", "#/pictures/4", "#/texts/108"], "page_nos": [1], "uuid": "8b2ff5eb-1ade-458d-a955-8159e21506af"}
{"doc_id": "2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538.doctags", "chunk_id": 28, "source_chunk_idxs": [31], "num_tokens": 171, "text": "4.1 The Michelangelo effect: clinical applications of neuroaesthetics in neurorehabilitation\nduring music-evoked chills, supports phase-specific designs that leverage anticipation and tension-release to drive learning signals (Salimpoor et al., 2011). Figure 3 distills the Michelangelo effect: aesthetic engagement, delivered through art and digital tools, increases motivation (functional gains), improves performance, and reduces perceived fatigue via emotion-movement-brain loops. In conclusion, the Michelangelo effect reflects a most promising neural rehabilitation strategy with scientific and clinical relevance in neurorehabilitation. By incorporating aesthetic experience into a patient ' s personal therapeutic journey, clinicians may assist patients in addressing their composite needs, promoting neuroplastic facilitation of function and the experience of joy, dignity, and self.", "doc_items_refs": ["#/texts/109"], "page_nos": [1], "uuid": "872652ed-31c3-4f2c-827f-a9bd5461e2e8"}
{"doc_id": "2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538.doctags", "chunk_id": 29, "source_chunk_idxs": [32], "num_tokens": 354, "text": "4.2 Art therapy and technology: evidence, mechanisms, and practice implications\nA rapidly growing literature in art therapy documents psychophysiological benefits that are mechanistically aligned with our framework. In healthy and clinical populations, 45 -60 min of visual art-making is associated with significant reductions in salivary cortisol and self-reported stress (Kaimal et al., 2016). Quantitative EEG and meta-analytic syntheses indicate post-drawing shifts in alpha (and in some tasks beta) activity consistent with relaxed alertness and selfregulation (Belkofer et al., 2014). Extending beyond traditional media, a pilot mixed-methods program of virtual drawing reported improvements in affect, creative agency, and wellbeing, suggesting that immersive and multisensory parameters can be tuned to support motivation (Kaimal et al., 2020). Integrative reviews also chart the rapid uptake of digital tools by art therapists (synchronous online work, digital drawing, VR), including practice guidance around\ncompetencies, consent, and data governance (Zubala et al., 2021). Finally, museum-based ' social prescribing ' shows clinically relevant effects on mood and engagement in older adults, bolstering ecological models of cultural participation in care pathways (Thomson et al., 2018). Methodologically, future trials should pair art-making (physical or virtual) with convergent psychophysiology, pre-registered outcomes, and equitable access provisions (device fit, digital literacy) to isolate aesthetic-specific mechanisms from generic arousal (Haiblum-Itskovitch et al., 2018; Czamanski-Cohen and Weihs, 2016).", "doc_items_refs": ["#/texts/111", "#/texts/116"], "page_nos": [1], "uuid": "b3633b85-7b47-4434-88d4-0c1d004c077b"}
{"doc_id": "2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538.doctags", "chunk_id": 30, "source_chunk_idxs": [33], "num_tokens": 371, "text": "4.3 Ethics, safety, and risk in neuroaesthetic interventions\nEthical and safety considerations are integral to neuroaesthetic protocols. First, consent must be adapted to cognitive vulnerability: a process-consent approach emphasizes ongoing assent, capacity checks, and the right to pause/withdraw without penalty (Hendriks S. et al., 2019). Second, professional codes in art therapy provide concrete guardrails for beneficence, non-mafilecience, confidentiality, boundaries, and cultural humility when working with creative content and digital artifacts. Third, immersive technologies warrant explicit risk management. VR can induce cybersickness (nausea, disorientation, and visual discomfort); incidence varies with content and hardware, and protocols should incorporate screening, graduated exposure, rest breaks, seeded options, and device-level mitigations (Chang et al., 2020; Ng et al., 2025). Fourth, overstimulation and agitation can occur in a minority of people with dementia during group music/art; personalization and real-time observation reduce risk and support safe cessation when needed (Ridder et al., 2013; Pedersen et al., 2017). Fifth, biosignals used to detect peak responses (e.g., electrodermal activity, piloerection images) constitute sensitive health/biometric data; governance should align with privacy-bysdesign and emerging ' neurorights ' discussions addressing mental privacy and cognitive liberty (Ienca and Andorno, 2017). Finally, VR research should follow published ethical recommendations for minimizing harm and reporting adverse events (Madary and Metzinger, 2016). Collectively, these frameworks make explicit how dignity, autonomy, and safety remain primary outcomes alongside efficacy.", "doc_items_refs": ["#/texts/118"], "page_nos": [1], "uuid": "8539bf26-652a-483c-b6f6-3a12bcb0ea99"}
{"doc_id": "2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538.doctags", "chunk_id": 31, "source_chunk_idxs": [34], "num_tokens": 409, "text": "5 Future perspectives: neuroaesthetics, virtual art, and rehabilitation in the metaverse era\nThe combination of neuroaesthetics, immersive technologies, and clinical neurorehabilitation is anticipated to usher in a paradigm shift in the treatment of people with neurodegenerative and neurological disorders in the foreseeable future. So far, studies of the Michelangelo effect provide a good level of support for the idea itself, which can be read as aesthetic engagement in the form of making and/or viewing art having the potential to do more than simply lift subjective experiences of patients; it might effectively modulate key rehabilitative outcomes (Salera et al., 2024; Iosa et al., 2022; De Giorgi et al., 2023). The shift from traditional (often monotonous) rehabilitation to engaging, art-based digital environments give rise to new opportunities for improving not only the motor/cognitive abilities but\nalso the mood and motivation of patients. The beginning of VR and its natural growth path into the metaverse is an unprecedented opportunity to build deeply immersive, interactive, and personalizable therapeutic environments. Patients can then actively 'co-create' a masterpiece of painting or sculpture in these virtual worlds, as suggested by the study of virtual sculpting protocols in Pascucci et al. (2024), or take a stroll through galleries filled with art stimuli customized to their tastes and experiences. These kinds of environments can mediate between passive and active involvement at once, appreciating art and producing it from a base of embodied, sensorimotor embedding. It is not just a curiosity that exposure to aesthetically significant stimuli can modulate perception of fatigue, enhance bimanual smoothness and movement symmetry, and promote stronger engagement, even under demanding motor demands, it is a clinical opportunity that can be intentionally leveraged (Iosa et al., 2022; Pascucci et al., 2024).", "doc_items_refs": ["#/texts/120", "#/texts/123"], "page_nos": [1], "uuid": "5cc49d8d-5474-4a05-9ec8-5ad7461c6318"}
{"doc_id": "2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538.doctags", "chunk_id": 32, "source_chunk_idxs": [35], "num_tokens": 512, "text": "5 Future perspectives: neuroaesthetics, virtual art, and rehabilitation in the metaverse era\nIn the future, the most significant leap may well be in the potential for customization and telehealth. The metaverse is set to bring in telerehabilitation models under which patients and clinicians can gather, converse, and work together, irrespective of their real-world geography as demonstrated by the study of Calabrò and Morone (2025). This model offers the potential to increase reach, lower costs, and make the best use of therapists' time while maintaining the human connection that is at the core of good treatment. In addition, the possibility of individualized and immediate adaptation of difficulty level, as well as informative analytics, will support adaptive interventions that are more sensitive and tailored to single patients (Morone et al., 2025). Because aesthetic canons and attentional habits vary across cultures and lifewholes, content libraries and parametrization (e.g., motif familiarity, narrative framing, tempo envelopes) should be culturally co-designed to avoid imposing narrow taste regimes while maximizing personally meaningful peak responses (Francourt and Finn, 2019). Another exciting frontier to explore is that of virtual embodiment: the sensation of having and controlling a virtual body or avatar. Studies have shown that this sense of agency and ownership is not just of psychological interest but also a game-changer when it comes to selfperception, motivation, and even the response of neurons (Guy et al., 2023; Li Z. et al., 2024). Seeing virtual hands (or even whole bodies) as moving theirs do in real-time, or even assuming avatars modeled after iconic artists or individuals, often proves to be highly motivating and identity-related (Lougiakis et al., 2020). Embedding validated embodiment techniques, calibrated to patient tolerance and safety, can enhance identification and motivation but necessitates protocols for cyber-sickness screening and graduated exposure (Slater and SanchezVives, 2016). Looking ahead, closed-loop VR should also estimate the instantaneous probability of a chill and adapt predictability, semantic load, and motor challenge in real time, operationalizing precisionweighted learning for rehabilitation. Trials should stratify by anhedonia severity and by suspected prodromal depressive features to test preventative potential suggested by reductions in maladaptive cognition after chills (Schoeller", "doc_items_refs": ["#/texts/124"], "page_nos": [1], "uuid": "db662b4a-6121-4cc6-8076-859339276f1c"}
{"doc_id": "2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538.doctags", "chunk_id": 33, "source_chunk_idxs": [36], "num_tokens": 337, "text": "5 Future perspectives: neuroaesthetics, virtual art, and rehabilitation in the metaverse era\net al., 2024). Finally, because VTA compromise may arise early in AD, phase-specific deployment in preclinical and mild stages deserves priority, with endpoints extending beyond scales to everyday effortful behavior (Krashia et al., 2022).\nNonetheless, the human element cannot be ignored. With these technologies also comes the potential ability to restore not only function but also dignity, meaning, and quality of life as they develop. The arts have always provided a language of hope, expression, and\nconnection, therefore thoughtful incorporation of this into digital neurorehabilitation protocols could be a way to preserve and expand this legacy. The chance to continue creating, perceiving, and interacting with beauty, despite the gradual withering of other abilities, could provide benefits for those living with a progressive neurodegenerative disease that go well beyond what clinical scales can measure. However, there are still some conceptual and methodological challenges. It is important to go beyond novelty effects and to unequivocally differentiate the special contribution of aesthetic involvement, without mere sensory stimulation or technological innovation. Long-term studies will be necessary in order to document persistence of benefits, and parameters used to study patients will have to become standardized and clinically relevant for results to be reproducible and used by other workers. Interdisciplinarity, that is, the involvement of neuroscientists, clinicians, artists, engineers, and patients themselves, will be vital in co-designing interventions that are as meaningful as they are effective.", "doc_items_refs": ["#/texts/124", "#/texts/125", "#/texts/129"], "page_nos": [1], "uuid": "14c4151c-388e-4abb-a9a7-cb185981907f"}
{"doc_id": "2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538.doctags", "chunk_id": 34, "source_chunk_idxs": [37], "num_tokens": 330, "text": "6 Conclusion\nThe overlap of neuroaesthetics and clinical neuroscience provides an exciting avenue to enhance neurorehabilitation and patient management. What we have seen in the course of this review is that beauty engagement via art, music, or digital environment transcends mere diversion, tapping into neural circuits in support of cognition, motivation, and emotional wellbeing, even as these circuits decline with neurodegeneration. The emergent era of immersive technologies, such as VR and the metaverse, has created an unprecedented momentum for personalized, adaptive, and engaging therapeutic thematics that respect the individuality and creativity of patients. However, future advancement will rely on strong research, agreed-on outcomes, and interdisciplinary teamwork to make certain these interventions are not simply helpful but also accessible. The challenge ahead is to clarify which patients benefit most and to distinguish the unique contribution of aesthetic experience from general novelty or stimulation. The ultimate purpose of the inclusion of neuroaesthetic principles into neurorehabilitation is not only to support function but also to support the conservation of dignity and meaning in the individuals who live with neurological diseases. In closing, treating aesthetic chilies as targeted neuromodulatory events that recalibrate dopaminergic prediction and meaning-making reframes arts-based care from enrichment to mechanism-driven intervention, with crossdiagnostic implications for learning, motivation, and prevention. Through making beauty and creativity central to care, the profession will be able to contribute to shaping a world in which healing and wellbeing may become more holistic and more human-centered.", "doc_items_refs": ["#/texts/131"], "page_nos": [1], "uuid": "811b0d89-cd58-47e9-b691-2d7d357149d6"}
{"doc_id": "2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538.doctags", "chunk_id": 35, "source_chunk_idxs": [38, 39, 40, 41], "num_tokens": 235, "text": "Author contributions\nAC: Investigation, Writing - review &amp; editing, Writing - original draft, Conceptualization, Visualization, Data curation, Methodology. RL: Validation, Methodology, Writing - review &amp; editing, Supervision, Investigation, Writing - original draft. RosC: Writing - original draft, Data curation, Methodology, Validation, Resources, Visualization. AM: Visualization, Resources, Writing - review &amp; editing, Data curation, Investigation, Validation. AQ: Project administration, Writing - review &amp; editing, Funding acquisition, Supervision. RocC:\nResources, Funding acquisition, Supervision, Conceptualization, Project administration, Writing - review &amp; editing.\n\nFunding\nThe author(s) declare that financial support was received for the research and/or publication of this article. This study was supported by Current Research Funds 2025, Ministry of Health, Italy.\n\nConflict of interest\nThe authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest.\n\nGenerative AI statement\nThe authors declare that no Gen AI was used in the creation of this manuscript.", "doc_items_refs": ["#/texts/133", "#/texts/136", "#/texts/138", "#/texts/140", "#/texts/142"], "page_nos": [1], "uuid": "4147878c-ab28-4104-80d0-35f6cb9a286a"}
{"doc_id": "2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538.doctags", "chunk_id": 36, "source_chunk_idxs": [42], "num_tokens": 491, "text": "References\nAgosta, F., Canu, E., Sarro, L., Comi, G., and Filippi, M. (2012). Neuroimaging findings in frontotemporal lobar degeneration spectrum of disorders. Cortex 48, 389-413. doi: 10.1016/j.cortex.2011.04.012\nAldridge, A. and Bethel, C. (2021). A systematic review of the use of art in virtual reality. Electronics 10:23814. doi: 10.3390/electronics10182314\nAlluri, V., Toiviainen, P.a, Jääskeläinen, I. P., Glerean, E., Sams, M., and Brattico, E. (2012). Large-scale brain networks emerge from dynamic processing of musical timbre, and key rhythm. NeuroImage 59, 3677-3689. doi: 10.1016/j.neuroimage.2011.11.019\nAntioni, A, Raho, E. M., Plorior, P. A., Pace, P. A., Latino, R. R., Agossa, M., et al. (2023). Frontotemporal dementia, where we do not? A narrative review. Int. J. Mol. Sci. 24:11732. doi: 10.3390/ijms241411732\nArioli, M., Canessa, N., Gargiulo, A., Zardin, M., Falini, A., and Sanna, A. (2025). Combined MRI and eye-tracking evidence on the neural processing of visual ambiguity in photographic aesthetics. Sci. Rep. 15:12971. doi: 10.038/p41598-025-97945-w\nArroyo-Anlló, E. M., Dauphin, S., Fargeau, M. N., Ingrand, P., and Gil, R. (2019). Music and emotion in Alzheimer's disease. Alzheimer's Res. Ther. 11:69. doi: 10.1186/s13195-019-0523-y", "doc_items_refs": ["#/texts/144", "#/texts/145", "#/texts/146", "#/texts/147", "#/texts/148", "#/texts/149"], "page_nos": [1], "uuid": "2a118b37-f6b3-42c2-a0cb-d9c38f90d92f"}
{"doc_id": "2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538.doctags", "chunk_id": 37, "source_chunk_idxs": [43], "num_tokens": 484, "text": "References\nAtkins, K. J., Andrews, S. C., Stout, J. C., and Chong, T. T. J. (2024). The effect of Huntington's disease on cognitive and physical motivation. Brain 147, 2449-2458. doi: 10.1093/brain/awae023\nBaird, A., and Samson, S. (2015). Music and dementia. Prog. Brain Res. 217, 207-235. doi: 10.1016/bs.prb.2014.11.028\nBang, J, Spina, S, and Miller, B. L. (2015). Frontotemporal dementia. Lancet 386, 1672-1682. doi: 10.1016/S0140-6736(15)00461-4\nBao, Y., Yang, T., Lin, X., Fang, Y., Wang, Y., Poppel, E., et al. (2016). Aesthetic preferences for eastern and Western traditional visual art: identity matters. Front. Psychol. 7:1596. doi: 10.3389/fpsg.2016.01596\nBara, I., Binney, R. J., Ward, R., and Ramsey, R. (2022). A generalized semantic cognition account of aesthetic experience. Neuropsychologia 173:108288. doi: 10.1016/j.neuropsychologia.2022.108288\nBelenchia, E. J. (2023). An individualized music listening program to reduce agitation hospitalized in patients with Alzheimer's disease and related dementias. Geriatr. Nurs. 52, 157-164. doi: 10.1016/j.gerinurse.2023.06.003\nBeli, A. M., Vessel, E. A., Brielmann, A. A., Isik, A. I., Chatterjee, A., Leder, H., et al. (2019). Dynamics of aesthetic experience are reflected in the default-mode network. NeuroImage 188, 584-597. doi: 10.1016/j.neuroimage.2012.12.017", "doc_items_refs": ["#/texts/150", "#/texts/151", "#/texts/152", "#/texts/153", "#/texts/154", "#/texts/155", "#/texts/156"], "page_nos": [1], "uuid": "eb735c8d-3a72-41ab-8462-193f1d8bb6dc"}
{"doc_id": "2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538.doctags", "chunk_id": 38, "source_chunk_idxs": [44, 45], "num_tokens": 240, "text": "References\nBkelcofer, C., M. Van Hecke, A. V., and Konopka, L. M. (2014). Effects of drawing on alpha activity: a quantitative EEG study with implications for art therapy. Ther. 31, 61-68. doi: 10.1080/07421656.2014.903821\nBilsky, E. (2017). Eric Kandel's reductionism in art and brain science - bridging the two cultures. Cerebrum 2017:cer-06-17\nAny alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us.\n\nPublisher's note\nAll claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher.", "doc_items_refs": ["#/texts/157", "#/texts/158", "#/texts/162", "#/texts/164"], "page_nos": [1], "uuid": "ded84b5c-055d-4b30-9403-de22ab159314"}
{"doc_id": "2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538.doctags", "chunk_id": 39, "source_chunk_idxs": [46], "num_tokens": 474, "text": "Supplementary material\nThe Supplementary material for this article can be found online at: https://www.frontiersin.org/articles/10.3389/fnhum.2025.1658617/ full#supplementary-material\nBlood, A. J., and Zatorre, R. J. (2001). Intensely pleasurable responses to music correlate with activity in brain regions implicated in reward and emotion. Proc. Natl. Acad. Sci. USA 98, 11818-11823. doi: 10.1073/pnas.191355898\nBocca, M. Barbetti, S. Piccardi, L. Guariglia, C. Ferlazzo, E. Giannini, A. M. et al. (2016). Where does brain neural activation in aesthetic responses to visual art occur? Meta-analytic evidence from neuroimaging studies. Neurosci. Biobehav. Rev. 60, 65-71. doi: 10.1016/j.neurobiest.2015.1009\nBoduroglu, A., Shah, P. and Nisbett, R. (2009). Cultural differences in allocation of attention in visual information processing. J. Cross-Cult. Psychol. 40, 349-360. doi: 10.1177/20222100833100\nBologna, M., Leodori, G., Stripe, P., Paparella, G., Colella, D., Belvisi, D., et al. (2016). Bradykinics early and advanced Parkinson's disease. J. Neurol. Sci. 369, 286-291. doi: 10.1016/j.jns.2016.08.028\nBrattico, E., Brusda, A., Dietz, M., Jacobsen, T., Fernandes, H. M., Gaggero, G., et al. (2025). Beauty and the brain - investigating the neural and musical attributes of beauty during naturalisticmusicalstudiengenes. Science 563, 308-325.doi: 10.1016/j.neuroscience.2024.12.008", "doc_items_refs": ["#/texts/166", "#/texts/167", "#/texts/168", "#/texts/169", "#/texts/170", "#/texts/171"], "page_nos": [1], "uuid": "39ba486f-19de-4b73-ac3a-0317ceb7b45e"}
{"doc_id": "2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538.doctags", "chunk_id": 40, "source_chunk_idxs": [47], "num_tokens": 459, "text": "Supplementary material\nBrattico, E., and Varankaitė, U. (2019). Aesthetic empowerment through music. Musica Sci. 23, 285-303. doi: 10.1177/1029864919850606\nBrown, S., Gao, X., Tisdelle, L., Eickhoff, S., and Liotti, M. (2011). Naturalizing aesthetics: brain areas for aesthetic appraisal across sensory modalities. NeuroImage 58, 250-258. doi: 10.1016/j.neuroimage.2011.06.012\nBuetler, K. A., Penalver-Andrews, J., Özen, Ö., Ferriroli, M., Lüri, M. R., Cazzoli, D., (2022). \"Tricking the Brain\" using immersive virtual reality: modifying the selfperception over embodied avatars influence motor cortical excitability and action initiation. Front. Hum. Neurosci. 15:78487. doi: 10.3389/fnhum.2021.78748\nCalbrà, R. S., and Morone, G. (2025). Advancing rehabilitation medicine with the metaverse: opportunities and challenges. Brain Sci. 15:321. doi: 10.3390/brainsci15032031\nCanei, M., Rusconi, M. L., Isia, I. U., and Pezzoli, G. (2012). Artistic productivity and creative thinking in Parkinson's disease. Eur. J. Neurol. 19, 468-472. doi: 10.1111/j.1468-1331.2011.03546.x\nCarlsson, I., Wendt, P. E., and Risberg, J. (2000). On the neurobiology of creativity. Differences in frontal activity between high and low creative subjects. Neuropsychologia 38, 873-885. doi: 10.1016/s0028-3932(99)00128-1", "doc_items_refs": ["#/texts/172", "#/texts/173", "#/texts/174", "#/texts/175", "#/texts/176", "#/texts/177"], "page_nos": [1], "uuid": "c1a88de6-328d-4753-8e13-e32ab3590c62"}
{"doc_id": "2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538.doctags", "chunk_id": 41, "source_chunk_idxs": [48], "num_tokens": 437, "text": "Supplementary material\nCavaco, S., Anderson, S. W., Allen, J. S., Castro-Caldas, A., and Damasio, H. (2004). The scope of preserved procedural memory in amnesia. Brain 127, 1853-1867. doi: 10.1093/brain/awh208\nChang, E., Kim, H. T., and Yoo, B. (2020). Virtual reality sickness: a review of causes and measurements. Int. J. Hum. Comput. Interact. 36, 1658-1682. doi: 10.1080/1044731720.20178351\nChatterjee, A., and Vartanian, O. (2014). Neuroaesthetics. Trends Cogn. Sci. 18, 370-375. doi: 10.1016/j.tics.2014.03.003\nChaudhary, S., Zhornitsky, S., Chao, H. H., van Dyck, C. H., and Li, C. R. (2022). Emotion processing dysfunction in Alzheimer's disease: an overview of behavioral findings, systems neural correlates, and underlying neural biology. Am. J. Alzheimers Dis. Other Dement. 37:15333175221082834. doi: 10.1177/15333175221082834\nCinzia, D. D., and Vittorio, G. (2009). Neuroaesthetics: a review. Curr. Opin. Neurobiol. 19, 682-687. doi: 10.1016/j.conb.2009.09.001\nClarke, A., Taylor, K. I., Devereux, B., Randall, B., and Tyler, L. K. (2013). From perception to conception: how meaningful objects are processed over time. Cereb Cortex 23, 187-197. doi: 10.1093/cercor/bhs002", "doc_items_refs": ["#/texts/178", "#/texts/179", "#/texts/180", "#/texts/183", "#/texts/184", "#/texts/185"], "page_nos": [1], "uuid": "a00ad84f-d212-4bbb-82a3-7da214857652"}
{"doc_id": "2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538.doctags", "chunk_id": 42, "source_chunk_idxs": [49], "num_tokens": 479, "text": "Supplementary material\nCrutch, S. J., Isaacs, R., and Rossor, M. N. (2001). Some workmen can blame their tools: artistic change in an individual with Alzheimer's disease. Lancet 357, 2129-2133. doi: 10.1016/S0140-6736(00)05187-4\nCuddy, L. L., and Duffin, J. (2005). Music, memory, and Alzheimer's disease: is music recognition spared in dementia, and how it can be assessed? Med. Hypotheses 64, 229-235. doi: 10.1016/j.mehy.2004.09.005\nCuddy, L. L., Sikkika, R. and Vanstone, A. (2015). Preservation of musical memory and engagement in healthy aging and Alzheimer's disease. Ann. N. Y. Acad. Sci. 1337, 223-231. doi: 10.1111/nyas.12617\nCzamanski-Cohen, J., and Weisks, K. L. (2016). The Bodymodel: model for a pathfinding studies the mechanisms of change induced by art therapy. Psychotherapy. 51, 63-71. doi: 10.1016/j.aim.2016.08.006\nDe Giorgi, R., Fortini, A., Aghilarre, F., Gentili, F., Morone, G., Antonucci, G., et al. (2023). Virtual art therapy: application of Michelangelo effecto to neurorehabilitation of patients with stroke. J. Clin. Med. 12:2590: doi. 10.3390/jcm12072590\nden Brok, M. G., van Delan, J. W., van Gool, W. A., moll Van arte, C. H. Beie, R. M., and Richard, E. (2015). Apathy in Parkinson's disease: a systematic review and meta-analysis. Mov. Disord. 30, 759-769. doi: 10.1092/mds.26208", "doc_items_refs": ["#/texts/186", "#/texts/187", "#/texts/188", "#/texts/189", "#/texts/190", "#/texts/191"], "page_nos": [1], "uuid": "18911400-8fa4-4c3d-bcd6-7669950618bf"}
{"doc_id": "2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538.doctags", "chunk_id": 43, "source_chunk_idxs": [50], "num_tokens": 433, "text": "Supplementary material\nDi Dio, C., Macaluso, E., and Rizzolatti, G. (2007). The golden beauty: brain response to classical and Renaissance sculptures. PLoS One: 2e12011. doi. 10.1371/journal.pone.0001201\nDrago, V., Foster, P. S., Trifletti, E., DitzGerald, D., B., Kluger, B. M., Crucian, G. P., et al. (2006). What's inside the art? The influence of frontotemporal dementia in art production. Neurology 67, 1285-1287. doi: 10.1212/wml.00100384.7744.da.\nDugger, B. N., and Dickson, D. W. (2017). Pathology of neurodegenerative diseases. Cold Spring Harb. Pers. Biol. 9:a023035. doi: 10.1101/cshperspect.a023035\nEidelberg, D., and Surmeier, D. I. (2011). Brain networks in Huntington disease. J Clin. Invest. 121, 484-492. doi: 10.1172/JC145646\nElse, J. E., Ellis, J., and Orme, E. (2015). Art expertise modulates the emotional response to modern art, especially abstract: an ERP investigation. Front. Hum. Neurosci. 25. doi: 10.3389/fhum.2015.00525\n9Eblad, S. Y. M., and Mukaetova-Ladinska, E. B. (2021). Creative art therapy as a non-pharmacological intervention for dementia: a systematic review. J. Alzheimers Dis. Rep. 5, 353-364. doi: 10.3233/ADR-201002", "doc_items_refs": ["#/texts/192", "#/texts/193", "#/texts/194", "#/texts/195", "#/texts/196", "#/texts/197"], "page_nos": [1], "uuid": "4c7deb10-50b8-4688-8d81-27bb8dcd6788"}
{"doc_id": "2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538.doctags", "chunk_id": 44, "source_chunk_idxs": [51], "num_tokens": 413, "text": "Supplementary material\nErkkinen, M. G., Kim, M. G., and Geschwind, M. D. (2018). Clinical neurology and epidemiology of the major neurodegenerative diseases. Cold Spring Harb. Pers. Biol. 10:03118. doi: 10.1101/cshperspect.a033118\nErkkinen, G. M., Zögnä, R. G., Pardo, C. C., Miller, B. L., and Miller, Z. A. (2018b). Artistic renaissance in frontotemporal dementia. JAMA 319, 1304-1306. doi. 10.10007/jame.20147.1\nFancourt, D. and Finn, S. What is the evidence on the role of the arts in improving health and well-being? A scoping review [internet]. Copenhagen: WHO Regional Office for Europe; (2019). (Health Evidence Network synthesize report, No. 67) Available online at: https://www.ncbi.nlm.nih.gov/books/NBK553773/\nFiala, V., Tfebrický, P., Zavhohi, F., Leongomé, J. R., Töveck, P., Sarib, S. A., et al. (2021). Facial attractiveness and preference of sexual multimorphism: a comparison across five populations. Evol. Hum. Sci. 3e38: doi. 10.1017/ehs.2021.33\nFornazzari, L. R. (2005). Preserved painting creativity in an artist with Alzheimer's disease. Eur. J. Neurotol. 4, 12-419. doi: 10.1114/j.1166-1338.51001.5128.x", "doc_items_refs": ["#/texts/198", "#/texts/199", "#/texts/200", "#/texts/201", "#/texts/202"], "page_nos": [1], "uuid": "56f1bc47-ccd9-4306-8fe7-881b16e21332"}
{"doc_id": "2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538.doctags", "chunk_id": 45, "source_chunk_idxs": [52], "num_tokens": 488, "text": "Supplementary material\nFriedberg, A., Pasquini, L., Diggs, R., Glaibitz, E. A., Lopez, L., Illán-Gala, I., et al. (2023). Prevalence, timing, and network localization of emergent visual creativity in frontotemporal dementia. JAMA Neurotol. 37, 387-377. doi: 10.1001/jameanlavero.2023.0001\nFu, X., Zhou, Z., and Zhu, X. (2023). The unique aesthetic experience of VR technology. Highlights Sci. Eng. Technol. 44, 177-188. doi: 10.54097/hvet.a4417.73\nGadhave, D. G., Sugandhi, V. V., Jha, S. K., Nangare, S. N., Gupta, G., Singh, S. K., et al. (2024). Neurodegenerative disorders: mechanisms of degeneration and therapeutic approaches with their clinical relevance. Aging Res. Rev. 99:102357. doi: 10.1016/j.arr.2024.10235\nGerdner, L. A. (2000). Effects of individualized versus classical \"relaxation\" music on the frequency of agitation in elderly persons with Alzheimer's disease and related disorders. Int. Psychogeriatr. 12, 49-65. doi: 10.1017/s104161020006190\nGermine, L., Russell, R., Bronstad, P. M., Blokland, G. A., Smoller, J. W., Kwow, H., et al. (2015). Individual aesthetic preferences for face are shaped mostly by environments, not genes. Curr. Biol. 25, 2684-2689. doi: 10.1016/j.cub.2015.08.048\nGlennon, M. J., and Zeki, S. (2022). The power of external influences to modify judgments of facial and moral beauty. Psych J. 11, 707-714. doi: 10.1002/pchj.492", "doc_items_refs": ["#/texts/203", "#/texts/204", "#/texts/205", "#/texts/206", "#/texts/207", "#/texts/210"], "page_nos": [1], "uuid": "5eb146e0-2c10-4155-98b5-39fba120d1aa"}
{"doc_id": "2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538.doctags", "chunk_id": 46, "source_chunk_idxs": [53], "num_tokens": 507, "text": "Supplementary material\nGökçal, E., Gür, V., Eselvit, R., Babalcan Yizdel, G., and Asil, T. (2017). Motor and non-motor sentiments in Parkinson's disease: effects on quality of life. NeuroPsiyat. Ars. 54, 143-148. doi: 10.5152/npa.2016.12758\nGorno-Tempini, P. M., L. H., A. E., Weintraub, S., Kertesz, A., Mendez, M., Cappa, S., et al. (2015). Classification of primary progressive aphasia and its variants. Neurology 76, 1006-1014. doi: 10.1212/WNL.0b013e31821103e6\nGrewe, O., Nagel, F., Kopiez, R., and Altenmüller, E. (2007). Emotions over time: synchronicity and development of subjective, physiological, and facial affective reactions to music. Emotion 7, 774-788. doi: 10.1037/1528-3542.7.4.774\nGuy, M., Normand, J., Keunel-Kwbel, A. (2023). The sense of embodiment in virtual reality and its assessment methods. Front. Virtual Real 4:1141683. doi: 10.3389/frv.2023.0411683\nAlbignock, S. Itchkovski-Bans, Shio, C. J., and Galili, G. (2018). Emotional response and changes in heart variability following art-making with three different art materials. Front. Chiss. 94:209. doi: 1033/fhc.g20.2018.009\nHendricks, S., Galili, C., Ramos, C. K., Chomung, F., Jins, F., J. Lord, P., et al. (2019). Ethical challenges of risk, informed and posttrial, and responsiblent in personal research and humanitarian needs. Jan A: Hernandez. J.76, 1506-1576. doi: 10.15arkeu.2019.3523.5", "doc_items_refs": ["#/texts/211", "#/texts/212", "#/texts/213", "#/texts/214", "#/texts/215", "#/texts/216"], "page_nos": [1], "uuid": "33e2fc7c-bfca-4252-abcd-bab6aaec21af"}
{"doc_id": "2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538.doctags", "chunk_id": 47, "source_chunk_idxs": [54], "num_tokens": 488, "text": "Supplementary material\nMendis, H. L., Mezell, F. J., M Slotwsin, A., Kowroe, L., Renstein, W., Heinhal, G. Rerris, D. L., et al. (2016). Do people with dementia respond to different types of art: An explorative study into museum programs. Psych. Inteager. 31, 9/98, 880-1015/S104161020006\nHolmberg, L. A., and Kozluk, S. J., and Zavko, P., M. K. (2014). The paintings reveal the story: case study of a well-known Swedish artist from Alzheimer's disease. J. Alzheimers Dis. J. A., Schoenbach, J. (2014).\nKliem, E., Forster, M., and Leder, H. (2022). Aesthetic preference for negativelyvalenced artworks remains stable in pathological aging: a comparison between cognitively impaired patients with Alzheimer's disease and healthy controls. Front . Psychol . 13:879833. doi: 10.3389/fpsyg.2022.879833\nKouli, A., Torsney, K. M., and Kuan, W. L. (2018). \"Parkinson's disease: etiology, neuropathology, and pathogenesis\" in Parkinson's disease: Pathogenesis and clinical aspects. eds. T. B. Stoker and J. C. Greenland (Brisbane (AU): Codon Publications).\nKrashia, P., Spoleti, E., and D'Amelio, M. (2022). The VTA dopaminergic system as diagnostic and therapeutic target for Alzheimer's disease. Front . Psych . 13:1039725. doi: 10.3389/fpsyt.2022.1039725\nKringelbach, M. L. (2005). The human orbitofrontal cortex: linking reward to hedonic experience. Nat. Rev. Neurosci . 6, 691-702. doi: 10.1038/rnn1747", "doc_items_refs": ["#/texts/217", "#/texts/218", "#/texts/222", "#/texts/223", "#/texts/224", "#/texts/225"], "page_nos": [1], "uuid": "77a3d843-2cb6-483f-a21e-0aacb21f8921"}
{"doc_id": "2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538.doctags", "chunk_id": 48, "source_chunk_idxs": [55], "num_tokens": 447, "text": "Supplementary material\nLauring, J. O., Ishizu, T., Kutlikova, H. H., Dörfling, F., Haugboß, S., Leder, H., et al. (2019). Why would Parkinson's disease lead to sudden changes in creativity, motivation, or style with visual art?: a review of case evidence and new neurobiological, contextual and genetic hypotheses. Neurosci . Biobehav . Rev. 100, 129-165. doi: 10.1016/j.neubiorev.2018.12.016\nLaver, K. E., Lange, B., George, S., Deutsch, J., E., Saposnik, G., and Crotty, M. (2017). Virtual reality for stroke rehabilitation. Cochrane Database Syst. Rev. 2018:CD008349. doi: 10.1002/14651858.CD008349.pub4\nLeder, H., Belke, B., Oeberst, A., and Augustin, D. (2004). A model of aesthetic appreciation and aesthetic judgments. Br. J. Psychol . 95, 489-508. doi: 10.1348/000712604239811\nLeder, H., and Nadal, M. (2014). Ten years of a model of aesthetic appreciation and aesthetic judgments: the aesthetic episode - developments and challenges in empirical aesthetics. Br. J. Psychol . 105, 443-464. doi: 10.1111/bjop.12084\nLhommé, E., Batir, A., Quesada, J. L., Ardouin, C., Fraix, V., Seigneur, E., et al. (2014). Dopamine and the biology of creativity: lessons from Parkinson's disease. Front . Neuro . 5:55. doi: 10.3389/fneur.2014.00055", "doc_items_refs": ["#/texts/226", "#/texts/227", "#/texts/228", "#/texts/229", "#/texts/230"], "page_nos": [1], "uuid": "c3b7c14d-de7d-4077-9964-4a66d09da891"}
{"doc_id": "2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538.doctags", "chunk_id": 49, "source_chunk_idxs": [56], "num_tokens": 505, "text": "Supplementary material\nLi, Z., Bujić, M., Burkul, O., Bampouni, E., Järvelä, S., and Hamari, J. (2024). Hapticsmediated virtual embodiment: impact of a wearable avatar-controlling system with kinesthetic degrees on VR embodiment. In: Real 5 :1439724. doi: 10.3389/frvir.2024.1439724\nLi, Y., Luo, X., Zhang, A., Ying, F., Wang, J., and Huang, G. (2024). The potential of arts therapies in Parkinson's disease rehabilitation: a comprehensive review. Helion 10:e35765. doi: 10.1016/j.helion.2024.e35765\nLittle, A. C., and Griffey, J. A. F. (2020). Preferring and detecting face symmetry: comparing children and adults judging human and other facial features. doi: 10.3390/sym1211221\nLittle, A. C., Jones, B. C., and DeBruine, L. M. (2011). Facial attractiveness: evolutionary based research. Philos . Trans. R. Soc. London. Ser. B Biol. Sci. 366, 1638-1659. doi: 10.1098/rstb.2010.0404\nLougianski, C., Katifori, A., and Roussou, M. Effect of virtual hand representation on interaction and embodiment in HMD-based virtual environments using controllers. In: 2020 IEEE Conference on Virtual Reality and 3D User Interfaces (VR); (2020)\nLundin, R. M., Yeap, Y., and Menkes, D. B. (2023). Adverse effects of virtual and augmented reality interventions in psychiatry: systematic review. JMN. Ment Health 10:e43240. doi: 10.2196/43240\nMadary, M., and Metzinger, T. K. (2016). Real virtuality: a code of ethical conduct. Recommendations for good scientific practice and the consumers of VR-technology. Front. Robot AI 3:3. doi: 10.3389/frobt.2016.00003", "doc_items_refs": ["#/texts/231", "#/texts/232", "#/texts/233", "#/texts/234", "#/texts/235", "#/texts/236", "#/texts/237"], "page_nos": [1], "uuid": "2893b20f-5b69-4fee-8e61-a6df90e16235"}
{"doc_id": "2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538.doctags", "chunk_id": 50, "source_chunk_idxs": [57], "num_tokens": 473, "text": "Supplementary material\nMagsamen, S. (2019). Your brain on art: the case for neuroaesthesia. Cerebrum 2019:cer-07-19\nMansuoto, S. P., Romeo, Z., Arngilli, A., and Spironelli, C. (2025). Emotional pictures in the brain and their interaction with the task: a fine-grained fMRI coordinate-based meta-analysis study. Neurojournal . 10:1016/j.neuroimage.2024.120986\nMariofra, G., Cutilleceto, L., Susninna, C., Di Lorenzo, G., Quartarone, A., and Lo Buono, V. (2025). Exploring the impact of dopaminergic treatment on creative expression in Parkinson's disease: a scoping review. J. Clin. Med . 14:4119. doi: 10.3390/jcm14124119\nMarco, P., and Redolat, R. (2023). Art therapy approaches in Alzheimer's disease: a systematic review. Activities Adapt . Aging 47, 75-106. doi: 10.1080/01924788.2022.2148402\nMartinez-Horta, S. Riba, J., de Bobadilla, R. F., Paganabraga, J., Pascual-Sedano, B., Neurotono, A. M., et al. (2014). Apathy in Parkinson's disease: neurophysiological evidence of impaired incentive processing. J. Neurosci . 34, 5918-5926. doi: 10.1523/JNEUROSCI.0251-14.2014\nMasuda, T., Gonzalez, R., Kwan, L., and Nisbett, R. E. (2008). Culture and aesthetic preference: comparing the attention to context of east Asians and Americans. Personal . Soc. Psychol . Bull. 34, 1260-1275. doi: 10.1177/01461657208320555", "doc_items_refs": ["#/texts/238", "#/texts/239", "#/texts/240", "#/texts/241", "#/texts/242", "#/texts/243"], "page_nos": [1], "uuid": "2db7e9e7-c914-4dce-9b20-a0a074c4553e"}
{"doc_id": "2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538.doctags", "chunk_id": 51, "source_chunk_idxs": [58], "num_tokens": 453, "text": "Supplementary material\nMcKhann, G. M., Knopman, D. S., Chertkow, H., Hyman, B. T., Jack, C. R. Jr., Kwasas, C. H., et al. (2011). The diagnosis of dementia due to Alzheimer's disease: recommendations from the National Institute on Aging-Alzheimer's Association workgroups on diagnostic guidelines for Alzheimer's disease. Alzheimers . Dement . 7, 263-269. doi: 10.1016/j.jalz.2011.03.005\nMedford, N., and Critchley, H. D. (2010). Conjoint activity of anterior insular and anterior cingulate cortex: awareness and response. Brain Struct . Funct . 214, 535-549. doi: 10.1007/s00429-010-0265-x\nMenon, V., Levit, D. J. (2005). The rewards of music listening: response and physiological connectivity of the mesolimbic system. NeuroImage 28, 175-184. doi: 10.1016/j.neuroimage.2005.05.003\nMiller, B. (2005). Neurology of the arts: painting, music, literature. J. Neurol . Neurosurg . Psychiatry 76, 148. doi: 10.1136/jnp.2004.048835\nMiller, B. L., Cummings, J., Mishkin, F., Boone, K., Prince, F., Ponton, M., et al. (1998). Emergence of artistic talent in frontotemporal dementia. Neurology 51, 978-982. doi: 10.1212/wnl.51.4.978\nMiller, Z. A., and Misa, E. (2013). Artistic creativity and dementia. Prog. Brain Res . 204, 99-112. doi: 10.1016/B978-0-444-63287-6.00005-1", "doc_items_refs": ["#/texts/244", "#/texts/247", "#/texts/248", "#/texts/249", "#/texts/250", "#/texts/251"], "page_nos": [1], "uuid": "377cd75b-06fe-441b-8daa-210da6490097"}
{"doc_id": "2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538.doctags", "chunk_id": 52, "source_chunk_idxs": [59], "num_tokens": 483, "text": "Supplementary material\nMorita, T., Tanabe, H. C., Sasaki, A. T., Shimada, K., Kakigi, R., and Sadato, N. (2014). The anterior sinus and anterior coriellate entions in processing for self-face recognition. Soc. Cogn. Affte. Neuro . 9, 579- doi: 10.1093/scan/nst011\nMorone, G., Ciarlicelli, A., Callabrò, R. S., Cerra, A., Iosa, M., and Migigliano, F. (2025). MetaRehabVerse: the great opportunity to put the person's functioning and participation at the Center of Healthcare. Neurorehab . Neural Repair 39, 241-255. doi: 10.1177/1545968343210457\nMuhammed, K., Manohar, S., Ben Yehuda, M., Chong, T. . 214, 3-4. Suggests with potential affinity in parkinsons with parkinsons. Brain . 139, 27-47. doi: 10.1093/brain/awww188\nNadal, M., and Chatterjee, A. (2019). Neuroaesthesaet and art's diversity and university. Wiley Stanley . Interpretive. Cogn. Sci . 10:e1487. doi: 10.1002/wcs.1487. doi: 10.1016/j.neuroimage.2024.10.10\nMng, A., Inagaki, M., Antunicci, R., Sockalingam, S., and Abdolp, S. (2025). Determining the severity and prevalence of cybersickness in virtual reality simulations Psychiatry . In. Desmod (Lim). 16:1032. doi: 10.1186/s41077-025-00358-y\nNicolini, F., and Politis, M. (2014). Neuroimaging in Huntington's disease. World J . Pei. 22: 3. doi: 10.1049/jv.6.1631", "doc_items_refs": ["#/texts/252", "#/texts/253", "#/texts/254", "#/texts/255", "#/texts/256", "#/texts/257"], "page_nos": [1], "uuid": "728e6abe-f67d-4e76-bdf8-1026c444ebf8"}
{"doc_id": "2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538.doctags", "chunk_id": 53, "source_chunk_idxs": [60], "num_tokens": 440, "text": "Supplementary material\nNovak, M. J., and Tabrizi, S. J. (2010). Huntington's disease. BMJ 340:c3109. doi: 10.1136/bmj.c3109\nPelowski, M., Marke, P. F., Antonos, M., Gerster, G., Mberger, G., and Deler, L. (2017). Neuroaesthetic painout. semi-hull. doi: 10.3389/fpsyg.2023.1158304\nParrino, E. D., Horpe, A. E., Garcia-Gorro, C., Rodriguez-Dechique, N., Vauder, Calio, M., et al. (2024). Disentangling the neurobiological bases of temporal impulsivity in Harrison . Brain Behav . 14:e335. doi: 10.1033/br2.3393\nPark, H., Pracione Specht, J. K. (2009). Effect of individual music on agitation in individuals with dementia due to home . J. Gerontol . N. 35, 47-55. doi: 10.23790/00988f.2016.0076\nPonzio, A., and Mather, M. (2014). Hearing something emotional influences memory for what was just: how are plausible effects of competition in memory consolidation . Emotion 14, 1137-1142. doi: 10.1037/a0037983\nRadada, K., Moldzio, R., Krewenka, C., Kramer, B., and Rausch, W. D. (2023). Pathophysiology of non-motor senses of Parkinson's disease: recent updating with brief presentation. Explor . Neuroprot . Ther. 3, 24-46. doi: 10.37349/ent.2023.00036", "doc_items_refs": ["#/texts/258", "#/texts/259", "#/texts/260", "#/texts/261", "#/texts/262", "#/texts/263"], "page_nos": [1], "uuid": "a645011d-46f9-4ef3-9111-ea6eacc39026"}
{"doc_id": "2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538.doctags", "chunk_id": 54, "source_chunk_idxs": [61], "num_tokens": 494, "text": "Supplementary material\nRascovsky, K., Hodges, J. R., Knopman, D., Mendez, M. F., Kramer, J. H., Neuhaus, J., et al. (2011). Sensitivity of revised diagnostic criteria for the behavioural variant of frontotemporal dementia. Brain 134, 2456-2477. doi: 10.1093/brain/awr179\nRidder, H. M., Stigge, B., Voleq, L. G., and Gold, C. (2013). Individual music therapy for agitation in dementia: an exploratory randomized controlled trial. Aging M e n t Health 17, 667-678. doi: 10.1080/13607863.2013.790926\nRios-Urrego, C. D., Vásquez-Correa, J. C., Vargas-Bonilla, J. F., Nöth, E., Lopera, F., and Orozco-Arroyave, J. R. (2019). Analysis and evaluation of handwriting in patients with Parkinson's disease using kinematic, geometrical, and non-linear features. Comput. Methods Prog. Biomed. 173, 43-52. doi: 10.1016/j.cmp.ob29.03.005\nRolls, E. T. (2023a). Emotion, motivation, decision-making, the orbitofrontal cortex, anterior cingulate cortex, and the amygdala. Brain Struct. Funct. 228, 1201-1257. doi: 10.1007/s00429-023-02644-9\nRolls, E. T. (2023b). The orbitofrontal cortex, food reward, body weight and obesity. Soc. Cogn. Affect. Neurosci. 18:nsab044. doi: 10.1093/scan/nsab044\nRolls, E. T., Cheng, W., and Feng, J. (2020). The orbitofrontal cortex: reward, emotion and depression. Brain Commun. 2:fca976. doi: 10.113/braincom/fca976", "doc_items_refs": ["#/texts/267", "#/texts/268", "#/texts/269", "#/texts/270", "#/texts/271", "#/texts/272"], "page_nos": [1], "uuid": "5f3d8798-d4fb-476c-bebd-fbdd4e6723cf"}
{"doc_id": "2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538.doctags", "chunk_id": 55, "source_chunk_idxs": [62], "num_tokens": 499, "text": "Supplementary material\nRoss, C. A., Aylward, E. H., Wild, E. J., Langbehn, D. R., Long, J. D., Warner, J. H., et al. (2014). Huntington disease: natural history, biomarkers and prospects for therapeutic treatments. Nat. Rev. Neurol. 10, 204-216. doi: 10.1038/nrneurol.2014.24\nRoss, C. A., and Tabrizi, S. J. (2011). Huntington's disease: from molecular pathogenesis to clinical treatment. Lancet Neurol. 10, 83-98. doi: 10.1016/S7414-422(1070)24-0453\nRouse, M. A., Alai, D. A., Ramanan, S., Rogers, T. G., Garrard, P., Patterson, K., et al. (2024). Social-semantic knowledge in frontotemporal dementia and after anterior temporal lobe resection. Brain Commun. 6:fcae37. doi: 10.1093/braincomms/fcae37\nSalera, C., Capua, C., De Angelis, D., Coelho, P., Veriuto, V., Sero, A., et al. (2024). Michelangelo effect in cognitive rehabilitation: using an art in a digital visuospatial memory task. Brain Sci. 14:479. doi: 10.3390/brainsciq1450479\nSalimpoor, V. N., Benovoy, M., Larcher, K., Dagher, A., and Zatorre, R. J. (2011). Anatomically distinct dopamine release during anticipation and experience of peak emotion to music. Nat. Neurosci. 14, 257-262. doi: 10.1038/nn27.26\nSärkäö, T., Tervaniemi, M., and Huilatoinen, M. (2013). Music perception and condition: development, neural basis, and rehabilitation use of music. Wiley Intersci. Rev. Cogn. Sci. 4, 441-451. doi: 10.1002/wcs.1237", "doc_items_refs": ["#/texts/273", "#/texts/274", "#/texts/275", "#/texts/276", "#/texts/277", "#/texts/278"], "page_nos": [1], "uuid": "40c45356-5f13-42be-8ccb-110d2eeb2957"}
{"doc_id": "2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538.doctags", "chunk_id": 56, "source_chunk_idxs": [63], "num_tokens": 506, "text": "Supplementary material\nSasaki, Y., Vandelfelde, W., Knutsen, T., Tyler, C., and Tootell, R. (2005). Symmetry activates extrastriate visual cortex in human and nonhuman primates. Proc. Natl. Acad. Sci. USA 102, 3159-3163. doi: 10.1073/pnas.0500319102\nSchneider, J. (2018). The arts as a medium for care and self-care in dentifugates. and evidence. Int. J. Environ. Res. Public Health 15:1151. doi: 10.3390/ijerph15061151\nSchöller, E., Jain, A., Pizzagalli, D. A., and Regente, N. (2024). The neurobiology of aesthetic chills: how bodily sensations shape emotional experiences. Cogn. Affect. Behav Neurosci. 24, 617-560. doi: 10.3758/s13415-024-011-8-x\nSchöller, F., and Perlovsky, L. (2016). Aesthetic chills: knowledge-acquisition, meaning-making, and aesthetic emotions. Front. Psychol. 7: 1093. doi: 10.3389/fpsyg.2016.01093\nSchultz, W. (2015). Neuronal reward and decision signals: from theories to data. Physiol. Rev. 95, 853-951. doi: 10.1152/physrev.00023.2014\nSchwartz, R. R. (2010). Ripples from a stone skipping across the lake: a narrative approach to the meaning of Huntington's disease. J Neurosci. Nurs. 42, 157-168. doi: 10.1097/NNJ.0b013e3181d4a37f\nSchwartz, A. E., van Walsem, M. R., Brean, A., and Frich, J. C. (2019). Therapeutic use of music, dance, and rhythmic auditory cueing for patients with Huntington's disease: a systematic review. J. Huntington Dis. 8, 393-420. doi: 10.3390/JHD-370", "doc_items_refs": ["#/texts/279", "#/texts/280", "#/texts/281", "#/texts/282", "#/texts/283", "#/texts/284", "#/texts/285"], "page_nos": [1], "uuid": "1562c14e-8235-49e2-9d6c-b21088d63916"}
{"doc_id": "2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538.doctags", "chunk_id": 57, "source_chunk_idxs": [64], "num_tokens": 488, "text": "Supplementary material\nWingschenschuk, P., Katschnig, P., Saurugr, D., Ott, E., and Bhatia, K. P. (2010). Artistic profession: a potential risk factor for dopamine syndromy regulation in Parkinson's disease? Mov. Disord. 25, 493-496. doi: 10.1002/mosd.22946\nSeelye, W. W., Matthews, B. W., Rackson, F. R., Korno-Tempini, M. L., Foti, D., Mackenzie, I. R., et al. (2008). Unravelling Bolero: progressive aphasia, transmodal creativity and the right posterior neocortex. Brain 131, 39-49. doi: 10.1093/brain/awm270\nShdo, S. M., Roy, A. R., Datta, S., Lible, I., Jukic, S., Perry, D. C., et al. (2022). Enhanced positive emotional reactivity in frontotemporal dementia reflects left-latently altered atrophy in the temporal and frontal lobes. Cortex 154, 405-420. doi: 10.1016/j.cortex.2022.02.018\nSilveri, M. C., Ferrante, I., Brita, A. C., Rossi, P., Leri, Raptor, M. Mancellarella, F., et al. (2015). \"The Memory of Beauty's rewards Alzheimer's disease (but cannot help memory). J. Alzheimer's Dis. 45, 483-494. doi: 10.3233/JAD-14134\nSimón-Vicente, N., Rodríguez-Canón, S., Delgado-Beritob, V., Aus-Villaberde, V, and Cubelo Degado, I. (2024). Cybersickness: a systematic literature review of adverse effects related to virtual reality. Neurologi (Engl) . 39, 701-705. doi: 10.1016/j.nrleng.2022.04.007", "doc_items_refs": ["#/texts/286", "#/texts/287", "#/texts/288", "#/texts/289", "#/texts/290"], "page_nos": [1], "uuid": "27a0572f-cba9-4abb-9e71-5e7e2af61c27"}
{"doc_id": "2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538.doctags", "chunk_id": 58, "source_chunk_idxs": [65], "num_tokens": 443, "text": "Supplementary material\nSipos-Lascu, D., Vesa, S. C., and Perju-Dumbravá, L. (2021). Apatyh and anhedonia: clinical and neurophysiological assessment of a Romanian cohort. Brain Sci. 11:729. doi: 10.3390/brainsci11060729\nSkorvanek, M., Gdovinova, Z., Rosenberger, J., Saeidern, R. G., Nagyova, I., Groothoff, J., W. et al., (2015). The associations between fatigue, apathy, and depression in Parkinson's disease. Acta Neurosc.  Land. 131, 80-87. doi: 10.1111/ane.12882\nSkov, M. (2019). Aesthetic appreciation: the view from neuroimaging. Empir. Stud. Arts 37, 220-248. doi: 10.1177/0276237419839257\nSlater, M., and Sanchez-Vives, M. V. (2016). Enhancing our lives with immersive virtual reality. Front. Robot AI 3:74. doi: 10.3389/frob.2046.00074\nSnowden, J. V. (1999). Semantic dysfunction in frontotemporal lobar degeneration. Dement. Geriatr. Cogn. Disord. 10, 33-36. doi: 10.1159/0051209912\nSpeer, B. T. M., Crone, J. N., Searwes, S. K., Meinders, M. J., Arato, J., Kim, Y. A., et al. (2025). Prevalence of experienced changes in artistic and everyday creativity in people with Parkinson's disease. NP J Parkinsons Dis. 11:97. doi: 10.1038/sj41531-025-00924-1", "doc_items_refs": ["#/texts/291", "#/texts/292", "#/texts/296", "#/texts/297", "#/texts/298", "#/texts/299"], "page_nos": [1], "uuid": "afe93365-0843-4f98-bcb1-61a6db89420a"}
{"doc_id": "2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Beauty_in_the_shadow_of_neurodegenerative_disease_a_narrative_review_on_aestheti__W4414972538.doctags", "chunk_id": 59, "source_chunk_idxs": [66], "num_tokens": 380, "text": "Supplementary material\nSturm, I., Marotzik, U., and Ziersmens, T. (2023). The role of the body in the experience of installation art: a case study 'vitals' of donor eyes' bodily, and transformative experiences in Cognasar e 'sinos' \"orbit\". Front. Psychol. 11:192689. doi: 10.3389/j23196829.103389\nTesco, G., and Goel, V. (2022). Pathophysiology of neurodegenerative diseases: an syndromant for axonarone, potassium sulfate, activity, oxidative stress, and inflammation? Semin. Immun. 59:1016.10.sim.2022.101628\nThaut, H. X., and Abur, M. A. (2021). Rhythmic auditory stimulation in rehabilitation of movement disorders: a review of current research. Music. Percept. 27, 263-269. doi: 10.1510/mp27.2010.16.4\nVest, L. H., Tomson, J., Curler, A. P., M. Mancio, and Chatterjee, H. J. (2018). Effects of a meditation-based social prescription intervention with quantitative measures of psychological wellbeing in older adults. Perspect. Public Health 138, 28-38. doi: 10.3711/1779.135799.137\nUlug, H., and Pijlanburg, Y. A. (2023). Frontotemporal dementia: past, present, and future Alzheimer. Dement. 9, 5253-5. doi: 10.1002/ajz.13363.38", "doc_items_refs": ["#/texts/300", "#/texts/301", "#/texts/302", "#/texts/303", "#/texts/304"], "page_nos": [1], "uuid": "652cd92c-742c-4248-8390-3a75b8629abb"}
