{"doc_id": "2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990.doctags", "chunk_id": 0, "source_chunk_idxs": [0, 1], "num_tokens": 252, "text": "&lt;!-- image --&gt;\n&lt;!-- image --&gt;\n\nOPEN ACCESS\nEDITED BY Keith Vossel, University of California, Los Angeles, United States\nREVIEWED BY Pablo Bagnati, Fundación Para la Lucha Contra las Enfermedades Neurológicas de la Infancia (FLENI), Argentina Amir Ali Sepehry, Adler University, Canada\n*CORRESPONDENCE Viorica Rarinca rarinca\\_viorica@yahoo.com Cristina Albert\n$\\_{☎}$ albident72@yahoo.com\nRECEIVED 14 July 2025 ACCEPTED 28 August 2025\nPUBLISHED 16 September 2025\nCITATION Mavroudis I, Petridis F, Franekova K, Visticernu M, Rarina C, Burlui V, Ciobica A, Novac B, Dobrin I, Hogas MM, Bovari E, Albert C and Kazis D (2025) Functional Cognitive Disorder: diagnostic challenges, clinical features, and future directions in a misunderstood condition.\nFront. Aging Neurosci. 17:1665510.\ndoi: 10.3389/fnagi.2025.1665510", "doc_items_refs": ["#/pictures/0", "#/pictures/1", "#/texts/1", "#/texts/2", "#/texts/3", "#/texts/4", "#/texts/5", "#/texts/6", "#/texts/7", "#/texts/8", "#/texts/9"], "page_nos": [1], "uuid": "98165b3a-fa97-4650-9878-9b75b56a1cd1"}
{"doc_id": "2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990.doctags", "chunk_id": 1, "source_chunk_idxs": [2], "num_tokens": 267, "text": "COPYRIGHT\n© 2025 Mavroudis, Petridis, Franekova, Visticernu, Rarinca, Burlui, Ciobica, Novac, Dobrin, Hogas, Bovari, Albert and Kazis. This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms.\nFunctional Cognitive Disorder: diagnostic challenges, clinical features, and future directions in a misunderstood condition\nIoannis Mavroudis 1,2,3,4 , Foivos Petridis 2 , Katerina Franekova 3 , Malina Visticernu 5,6 , Viorica Rarinca 5,6,7* , Vasile Burlui 6 , Alin Ciobica 4,5,6,8 , Bogdan Novac 9 , Irina Dobrin 10 , Mihai Marian Hogas 9 , Erica Bovari 6 , Cristina Albert 11* and Dimitrios Kazis 3", "doc_items_refs": ["#/texts/11", "#/texts/15", "#/texts/16"], "page_nos": [1], "uuid": "763cde17-9eca-450b-8183-3f241a779d05"}
{"doc_id": "2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990.doctags", "chunk_id": 2, "source_chunk_idxs": [3], "num_tokens": 500, "text": "COPYRIGHT\n$^{1}$Department of Neuroscience, Leeds Teaching Hospitals, NHS Trust, Leeds, United Kingdom, $^{2}$Third Department of Neurology, Aristotle University of Thessaloniki, Thessaloniki, Greece, $^{3}$School of Medicine, University of Leeds, Leeds, United Kingdom, $^{4}$Academy of Romanian Scientists, Bucureti, Romania, $^{5}$Faculty of Biology, Doctoral School of Biology, \"Alexandru Ioan Cuza\" University of Iași, Iași, Romania, $^{6}$Ioan Haulica\" Institute, Apollonia University, Iași, Romania, $^{7}$Faculty of Geography and Geology, Doctoral School of Geosciences, \"Alexandru Ioan Cuza\" University of Iași, Iași, Romania, $^{8}$Center of Biomedical Research, Romanian Academy, Iași, Romania, $^{9}$Faculty of Medicine, University of Medicine and Pharmacy \"Grigore T. Popa\" Iași, Romania, $^{10}$CENEMED Platform for Interdisciplinary Research, \"Grigore T. Popa\" University of Medicine and Pharmacy of Iași, Romania, $^{11}$Preclinical Department, Apollonia University, Iași, Romania\nFunctional Cognitive Disorder (FCD), a condition marked by significant subjective cognitive complaints in the absence of identifiable neurological disease, is increasingly recognized as a distinct and underdiagnosed entity in clinical practice. This review synthesizes recent findings to clarify its diagnostic features, differentiate it from other cognitive syndromes such as mild cognitive impairment and dementia, and explore its psychological underpinnings. We examined longitudinal studies, meta-analyses, and clinical frameworks to identify patterns of symptom presentation, cognitive performance, and psychosocial factors. Findings reveal that FCD is characterized by inconsistent cognitive deficits, preserved functional independence, and heightened help-seeking behavior, often accompanied by anxiety, metacognitive dysfunction, and maladaptive beliefs about memory. Unlike neurodegenerative conditions, FCD follows a stable, non-progressive course and shows no evidence of conversion to dementia when accurately diagnosed. Enhanced clinical recognition and structured assessment approaches are crucial for improving diagnostic accuracy, minimizing patient distress, and avoiding unnecessary medical interventions. Further research is needed to standardize diagnostic criteria and develop targeted therapeutic strategies.", "doc_items_refs": ["#/texts/17", "#/texts/18"], "page_nos": [1], "uuid": "0b7885f2-ac9c-4e01-a42d-10107c411218"}
{"doc_id": "2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990.doctags", "chunk_id": 3, "source_chunk_idxs": [4, 5], "num_tokens": 445, "text": "KEYWORDS\nFunctional Cognitive Disorder, internal inconsistency, memory complaints, diagnosis, subjective cognitive decline, pseudodementia, metacognition, neuropsychiatry\n\n1 Introduction\nFunctional Cognitive Disorders are characterized by significant subjective cognitive complaints in the absence of corresponding objective neurological abnormalities typically associated with dementia or other neurodegenerative conditions (Ball et al., 2020; Stone et al., 2015; Marín-Medina et al., 2025; Poole et al., 2019). Increasingly recognized as the\ncognitive counterpart of FND reflects symptoms that are primarily driven by psychological mechanisms, attentional dysregulation, and impaired metacognition rather than structural brain pathology (Cabreira et al., 2023a; Pennington et al., 2019).\nDiagnostic ambiguity and terminological overlap remain common in clinical settings, often leading to confusion among healthcare professionals and distress for patients (Stone et al., 2015; Bailey et al., 2017). Labels such as Subjective Cognitive Decline (SCD), pseudodementia, or the colloquial \"worried well \" have historically been used to describe individuals presenting with cognitive complaints in the absence of identifiable neurodegenerative processes (Ball et al., 2020; Jessen et al., 2014). However, these terms lack etiological clarity and are frequently unsatisfactory for patients seeking a definitive explanation, often resulting in persistent anxiety and repeated consultations (Rahman-Filipiak et al., 2018).\nClinicians often face considerable challenges in distinguishing FCD from early presentations of MCI or dementia, since the symptoms often appear similar at first glance (Pennington et al., 2015; Cabreira et al., 2023b). Nonetheless, several distinguishing features have been consistently reported in recent research. These include internal inconsistency in cognitive test performance, preserved conversational fluency, a tendency for patients to attend appointments unaccompanied, and the presentation of detailed written notes documenting their cognitive concerns (Reuber et al., 2018; Bharambe and Larner, 2018; McWhirter et al., 2022).", "doc_items_refs": ["#/texts/20", "#/texts/22", "#/texts/25", "#/texts/26", "#/texts/27"], "page_nos": [1], "uuid": "3dbe476c-8d09-42c1-9e81-f6c4301489dc"}
{"doc_id": "2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990.doctags", "chunk_id": 4, "source_chunk_idxs": [6], "num_tokens": 209, "text": "1 Introduction\nAccurate recognition of FCD is of critical importance (McWhirter et al., 2022). Misdiagnosis may lead to unwarantied investigations, inappropriate treatments, and heightened patient anxiety. In contrast, a correct diagnosis offers reassurance and enables targeted interventions, including psychoeducation, cognitive-behavioral therapy, and metacognitive training, which have shown promise in improving patient outcomes (Teodoro et al., 2018; Bhome et al., 2022).\nDespite increasing clinical awareness, there remains a pressing need to standardize diagnostic frameworks, develop validated assessment tools, and promote a positive identification model rather than relying on exclusion (Ball et al., 2020; Cabreira et al., 2023b). This paper aims to clarify the concept of FCD, synthesize practical diagnostic strategies grounded in empirical evidence, and reinforce the view of FCD as a distinct, generally non-progressive clinical entity deserving of focused clinical attention and research.", "doc_items_refs": ["#/texts/28", "#/texts/29"], "page_nos": [1], "uuid": "08a80911-daed-4f07-af32-7b173969df15"}
{"doc_id": "2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990.doctags", "chunk_id": 5, "source_chunk_idxs": [7], "num_tokens": 359, "text": "2 Definition and diagnostic challenges\nFunctional Cognitive Disorder is increasingly recognized as the cognitive counterpart of FND, marked by prominent subjective cognitive complaints without corresponding objective evidence of\nAbbreviations: CBT, Cognitive-Behavioral Therapy; FCD, Functional Cognitive Disorder; FND, Functional Neurological Disorder; HADS, Hospital Anxiety and Depression Scale; MCI, Mild Cognitive Impairment; MME/MMSE, Mini-Mental State Examination; PHQ-15, Patient Health Questionnaire-15; MMQ, Multifactorial Memory Questionnaire; MoCA, Montreal Cognitive Assessment; MSVT, Medical Symptom Validity Test; PHQ-15, Patient Health Questionnaire-15; PSQI, Pittsburgh Sleep Quality Index; SCD, Subjective Cognitive Decline.\nneurological pathology (Ball et al., 2020; Pennington et al., 2019; Laukaityte and Laukaityte, 2024; Tamilson et al., 2025; Kemp et al., 2022). Unlike neurodegenerative conditions, the symptoms of FCD are believed to arise from psychological mechanisms, attentional dysfunction, and impaired metacognitive monitoring, rather than structural brain damage (Teodoro et al., 2018; Bhome et al., 2019).\nA defining diagnostic feature of FCD is internal inconsistency, whereby an individual's cognitive performance fluctuates significantly within the same domain or across tasks, often influenced by situational, emotional, or attentional factors (Ball et al., 2020; Wakefield et al., 2018; Silverberg and Rush, 2024). For example, individuals may demonstrate better delayed recall than immediate recall, or perform inconsistently across similar memory tasks, patterns atypical of progressive neurological diseases.", "doc_items_refs": ["#/texts/31", "#/texts/32", "#/texts/36", "#/texts/37"], "page_nos": [1], "uuid": "e5d17b4b-848f-4aee-b47f-727ba3b6aa33"}
{"doc_id": "2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990.doctags", "chunk_id": 6, "source_chunk_idxs": [8], "num_tokens": 503, "text": "2 Definition and diagnostic challenges\nFCD is frequently misclassified or conflated with related constructs such as SCD, pseudodementia, and the informal label \"worried well \" (Cabreira et al., 2023a; Jessen et al., 2014; McWhirter et al., 2022). While SCD broadly refers to individuals who report cognitive complaints in the absence of measurable impairment on neuropsychological tests, pseudodementia typically describes cognitive symptoms that emerge secondary to psychiatric disorders, particularly depression, and are considered potentially reversible with adequate treatment (Stone et al., 2015; RahmanFilipiak et al., 2018). However, these terms lack the specificity and explanatory power offered by the FCD framework, often leaving patients with lingering uncertainty about the cause and significance of their cognitive symptoms (Ball et al., 2020; Bailey et al., 2017).\nOne of the main challenges for clinicians is the distinguishing FCD from early presentations of MCI or dementia, due to the similarity of reported symptoms and the frequently normal findings on initial cognitive assessments (Cabreira et al., 2023a; Pennington et al., 2015). Despite this overlap, longitudinal studies and structured clinical observations suggest that FCD follows a stable, non-progressive course, distinguishing it from true neurodegenerative conditions (Poole et al., 2019; McWhirter et al., 2022; Schmidtke and Metternich, 2009).\nImportantly, misdiagnosis in either direction may have harmful consequences. Patients incorrectly labeled as having MCI can experience increased anxiety about developing dementia, which may further intensify subjective symptoms and negatively affect quality of life (Sabbagh et al., 2020; Edmonds et al., 2014; Voros et al., 2020). In contrast, individuals with undiagnosed FCD may undergo unnecessary investigations, receive inappropriate treatments, or lack access to appropriate psychological support (Ghadiri-Sani and Larner, 2013). This diagram (Figure 1) highlights the three major consequences of misdiagnosing FCD: (1) Increased Anxiety, reflecting the distress experienced by patients when diagnostic uncertainty reinforces fears of neurodegeneration; (2) Inappropriate Treatment, representing the risk of unwarranted pharmacological or therapeutic interventions aimed at misattributed conditions; and", "doc_items_refs": ["#/texts/38", "#/texts/39", "#/texts/40"], "page_nos": [1], "uuid": "2ec5efa0-9537-4bf3-b2f7-86208abfd07c"}
{"doc_id": "2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990.doctags", "chunk_id": 7, "source_chunk_idxs": [9, 10, 11, 12], "num_tokens": 476, "text": "2 Definition and diagnostic challenges\nIn response to these diagnostic complexities, recent expert consensus emphasizes the need for positive diagnostic criteria, including internal inconsistency, characteristic interactional\n&lt;!-- image --&gt;\nbehavior, and communication pattern, rather than relying solely on the exclusion of neurodegenerative disease ( Pennington et al., 2019 ; Reuber et al., 2018 ). This approach supports clearer clinical decision-making and empowers patients with a coherent, explanatory framework for their symptoms. Once a positive diagnosis of FCD has been established, clinical attention can turn to targeted therapeutic interventions, which are discussed in the following section.\n\n2.1. Related concepts and differential diagnosis\nFCD shares overlapping features with several cognitive conditions and distinguishing it from these is crucial for accurate diagnosis and effective management. Differential diagnosis requires a careful evaluation of phenomenology, longitudinal course, and psychological context.\n\n2.1.1 Subjective cognitive decline\nSCD refers to the perception of cognitive decline in the absence of objective deficits on testing ( Jessen et al., 2014 ). While some cases of SCD precede neurodegenerative disease, others, especially those with internal inconsistency and psychiatric comorbidities, align more closely with FCD ( Cabreira et al., 2023a; McWhirter et al., 2020 ). Unlike FCD, SCD often lacks the prominent metacognitive discrepancies or maladaptive attentional focus seen in functional presentations. A detailed clinical interview can help differentiate between SCD with preclinical Alzheimer ' s pathology and FCDrelated complaints.\n\n2.1.2 Pseudodementia\nThis older term refers to cognitive symptoms caused by depression or psychiatric disorders. Although pseudodementia can overlap with FCD, the latter is not solely attributable to mood disorders. FCD emphasizes the role of metacognitive dysfunction and cognitive-behavioral mechanisms rather than only affective disturbance ( Ball et al., 2020 ; Pennington et al., 2015 ). The concept of pseudodementia is falling out of favor due to its oversimplification. Contemporary approaches encourage viewing FCD as a distinct entity with its own cognitive-behavioral profile rather than a subset of depressive symptomatology.", "doc_items_refs": ["#/texts/41", "#/pictures/2", "#/texts/44", "#/texts/46", "#/texts/48", "#/texts/53"], "page_nos": [1], "uuid": "50a3c4ac-3cc3-47b3-baee-65ae418e0bce"}
{"doc_id": "2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990.doctags", "chunk_id": 8, "source_chunk_idxs": [13, 14], "num_tokens": 387, "text": "2.1.3 \" Worried well \"\nOften used dismissively, this term refers to cognitively intact individuals with high health anxiety. However, it lacks clinical utility and may invalidate genuine distress ( Ball et al., 2020 ; Bhome et al., 2022 ). Or example, memory complaints are relatively common among otherwise normal-functioning older adults and may reflect normal aging rather than pathology. Similarly, individuals with depression or anxiety may report cognitive problems that are consistent with their affective disorder or situational stressors, rather than indicating a distinct disorder. In such cases, the degree of complaint is not excessive, daily functioning is generally preserved, and cognitive test performance usually falls within normal limits ( Delis and Wetter, 2007 ). In contrast, individuals with FCD present with disproportionate and persistent cognitive complaints, often accompanied by internal inconsistency in performance, which distinguishes them from the so-called \" worried well. \" Thus, FCD provides a more respectful and clinically useful framework, allowing clinicians to move\nbeyond reassurance alone and offer targeted interventions, such as psychoeducation or cognitive restructuring, to address maladaptive beliefs and attentional biases (Ball et al., 2020; Bhome et al., 2022; Delis and Wetter, 2007).\n\n2.1.4 Cogniform disorder\nA proposed but not widely adopted term, Cogniform Disorder encompasses functional cognitive symptoms not explained by neurological disease. It overlaps conceptually with FCD and reflects ongoing efforts to formalize the diagnosis of functional memory syndromes (Pennington et al., 2015). Cogniform Disorder has been proposed as an analog to somatoform disorders for cognitive complaints. However, FCD offers a more nuanced model grounded in metacognitive theory and empirical findings from functional neuroimaging and behavioral studies.", "doc_items_refs": ["#/texts/55", "#/texts/58", "#/texts/60"], "page_nos": [1], "uuid": "dda9d4ea-9ffd-4825-8d2e-00c2d1fe3670"}
{"doc_id": "2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990.doctags", "chunk_id": 9, "source_chunk_idxs": [15], "num_tokens": 355, "text": "2.1.5 Functional neurological disorder\nFCD is increasingly recognized as the cognitive counterpart to FND. Both share features such as symptom inconsistency, non-progressive course, and associations with psychological distress and attentional dysregulation (Ball et al., 2020; Teodoro et al., 2018). Recognizing this relationship helps align FCD within the broader category of functional disorders. Integrating FCD into the functional disorder spectrum supports unified treatment approaches, such as neuropsychoeducation, attention retraining, and cognitive-behavioral therapy (CBT), across sensory, motor, and cognitive symptom domains. This also encourages multidisciplinary care and avoids fragmented diagnoses.\nAlthough FCD is not formally recognized as a distinct disorder in DSM-5-TR or ICD-11, it conceptually aligns with Functional Neurological Symptom Disorder (Conversion Disorder) in DSM5-TR and with Dissociative Neurological Symptom Disorder in ICD-11. This nosological linkage highlights the overlap between FCD and FND, particularly regarding symptom inconsistency, non-progressive course, and association with psychological distress. Positioning FCD within this broader spectrum facilitates diagnostic classification, guides management, and helps clinicians direct patients toward evidence-based interventions such as psychoeducation, CBT, or metacognitive training, while avoiding mislabeling as neurodegenerative disease. The lack of a formal diagnostic category for FCD underscores the need for international consensus and standardized clinical guidelines (Butler and Nicholson, 2024; Mavroudis et al., 2025; First et al., 2021).", "doc_items_refs": ["#/texts/62", "#/texts/63"], "page_nos": [1], "uuid": "c3ecd66b-f8de-43d9-931c-10061f2a0414"}
{"doc_id": "2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990.doctags", "chunk_id": 10, "source_chunk_idxs": [16], "num_tokens": 390, "text": "2.2 Management and treatment approaches\nCurrent approaches, including psychoeducation, CBT, and metacognitive training, aim to improve patients ' understanding of their cognitive symptoms, reduce maladaptive anxiety, and foster adaptive coping strategies (Bhome et al., 2019). Psychoeducation helps patients recognize the functional nature of their complaints, thereby reducing distress associated with perceived cognitive decline (Bhome et al., 2019; Wolstencroft, 2024). Psychoeducation\nis often considered the first-line intervention in FCD, helping patients reframe their symptoms as functional rather than neurodegenerative, which reduces health anxiety and catastrophic interpretations (Rueda-Lara et al., 2024). It also provides an explanatory model that normalizes variability and inconsistency in performance. Small observational studies suggest psychoeducation can lower distress and reduce unnecessary healthcare use, but controlled trials are still lacking (Ball et al., 2020; Bhome et al., 2019; Donker et al., 2009).\nCBT targets associated maladaptive beliefs, health-related anxiety, and behavioral avoidance, while metacognitive training specifically addresses distortions in self-monitoring, attention regulation, and memory appraisal that often exacerbate subjective cognitive complaints (McWhirter et al., 2020; Day and Thorn, 2022). Pilot studies and case series report improvements in anxiety, subjective cognitive complaints, and quality of life, though objective cognitive gains are less consistent. Evidence is limited by small samples, heterogeneous protocols, and short followup (Schmidtke and Metternich, 2009; McWhirter et al., 2020). MCT aims to improve self-monitoring, attention regulation, and memory appraisal, addressing mechanisms believed to sustain FCD (Larner, 2021).", "doc_items_refs": ["#/texts/65", "#/texts/69", "#/texts/70"], "page_nos": [1], "uuid": "f07a52fb-977d-4d05-bd33-0a58bc471b42"}
{"doc_id": "2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990.doctags", "chunk_id": 11, "source_chunk_idxs": [17], "num_tokens": 447, "text": "3 Clinical signs and diagnostic features\nRecognizing FCD in clinical practice hinges on identifying a set of characteristic features that reliably distinguish it from neurodegenerative conditions such as MCI and dementia. One of the most critical of these is internal inconsistency, the observation that a patient ' s cognitive performance varies significantly across time or contexts within the same cognitive domain, in a manner that is incompatible with structural brain disease and cannot be explained by metabolic changes or other medical conditions (Ball et al., 2020; Pennington et al., 2015). For instance, patients may demonstrate better delayed than immediate recall or maintain fluent conversational abilities while performing poorly on formal memory tasks, suggesting preserved cognitive capacity with context-dependent impairments in retrieval (Cabreira et al., 2023a; Teodoro et al., 2018). This pattern may reflect the influence of cognitive reserve, whereby premorbid intellectual ability, education, or other compensatory mechanisms allow individuals to maintain function despite underlying vulnerabilities (Pappalettera et al., 2024).\nA clinically useful operational set of diagnostic criteria for FCD has been proposed by Ball et al. (2020), which includes the following elements:\n- · One or more symptoms of impaired cognitive function;\n- · Evidence of functional impact, reflected in avoidance of cognitively demanding tasks of social situation, despite preserved objective performance;\n- · Evidence of internal inconsistency in performance;\n- · Symptoms not better explained by another medical, neurological, or psychiatric disorder;\n- · Symptoms that result in significant distress, impairment, or warrant clinical attention.\n- · Specify if with/without a linked co-morbidity.\nBeyond these core features, systematic reviews and diagnostic meta-analyses have identified additional behavioral and interactional clues that enhance diagnostic confidence. For example, individuals with FCD often present with a distinctive communication profile, characterized by greater fluency and coherence compared to patients with dementia. They frequently provide detailed, unsolicited examples of their cognitive complaints, reflecting preserved episodic memory and meta-awareness (Cabreira et al., 2023a; Reuber et al., 2018).", "doc_items_refs": ["#/texts/72", "#/texts/73", "#/texts/74", "#/texts/75", "#/texts/76", "#/texts/77", "#/texts/78", "#/texts/79", "#/texts/82"], "page_nos": [1], "uuid": "4f5b9187-e29d-4013-9e33-ead5abac6fda"}
{"doc_id": "2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990.doctags", "chunk_id": 12, "source_chunk_idxs": [18], "num_tokens": 404, "text": "3 Clinical signs and diagnostic features\nInteractional behaviors also offer important diagnostic cues (Elsey et al., 2015). Patients with FCD are more likely to attend appointments alone, bring structured written notes about their symptoms, and express high levels of concern, often in contrast to dementia patients, who are commonly accompanied by caregivers who contribute substantively to the clinical narrative (Bharambe and Larner, 2018; McWhirter et al., 2022; Wakefield et al., 2018). One particularly specific marker is the absence of the \"head-turning sign,\" the behavior of looking toward a caregiver for assistance during memory testing, a behavior frequently seen in dementia but rarely in FCD (Ghadiri-Sani and Larner, 2013; Soysal et al., 2017).\nThe presence of psychiatric comorbidities, particularly anxiety and depression, is another significant clinical correlate. While FCD is not solely attributable to affective disorders, these comorbidities can contribute to the development and persistence of functional cognitive symptoms (Bhome et al., 2022; McWhirter et al., 2020).\nIn an observational study, Teodoro et al. (2023) found that patients with FCD spoke for a median of 124 s when describing their memory concerns, markedly longer than the 42-s median in patients with neurodegenerative diagnoses. This verbosity and richness of description suggest preserved verbal fluency and attentional resources, further supporting the functional nature of the disorder.\nTo enhance diagnostic precision, quantitative tools and structured assessment scales have been developed. The Schmidtke Criteria, in particular, provide a standardized framework with predictive value for non-progression. Other validated questionnaires are detailed in Section 7.4 (Cabreira et al., 2023a; Schmidtke and Metternich, 2009; Mascherek et al., 2015).", "doc_items_refs": ["#/texts/83", "#/texts/84", "#/texts/85", "#/texts/86"], "page_nos": [1], "uuid": "5988fc4c-1f6d-4580-8cbe-4d7e6ae1271a"}
{"doc_id": "2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990.doctags", "chunk_id": 13, "source_chunk_idxs": [19, 20], "num_tokens": 387, "text": "3 Clinical signs and diagnostic features\nUltimately, the diagnosis of FCD should rest on positive identification of these distinctive features rather than exclusion of organic disease alone (Cabreira et al., 2023b; Van Patten and Bellone, 2023). Careful attention to narrative coherence, metacognitive markers, and psychosocial context allows clinicians to deliver a confident, compassionate diagnosis. This approach not only prevents inappropriate escalation to dementia care pathways but also supports timely psychological intervention and improves overall patient outcomes (Ball et al., 2020; Bhome et al., 2022).\n\n4 Communication patterns and interactional profiles\nDistinctive communication styles and interpersonal behaviors are central to the clinical recognition of FCD (Pennington et al., 2015). Unlike individuals with neurodegenerative conditions such as Alzheimer ' s disease, patients with FCD typically exhibit preserved or even enhanced verbal fluency\nduring consultations. These communication features serve as positive diagnostic clues, offering contrast to the vague, hesitant, or under-detailed responses often observed in patients with early dementia (Reuber et al., 2018; Bhome et al., 2022).\nA hallmark characteristic of FCD is the patient ' s ability to provide detailed, unsolicited examples of perceived cognitive failures, such as forgetting appointments or losing track of tasks, which are often described in vivid narrative form (Pennington et al., 2015). This suggests not only intact episodic memory but also heightened meta-awareness of perceived lapses (Teodoro et al., 2023). In contrast, individuals with neurodegenerative conditions frequently rely on generalities, require assistance from informants, or are unable to specify the nature or context of their complaints (Pennington et al., 2015; McWhirter et al., 2020).\nKey communication-based features include:", "doc_items_refs": ["#/texts/87", "#/texts/89", "#/texts/93", "#/texts/94", "#/texts/95"], "page_nos": [1], "uuid": "9f02fca5-ce54-4005-beba-2d82987c2221"}
{"doc_id": "2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990.doctags", "chunk_id": 14, "source_chunk_idxs": [21], "num_tokens": 455, "text": "4 Communication patterns and interactional profiles\n- · Longer response duration: In a study by Teodoro et al. (2023), individuals with FCD spoke for a median of 124 s when describing their cognitive concerns, significantly longer than the 42 s observed in patients with neurodegenerative disorders. This verbosity may reflect intact working memory and linguistic fluency, characteristics inconsistent with progressive dementia.\n- · Higher volume and breadth of complaints: Patients with FCD often report difficulties across multiple cognitive domains, memory, attention, word-finding, multitasking, which may indicate heightened vigilance to normal cognitive fluctuations rather than true multidomain cognitive impairment (Ball et al., 2020; Bhome et al., 2022).\n- · \" Attending alone \" behavior: A notable feature in FCD populations is the tendency to arrive unaccompanied at clinical appointments. These patients often bring written summaries or bullet-pointed notes detailing their concerns, behaviors seldom observed in individuals with dementia, who are frequently accompanied by family members who provide collateral information and support (Ball et al., 2020; Reuber et al., 2018).\n- · Absence of the \" head-turning sign \" : In neurodegenerative conditions, patients often glance toward caregivers for reassurance or help during cognitive testing, a behavior that is rare in FCD, further reinforcing the functional, rather than organic, nature of their symptoms (Ghadiri-Sani and Larner, 2013).\nThese interactional features and preserved communication abilities underscore the non-progressive nature of FCD and support a positive diagnostic approach that emphasizes what is present, such as coherence, meta-awareness, and social fluency, rather than focusing solely on what is absent (Reuber et al., 2018; Teodoro et al., 2018).\nRecognizing and interpreting these subtle conversational and interpersonal markers requires clinical experience and active listening. However, when used systematically, these features can empower clinicians to move beyond diagnostic exclusion, providing patients with clearer explanations, targeted interventions, and relief from diagnostic uncertainty (Ball et al., 2020; Cabreira et al., 2023b).", "doc_items_refs": ["#/texts/96", "#/texts/97", "#/texts/98", "#/texts/99", "#/texts/100", "#/texts/101"], "page_nos": [1], "uuid": "4922a243-bbe7-4b79-8bc8-2412a7c02d30"}
{"doc_id": "2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990.doctags", "chunk_id": 15, "source_chunk_idxs": [22], "num_tokens": 261, "text": "5 Metacognition and psychological factors\nA growing body of research indicates that impaired metacognition and psychological distress are central to the pathophysiology of FCD. Metacognition, the ability to monitor, reflect upon, and evaluate one ' s cognitive performance, is often dysfunctional in individuals with FCD. This metacognitive dysfunction contributes to increased self-monitoring, hyperawareness, and misinterpretation of normal cognitive fluctuations as pathological decline (Ball et al., 2020; Bhome et al., 2022; McWhirter et al., 2020).\nOne key psychological trait frequently observed in FCD is memory perfectionism, whereby individuals hold unrealistically high standards for their memory performance. Even minor forgetfulness is viewed as unacceptable and alarming, fostering a sense of cognitive failure (Pennington et al., 2015; Picon et al., 2022). This perfectionism may drive hypervigilant attentional styles, wherein patients monitor their memory processes excessively, paradoxically worsening their subjective experience of dysfunction (Ball et al., 2020; Teodoro et al., 2018).\nSeveral cognitive-affective biases are commonly associated with FCD (Table 1):", "doc_items_refs": ["#/texts/105", "#/texts/106", "#/texts/107"], "page_nos": [1], "uuid": "f0a4c9be-4dd8-4239-925b-b996d8966e39"}
{"doc_id": "2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990.doctags", "chunk_id": 16, "source_chunk_idxs": [23], "num_tokens": 397, "text": "5 Metacognition and psychological factors\n- · Impaired metacognitive ability: Patients with FCD often overestimate their cognitive deficits, even in the context of normal or near-normal neuropsychological test results. They may misattribute benign lapses to serious dysfunction, due in part to poor calibration between subjective experiences and objective performance (Ball et al., 2020; Bhome et al., 2022).\n- · Negative interpretation bias: Individuals with FCD may selectively attend to episodes of forgetfulness and interpret them as signs of progressive brain disease, reinforcing anxiety and worry (Bhome et al., 2022)\n- · Memory-related anxiety and societal expectations: Cultural narratives and personal beliefs about aging or family history of dementia can exacerbate memory-related fears. Many patients report assuming that cognitive decline is inevitable, thereby interpreting normal lapses as harbors of irreversible decline (Teodoro et al., 2023).\n- · Cogniphobia: This term describes the avoidance of cognitively demanding situations due to fear of failure or embarrassment. Patients with FCD may reduce engagement in work or social settings, limiting opportunities to challenge maladaptive beliefs and perpetuating functional impairment (Ball et al., 2020; Cabreira et al., 2023a).\nThese cognitive and emotional dynamics create a selfperpetuating cycle in which excessive self-focus, distress, and avoidance reinforce the salience and persistence of cognitive complaints. Encouragingly, targeted psychological interventions such as CBT, which aim to address metacognitive beliefs, reduce avoidance, and promote adaptive thinking, have shown promising outcomes in this population (Cabreira et al., 2023a; Bhome et al., 2022).\nIt is important to distinguish metacognitive deficits from insight: while patients with FCD may exhibit metacognitive", "doc_items_refs": ["#/texts/108", "#/texts/109", "#/texts/110", "#/texts/111", "#/texts/112", "#/texts/113"], "page_nos": [1], "uuid": "9dd12682-695a-4c86-8482-3146f6cf2fb4"}
{"doc_id": "2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990.doctags", "chunk_id": 17, "source_chunk_idxs": [24], "num_tokens": 231, "text": "5 Metacognition and psychological factors\ninterference affecting their task performance, they can still retain good insight, often providing detailed, coherent accounts of their perceived cognitive difficulties (Wolstencroft, 2024; Larner, 2021). Mood and anxiety disorders are commonly comorbid with FCD. Although they may intensify cognitive concerns, FCD should not be viewed merely as a manifestation of affective disturbance. Rather, it constitutes a distinct clinical entity that overlaps with but is not reducible to depression or generalized anxiety disorder (Cabreira et al., 2023a; McWhirter et al., 2020). The presence of psychiatric comorbidities should be regarded as diagnostically informative, helping clinicians contextualize symptom development and persistence.\nUltimately, understanding the psychological architecture of FCD provides both explanatory insight and therapeutic direction. Shifting the clinical narrative away from structural pathology and toward dysfunctional self-appraisal, maladaptive illness beliefs, and metacognitive dysregulation allows clinicians to offer patients a hopeful and scientifically grounded explanation of their symptoms.", "doc_items_refs": ["#/texts/117", "#/texts/118"], "page_nos": [1], "uuid": "c76947e0-4473-4283-b1de-e914d704042a"}
{"doc_id": "2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990.doctags", "chunk_id": 18, "source_chunk_idxs": [25], "num_tokens": 479, "text": "6 Long-term outcomes\nUnderstanding the long-term trajectory of FCD is crucial for differentiating it from progressive neurodegenerative conditions, including MCI and dementia. One of the most common concerns among patients diagnosed with FCD is the fear that their cognitive symptoms represent the early stages of an irreversible decline. This anxiety is often intensified by diagnostic uncertainty and the overlap in early clinical presentations with neurodegenerative syndromes (Ball et al., 2020; Cabreira et al., 2023a). Long-term follow-up studies indicate that individuals with FCD typically maintain preserved daily functioning and independence over months to years, with objective performance remaining within normal limits. In a Brazilian tertiary memory clinic with loweducation patients, around one-third of referrals were diagnosed with FCD, who also showed preserved cognitive performance despite higher subjective complaints (Pennington et al., 2019; Borelli et al., 2022; Schwilk et al., 2021).\nIt is important to note that FCD is defined by subjective cognitive complaints without consistent neurological signs (Cabreira et al., 2023a). Minor variations in neuropsychological test results may occasionally occur but do not correspond to specific neuroanatomical patterns and remain within normal limits. This feature distinguishes FCD from both SCD and neurodegenerative disorders.\nHowever, longitudinal studies increasingly support the view that FCD is generally a stable, non-progressive condition, with most individuals maintaining consistent cognitive functioning over time (Bhome et al., 2022; McWhirter et al., 2020). One of the most compelling studies in this domain is a 10-year prospective followup involving individuals with SCD. Within this cohort, 31 out of 41 patients ( ∼ 76%) who met criteria for FCD based on the Schmidtke inventory did not progress to MCI or dementia throughout the follow-up period (Cabreira et al., 2023a; Schmidtke and Metternich, 2009). This suggests that the use of structured, symptom-based criteria such as the Schmidtke scale may offer strong predictive validity in identifying individuals at low risk for neurodegeneration.\n\nTABLE 1 Psychological features and metacognitive distortions in functional cognitive disorder.", "doc_items_refs": ["#/texts/120", "#/texts/121", "#/texts/122", "#/texts/125", "#/tables/0"], "page_nos": [1], "uuid": "c1f88394-7591-4e68-bc13-78d1da19f2b2"}
{"doc_id": "2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990.doctags", "chunk_id": 19, "source_chunk_idxs": [26], "num_tokens": 512, "text": "6 Long-term outcomes\n| Feature                      | Description                                                               | Clinical relevance                                                                    |\n|------------------------------|---------------------------------------------------------------------------|---------------------------------------------------------------------------------------|\n| Impaired metacognition       | Difficulty accurately monitoring or evaluating cognitive performance.     | leads to overestimation of deficits despite intact objective testing.                 |\n| Memory perfectionism         | Unrealistically high standards for memory functioning.                    | Fosters hypervigilance and misinterpretation of benign lapses as pathological.        |\n| Negative interpretation bias | Tendency to selectively attend to and catastrophize normal forgetfulness. | Reinforces anxiety and distress about cognitive health.                               |\n| Memory-related anxiety       | Fear of inevitable decline due to aging or genetic predisposition.        | Increases symptom salience and promotes maladaptive beliefs.                          |\n| Cogniphobia                  | Avoidance of cognitively demanding activities.                            | Reduces exposure to corrective experiences, reinforcing dysfunctional beliefs.        |\n| Psychiatric comorbidity      | Co-occurrence of anxiety, depression, or trauma history.                  | May perpetuate or exacerbate cognitive complaints but does not account for FCD alone. |\n| Impaired metacognition       | Difficulty accurately monitoring or evaluating cognitive performance.     | leads to overestimation of deficits despite intact objective testing.                 |\n| Memory perfectionism         | Unrealistically high standards for memory functioning.                    | Fosters hypervigilance and misinterpretation of benign lapses as pathological.        |\n| Negative interpretation bias | Tendency to selectively attend to and catastrophize normal forgetfulness. | Reinforces anxiety and distress about cognitive health.                               |", "doc_items_refs": ["#/tables/0"], "page_nos": [1], "uuid": "c1fe21d6-59ea-46e4-88e4-235a02f72c7d"}
{"doc_id": "2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990.doctags", "chunk_id": 20, "source_chunk_idxs": [27], "num_tokens": 453, "text": "6 Long-term outcomes\n| Memory-related anxiety       | Fear of inevitable decline due to aging or genetic predisposition.        | Increases symptom salience and promotes maladaptive beliefs.                          |\n| Cogniphobia                  | Avoidance of cognitively demanding activities.                            | Reduces exposure to corrective experiences, reinforcing dysfunctional beliefs.        |\nBy contrast, dementia and mild cognitive impairment are characterized by a progressive trajectory, with cognitive decline that correlates with neuroimaging or biomarker changes and produces consistent impairments across domains. Whereas, individuals with FCD typically maintain preserved daily functioning and show intraindividual variability without progression, patients with dementia demonstrate a steady deterioration of memory, executive function, and independence (Ball et al., 2021). Importantly, anosognosia, reduced awareness of deficits, is common in dementia, while individuals with FCD tend to exhibit heightened symptom awareness and distress (Larner, 2021). These prognostic distinctions reinforce the clinical utility of recognizing FCD as a non-degenerative condition (Cabrêira et al., 2023b).\nThese findings underscore the clinical value of making a positive diagnosis of FCD, rather than one based on exclusion. When clearly communicated, such a diagnosis can provide significant reassurance to patients, shift the therapeutic focus away from unnecessary diagnostic testing, and redirect care toward more appropriate psychological and rehabilitative strategies, such as cognitive-behavioral therapy or metacognitive training (Ball et al., 2020; Bhome et al., 2022).\nNevertheless, FCD is not a monolithic condition. Heterogeneity exists in clinical presentations and outcomes. While many individuals demonstrate cognitive stability or spontaneous improvement, others may experience persistent distress, often linked to unresolved psychological factors, comorbid anxiety or depression, or entrenched maladaptive beliefs about cognitive functioning (Pennington et al., 2015; Picon et al., 2022). In most cases, symptoms initially attributed to FCD remain stable, with no progression to neurodegenerative disorders observed over the follow-up period. In the cohort studied by Wakefield et al. (2018),", "doc_items_refs": ["#/tables/0", "#/texts/126", "#/texts/127", "#/texts/128"], "page_nos": [1], "uuid": "68d84fb3-46b0-4aa7-b4fb-3442876f8494"}
{"doc_id": "2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990.doctags", "chunk_id": 21, "source_chunk_idxs": [28], "num_tokens": 246, "text": "6 Long-term outcomes\nnone of the 20 FMD patients progressed to MCI or dementia, highlighting the typically benign and non-progressive course of the disorder. Only in the wider literature have rare cases been reported, which may reflect diagnostic uncertainty or true comorbidity (Ball et al., 2020; Wakefield et al., 2018).\nRecent models conceptualize FCD as existing along a spectrum, ranging from brief, reversible episodes of cognitive dysfunction to more chronic and impairing functional syndromes (Ball et al., 2020; Teodoro et al., 2018). Crucially, this variability in presentation does not imply inevitable progression, but rather highlights the importance of individualized, longitudinal care and periodic reassessment when new clinical features emerge.\nIn practice, communicating the typically benign prognosis of FCD can be transformative for patients. It not only alleviates anxiety but also promotes better engagement with psychological therapies and supportive interventions. Moreover, it prevents premature entry into dementia care pathways, thus reducing unnecessary medicalization and reinforcing the functional nature of the condition (Cabrêira et al., 2023a; McWhirter et al., 2020).", "doc_items_refs": ["#/texts/132", "#/texts/133", "#/texts/134"], "page_nos": [1], "uuid": "8c558d36-640f-4639-9739-33fe497c665a"}
{"doc_id": "2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990.doctags", "chunk_id": 22, "source_chunk_idxs": [29], "num_tokens": 285, "text": "7 Assessment methods\nDiagnosing FCD requires a multimodal clinical approach that combines careful interviewing, observational data, formal neuropsychological testing, and validated structured tools (Figure 2). Unlike neurodegenerative disorders, where imaging, cerebrospinal fluid biomarkers, or genetic testing may support the diagnosis, FCD remains a clinical diagnosis, centered on the identification of positive features and the exclusion of progressive pathology. Positive features include internal inconsistency in\n&lt;!-- image --&gt;\ncognitive performance, preserved functional independence, distinctive communication and interactional behaviors, and metacognitive markers such as memory perfectionism or heightened self-monitoring (Ball et al., 2020; Cabreira et al., 2023a; Bhome et al., 2022; Larner, 2021; Teodoro et al., 2023).\nVarious assessment methods contribute uniquely to the diagnostic process of FCD, as outlined in Table 2. These include neuropsychological testing to evaluate cognitive domains, brief cognitive screening instruments, medical symptom validity tests, structure self-report questionnaires, interactional and conversational assessments, structured psychiatric interviews the MINI, and standardized symptom-based frameworks like the Schmidtke Criteria. Together, these approaches provide complementary information that strengthens diagnostic confidence in functional cognitive presentations.", "doc_items_refs": ["#/texts/136", "#/pictures/3", "#/texts/139", "#/texts/140"], "page_nos": [1], "uuid": "48b312d9-1dcf-4586-ae0c-a62a3c147afe"}
{"doc_id": "2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990.doctags", "chunk_id": 23, "source_chunk_idxs": [30, 31, 32, 33], "num_tokens": 476, "text": "7.1 Neuropsychological testing\nFormal neuropsychological assessments are essential to evaluate cognitive domains such as memory, attention, language, and executive functioning. In FCD, testing often reveals normal or inconsistently impaired results, with patterns that do not conform to known neuroanatomical distributions (Ball et al., 2020; Wakefield et al., 2018). A typical red flag is a discrepancy between severe subjective complaints, defined as self-reported cognitive difficulties that significantly interfere with daily functioning or cause marked distress, and relatively intact objective performance in standardized neuropsychological tests (often within 0 -1 standard deviation of normative values) (Ball et al., 2020; Pennington et al., 2015; Teodoro et al., 2023; Zamarian et al., 2015; Baker et al., 2018). Moreover, FCD patients may demonstrate intact performance on tasks requiring automatic processing, while\nunderperforming on tasks perceived as cognitively demanding, highlighting the role of metacognitive interference.\n\n7.2 Cognitive screening instruments\nBrief cognitive screeners like the Montreal Cognitive Assessment (MoCA) and Mini-Mental State Examination (MMSE) are commonly used as initial tools. While not specific to FCD, normal performance on these tests, when paired with marked self-reported deficits, should raise clinical suspicion for a functional etiology (Larner, 2014, 2005). When such a discrepancy is present, clinicians should consider a functional etiology, especially in the absence of progressive decline.\n\n7.3 Medical symptom validity tests (MSVT)\nPerformance validity tests such as the MSVT can help assess effort and test-taking consistency. In FCD, suboptimal performance is not necessarily indicative of malering, but may instead reflect attentional disruption, anxiety, or metacognitive interference (Pennington et al., 2015; Picon et al., 2022). Interpretation requires clinical nuance and compassion, recognizing that metacognitive interference, rather than intentional deception, often underlies these results.\n\n7.4 Structured questionnaires\nSeveral validated self-report tools support the diagnosis of FCD and help assess common psychological comorbidities:\n\nTABLE 2 Assessment tools and diagnostic aids in functional cognitive disorder.", "doc_items_refs": ["#/texts/142", "#/texts/146", "#/texts/148", "#/texts/150", "#/texts/152", "#/texts/155", "#/tables/1"], "page_nos": [1], "uuid": "00c5b7d7-a43c-4148-b185-5999dbd0206d"}
{"doc_id": "2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990.doctags", "chunk_id": 24, "source_chunk_idxs": [34], "num_tokens": 479, "text": "7.4 Structured questionnaires\n| Assessment method                           | Purpose                                                                     | Key diagnostic contribution                                                                                                                                                          | Limitation                                                                       | References                                                       |\n|---------------------------------------------|-----------------------------------------------------------------------------|--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|----------------------------------------------------------------------------------|------------------------------------------------------------------|", "doc_items_refs": ["#/tables/1"], "page_nos": [1], "uuid": "7cf7efaf-87da-40a5-b9d4-cc53d1d538bc"}
{"doc_id": "2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990.doctags", "chunk_id": 25, "source_chunk_idxs": [35], "num_tokens": 479, "text": "7.4 Structured questionnaires\n| Neuropsychological testing                  | Evaluates cognitive domains (e.g., memory, attention).                      | Reveals normal or inconsistent impairments not aligning with neuroanatomical patterns; identifies red flags like discrepancy between subjective complaints and objective performance | May not capture subtle functional deficits; time-consuming                       | Ball et al., 2020; Wakefield et al., 2018; Zamarian et al., 2015 |\n| MoCA/MMSE                                   | Brief cognitive screening tools.                                            | Quick administration; identifies normal vs. abnormal performance; highlights discrepancy with subjective complaints                                                                  | Limited specificity for FCD; may miss subtle cognitive fluctuations              | Larner, 2014, 2005                                               |\n| Medical symptom validity tests              | Tests response consistency and effort.                                      | Helps identify attentional interference or metacognitive disruption rather than malingering.                                                                                         | Requires careful interpretation; may be affected by anxiety                      | Pennington et al., 2015; Picon et al., 2022                      |\n| PHQ-15                                      | Questionnaires assessing somatic symptoms, mood, sleep, and memory beliefs. | Elevated scores without objective deficits support functional diagnosis.                                                                                                             | Does not assess cognition directly                                               | Mascherek et al., 2011                                           |\n| HADS                                        | Measures somatic                                                            | Captures bodily hypervigilance; identifies functional overlay                                                                                                                        | Does not assess cognition directly                                               | Ball et al., 2020                                                |\n| PSQI                                        | Evaluates sleep disturbances                                                | Highlights contributing/perpetuating factors for cognitive complaints                                                                                                                | Self-report; may not capture objective sleep quality                             | Tarik Elhadd, 2018                                               |\n| MMQ                                         | Explores beliefs about memory and perceived control                         | Provides insight into dysfunctional metacognition; supports psychological formulation                                                                                                | Self-report; cultural differences may influence results                          | Pennington et al., 2015                                          |\n| Interactional and conversational assessment | Observation of communication patterns and symptom narratives.               | Features like verbosity; coherence, and \"attending alone\" behavior support FCD.                                                                                                      | Requires trained observer; subjective interpretation                             | Reuber et al., 2018; Teodoro et al., 2023                        |\n| MINI interview                              | Structured psychiatric interview.                                           | Identifies comorbid depression, anxiety, trauma; guides treatment planning                                                                                                           | Time-consuming; requires trained                                                 | McWhirter et al., 2020                                           |", "doc_items_refs": ["#/tables/1"], "page_nos": [1], "uuid": "2484a92a-9751-4476-a909-3b2992d6becc"}
{"doc_id": "2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990.doctags", "chunk_id": 26, "source_chunk_idxs": [36], "num_tokens": 376, "text": "7.4 Structured questionnaires\n| Schmidtke criteria                          | Symptom-based inventory.                                                    | Standardized framework; predictive validity for non-progression; supports structured clinical decision-making                                                                        | Limited to memory-focused complaints; may not capture broader cognitive symptoms | Pennington et al., 2019; Schmidtke and Metternich, 2009          |\nHADS, Hospital Anxiety and Depression Scale; FCD, Functional Cognitive Disorder; MMQ. Multifactorial Memory Questionnaire; MMSE, Mini-Mental State Examination; MoCA, Montreal Cognitive Assessment; PHQ-15, Patient Health Questionnaire-15; PSQI, Pittsburgh Sleep Quality Index.\n- · Patient Health Questionnaire-15 (PHQ-15): Assesses the severity of somatic symptoms, often elevated in FCD due to bodily hypervigilance and health anxiety (Mascherek et al., 2011);\n- · Hospital Anxiety and Depression Scale (HADS): Screens for anxiety and depressive symptoms, which frequently co-occur with FCD and modulate symptom perception (Ball et al., 2020).\n- · Pittsburgh Sleep Quality Index (PSQI): Evaluates sleep disturbances, which are both risk factors and perpetuating elements in functional cognitive complaints (Tarik Elhadd, 2018);\n- · Multifactorial Memory Questionnaire (MMQ): Explores beliefs about memory and perceived control, providing insight into dysfunctional metacognitive frameworks common in FCD (Pennington et al., 2015);\nHigh scores on these instruments, particularly in the absence of objective cognitive impairment, support the functional nature of the cognitive complaints and help identify psychological contributors to the patient's experience. Although these questionnaires assess somatic or affective symptoms rather than cognitive performance directly, they offer valuable context for understanding functional cognitive difficulties.", "doc_items_refs": ["#/tables/1", "#/texts/156", "#/texts/157", "#/texts/158", "#/texts/159", "#/texts/163", "#/texts/164"], "page_nos": [1], "uuid": "1318851d-8178-4bf2-a65d-2d7591605354"}
{"doc_id": "2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990.doctags", "chunk_id": 27, "source_chunk_idxs": [37], "num_tokens": 340, "text": "7.5 Interactional and conversational assessment\nPatients ' speech patterns and interpersonal behavior can be diagnostically informative. Tools developed by Reuber et al. (2018) and Teodoro et al. (2023) measure features such as narrative coherence, verbosity, and spontaneous detail, which help differentiate FCD from organic cognitive decline. For instance, patients with FCD often provide long, detailed accounts of their symptoms, demonstrating preserved verbal fluency and insight. To illustrate how these communication profiles manifest in clinical practice, consider the following brief examples (Cabeira et al., 2025):\nCase 1: A 64-year-old retired woman presents alone to the clinic, reporting frequent forgetfulness, although she can recall information moments later. During the consultation, she provides coherent, detailed accounts of her memory lapses and brings written notes. Neurological examination and bedside cognitive testing are unremarkable. This case illustrates the application of FCD criteria: subjective cognitive complaints, preserved objective performance, associated anxiety, and characteristic communicative behaviors (Picon et al., 2022).\nCase 2: A 44-year-old university teacher reports being easily distractible but now feels her memory is \" worse than \" ever, \" particularly during meetings. Colleagues have not noticed these difficulties. She attends the clinic alone. Neurological examination and bedside cognitive testing are unremarkable, with slightly slower immediate recall but preserved delayed recall. This vignette demonstrates the role of metacognitive interference and attentional dysregulation in functional cognitive complaints, highlighting how preserved objective performance can coexist with significant subjective impairment (Ball et al., 2020).", "doc_items_refs": ["#/texts/168", "#/texts/169", "#/texts/170"], "page_nos": [1], "uuid": "4724f290-294a-44b1-b0bc-fd755d84d1df"}
{"doc_id": "2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990.doctags", "chunk_id": 28, "source_chunk_idxs": [38, 39], "num_tokens": 216, "text": "7.6 Mini International Neuropsychiatric Interview (MINI)\nThe MINI is a structured diagnostic interview designed to identify psychiatric comorbidities including mood, anxiety, and somatoform disorders. Given the high prevalence of such conditions in individuals with FCD, the MINI provides a valuable adjunct to cognitive testing. Identifying underlying or comorbid psychology is essential for effective treatment planning and for understanding the broader context of the patients ' cognitive symptoms (Mavroudis et al., 2025).\n\n7.7 The Schmidtke criteria\nThis 10-item inventory was designed to aid in diagnosing functional memory disorder by evaluating symptom inconsistency, preserved daily function, and distress. Its predictive validity for identifying patients unlikely to progress to dementia has been demonstrated in long-term follow-up studies (Cabeira et al., 2023a; Schmidtke and Metternich, 2009).\nTheir use encourages a structured approach to differentiating functional memory complaints from early neurocognitive disorders and provides support for clinical decision-making.", "doc_items_refs": ["#/texts/172", "#/texts/174", "#/texts/178"], "page_nos": [1], "uuid": "12f2408c-0931-476c-90bf-672974ec3ac0"}
{"doc_id": "2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990.doctags", "chunk_id": 29, "source_chunk_idxs": [40, 41], "num_tokens": 449, "text": "8 Conclusion\nFunctional Cognitive Disorder represents an increasingly recognized but still underdiagnosed condition within the spectrum of cognitive disorders. Characterized by genuine cognitive complaints in the absence of progressive neurological pathology, FCD challenges traditional diagnostic paradigms, which often rely heavily on exclusion. However, emerging evidence highlights the presence of positive diagnostic features, such as internal inconsistency, distinct communication styles, and preserved interactional profiles, that support a confident clinical diagnosis.\nDifferentiating FCD from conditions like mild cognitive impairment, dementia, and pseudodementia is essential. Misclassification not only leads to inappropriate investigations and management strategies but can also heighten patient distress and reinforce maladaptive illness beliefs. In contrast, a timely and accurate diagnosis of FCD can provide significant reassurance and guide individuals toward evidencebased psychological interventions that target metacognitive dysfunction, memory-related anxiety, and associated behavioral avoidance.\nLongitudinal data support the view of FCD as a nonprogressive condition for most individuals, with stable cognitive trajectories over time. These findings, alongside tools such as the Schmidtke criteria and structured conversational profiling, offer clinicians robust strategies for identifying FCD in memory clinic populations.\nDespite these advances, FCD remains an underresearched area. Further work is needed to refine diagnostic criteria, validate assessment tools, and develop tailored treatment pathways. Moreover, there is a pressing need for an international consensus on diagnostic criteria and the development of specific clinical guidelines, given the significant impact of accurate diagnosis on patient outcomes. Recognizing FCD as a legitimate and treatable clinical entity is essential for improving patient care, reducing stigma.\n\nAuthor contributions\nIM: Conceptualization, Data curation, Formal analysis, Funding acquisition, Investigation, Methodology, Project administration, Resources, Software, Supervision, Validation, Visualization, Writing - original draft, Writing - review &amp; editing. FP: Conceptualization, Data curation, Formal analysis, Funding acquisition, Investigation, Methodology, Project administration, Resources, Software, Supervision, Validation, Visualization, Writing - original draft, Writing - review &amp; editing. KF: Conceptualization, Data curation, Formal analysis, Funding acquisition, Investigation, Methodology, Project administration,", "doc_items_refs": ["#/texts/180", "#/texts/181", "#/texts/182", "#/texts/183", "#/texts/185"], "page_nos": [1], "uuid": "a2ac3ddd-27f4-454b-8615-006752661026"}
{"doc_id": "2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990.doctags", "chunk_id": 30, "source_chunk_idxs": [42], "num_tokens": 490, "text": "Author contributions\nResources, Software, Supervision, Validation, Visualization, Writing -original draft, Writing -review &amp; editing. MV: Conceptualization, Data curation, Formal analysis, Funding acquisition, Investigation, Methodology, Project administration, Resources, Software, Supervision, Validation, Visualization, Writing -original draft, Writing -review &amp; editing. VR: Conceptualization, Data curation, Formal analysis, Funding acquisition, Investigation, Methodology, Project administration, Resources, Software, Supervision, Validation, Visualization, Writing -original draft, Writing -review &amp; editing. VB: Conceptualization, Data curation, Formal analysis, Funding acquisition, Investigation, Methodology, Project administration, Resources, Software, Supervision, Validation, Visualization, Writing -original draft, Writing -review &amp; editing. AC: Conceptualization, Data curation, Formal analysis, Funding acquisition, Investigation, Methodology, Project administration, Resources, Software, Supervision, Validation, Visualization, Writing -original draft, Writing -review &amp; editing. BN: Conceptualization, Data curation, Formal analysis, Funding acquisition, Investigation, Methodology, Project administration, Resources, Software, Supervision, Validation, Visualization, Writing -original draft, Writing -review &amp; editing. ID: Conceptualization, Data curation, Formal analysis, Funding acquisition, Investigation, Methodology, Project administration, Resources, Software, Supervision, Validation, Visualization, Writing -original draft, Writing -review &amp; editing. MH: Conceptualization, Data curation, Formal analysis, Funding acquisition, Investigation, Methodology, Project administration, Resources, Software, Supervision, Validation, Visualization, Writing -original draft, Writing -review &amp; editing. EB: Conceptualization, Data curation, Formal analysis, Funding acquisition, Investigation, Methodology, Project administration, Resources, Software, Supervision, Validation, Visualization, Writing -original draft, Writing -review &amp; editing. CA: Conceptualization, Data curation, Formal analysis, Funding acquisition, Investigation, Methodology, Project administration, Resources, Software, Supervision, Validation, Visualization, Writing -original draft, Writing -review &amp; editing. DK: Conceptualization, Data curation, Formal analysis, Funding acquisition, Investigation, Methodology, Project administration, Resources, Software, Supervision, Validation, Visualization, Writing -original draft, Writing -review &amp; editing.", "doc_items_refs": ["#/texts/188"], "page_nos": [1], "uuid": "22c76816-9734-46f4-b56f-010d646bd60f"}
{"doc_id": "2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990.doctags", "chunk_id": 31, "source_chunk_idxs": [43, 44, 45, 46, 47], "num_tokens": 504, "text": "References\nBailey, C., Bell, S. M., and Blackburn, D. M. (2017). How the UK describes functional memory symptoms. Psychogeriatrics 17 , 336-337. doi: 10.1111/psyg.12232\nBaker, K. S., Gibson, S. J., Georgiou-Karistiani, N., and Giummarra, M. J. (2018). Relationship between self-reported cognitive difficulties, objective neuropsychological test performance and psychological distress in chronic pain. Eur. Jo Pain 22 , 601-613. doi: 10.1002/ejp.1151\nBall, H. A., McWhirter, L., Ballard, C., Bhome, R., Blackburn, D. J., Edwards, M. J., et al. (2020), Functional cognitive disorder: dementia's blind spot. Brain 143, 2895-2903. doi: 10.1093/brain/awaa224\nBall, H. A., Swirski, M., Newson, M., Coulthard, E. J., and Pennington, C. M. (2021). Differentiating functional cognitive disorder from early neurodegeneration: a clinic-based study. Brain Sci. 11:800. doi: 10.3390/brainsci1106 0800\n\nFunding\nThe author(s) declare that no financial support was received for the research and/or publication of this article.\n\nConflict of interest\nThe authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest.\n\nGenerative AI statement\nThe author(s) declare that no Gen AI was used in the creation of this manuscript.\nAny alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us.\n\nPublisher's note\nAll claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher.", "doc_items_refs": ["#/texts/190", "#/texts/191", "#/texts/192", "#/texts/193", "#/texts/198", "#/texts/200", "#/texts/202", "#/texts/203", "#/texts/205"], "page_nos": [1], "uuid": "8d1086ff-c126-4800-9d91-46d25b32ee0c"}
{"doc_id": "2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990.doctags", "chunk_id": 32, "source_chunk_idxs": [48], "num_tokens": 480, "text": "Author disclaimer\nThe statements, opinions and data contained in all publications are solely those of the individual author(s) and contributor(s) and not of Frontiers and/or the editor(s). Frontiers and/or the editor(s) disclaim responsibility for any injury to people or property resulting from any ideas, methods, instructions or products referred to in the content.\nBharamve, B., and Larner, A. J. (2018). Functional cognitive disorders: demographic and clinical features contribute to a positive diagnosis. Neurodegen. Dis. Manag. 8, 377-383. doi: 10.2217/nmt-2018-0025\nBhome, R., McWilliams, A., Huntley, J. D., Fleming, S. M., and Howard, R. J. (2019). Metacognition in functional cognitive disorder- a potential mechanism and treatment target. Cogn. Neuropsychiatry 24 , 311-321. doi: 10.1080/13546805.2019.1651708\nBhome, R., McWilliams, A., Price, G., Poole, N. A., Howard, R. J., Fleming, S. M., et al. (2022). Metacognition in functional cognitive disorder. Brain Commun. 4. doi: 10.1093/braincomms/fac041\nBorelli, W. V., de Senna, P. N., Brum, W. S., Schumacher-Schuh, A. F., Zimmer, E. R., Fagundes Chaves, M. L., et al. (2022). Presents high frequency and distinct clinical profile in patients with low education. Front. Aging Neurosci. 14:789190. doi: 10.3389/fnagi.2022.789190\nButler, M., and Nicholson, T. R. (2024). \"Functional neurological disorder,\" in Seminars in General Adult Psychiatry (Cambridge University Press), 366-386. doi: 10.1017/9781911623861.018", "doc_items_refs": ["#/texts/207", "#/texts/208", "#/texts/209", "#/texts/210", "#/texts/211", "#/texts/214"], "page_nos": [1], "uuid": "848e6f6b-66c3-4774-8f9e-70cc7271c605"}
{"doc_id": "2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990.doctags", "chunk_id": 33, "source_chunk_idxs": [49], "num_tokens": 489, "text": "Author disclaimer\nCabeira, V., Alty, J., Antic, S., Araújo, R., Aybek, S., Ball, H. A., et al. (2025). Perspectives on the diagnosis and management of functional cognitive disorder: an international delphi study. Eur. J. Neurol. 32:e16318. doi: 10.1111/ene.16318\nCabeira, V., Frostholm, L., McWhirter, L., Stone, J., and Carson, A. (2023a). clinical signs in functional cognitive disorders: a systematic review and diagnostic meta-analysis. J. Psychosom. Res. 173:111447. doi: 10.1016/j.jpsychores.2023.111447\nCabeira, V., McWhirter, L., and Carson, A. (2023b). Functional cognitive disorder: diagnosis, treatment, and differentiation from secondary causes of cognitive difficulties. Neurol. Clin. 41, 619-633. doi: 10.1016/j.ncl.2023.02.004\nDay, M. A., and Thorn, B. E. (2022). \"Psychological interventions: a focus on cognitive-behavioral therapy,\" in Clinical Pain Management: A Practical Guide, 2nd Edition eds, M. E. Lynch, K. D. Craig and P. W. Peng (Hoboken, NJ: Wiley Blackwell), 272-281. doi: 10.1002/9781119701170.ch26\nDelis, D. C., and Wetter, S. R. (2007). Cogniform disorder and cogniform condition: proposed diagnoses for excessive cognitive symptoms. Clin. Arch. Neuropsychol. 27, 10604-10. doi: 10.1667/j.acn.2007.04.001\nDonker, T. Griffiths, K. M. Cuijpers, P., and Christensen, H. (2009). Psychoeducation for depression, anxiety and psychology distress: a meta-analysis. BMC Med. 7:79. doi: 10.1186/1741-7015-7-79", "doc_items_refs": ["#/texts/215", "#/texts/216", "#/texts/217", "#/texts/218", "#/texts/219", "#/texts/220"], "page_nos": [1], "uuid": "d9b86f26-9e6b-48f3-bd05-f4044fb38379"}
{"doc_id": "2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990.doctags", "chunk_id": 34, "source_chunk_idxs": [50], "num_tokens": 451, "text": "Author disclaimer\nEdmonds, E. C., Delano-Wood, L., Galasko, D. R., Salmon, D. P., and Bondi, M. W. (2014). Subjective cognitive complaints contribute to misdiagnosis of mild cognitive impairment. J. Int. Neuropsychol. Soc. 20, 836-847. doi: 10.1017/S356131771400068X\nElsey, C., Drew, P., Jones, D., Blackburn, D., Wakefield, S., KHarness, K., et al. (2015). Towards diagnostic conversational profiles of patients presenting with dementia or functional memory disorders to memory clinics. Patient Educ. Counts. 98, 1071-1077. doi: 10.1016/j.pec.2015.05.012\nFirst, M. B., Gaebel, W., Maj, M., Stein, D. J., Kogan, C. S., Saunders, J. B., et al. (2021). an organization- and category-level comparison of diagnostic requirements for mental disorders in ICD-11 and DSM-5. World-Quality 20:3. doi: 10.1002/wps.2025\nGhadiri-Sani, M., and Larner, A. (2013). Head turning sign for diagnosis of dementia and mild cognitive impairment: a revision. J. Neurolog. Wurzati 3, 852-853. doi: 10.1136/jnnp-2013-306573.83\nJessen, F., Amarigliro, A. R., En Van Boxtel, M., Brette, M., Ceccaldi, M., Chételat, G., et al. (2014). A conceptual framework for research on subjective cognitive decline in preclinical Alzheimer's disease. Alzheimers Demen. 10, 844-852. doi: 10.1016/j.jalz.2014.01.001", "doc_items_refs": ["#/texts/221", "#/texts/222", "#/texts/223", "#/texts/224", "#/texts/225"], "page_nos": [1], "uuid": "d808e377-2335-4a31-833e-ef6e35b940d4"}
{"doc_id": "2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990.doctags", "chunk_id": 35, "source_chunk_idxs": [51], "num_tokens": 448, "text": "Author disclaimer\nKemp, S., Kapur, N., Graham, C. D., and Reverb, M. (2022). Functional cognitive disorder: differential diagnosis of common clinical presentations. Arch. Clin. Neuropsychol. 37, 1158-1176. doi: 10.1093/arclin/acac020\nLarner, A. J. (2005). \"Who came with you?\" A diagnostic observation in patients with memory problems? J. Neurol. Neurosurg. Psychiatry 76:1739. doi: 10.1136/jnnp.2005.068023\nLarner, A. J. (2014). Screening utility of the attended alone sign for subjective memory impairment. Alzheimer Dis. Assoc. Disord. 28, 364-365. doi: 10.1097/WAD.0b314eB259c4f8\nLarner, A. J. (2021). Functional cognitive disorders (FDC): how information involved? Brain Sci. 11:1082. doi: 10.3390/brainsci11081082\nLaikuttye, U., and Laikuttye, U. (2024). The Scope of Functional Neurological Disorder. Symptom Perception, Inference, and Psychiatry (thesis) Berkeley, CA: University of California.\nMarin-Medina, D. S., Arenas-Vargas, P. A., del Pilar Vásseló-Duzque, M., and Bagnati, P. M. (2025). Functional cognitive disorder: pseudobeyond pseudolata. Perspect. 5:100179. doi: 10.1016/j.neuropr.2004.10175\nMascherek, A., Zimprich, D., Rupprecht, R., and Lang, F. R. (2011). What do cognitive complaints in a sample of memory clinic patients reflect? GeroPsych 24, 187-195. doi: 10.1024/1692-6647/a004600", "doc_items_refs": ["#/texts/226", "#/texts/227", "#/texts/228", "#/texts/229", "#/texts/230", "#/texts/231", "#/texts/232"], "page_nos": [1], "uuid": "2f7350af-a661-4b46-949d-61242439daf5"}
{"doc_id": "2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990.doctags", "chunk_id": 36, "source_chunk_idxs": [52], "num_tokens": 447, "text": "Author disclaimer\nMavroudistis, I., Petridis, F., Karantali, E., Ciobica, A., Papagiannopoulos, S., Kazis, D., et al. (2025). Post-concussion syndrome and functional neurological disorder: diagnostic interfaces, risk mechanisms, and the functional overlay model. Brain Sci. 15:755. doi: 10.3390/brainsci15070755\nMcWhirter, L., Ritchie, C., Stone, J., and Carson, A. (2020). Functional cognitive disorders: a systematic review. Lancet Psychiatry 7, 191-207. doi: 10.1016/S2215-0366(19)30405-5\nMcWhirter, L., Ritchie, C., Stone, J., and Carson, A. (2022). Identifying functional disorder: a proposed diagnostic risk model. CNS Spectr. 27, 754-763. doi: 10.1017/S1092852921000845\nPappalettera, C., Carraniir, C., Miraglia, F., Vecchio, F., and Rossini, P. M. (2024). Cognitive resilience/reserve: myth or reality? A review of definitions\nand measurement methods. Alzheimers Dement. 20, 3567-3586. doi: 10.1002/al z.13744\nPennington, C., Ball, H., and Swirski, M. (2019). Functional cognitive disorder: diagnostic challenges and future directions. Diagnostics 9:131. doi: 10.3390/diagnostics904013168000\nPennington, C., Newson, M., Hayre, A., and Coulthard, E. (2015). Functional cognitive disorder: what is it and what to do about it? Pract. Neurol. 15, 436-444. doi: 10.1136/prneutrol-2015-00112", "doc_items_refs": ["#/texts/233", "#/texts/234", "#/texts/235", "#/texts/236", "#/texts/237", "#/texts/238", "#/texts/239"], "page_nos": [1], "uuid": "c0384e91-1b87-4bf3-9424-0e9895fa7115"}
{"doc_id": "2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990.doctags", "chunk_id": 37, "source_chunk_idxs": [53], "num_tokens": 372, "text": "Author disclaimer\nPicon, E. L., Todorova, E. V., Palombo, D. J., Perez, D. L., Howard, A. K., Silverberg, N. D., et al. (2022). Memory perfectionism is associated with persistent memory complaints after concussion. Arch. Clin. Neuropsychol. 37, 1177-1184. doi: 10.1093/arclin/acac021\nPoole, N. A., Cope, S. R., Bailey, C., and Isaacs, J. D. (2019). Functional cognitive disorders: identification and management. BJPsych. 25, 342-350. doi: 10.1192/bjpa.2018.394\nRahman-Filipiak, A. M., Giordani, B., Heidebrink, J., Bhaumik, A., and Schmitt, D. B. (2018). Self-and informant-reported memory complaints: frequency and severity in cognitively intact individuals and with mild cognitive impairment and neurogenerative dementias. J. Alzheimers Dis. 65, 1011-1017. doi: 10.3392/J3AC-1800-858\nReuber, M., Blackburn, D. J., Elsey, C., Wakefield, S., Erdav, A. K., Harness, K., et al. (2018). An interactive profile to assist the differential diagnosis of neurological disorders and functional memory disorders. Alzheimer Dis. Assoc. Disord. 32, 197-206. doi: 10.1097/WAD.00000000000000231", "doc_items_refs": ["#/texts/240", "#/texts/241", "#/texts/242", "#/texts/243"], "page_nos": [1], "uuid": "95f37730-0090-4f0b-9271-389c97eca9b5"}
{"doc_id": "2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990.doctags", "chunk_id": 38, "source_chunk_idxs": [54], "num_tokens": 455, "text": "Author disclaimer\nRueda-Lara, M., Pina-Delgado, D., and Barrera, I. G. (2024). \"Cognitive and behavioral interventions for patients with neurological and cognitive neurodisciplines,\" Adap Manual Handbook of Health Psychology, Vol. 2: Clinical Interventions and Disease Management in Health Psychology. Ed. N. Schneiderman. M. H. Antoni. F. J. Penedo. T. Smith, W. N. Anderson, B. A. T. Reavenson, and A. P. Afribao-Lanza (Washington, ACS: American Psychological Association), 397-415. doi: 10.1037/0000395-018\nSabagh, M. N., Boada, M., Sorhiz, M., Sibukuri, M., Dubois, B., Ingram, J., et al. (2020). Early distraction cognitive impairment (MCI) in primary care. J. Prev. Alzheimers Dis. 7, 165-170. doi: 10.14283/jpad.2020.21\nSchmidt, K., and Metternich, B. (2009). Validation of two inventories for the diagnosis and monitoring of functional memory disorder. J. Psychosom. Res. 67, 245-251. doi: 10.1016/j.psychores.2009.04005\nPoom, N., Klíská, P., Sehlöp, admitkte, K., and Metternich, B. (2021). Functional cognitive disorder in subjective decline-a year-to-year follow-up. J. Int. Geraniat. 36, 077-683. doi: 10.1056/2.9466-0026.g\nStenberg, P., and R. B. K. (2020). Neuropsychological evaluation of functional cognitive disorder: a narrative review. Clin. Neuropsychol. 38, 302-325. doi: 10.1080/1380339540.2023.2228", "doc_items_refs": ["#/texts/244", "#/texts/245", "#/texts/246", "#/texts/247", "#/texts/248"], "page_nos": [1], "uuid": "591fe13b-7ba1-4033-8788-131113ab1db7"}
{"doc_id": "2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990.doctags", "chunk_id": 39, "source_chunk_idxs": [55], "num_tokens": 475, "text": "Author disclaimer\nSoy, P., Al, S., Ipcir, S., Erluk, G., and Isik, A. (2017). Attended with and heading can be similar markers of cognitive impairment in older adults. Int. Psychiatr. Agogenerat. 29, 1017.1010/S10416170000118\nSew, P., Tal, S., Blackburn, D., Reuber, M., Hecknerkumpath, P., Carson, A., et al. 1952: doi. 10.1186/s12991-0202-0302-6\nWakefield, S. D., Blackburn, D. J., Harkness, K., Khan, A., Reuber, M., Venneri, A., et al. (2018). M. D. (2018). A new comprehensive functional cognitive disorder and autism disorder from a systematic review and meta-analysis. Cogn. Neuropsychol. 29, 358-385. doi: 10.1054/1380-0195-0255\nTarik Elhadd, K. (2018). Functional cognitive disorders: can sleep disturbance contribute to a positive diagnosis? J. Sleep Disord. Ther. 7, 291. doi: 10.1042/2168-0227-1000279\nTeodoro, T., Edwards, M. J., and Isaacs, J. D. A. (2018). Unifying theory for cognitive abnormalities in functional neurological disorders, fibromyalgia and chronic fatigue syndrome: systematic review. J. Neurolog. Neurosurg. Psychiatry 89, 1308-1319. doi: 10.1136/jnp-2017-317823\nTeodor, T., Koreki, A., Chen, J., Coerbegh, J., Poodle, N., Ferreira, J., et al. (2023). functional cognitive disorder affects reaction time, subjective mental effort and global metacognition. Brain 146, 1615-1623. doi: 10.1093/brain/awac363", "doc_items_refs": ["#/texts/249", "#/texts/250", "#/texts/251", "#/texts/252", "#/texts/253", "#/texts/254"], "page_nos": [1], "uuid": "2a3f7321-44c5-431c-a1ac-36d1dd298e19"}
{"doc_id": "2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Functional_Cognitive_Disorder_diagnostic_challenges_clinical_features_and_future__W4414253990.doctags", "chunk_id": 40, "source_chunk_idxs": [56], "num_tokens": 234, "text": "Author disclaimer\nVan Patten, R., and Bellone, J. A. (2023). The neuropsychology of functional cognitive disorders: J. Clin. Exp. Neuropsychol. 45, 957-969. doi: 10.1080/1380339540.2322\nWolstencroft, H. A. (2023). Intervention for cognitive difficulties in functional neurological disorder (Doctoral thesis, University of Birmingham, UK). Centre for Applied Psychology, School of Psychology, The University of Birmingham. https://etheses. bham.ac.uk/id/eprint/14509/\nZamarian, L., Högl, B., Delazer, M., Hingerl, K., Gabelia, D., Mitterling, T., et al. (2015). subjective deficits of attention, cognition and depression in patients with narcolepsy. Sleep Med. 16, 45-51. doi: 10.1016/j.sleep.2014. 07.025", "doc_items_refs": ["#/texts/255", "#/texts/259", "#/texts/263"], "page_nos": [1], "uuid": "6bce0f2a-9a3a-47ca-9393-4f4ea8d68f88"}
