{"doc_id": "2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539.doctags", "chunk_id": 0, "source_chunk_idxs": [0, 1], "num_tokens": 302, "text": "Research Article\n&lt;!-- image --&gt;\n\nCross-domain latent profiles of MCI and dementia are most differentiated by social and emotional functioning\nMatthew L. Cohen 1,2,3 , Aaron J. Boulton$^{1}$, Callie E. Tyner 1 , Jerry Slotkin$^{1}$, Sandra Weintraub$^{4,5}$, Richard C. Gershon$^{6}$, Hiroko H. Dodge 7 and David S. Tulsky 1,8\n$^{1}$Center for Health Assessment Research and Translation, University of Delaware, Newark, DE, USA, $^{3}$Delaware Center for Cognitive Aging Research, University of Delaware, Newark, DE, USA, $^{4}$Mesulam Center for Cognitive Neurology and Alzheimer ' s Disease, Northwestern University Feinberg School of Medicine, Chicago, IL, USA, $^{5}$Department of Psychiatry and Behavioral Sciences, Northwestern University Feinberg School of Medicine, Chicago, IL, USA, $^{6}$Department of Medical Social Sciences, Northwestern University Feinberg School of Medicine, Chicago, IL, USA, $^{7}$Department of Neurology, Massachusetts General Hospital, Harvard Medical School, Boston, MA, USA and $^{8}$Departments of Physical Therapy and Psychological and Brain Sciences, University of Delaware, Newark, DE, USA", "doc_items_refs": ["#/pictures/0", "#/texts/4", "#/texts/5"], "page_nos": [1], "uuid": "3c9c6ee9-f81e-4de8-b823-841fa803dd78"}
{"doc_id": "2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539.doctags", "chunk_id": 1, "source_chunk_idxs": [2], "num_tokens": 375, "text": "Abstract\nObjective: Because of the complexity of Alzheimer ' s Disease (AD) clinical presentations across bio-psycho-social domains of functioning, data-reduction approaches, such as latent profile analysis (LPA), can be useful for studying profiles rather than individual symptoms. Previous LPA research has resulted in more precise characterization and understanding of patients, better clarity regarding the probability and rate of disease progression, and an empirical approach to identifying those who might benefit most from early intervention. Whereas previous LPA research has revealed useful cognitive, neuropsychiatric, or functional subtypes of patients with AD, no study has identified patient profiles that span the domains of health and functioning and that also include motor and sensory functioning. Methods: LPA was conducted with data from the Advancing Reliable Measurement in Alzheimer ' s Disease and cognitive Aging study. Participants were 209 older adults with amestic mild cognitive impairment (aMCI) or mild dementia of the Alzheimer ' s type (DAT). LPA indicator variables were from the NIH Toolbox ® and included cognitive, emotional, social, motor, and sensory domains of functioning. Results: The data were best modeled with a 4-profile solution. The latent profiles were most differentiated by indices of social and emotional functioning and least differentiated by motor and sensory function. Conclusions: These multi-domain patient profiles support and extend previous findings on single-domain profiles and highlight the importance of social and emotional factors for understanding patient experiences of aMCI/DAT. Future research should investigate these profiles further to better understand risk and resilience factors, the stability of these profiles over time, and responses to intervention.\nKeywords: Alzheimer ' s Disease; latent profile analysis; latent class analysis; mild cognitive impairment; cluster analysis; adults; aged (Received 26 June 2024; final revision 14 May 2025; accepted 6 August 2025)", "doc_items_refs": ["#/texts/7", "#/texts/8"], "page_nos": [1], "uuid": "7f3251a6-7a27-4a06-8c52-b85a17912c9e"}
{"doc_id": "2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539.doctags", "chunk_id": 2, "source_chunk_idxs": [3], "num_tokens": 453, "text": "Statement of Research Significance\nResearch Question(s) or Topic(s): This study investigated whether people with mild cognitive impairment (MCI) or early dementia from Alzheimer ' s disease could be grouped based on patterns in their thinking, emotional health, social support, physical abilities, and sensory skills. Main Findings: Researchers identified four distinct patient profiles. The most important differences among them were in emotional and social functioning, while physical and sensory differences were less consequential.\nSome people had strong social connections and emotional wellbeing, while others experienced low mood or isolation, even when their memory or thinking was similar. Study Contributions: This research highlights that emotional and social health are key parts of how people experience early dementia. It provides a clearer way to identify which patients may need support for mood or social engagement. These insights may help healthcare providers better match patients with personalized care and guide future interventions.\nCorresponding author: Matthew L. Cohen; Email: mlcohen@udel.edu\nCite this article: Cohen M.L., Boulton A.J., Tyner C.E., Slotkin J., Weintraub S., Gershon R.C., Dodge H.H., &amp; Tulsky D.S. Cross-domain latent profiles of MCI and dementia are most differentiated by social and emotional functioning. Journal of the International Neuropsychological Society , 1 -11, https://doi.org/10.1017/S1355617725101276\n© The Author(s), 2025. Published by Cambridge University Press on behalf of International Neuropsychological Society. This is an Open Access article, distributed under the terms of the Creative Commons Attribution-NonCommercial-NoDerivatives licence (https://creativecommons.org/licenses/by-nc-nd/4.0/), which permits non-commercial re-use, distribution, and reproduction in any medium, provided that no alterations are made and the original article is properly cited. The written permission of Cambridge University Press must be obtained prior to any commercial use and/or adaptation of the article.", "doc_items_refs": ["#/texts/10", "#/texts/11", "#/texts/12", "#/texts/13", "#/texts/14"], "page_nos": [1], "uuid": "f24f593e-33d5-45ca-9ce0-7910bb3acc84"}
{"doc_id": "2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539.doctags", "chunk_id": 3, "source_chunk_idxs": [4], "num_tokens": 256, "text": "Introduction\nThe core clinical features of Alzheimer ' s disease (AD) relate to cognitive skills and daily functioning (Albert et al., 2011; Dubois et al., 2014). However, AD commonly affects other domains of health and well-being, including behavioral/psychological, motor, sensory, and social functioning (Kew et al., 2022) and the significance of symptoms in these \" other \" domains is becoming increasingly appreciated. For example, hearing loss and social isolation were recently identified as among the most significant modifiable risk factors for dementia, accounting for 7 and 5% of cases of dementia, respectively (Livingston et al., 2024). Mild behavioral impairment (MBI, Ismail et al., 2016), characterized by neuropsychiatric symptoms, and motoric cognitive risk (MCR) syndrome (H. Zhang et al., 2024), characterized by subjective cognitive complaints and slow gait speed, have been identified as risk factors or early manifestations of AD, separate from MCI. Unfortunately, signs and symptoms like these are often studied by considering performance within a single domain (e.g., cognitive or neuropsychiatric), which permits only a piecemeal understanding of AD symptoms and clinical presentations.", "doc_items_refs": ["#/texts/19"], "page_nos": [1], "uuid": "a0c046c5-f098-4531-a512-259b970f29df"}
{"doc_id": "2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539.doctags", "chunk_id": 4, "source_chunk_idxs": [5], "num_tokens": 260, "text": "Introduction\nThe NIH Symptom Science Model (Cashion et al., 2016) is one framework used to guide research from complex, multifaceted clinical data toward a more precise characterization and understanding of patients and their symptoms (e.g., Mahoney &amp; Pierce, 2022) and of matching people to interventions (Cashion et al., 2016; Dorsey et al., 2019; Miaskowski et al., 2017), for example, by using data reduction techniques. Recently, our group used exploratory factor analysis (EFA) to examine cross-domain symptom clusters in older adults with amnic S (mCI aMCI) or dementia of the Alzheimer ' s type (DAT; Weintraub et al., 2022)(Tyner et al., 2024). This work revealed symptom patterns both within and across domains of functioning. For example, negative affect, stress, loneliness, and pain loaded together, while olfaction loaded with cognitive functioning. These variable-oriented clusters may suggest a shared etiology (e.g., frontal lobe pathology may contribute to both cognitive and olfactory dysfunction) and lead to a clearer conceptualization of challenges faced by people with MCI or dementia.", "doc_items_refs": ["#/texts/20"], "page_nos": [1], "uuid": "39d24424-0058-400f-a9e0-84aad1796355"}
{"doc_id": "2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539.doctags", "chunk_id": 5, "source_chunk_idxs": [6], "num_tokens": 374, "text": "Introduction\nThis previous EFA (Tyner et al., 2024) was conducted using data from the NIH Toolbox ® for Assessment of Neurological and Behavioral Function (NIHTB) (Gershon et al., 2013). The NIHTB was found to be a useful set of instruments for this purpose because it contains measures of cognitive, emotional, social, motor, and sensory health and functioning that are co-normed and can form composite scores (Babkahanyan et al., 2018; Heaton et al., 2014). have evidence for validity in older adults both with and without cognitive impairment (R. Gershon et al., 2020; Giordani et al., 2022; Hackett et al., 2018; Ma et al., 2021; Nolin et al., 2023), and correlate with AD biomarkers (Cheng et al., 2024; Snitz et al., 2020).The present study sought to further explore the potential to differentiate distinct clinical profiles of aMCI and DAT using the NIH Toolbox. Whereas EFA is a variable-centered analysis, this investigation aimed to conduct a latent profile analysis (LPA), which is a person-centered analysis that can be useful for identifying patient subtypes (Harris et al., 2022).\nPrevious LPA investigations related to AD have produced interesting findings with clinical translational potential. For example, Machulda et al. (2019) conducted an analysis of cognitive data from people with MCI to reveal empirically derived subtypes, including a group that they posited might be most responsive to early intervention. Jang et al. (2020) and Leoutsak et al. (2015a) conducted analyses of neuropsychiatric symptoms in people who", "doc_items_refs": ["#/texts/21", "#/texts/22"], "page_nos": [1], "uuid": "886cfc44-edf2-4bf3-b44d-1367a3f3a595"}
{"doc_id": "2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539.doctags", "chunk_id": 6, "source_chunk_idxs": [7], "num_tokens": 441, "text": "Introduction\nwere cognitively unimpaired or had MCI and identified profiles that were at elevated risk of disease progression, independent of age, sex, cognition, and genotype. However, one limitation of previous LPA investigations is that many have been restricted to one domain of functioning - for example, specific to psychosocial variables only (Roberto et al., 2021; Siew et al., 2023), cognitive variables only (Jester et al., 2021; Romero et al., 2022; J. Yu &amp; Lee, 2018), or daily functioning variables only (Mis et al., 2019). Two or three domain types (e.g., cognitive and neuropsychiatric) have occasionally been combined when one domain is an indicator variable (used to define the profile) and the other is a criterion variable, used to predict profile classification (Mis et al., 2019; J. Yu &amp; Lee, 2018). Du et al. (2023) is an exception and demonstrates the potential value of profiles with cross-domain indicator variables. These authors identified a subgroup of people with MCI who had especially poor cognitive functioning alongside poor sleep, insulin resistance, and elevated symptoms of depression. A cross-domain profile like this is potentially very useful because it could help clinicians think to assess for common comorbidities and match people to interventions that might strategically address multiple issues, for example, cognitive-behavioral therapy for insomnia and behavioral activation (Cassidy-Eagle et al., 2018). Notably, people in this profile identified by Du et al., did not have a worse disease burden (amyloid PET estimates), indicating the importance of symptom profiles beyond disease severity alone. To our knowledge, no study of AD has conducted an LPA with both cognitive and psychosocial indicator variables, along with motor and sensory variables. An analysis of our NIHTB data with a personoriented (LPA) approach offers a new opportunity to study patient profiles across domains, which might ultimately lead to a better understanding of patient experiences, improved prognostic accuracy, and better tailoring of therapeutic strategies.", "doc_items_refs": ["#/texts/24"], "page_nos": [1], "uuid": "438b7a04-b2ea-4105-81bd-46095d65e66c"}
{"doc_id": "2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539.doctags", "chunk_id": 7, "source_chunk_idxs": [8, 9], "num_tokens": 433, "text": "Study overview and research participants\nThe dataset analyzed in this study was drawn from a large, multiview, multi-cohort study of older adults: the Advancing Reliable Measurement in Alzheimer ' s Disease and cognitive Aging (ARMADA) study. The ARMADA study consisted of several hundred older adults measured using the NIHTB on up to three occasions over a two-year period. The primary goal of the ARMADA study was to expand validity evidence for NIHTB performance tests and patient-reported outcome measures in a diverse older adult population. Details regarding the methodology and sample characteristics of the ARMADA study, including the comprehensive diagnostic process followed for cohort assignment, have been published elsewhere (Karpouzian-Rogers et al., 2023; Weintraub et al., 2022). For this study, we examined baseline data from 209 older adults ages 65-85 with diagnoses of aMCI ( n = 136) or DAT ( n = 73). Participants were recruited from nine Alzheimer ' s Disease Research Centers (ADRCs) across the United States. In addition to completing NIHTB measures, participants completed selected cognitive tests and patient-, informant-, and clinican-report measures from the National Alzheimer ' s Coordinating Centers ' Uniform Data Set (UDS) version 3 (Weintraub et al., 2018).\n\nAssessments\nTwo types of variables were included in the current analyses: (a) variables of motor, sensory, emotional, and cognitive functioning\ndrawn from the NIHTB (\"LPA indicators\"), which defined the aMCI/DAT profiles, and (b) associated, non-NIHTB variables to provide evidence of validity for profile classifications (\"criterion variables\"). Based on iterative review of available data, nine NIHTB variables and/or composite scores were selected as LPA indicators (Babakhanyan et al., 2018; Heaton et al., 2014). All individuals in the study had memory impairment, and thus two memory tests from the NIHTB (i.e., Picture Sequence Memory Test and List Sorting) were not included as indicator variables.", "doc_items_refs": ["#/texts/27", "#/texts/29", "#/texts/32"], "page_nos": [1], "uuid": "02597fc4-354b-4f4d-9a53-a8be0ba417f3"}
{"doc_id": "2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539.doctags", "chunk_id": 8, "source_chunk_idxs": [10], "num_tokens": 394, "text": "Assessments\n- · Cognition ( k = 4): Four cognitive variables were selected as LPA indicators: (1) Crystallized Cognition composite score (Heaton et al., 2014) - comprised of the Picture Vocabulary Test and Oral Reading Recognition Test; (2) the Dimensional Change Card Sort Test, (3) Flanker Inhibitory Control and Attention Test, and (4) Pattern Comparison Processing Speed Test.\n- · Psychosocial ( k = 3): Psychological Well-Being composite, Negative Affect composite, and Social Satisfaction composite (Babakhanyan et al., 2018). Specifically, the Psychological WellBeing composite includes the following measures from the NIHTB Emotion Battery: Meaning, Life Satisfaction, Positive Affect, and Self-Efficacy. The Negative Affect composite includes the following measures: Fear Affect, Anger Affect, Sadness, Perceived Stress, Anger Hostility, Fear Somatic Arousal, and Anger Physical Aggression. The Social Satisfaction composite includes Perceived Hostility, Loneliness, Perceived Rejection, Friendship, Emotional Support, and Instrumental Support.\n- · Motor ( k = 1): 2-Minute Walk (endurance) Test. This test was selected because it was found to load strongly on a motor test factor (Tyner et al., 2024) and gait rates to current and future cognitive impairment (Dodge et al., 2012; Xu et al., 2024; H. Zhang et al., 2024).\n- · Sensory ( k = 1): Words-In-Noise (hearing) Test. This test, which uses a multi-talker babble paradigm, was selected because of the intricate relationship between hearing and cognition (Powell et al., 2022), strong relevance of hearing to the development and progression of AD (Johnson et al., 2021), and the potential to clarify its lack of loading on any of the factors that we previously reported from an EFA (Tyner et al., 2024).", "doc_items_refs": ["#/texts/33", "#/texts/34", "#/texts/35", "#/texts/36"], "page_nos": [], "uuid": "965af8c7-2f0e-4ef6-8d72-f392d4b9d8d4"}
{"doc_id": "2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539.doctags", "chunk_id": 9, "source_chunk_idxs": [11], "num_tokens": 496, "text": "Assessments\nCognition and motor scores used were demographically uncorrected standardized scores ( M = 100, SD = 15), whereas emotion scores were on a T-score metric ( M = 50, SD = 10); all were co-normed on a sample whose denographics mirrored the 2010 U.S. census (Cella et al., 2010). Scores for the Words-In-Noise Test were better ear threshold scores, defined as the lowest score indicative of better auditory function - observed in either ear, in decibels of signal-to-noise ratio (dB S/N). Prior to LPA estimation, all NIHTB variables were standardized within the full sample. Negative Affect composite scores and Words-in-Noise test scores were inverted so that all variables were on a similar scale with similar directionality (i.e., higher scores equal better health and function). In addition, all variables were screened for outliers (defined as values outside ± 3 SDs); as a result, one outlying value was removed.\nCriterion variables that assess cognitive and functional status included the B-minus-A score from the Trail Making Test (TMT B-A), which correlates broadly with cognitive test scores across domains (Corrigan &amp; Hinkeldey, 1987); the Clinical Dementia Rating (CDR) Sum of Boxes (CDR-SB) score, a clinician-rated tool used to stage overall cognitive and functional\nstatus (Morris, 1993; O'Bryant, 2008); and the Functional Assessment Questionnaire (FAQ) total score (Brown et al., 2011), a patient-report measure of functional impairment. Criterion variables to assess neuropsychiatric symptoms were rates of clinical diagnosis of major depressive disorder within the past 2 years; the severity score from the Neuropsychiatric Inventory Questionnaire (NPI-Q), an informant-reported measure of anxiety, depression, apathy, disinhibition, eating and sleep changes, and other neuropsychiatric symptoms (Kaufer et al., 1992); and the total score from the Geriatric Depression Scale - 15 item version (Yesavage &amp; Sheikh, 2008), a patient-report measure of depressive symptoms. We also compared profiles on a small number of demographic variables (age, gender, ethnicity, race, and education).", "doc_items_refs": ["#/texts/37", "#/texts/38", "#/texts/40"], "page_nos": [1], "uuid": "aa45d8cf-397d-4fd4-88ed-7ed4188f0bea"}
{"doc_id": "2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539.doctags", "chunk_id": 10, "source_chunk_idxs": [12], "num_tokens": 468, "text": "Data analysis\nLPA - also referred to as model-based clustering or Gaussian mixture modeling - was used (Lanza &amp; Cooper, 2016; McLachlan et al., 2019). To analyze the data, we fit and compared several LPA models to select a model that (a) fit the data well, such that estimated profiles were distinct and homogeneous and model fit was optimal relative to other models (see below for the selection criteria used), and (b) identified profiles that were substantively interpretable and qualitatively as well as quantitatively distinguishable - that is, the profiles did not differ solely by the degree or severity of the measured outcomes. All LPA models were estimated in the R (version 4.2.0) package mclust (version 6.0.0; Scrucca et al., 2016), which provides 14 LPA model specifications that differ according to how indicator variances and covariances are structured. Detail regarding the choice of LPA model is provided in the Supplementary Material. Within the chosen specification, nine models were fit that differed by the number of profiles extracted (between one and nine); a maximum of nine profiles were considered sufficient given the sample size as well as the expected number of profiles based on prior research.\nRates of missing data were low; all NIHTB variables exhibited rates less than 6% missing except the 2-Minute Walk Test, which was 16.3%. A single imputation was performed within mclust to generate a complete dataset for analysis due to the small amount missing data. An expectation-maximization (EM) algorithm was used to estimate LPA model parameters, and solutions were judged using the Bayesian Information Criterion (BIC; Schwarz,1978), Integrated Complete-data Likelihood (ICL; Scrucca et al., 2016), bootstrap likelihood ratio test (BLRT; McLachlan &amp; Peel, 2000), entropy (ideally &gt; .80, and, at a minimum, &gt; .60; Bauer, 2022; Celeux &amp; Soromenho, 1996), and within-profile posterior probabilities (ideally &gt; .70; Masyn, 2013).", "doc_items_refs": ["#/texts/42", "#/texts/43"], "page_nos": [1], "uuid": "735f4aa5-562a-47f0-9f64-e8e1c4ec0dfc"}
{"doc_id": "2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539.doctags", "chunk_id": 11, "source_chunk_idxs": [13, 14], "num_tokens": 160, "text": "Data analysis\nOnce a final solution was chosen, bootstrapped standard errors were computed for all parameter estimates based on 1000 bootstrap samples. To assess the validity of the extracted profiles, we utilized an external validation strategy (van Rentergem et al., 2021) by comparing the profiles on the clinician-, informant-, and patientreport criterion variables described above. One-way analysis of variance was conducted for each outcome, followed by pairwise post hoc comparisons via Tukey's honestly significant difference (HSD; Tukey, 1949), with the family-wise error rate set at .05.\n\nSample and indicator variable characteristics\nDemographic and clinical characteristics of the aMCI/DAT sample are shown in Table 1. Participant ages ranged between 62 and 91\n\nTable 1. Sample characteristics", "doc_items_refs": ["#/texts/44", "#/texts/47", "#/texts/50", "#/tables/0"], "page_nos": [1], "uuid": "b6ce6d71-6454-4b99-ae96-2da3bce4cae8"}
{"doc_id": "2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539.doctags", "chunk_id": 12, "source_chunk_idxs": [15], "num_tokens": 501, "text": "Sample and indicator variable characteristics\n|                                                  | Clinical Subgroup   | Clinical Subgroup   | Clinical Subgroup   | Clinical Subgroup   | Clinical Subgroup   | Clinical Subgroup   |\n|--------------------------------------------------|---------------------|---------------------|---------------------|---------------------|---------------------|---------------------|\n|                                                  | aMCI                | DAT                 | Overall             | Overall             | Overall             | Overall             |\n|                                                  | ( n = 136)          | ( n = 73)           | ( n = 209)          | ( n = 209)          | ( n = 209)          | ( n = 209)          |\n| Age - M (SD)                                     | 76.1                | 75.4                | (7.2)               | 75.9                | 6.9                 |                     |\n| Gender - n (%)                                   | 65                  | (47.8)              | 32                  | (43.8)              | 97                  | (46.4)              |\n| Male                                             | 71                  | (52.2)              | 41                  | (56.2)              | 112                 | (53.6)              |\n| Ethnicity - n (%)                                | 2                   | (1.5)               | 2                   | (2.7)               | 4                   | (1.9)               |\n| Not Hispanic                                     | 134                 | (98.5)              | 71                  | (97.3)              | 205                 | (98.1)              |\n| Race - n (%)                                     | White               | (83.7)              | 66                  | (90.4)              | 143                 | (68.4)              |\n| Black or African American                        | 59                  | (43.4)              | 4                   | (5.5)               | 63                  | (30.1)              |\n| Asian                                            | 0                   | (0.0)               | 1                   | (1.4)               | 1                   | (0.5)               |", "doc_items_refs": ["#/tables/0"], "page_nos": [1], "uuid": "46e522ba-7001-44a0-8ae9-fb274fe04d13"}
{"doc_id": "2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539.doctags", "chunk_id": 13, "source_chunk_idxs": [16], "num_tokens": 493, "text": "Sample and indicator variable characteristics\n| Other                                            | 0                   | (0.0)               | 1                   | (1.4)               | 1                   | (0.5)               |\n| More than one race                               | 0                   | (0.0)               | 1                   | (1.4)               | 1                   | (0.5)               |\n| Education - n (%)                                | 5                   | (3.7)               | 0                   | (0.0)               | 5                   | (2.4)               |\n| High school or less                              | 10                  | (7.4)               | 10                  | (13.7)              | 20                  | (9.6)               |\n| Some college or associate degree                 | 35                  | (25.9)              | 14                  | (19.2)              | 49                  | (23.6)              |\n| Bachelor's degree                                | 37                  | (27.4)              | 28                  | (38.4)              | 65                  | (31.2)              |\n| Master's degree                                  | 31                  | (23.0)              | 12                  | (16.4)              | 43                  | (20.7)              |\n| Professional degree or doctorate                 | 17                  | (12.6)              | 9                   | (12.3)              | 26                  | (12.5)              |\n| (Missing)                                        | 1                   | 0                   | 0                   | 1                   | 1                   | (74.6)              |\n| Marital Status - n (%)                           | 75                  | (65.2)              | 57                  | (91.9)              | 132                 | (74.6)              |\n| Widowed                                          | 15                  | (13.0)              | 2                   | (3.2)               | 17                  | (9.6)               |\n| Divorced                                         | 15                  | (13.0)              | 2                   | (3.2)               | 17                  | (9.6)               |\n| Separated                                        | 2                   | (1.7)               | 0                   | (0.0)               | 2                   | (1.1)               |\n| Never married (or annulled)                      | 7                   | (6.1)               | 0                   | (0.0)               | 7                   | (4.0)               |\n| Living as married/domestic partner               | 1                   | (0.9)               | 1                   | (1.6)               | 2                   | (1.1)               |\n| (Missing)                                        | 21                  |                     | 11                  |                     | 32                  |                     |\n| Residential Status - n (%)                       | 106                 | (92.2)              | 57                  | (91.9)              | 163                 | (92.1)              |", "doc_items_refs": ["#/tables/0"], "page_nos": [1], "uuid": "118db102-bd68-43a8-b230-a1599bd9cfdd"}
{"doc_id": "2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539.doctags", "chunk_id": 14, "source_chunk_idxs": [17], "num_tokens": 510, "text": "Sample and indicator variable characteristics\n| Retirement community or independent group-living | 7                   | (6.1)               | 3                   | (4.8)               | 10                  | (5.6)               |\n| Assisted living                                  | 2                   | (1.7)               | 1                   | (1.6)               | 3                   | (1.7)               |\n| Other or unknown                                 | 0                   | (0.0)               | 1                   | (1.6)               | 1                   | (0.6)               |\n| (Missing)                                        | 21                  |                     | 11                  |                     | 32                  |                     |\n| CDR Global Score - n (%)                         | 0                   | (7.4)               | 0                   | (0.0)               | 10                  | (4.8)               |\n| 0.5                                              | 124                 | (91.9)              | 38                  | (52.1)              | 162                 | (77.9)              |\n| 1.0                                              | 1                   | (0.7)               | 32                  | (43.8)              | 33                  | (15.9)              |\n| 2.0                                              | 0                   | (0.0)               | 3                   | (4.1)               | 3                   | (1.4)               |\n| (Missing)                                        | 1                   | 0                   |                     | 1                   |                     | (1.4)               |\nyears. On average, the DAT subsample was slightly younger ( M = 75.4) than the aMCI subsample ( M = 76.1). Gender frequencies skewed slightly male (approximately 53% male to 47% female in each subsample). Self-reported racial and ethnic identities were predominately non-Hispanic White. In addition, most participants resided in a private residence (e.g., single- or multi-family apartment, condo, or house) and were married. Univariate and bivariate descriptive statistics for the LPA indicators are provided in Tables 2 and 3, respectively. The Dimensional Change Card Sort Test, Flanker Inhibitory Control and Attention Test, and Pattern Comparison Processing Speed Test were strongly correlated ( rs = .66, .56, and .51), which was expected because they are all related to speed of information processing and contribute to the Fluid Cognition Composite Score (Heaton et al., 2014). Those three tests also exhibited weaker correlations with the Crystallized Cognition composite score ( rs = .19 - .30). The three emotion composites also exhibited strong correlations (absolute rs = .61 - .68). All other associations between indicators were small or negligible.", "doc_items_refs": ["#/tables/0", "#/texts/51"], "page_nos": [1], "uuid": "eadbf9b8-6dc6-458f-83b3-675fb31e986e"}
{"doc_id": "2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539.doctags", "chunk_id": 15, "source_chunk_idxs": [18], "num_tokens": 402, "text": "Latent profile analysis model selection\nModel fit information for the nine LPA models is provided in Table 4. A 4-profile solution was considered preferable based on fit as well as the interpretations and sizes of the profiles. The 4-profile\nTable 2. LPA model indicator univariate descriptives\n\n| NIHTB battery   | NIHTB assessment          |   % N |   Missing |   Mean |   SD |   Min |   Max |\n|-----------------|---------------------------|-------|-----------|--------|------|-------|-------|\n| Cognition       | Crystallized composite    |   204 |       2.4 |  107.7 |  8.7 |  81   |   127 |\n| Cognition       | Dimensional change        |   205 |       1.9 |   88.4 | 15.6 |  46   |   119 |\n| Cognition       | Flanker task              |   205 |       1.9 |   81.9 | 13.7 |  48   |   108 |\n| Cognition       | Pattern comparison        |   208 |       0.5 |   72.4 | 15.7 |  38   |   109 |\n| Emotion         | Psychological well- being |   209 |       0   |   50.1 |  8.9 |  31   |    75 |\n| Emotion         | Social satisfaction       |   207 |       1   |   50   |  9.1 |  28   |    68 |\n| Emotion         | Negative affect           |   207 |       1   |   46.7 |  9.9 |  24   |    72 |\n| Motor           | 2-Minute walk test        |   175 |      16.3 |   79.6 | 15.5 |  39   |   126 |\n| Sensory         | Words-in-noise a          |   198 |       5.3 |   12.5 |  6   |   3.6 |    26 |", "doc_items_refs": ["#/texts/53", "#/texts/55", "#/tables/1"], "page_nos": [1], "uuid": "37485040-5eed-4f3f-9b8b-ca46d4f9847a"}
{"doc_id": "2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539.doctags", "chunk_id": 16, "source_chunk_idxs": [19], "num_tokens": 233, "text": "Latent profile analysis model selection\nNote: * Test scores were inverted for analyses to facilitate profile interpretation. Statistics presented here are based on original test metrics, prior to z standardization. All Cognition and Motor tests (Crystallized Composite, Dimensional Change Card Sort, Flanker, Pattern Comparison, 2-Minute Walk) are demographically uncorrected standardized scores ( M = 100, SD = 15) co-normed to the 2010 U.S. Census. Emotion measures composites (Psychological Well-Being, Social Satisfaction, Negative Affect) are T scores ( M = 50, SD = 10) also co-normed to the 2010 U.S. Census. The sensory test (Words-In-Noise) is defined as the better ear threshold, that is, the lower signal-to-noise decibels ratio (dB S/N).\nsolution had the largest BIC and ICL value among models. According to the BLRT, significant improvements in fit were found when 2-5 profiles were extracted; however, addition of a sixth profile did not significantly improve model fit. Entropy was\n\nTable 3. LPA model indicator correlations", "doc_items_refs": ["#/texts/56", "#/texts/57", "#/texts/60", "#/tables/2"], "page_nos": [1], "uuid": "9ae0b493-1b23-4073-aed2-2d6fa9093ce6"}
{"doc_id": "2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539.doctags", "chunk_id": 17, "source_chunk_idxs": [20], "num_tokens": 486, "text": "Latent profile analysis model selection\n|                              | Crystallized composite   | Dimensional change card sort   | Flanker task   | Pattern comparison   | Psychological well-being composite   | Social satisfaction composition   | Negative affect composite a   | 2-Minute walk test   | Words-in- noise a   |\n|------------------------------|--------------------------|--------------------------------|----------------|----------------------|--------------------------------------|-----------------------------------|-------------------------------|----------------------|---------------------|\n| Correlations                 |                          |                                |                |                      |                                      |                                   |                               |                      |                     |\n| Crystallized composite       |                          |                                |                |                      |                                      |                                   |                               |                      |                     |\n| Dimensional change card sort |                          |                                |                |                      |                                      |                                   |                               |                      |                     |\n| Flanker task                 | .29                      | .66                            |                |                      |                                      |                                   |                               |                      |                     |\n| Pattern                      | .19                      | .51                            | .56            |                      |                                      |                                   |                               |                      |                     |\n| Comparison                   |                          |                                |                |                      |                                      |                                   |                               |                      |                     |\n| Psychological                | .03                      | -.10                           | -.06           | -.01                 |                                      |                                   |                               |                      |                     |\n| well-being                   |                          |                                |                |                      |                                      |                                   |                               |                      |                     |\n| Social satisfaction          | .14                      | .05                            | .01            | .03                  | .64                                  |                                   |                               |                      |                     |", "doc_items_refs": ["#/tables/2"], "page_nos": [1], "uuid": "c4554ab6-6a97-4b4c-8290-de4f87ec668d"}
{"doc_id": "2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539.doctags", "chunk_id": 18, "source_chunk_idxs": [21], "num_tokens": 506, "text": "Latent profile analysis model selection\n| Negative affect a            | -.15                     | -.06                           | -.06           | .01                  | -.61                                 | -.68                              |                               |                      |                     |\n| 2-Minute walk test           | .23                      | .29                            | .28            | .20                  | .01                                  | .10                               | -.01                          |                      |                     |\n| Words-in-noise a             | -.01                     | -.11                           | -.08           | -.05                 | .08                                  | .14                               | -.12                          | -.88                 |                     |\nNote: a Test scores were inverted for analyses to facilitate profile interpretation.\nTable 4. LPA model selection indices\n\n|   Profiles |   Parameters | BIC      | ICL      | BLRT   | BLRT p       | Entropy   |\n|------------|--------------|----------|----------|--------|--------------|-----------|\n|          1 |           18 | - 5427.9 | - 5427.9 | 243.1  | < 0.01<ecel> |           |\n|          2 |           29 | - 5243.6 | - 5251.2 | 151.7  | 0.01         | 0.93      |\n|          3 |           40 | - 5150.7 | - 5183.5 | 96.6   | 0.01         | 0.84      |\n|          4 |           51 | - 5112.8 | - 5149.7 | 49.6   | 0.01         | 0.87      |\n|          5 |           62 | - 5122.0 | - 5164.1 | 57.3   | 0.01         | 0.86      |\n|          6 |           73 | - 5123.5 | - 5177.0 | 25.6   | 0.18         | 0.85      |\n|          7 |           84 | - 5156.6 | - 5205.1 | - 2.0  | 1.00         | 0.87      |\n|          8 |           95 | - 5217.3 | - 5275.8 | 30.7   | 0.06         | 0.85      |\n|          9 |          106 | - 5245.4 | - 5304.3 | 79.4   | < 0.01<fcel> |           |", "doc_items_refs": ["#/tables/2", "#/texts/61", "#/texts/62", "#/tables/3"], "page_nos": [1], "uuid": "072d72a4-7355-405d-ab1a-c2f7f9a8e66d"}
{"doc_id": "2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539.doctags", "chunk_id": 19, "source_chunk_idxs": [22, 23], "num_tokens": 381, "text": "Latent profile analysis model selection\nNote: BIC is Bayesian information criterion. ICL is Integrated complete-data likelihood. BLRT is Bootstrap likelihood ratio test. BLRT values compare the fit of anLPA model withmprofiles to a model with m + 1 profiles. The BLRT value for the 9-profile solution is compared to a 10-profile solution (additional fit information not provided).\nacceptable for the 4-profile solution (.87). Finally, the 4-profile solution resulted in an additional class beyond the 3-profile solution that was evaluated to be clinically interpretable, yet the addition of a fifth profile, though supported by the BLRT, was deemed to not add any additional clinical information. Given these observations, the 4profile solution was selected for additional examination.\nEstimated profile sample sizes based on each participant's most likely profile membership (highest posterior probability) are shown in Table 5 for the 4-profile solution, along with cognitive diagnosis subgroup sizes and average profile posterior probabilities within profiles. Profile mean and standard deviation estimates for model indicators are displayed in Figure 1 (within-sample z -score metric) and Figure 2 (on original NIHTB metric). The crossdomain patterns for each profile are readily observed in Figure 1, whereas normative information within profiles for different NIHBT domains can be seen in Figure 2. Estimates shown in these figures, as well as the demographic characteristics of individuals within each profile, are provided numerically in the online supplement to this article. Average posterior probabilities were high in all four profiles (minimum = .91, maximum = .96).\n\nProfile 1: dysexecutive / low functioning\nProfile 1 contained 61 participants (29% of sample) who exhibited poor executive functioning, processing speed, endurance, and auditory function when compared to the general", "doc_items_refs": ["#/texts/63", "#/texts/64", "#/texts/65", "#/texts/68"], "page_nos": [1], "uuid": "a9a1dd43-8637-4952-ae76-4122600753f6"}
{"doc_id": "2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539.doctags", "chunk_id": 20, "source_chunk_idxs": [24], "num_tokens": 511, "text": "Profile 1: dysexecutive / low functioning\nTable 5. Profile counts and average posterior probabilities, 4-profile solution\n\n|               | Counts and proportions by most likely profile membership   | Counts and proportions by most likely profile membership   | Counts and proportions by most likely profile membership   | Counts and proportions by most likely profile membership   | Counts and proportions by most likely profile membership   |\n|---------------|------------------------------------------------------------|------------------------------------------------------------|------------------------------------------------------------|------------------------------------------------------------|------------------------------------------------------------|\n|               | Profile 1                                                  | Profile 2                                                  | Profile 3                                                  | Profile 4                                                  |                                                            |\n| Overall n     | 61                                                         | 92                                                         | 25                                                         | 31                                                         |                                                            |\n| Overall prop. | .29                                                        | .44                                                        | .12                                                        | .15                                                        |                                                            |\n| aMCI n        | 24                                                         | 72                                                         | 19                                                         | 21                                                         |                                                            |\n| DAT n         | 37                                                         | 20                                                         | 6                                                          | 10                                                         |                                                            |\n| aMCI prop.    | .39                                                        | .78                                                        | .76                                                        | .68                                                        |                                                            |\n| DAT prop.     | .61                                                        | .22                                                        | .24                                                        | .32                                                        |                                                            |\nAverage posterior probabilities", "doc_items_refs": ["#/texts/70", "#/tables/4", "#/texts/71"], "page_nos": [1], "uuid": "64fe8772-dcfc-430f-a88a-af5a5078fa87"}
{"doc_id": "2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539.doctags", "chunk_id": 21, "source_chunk_idxs": [25], "num_tokens": 365, "text": "Profile 1: dysexecutive / low functioning\nNote: Estimated profile proportions for the overall sample are relative across the 4 profiles (i.e., row-wise). Estimated profile proportions for the cognitive diagnosis subgroups are relative within each profile (i.e., column-wise) across the 2 diagnosis subgroups. prop. = proportion.\n\n|           |   Profile 1 |   Profile 2 |   Profile 3 |   Profile 4 |\n|-----------|-------------|-------------|-------------|-------------|\n| Profile 1 |        0.91 |        0.06 |        0.01 |        0.02 |\n| Profile 2 |        0.02 |        0.93 |        0.03 |        0.02 |\n| Profile 3 |        0.02 |        0.07 |        0.91 |        0    |\n| Profile 4 |        0.03 |        0.01 |        0    |        0.96 |\nFigure caption: Figure 1. Within-Sample Mean and SD Estimates for Model Indicators.\npopulation (Figure 2) and other profiles (Figure 1), yet average to below-average emotional health and social satisfaction. This profile contained approximately 50% of all participants with DAT and outnumbered participants with aMCI approximately 2 to 1 (61 to 39%). The remaining three profiles were highly similar in cognitive and motor functioning and were most distinguished by\nFigure caption: Figure 2. NIHTB Metric Mean and SD Estimates for Model Indicators.\ndifferences in psychosocial functioning: low (Profile 3), average (Profile 2), or high (Profile 4).", "doc_items_refs": ["#/texts/72", "#/tables/5", "#/pictures/1", "#/texts/74", "#/pictures/2", "#/texts/78"], "page_nos": [1], "uuid": "b2988148-5ce0-41f5-b334-3823d0d970ef"}
{"doc_id": "2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539.doctags", "chunk_id": 22, "source_chunk_idxs": [26, 27], "num_tokens": 288, "text": "Profile 2: average psychosocial functioning\nProfile 2 contained 92 participants (44% of sample). Individuals in this profile exhibited above-average levels of crystallized cognitive ability and below average levels of executive function and endurance compared to those in the general population (Figure 2). Moreover, individuals in Profile 2 exhibited approximately average levels of emotional and social satisfaction, both within the sample and compared to the general population. Most participants in Profile 2 had aMCI (78%).\n\nProfile 3: low psychosocial functioning\nProfile 3 contained 25 participants (12% of sample) who, like members of Profile 2, exhibited above-average levels of crystallized cognitive ability and below-average levels of executive function compared to individuals in the general population. Individuals in this profile also demonstrated very low (negative) levels of psychosocial health, both within the sample and compared to the general population. In fact, the levels of psychosocial health for those in Profile 3 were lower than individuals in Profile 1, who predominantly had more advanced disease and lower functioning overall. Profile 3 had the best average performance on the Words-in-Noise test, although all four profiles were comprised of individuals who on average met this test's clinical threshold score (10 or higher) that suggests test takers seek additional clinical evaluation of their hearing. Similar to Profile 2, more individuals with aMCI (76%) than DAT (24%) constituted Profile 3.", "doc_items_refs": ["#/texts/80", "#/texts/82"], "page_nos": [1], "uuid": "a13faa09-a0a4-46ce-b002-135d39990d16"}
{"doc_id": "2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539.doctags", "chunk_id": 23, "source_chunk_idxs": [28], "num_tokens": 506, "text": "Profile 4: high psychosocial functioning\nProfile 4 contained 31 individuals (15% of sample) who exhibited very high (positive) levels of psychosocial health and average levels of cognition, endurance, and auditory function that were\n&lt;!-- image --&gt;\n&lt;!-- image --&gt;\nTable 6. Criterion variable descriptive statistics by profile\n\n|                  | Profile 1   | Profile 2   | Profile 3   | Profile 4   |\n|------------------|-------------|-------------|-------------|-------------|\n|                  | n = 61      | n = 92      | n = 25      | n = 31      |\n|                  | M (SD)      | M (SD)      | M (SD)      | M (SD)      |\n| TMT (B-A)        | 2.7 (1.1)   | 1.4 (0.9)   | 1.9 (1.2)   | 1.6 (1.1)   |\n| CDR sum of boxes | 3.8 (2.8)   | 1.5 (1.5)   | 1.9 (1.5)   | 2.7 (2.5)   |\n| FAQ              | 12.4 (9.8)  | 4.5 (5.9)   | 4.7 (5.6)   | 9.1 (9.0)   |\n| NPI-Q            | 4.4 (4.6)   | 1.8 (2.6)   | 4.0 (4.0)   | 1.7 (2.5)   |\n| GDS              | 1.6 (2.0)   | 1.4 (1.4)   | 3.8 (3.4)   | 0.6 (0.7)   |\nNote: TMT (B-A) = Trail Making Test. The TMT (B-A) was rescaled to minutes. CDR = Clinician Dementia Rating (clinician-report) . FAQ = Function Activities Questionnaire (patient-report). NPI-Q = Neuropsychiatric Questionnaire (informant-report). GDS = Geriatric Depression Scale (patient-report).", "doc_items_refs": ["#/texts/84", "#/pictures/3", "#/pictures/4", "#/texts/86", "#/tables/6", "#/texts/87"], "page_nos": [1], "uuid": "c2b857a6-df26-4b66-8961-92ca8c5915ac"}
{"doc_id": "2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539.doctags", "chunk_id": 24, "source_chunk_idxs": [29, 30], "num_tokens": 206, "text": "Profile 4: high psychosocial functioning\ncomparable to Profiles 2 and 3. Similar to Profiles 2 and 3, this profile contained more people with aMCI than DAT (68% aMCI, 32% DAT).\n\nPreliminary evidence for profile validity\nPreliminary evaluations of profile validity revealed no significant differences across profiles with regard to age, sex, race, or education, indicating that the profiles were classified by clinical rather than demographic differences. For each criterion variable, within-profile descriptive statistics are provided in Table 6, pairwise comparison results are provided in Table 7, and demographic results are provided in Supplementary Table 3. Due to low sample size for some profiles - Profiles 3 and 4 in particular -we note here that these results provide only preliminary evidence of validity and should be replicated in a larger sample.\nCognition: TMT-B-A. The one-way ANOVA test was significant [ F (3,151) = 12.86, p\n\nTable 7. Pairwise comparisons across profiles (Tukey's HSD)", "doc_items_refs": ["#/texts/88", "#/texts/90", "#/texts/91", "#/texts/94", "#/tables/7"], "page_nos": [1], "uuid": "7bd6d6a7-5105-4520-8d05-a87b3f958268"}
{"doc_id": "2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539.doctags", "chunk_id": 25, "source_chunk_idxs": [31], "num_tokens": 486, "text": "Preliminary evidence for profile validity\n| Domain                | Criterion variable   | Profile (I)   |   Profile (J) | Mean difference (I - J)   | p            | Lower bound   | Upper bound   |\n|-----------------------|----------------------|---------------|---------------|---------------------------|--------------|---------------|---------------|\n| Cognition             | TMT (B-A)            |               |             1 | 2                         | 1.30         | < 0.01<fcel>  |               |\n|                       |                      |               |             3 | 0.82                      | 0.04         | 1.59          | 0.04          |\n|                       |                      |               |             4 | 1.07                      | < 0.01<fcel> | 0.36          |               |\n|                       |                      |               |             2 | 3                         | - 0.48       | 0.28          | - 1.18        |\n|                       |                      |               |             4 | - 0.23                    | 0.78         | 0.40          | - 0.85        |\n|                       |                      |               |             3 | 4                         | 0.25         | 0.86          | - 0.58        |\n| Functional impairment | CDR sum of boxes     | 1             |             2 | 2.27                      | < 0.01<fcel> | 1.37          |               |\n|                       |                      |               |             3 | 1.94                      | < 0.01<fcel> | 0.62          |               |\n|                       |                      |               |             4 | 1.16                      | 0.07         | 2.38          | - 0.06        |\n|                       |                      |               |             3 | - 0.33                    | 0.90         | 0.93          | - 1.59        |\n|                       |                      |               |             4 | - 1.12                    | 0.06         | 0.03          | - 2.27        |\n|                       |                      |               |             3 | - 0.79                    | 0.53         | 0.72          | - 2.29        |", "doc_items_refs": ["#/tables/7"], "page_nos": [1], "uuid": "79ea1647-7da5-4321-81f1-cb176bd2ffd9"}
{"doc_id": "2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539.doctags", "chunk_id": 26, "source_chunk_idxs": [32], "num_tokens": 509, "text": "Preliminary evidence for profile validity\n|                       | FAQ                  | 1             |             2 | 7.89                      | < 0.01<fcel> | 4.42          |               |\n|                       |                      |               |             3 | 7.75                      | < 0.01<fcel> | 2.63          |               |\n|                       |                      |               |             4 | 3.30                      | 0.26         | 7.93          | - 1.33        |\n|                       |                      |               |             2 | - 0.14                    | 1.00         | 4.78          | - 5.05        |\n|                       |                      |               |             4 | - 4.59                    | 0.04         | - 0.19        | - 8.99        |\n|                       |                      |               |             3 | - 4.46                    | 0.19         | 1.34          | - 10.25       |\n| Behavioral health     | NPI-Q                | 1             |             2 | 2.54                      | < 0.01<fcel> | 0.94          |               |\n|                       |                      |               |             3 | 0.38                      | 0.98         | 2.82          | - 2.06        |\n|                       |                      |               |             4 | 2.71                      | < 0.01<fcel> | 0.59          |               |\n|                       |                      |               |             2 | - 2.16                    | 0.08         | 0.15          | - 4.47        |\n|                       |                      |               |             4 | 0.17                      | 1.00         | 2.15          | - 1.80        |\n|                       |                      |               |             3 | 2.33                      | 0.12         | 5.04          | - 0.37        |\n|                       | GDS                  | 1             |             2 | 0.25                      | 0.86         | 1.08          | - 0.58        |\n|                       |                      |               |             3 | - 2.18                    | < 0.01<fcel> | - 3.48        |               |\n|                       |                      |               |             4 | 1.04                      | 0.08         | 2.17          | - 0.09        |\n|                       |                      |               |             2 | - 2.44                    | < 0.01<fcel> | - 3.67        |               |\n|                       |                      |               |             4 | 0.79                      | 0.22         | 1.84          | - 0.27        |\n|                       |                      |               |             3 | 3.22                      | < 0.01<fcel> | 1.78          |               |\nNote: For each outcome, the family-wise error was fixed at p\nFunctioning) had the largest (i.e., worst) values on this variable, indicative of cognitive impairment. The other groups did not differ significantly from one another, as was observed with the NIHTBCB indicator variables.", "doc_items_refs": ["#/tables/7", "#/texts/95", "#/texts/96"], "page_nos": [1], "uuid": "14652704-b666-40bb-a7fe-d44f32d74367"}
{"doc_id": "2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539.doctags", "chunk_id": 27, "source_chunk_idxs": [33], "num_tokens": 161, "text": "Preliminary evidence for profile validity\nFunctional Impairment: CDR Sum of Boxes and FAQ. One-way ANOVA tests were significant for the CDR Sum of Boxes [ F (3,196) = 14.85, p\nMental and Behavioral Health: NPI-Q, GDS, and Clinical Diagnoses of Depression. NPI-Q [ F (3,173) = 7.40, p\nchallenges specifically, whereas the NPI-Q scores of Profile 1 were more influenced by other neuropsychiatric symptoms. This finding was further supported by members of Profile 3 being the most likely (75% of profile members) to have received clinical diagnoses of depression within the previous two years, although this variable had a high rate of missing data (59.8%).", "doc_items_refs": ["#/texts/97", "#/texts/98", "#/texts/100"], "page_nos": [1], "uuid": "3b8edf83-3559-457e-a338-fe8fc7be5686"}
{"doc_id": "2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539.doctags", "chunk_id": 28, "source_chunk_idxs": [34], "num_tokens": 445, "text": "Discussion\nAD is a complex and heterogeneous condition that affects many domains of health and well-being, including behavioral/psychological, motor, sensory, and social functioning (Cheng et al., 2023; Kew et al., 2022). Data reduction approaches, for example, following the NIH Symptom Science Model framework (Cashion et al., 2016), offer researchers and clinicians opportunities to identify trends in symptoms and patient subtypes with the ultimate goal of providing patients with more effective and person-centered care (Jang et al., 2020; Leousatsok et al., 2015b; Machulda et al., 2019). Whereas most previous LPA research has focused on patient profiles within a single domain of functioning, the work presented here investigated profiles across domains of functioning measured by the NIHTB. This work benefited from all NIHTB tests being co-normed and from the sample overrepresenting Black/ African American participants (30%) compared to the U.S. population (14.2%) (Martinez &amp; Passel, 2025).\nOur data from 209 older adults with a MCI or DAT were best modeled with a 4-profile solution. Profile 1 was characterized by\naverage to low-average psychosocial functioning but otherwise low functioning across other domains. Profiles 2, 3, and 4, which contained 82% of individuals with MCI, differed most notably based on emotional and social functioning: low (Profile 3), average (Profile 2), or high (Profile 4). Crystallized cognitive abilities, motor functioning (endurance), and sensory (hearing) functioning did not strongly differ among the profiles. Although others have described heterogeneity in MCI/DAT patient presentations of motor and sensory signs and symptoms (Albers et al., 2015), they did not systematically cohere with patient subtypes in our sample. These data indicate that although low physical functioning and poor hearing are related to cognitive and functional health, ambulatory endurance and hearing in a multi-talker babble paradigm do not significantly differentiate among people with MCI and DAT syndromes.", "doc_items_refs": ["#/texts/102", "#/texts/103", "#/texts/106"], "page_nos": [1], "uuid": "199a3ba5-b16a-417b-b8bf-d269fa01404f"}
{"doc_id": "2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539.doctags", "chunk_id": 29, "source_chunk_idxs": [35], "num_tokens": 424, "text": "Discussion\nRecently reported data from the ARMADA cohort indicated that, based on group means, people with MCI and DAT generally reported average psychosocial functioning (M. Zhang et al., 2023) compared with the general population. The profiles reported here, however, reveal distinct subgroups of people with low, average, and high psychosocial functioning, and these may provide a broader context for the cognitive-only profiles reported by others. As many as one-third of people who meet clinical diagnoses of MCI produce grossly normal or only mildly low cognitive test scores compared to normative group means (Blanken et al., 2020; Edmonds et al., 2015). Blanken et al. (2020) discussed the possibility that those participants may be influenced by noncognitive factors. Our results support this possibility. People in Profile 3 (mostly people with aMCI) produced relatively normal cognitive test scores, but low psychosocial functioning. The preliminary validity analyses also revealed that this group reported the most/worst symptoms of depression on the GDS and were the most likely to have been diagnosed with depression. This may be the same subgroup of people in the \" subtle cognitive impairment \" reported by Machulda et al. (2019), who comprised a subset of their aMCI cluster (other clusters were dysexecutive and dysnomic). If so, our findings additionally indicate that people with that cognitive profile may be influenced by emotional (e.g., low mood) and social (e.g., isolation) challenges, and may benefit from special attention from psychologists and social workers. Their cognitive test scores are not that low (generally within -1SD), yet they have clinical diagnoses of MCI and DAT. It may be the case that their low socialemotional functioning amplifies the effects of mild cognitive weaknesses on everyday cognitive tasks and independent living. These group members likely have the worst quality of life, and mood disorders and social isolation are known to accelerate cognitive decline (Livingston et al., 2024).", "doc_items_refs": ["#/texts/107"], "page_nos": [1], "uuid": "230bc195-6ebf-4370-befa-3da5d2b73b5a"}
{"doc_id": "2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539.doctags", "chunk_id": 30, "source_chunk_idxs": [36], "num_tokens": 225, "text": "Discussion\nWhereas most research about the cognitive effects of psychosocial factors has been correlational, more recent evidence provides experimental evidence for the modifiability of social isolation and its effects on cognition. For example, the Internetbased Conversational Engagement Clinical Trial (I-CONECT) evaluated whether socially isolated older adults with and without MCI could enhance cognitive function and psychological wellbeing through increased social interactions (e.g., video conversations for 30 minutes/day, four times/week) with trained conversational staff (Dodge et al., 2024; K. Yu et al., 2021). This social intervention displayed efficacy in improving global cognition among the MCI participants with a large effect size (Cohen ' s d of 0.73) after 6 months of the intervention. Notably, both the intervention and control groups - the latter receiving brief weekly check-in calls - also showed improvements in psychological well-\nbeing (Dodge et al., 2024). This research suggests that even brief weekly contacts could effectively enhance emotional well-being among socially isolated older individuals, such as those in Profile 3.", "doc_items_refs": ["#/texts/108", "#/texts/110"], "page_nos": [1], "uuid": "1fc3b494-6f39-407a-a147-18e71841eb6a"}
{"doc_id": "2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539.doctags", "chunk_id": 31, "source_chunk_idxs": [37], "num_tokens": 475, "text": "Discussion\nProfile 4 (High Psychosocial Functioning) was particularly intriguing. Not only was this profile notable for the absence of negative emotions, but also a remarkable degree of positive emotions. On average, individuals displayed only mild cognitive weaknesses, similar to Profiles 2 and 3, but reported and were rated to have more functional challenges than Profiles 2 or 3, although the difference was not quite significant statistically. Siew et al. (2023) reported three latent profiles (low, average, and high psychosocial functioning) similar to our Profiles 2, 3, and 4, based on their study of community-dwelling adults with MCI in Singapore. Their high psychosocial group was their largest group (45.2% of sample), whereas it was our smallest (15% of sample). These differences between the Singaporean and U.S. samples might indicate that high psychosocial functioning relates to cultural/ psychological/environmental variables, such as resilience and coping with chronic conditions, rather than biological/neuropathological differences between the psychosocial profiles. Indeed, resilience has been shown to relate to positive emotions in people with MCI (Tsormpatzoudi et al., 2023). Individuals in this profile group may be well suited for exercise or dietary interventions that require resolve and grit, as opposed to mental health interventions more appropriate for Profile 3. A less likely possibility is that Profile 4 may represent people with the cognitive subtype of functional neurological disorder, which is increasingly recognized as being common in memory disorder clinics, perhaps affecting as many as 12 -56% patients in those settings (Ball et al., 2020). The fact that Profile 4 may display more functional problems than others with similar cognitive abilities (Profiles 2 and 3) might be a sign of functional neurological disorder, and their unexpected positive affect might reflect what some have termed \" la belle indifference, \" known to accompany functional neurological disorders (Gokarakonda &amp; Kumar, 2024). A third possibility is that this group experiences anosognosia (Tagai et al., 2020) - a lack of awareness of their limitations. This might explain the relative lack of negative affect, but it does not explain the presence of positive affect. These tree and other possible interpretations of Profile 4 would need to be supported with future research.", "doc_items_refs": ["#/texts/111"], "page_nos": [1], "uuid": "44147047-697c-4f7d-b2c1-cf51811fad07"}
{"doc_id": "2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539.doctags", "chunk_id": 32, "source_chunk_idxs": [38], "num_tokens": 430, "text": "Discussion\nBecause all participants with MCI had the amnestic subtype as an inclusion criterion, the inclusion of memory scores as an LPA indicator or covariate was not productive in distinguishing profiles. This potentially limits our findings because we cannot represent participants with non-amci or evaluate the effects of memory scores on latent profiles. On the other hand, the psychosocial aspects of Profiles 2, 3, and 4, in particular, closely resemble the psychosocial profiles reported by Siew et al.(2023), who included a list-learning memory test as an indicator variable. Similar to our findings, Siew et al., also found that their MCI profiles differed only on psychosocial variables rather than demographic or cognitive variables, and they included participants with multiple MCI subtypes (including non-aMCI). The fact that they found similar profiles provides confidence that our findings were not overly influenced by only including amnestic participants and the absence of an episodic memory indicator variables, although this needs to be confirmed with future research.\nFuture research with broader inclusion criteria and more participants might produce a richer connection with previous single-domain investigations, for example, that more clearly show cognitive subtypes of MCI or mild behavioral impairment. Furthermore, the ARMADA data we analyzed lacked an\nassessment of auditory sensitivity, although an NIHTB Hearing Threshold Test has subsequently been developed (Wiseman et al., 2022). This is a limitation and future research should include this or a similar measure to be able to understand the role of other hearing variables in differentiating profiles of aMCI/DAT further.\nOur sample of 209 participants is on the lower end of reported studies using LPA. Although we have presented evidence for why we believe the identified solution would replicate in a larger sample, this would need to be determined empirically. A larger sample size would be especially valuable for detecting smaller differences between the profiles as part of the validity analyses. Because of the relatively small number of people in Profiles 2, 3, and 4, some of the validity analyses presented here that compared these profiles were likely underpowered.", "doc_items_refs": ["#/texts/112", "#/texts/113", "#/texts/116", "#/texts/117"], "page_nos": [1], "uuid": "2dd834a4-f5a2-444e-8244-32b08ab9d45a"}
{"doc_id": "2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539.doctags", "chunk_id": 33, "source_chunk_idxs": [39], "num_tokens": 347, "text": "Discussion\nThis work highlights the value of modeling cognitive and psychosocial variables together to understand patient profiles in MCI and early-stage DAT. Future studies might consider detailed investigations of individuals with high, average, and low psychosocial profiles to better understand risk and resilience factors, the stability of these profiles over time, and responses to intervention. The most recent report from the Lancet Commissions revealed that up to 40% of cases of dementia are potentially modifiable in middle and later life by addressing hearing loss, high LDL cholesterol, hypertension, excessive alcohol intake, obesity, smoking, depression, social isolation, physical inactivity, visual loss, air pollution, and diabetes (Livingston et al., 2024). Current multicomponent interventions generally target diet, exercise, cognitive training, and management of cardiometabolic conditions (Cohen et al., 2021). The work presented here highlights the additional importance of emotional and social variables as well and may eventually help to match people to interventions based on their profile.\nSupplementary material. The supplementary material for this article can be found at https://doi.org/10.1017/S1355617725101276.\nAcknowledgements. This work was supported by the National Institute of Nursing Research (D.T., C.T., A.B., J.S., and M.C., grant number 1R01NR018684), and the National Institute on Aging (R.G., S.W., and J.S., grant number U2C AG057441).\nCompeting interests. No author has a conflict of interest.", "doc_items_refs": ["#/texts/118", "#/texts/119", "#/texts/120", "#/texts/121"], "page_nos": [1], "uuid": "fedd03b8-3c31-42d1-9f67-8ac5338a9660"}
{"doc_id": "2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539.doctags", "chunk_id": 34, "source_chunk_idxs": [40], "num_tokens": 512, "text": "References\nAgelink Van Rertergen, J. A., Deserno, M. K., &amp; Geurts, H. M. (2021). Validation strategies for subtypes in psychiatry: A systematic review of research on autism spectrum disorder. Clinical Psychology Review , 87 , 1 -22. https://doi.org/10.1016/j.cpr.2021.102033\nAlbers, M. W., Gilmore, G. C., Kaye, J., Murphy, C., Wingfield, A., Bennett, D. A., Boxer, A. L., Buchman, A. S., Cruickshanks, K. J., Devanand, D. P., Duffy, C. J., Gall, C. M., Gates, G. A., Granholm, A., Schensh, T., Holtzer, R., Hyman, B. T., Lin, F. R., McKee, A. C. . . Zhang, L. M. (2015). At the interface of sensory and motor dysfunctions and Alzheimer's disease. Alzheimer's &amp; Dementia , 11 , 70 -98.\nAlbert, M. S., DeKosky, S. T., Dickson, D., Dubois, B., Feldman, H. H., Fox, N. C., Gamst, A., Holtzman, D. M., Jagust, W. J., Petersen, R. C., Snyder, P. J., Carrillo, M. C., Thies, B., &amp; Phelps, C. H. (2011). The diagnosis of mild cognitive impairment due to Alzheimer's disease: Recommendations from the national institute on aging-Alzheimer's association workgroups on diagnostic guidelines for Alzheimer's disease. Alzheimer's &amp; Dementia: The Journal of the Alzheimer ' s Association , 7 , 270 -279.\nBabakhanyan, I., McKenna, B. S., Casaleto, K. B., Nowinski, C. J., &amp; Heaton, R. K. (2018). National institutes of health toolbox emotion battery for english-\nand Spanish-speaking adults: Normative data and factor-based summary scores. Patient Related Outcome Measures , 9 , 115 -127.", "doc_items_refs": ["#/texts/123", "#/texts/124", "#/texts/125", "#/texts/126", "#/texts/128"], "page_nos": [1], "uuid": "531dfc23-afea-4c0f-8b34-a0ac9c531e6f"}
{"doc_id": "2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539.doctags", "chunk_id": 35, "source_chunk_idxs": [41], "num_tokens": 438, "text": "References\nBall, H. A., McWhirter, L., Ballard, C., Bhome, R., Blackburn, D. J., Edwards, M. J., Fleming, S. M., Fox, N. C., Howard, R., Huntley, J., Isaacs, J. D., Larner, A. J., Nicholson, T. R., Pennington, C. M., Poole, N., Price, G., Price, J. P., Reuber, M., Ritchie, C. . . . Carson, A. J. (2020). Functional cognitive disorder: Dementia ' s blind spot. Brain , 143 , 2895 -2903.\nBauer, J. (2022). A primer to latent profile and latent class analysis. In Methods for researching professional learning and development: Challenges, applications and empirical illustrations (pp. 243 -268). Springer.\nBlanken, A. E., Jang, J. Y., Ho, J. K., Edmonds, E. C., Han, S. D., Bangen, K. J., &amp; Nation, D. A. (2020). Dilling heterogeneity of mild cognitive impairment in the national Alzheimer coordinating center database using latent profile analysis. JAMA Network Open , 3 , e200413.\nBrown, P. J., Devanand, D. P., Liu, X., Caccappolo, E., &amp; Alzheimer ' s Disease Neuroimaging Initiative. (2011). Functional impairment in elderly patients with mild cognitive impairment and mild Alzheimer disease. Archives of general psychiatry , 68(6), 617 -26.\nCashion, A. K., Gill, J., Haves, R., Henderson, W. A., &amp; Saligan, L. (2016). National institutes of health symptom science model sheds light on patient symptoms. Nursing Outlook , 64 , 499 -506.", "doc_items_refs": ["#/texts/129", "#/texts/130", "#/texts/131", "#/texts/132", "#/texts/133"], "page_nos": [1], "uuid": "606402d2-6d31-4138-97f2-ba0d2fc0367a"}
{"doc_id": "2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539.doctags", "chunk_id": 36, "source_chunk_idxs": [42], "num_tokens": 500, "text": "References\nCassidy-Eagle, E., Siebern, A., Unti, L., Glassman, J., &amp; O ' haR, 8 (2018). Neuropsychological functioning in older adults with mild cognitive impairment and insomnia randomized to CBT-I or control group. Clinical Gerontologist , 41 , 136 -144.\nCeleux, G., &amp; Soromenho, G. (1996). An entropy criterion for assessing the number of clusters in a mixture model. Journal of Classification , 13 , 195 -212. -Cella, D., Riley, W., Stone, A., Rothrock, N., Reeve, B., Yount, S., Amtmann, D., Bode, R., Buysse, D., Choi, S., Cook, K., DeVellis, R., DeWalt, D., Fries, J. F., Gershon, R., Hahn, E. A., Lai, J.-S., Pilkonis, P., Revicki, D., Rose, M., Weinfurt, K., Hays, R. (2010). The patient-reported outcomes measurement information system (PROMIS) developed and tested its first wave of adult self-reported health outcome item banks: 2005 -2008. Journal of Clinical Epidemiology , 63 , 1179 -194.\nCheng, Y., Ho, E., Weintraub, S., Rentz, D., Gershon, R., Das, S., &amp; Dodge, H. H. (2024). Predicting brain amyloid status using the national institute of health toolbox (NIHTB) for assessment of neurological and behavioral function. The Journal of Prevention of Alzheimer ' s Disease , 11 , 943 -957. Cheng, Y., Ho, E., Weintraub, S., Rentz, D. M., Gershon, R. C., Das, S., &amp; Dodge, H. H. (2023). Predicting brain amyloid status using the NIHT toolbox for assessment of neurological and behavioral function (NIHTB). Alzheimer ' s &amp; Dementia , 19 , e082364.", "doc_items_refs": ["#/texts/134", "#/texts/135", "#/texts/136"], "page_nos": [1], "uuid": "32365aad-07f0-448d-a322-1da15f76d277"}
{"doc_id": "2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539.doctags", "chunk_id": 37, "source_chunk_idxs": [43], "num_tokens": 433, "text": "References\nCohen, M. L., Ryan, A. C., &amp; Lanzi, A. M. (2021). Prevention of and early intervention for cognitive decline due to Alzheimer ' s disease and related disorders. Delaware Journal of Public Health . 7 (4), 118 -122. doi: 10.32481/ djph.2021.09.014\nCorrigan, J. D., &amp; Hinkeldey, N. S. (1987). Relationships between parts a and b of the trail making test. Journal of Clinical Psychology , 43 , 402 -409 Dodge, H. H., Mattek, N. C., Austin, D., Hayes, T. L., &amp; Kaye, J. A. (2012). In-home walking speeds and variability trajectories associated with mild\nepitome. Brain Neurology , 78 , 1946 -1952. Dodge, H. H., Yu, K., Wu, C., Y., Pruitt, P. J., Asgari, M., Kaye, J. A., Hampstead, B. M., Struble, L., Potempal, K., Lichtenberg, P., Croff, R., Albin, R., L., Silbert,\nDodge, H. H., Yu, K., Wu, C., Y., Pruitt, P. J., Asgari, M., Kaye, J. A., Hampstead, B. M., Struble, L., Potempal, K., Lichtenberg, P., Croff, R., Albin, R., Silbert, L., C. L., the I-CONE Team, Alfaro, E., McDonald, M., Lindsey, J., Savcone, C., Sheridan, N. . . . Bhaumik, A. K. (2024). Internet-based conversational", "doc_items_refs": ["#/texts/137", "#/texts/138", "#/texts/139", "#/texts/140"], "page_nos": [1], "uuid": "658e05f0-a9da-4ac4-b22b-93a6674ed009"}
{"doc_id": "2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539.doctags", "chunk_id": 38, "source_chunk_idxs": [44], "num_tokens": 457, "text": "References\nengagement randomized controlled clinical trial (I-CONECT) among socially isolated adults 75 + years old with normal cognition or mild cognitive impairment: The Gerontologist , 64 , gnad147. Dorsey, S. G., Griffio, M. A., Renn, C. L., Cashion, A. K., Colloca, L., Jackson, Cook, C. K., Gill, J., Henderson, W., Kim, H., Joseph, P. V., Saligan, L., Starkweather, A. R., &amp; Lyon, D. (2019). Working together to advance symptom science in the precision era. Nursing Research , 68 , 86 -90.\nDu, L., Langhough, R., Hermann, B. P., Jonaitis, E., Betheuser, T. J., Cody, K. A., Mueller, K., Suellersdorff, M., Chin, N., Ennis, G. E., Bendlin, B. B., Gleason, C. E., Christian, B. T., Plante, D. T., Chappell, R. &amp; Johnson, S. C. (2023). Associations between self-reported sleep patterns and health, cognition and amyloid measures: Results from the Wisconsin registry for Alzheimer ' s\nDubois, B., Feldman, H. H., Jacova, C., Hampel, H., Molinuevo, J. L., Blennow, K., DeKosky, S. T., Gauthier, S., Selkoe, D., Bateman, R., Cappa, S., Crutch, S., Engelborghs, S., Frisoni, G. B., Fox, N. C., Galasko, D., Habert, M. O., Jicha, G. A., Nordberg, A. . . . Cummings, J. L. (2014). Advancing research diagnostic criteria", "doc_items_refs": ["#/texts/141", "#/texts/142", "#/texts/146"], "page_nos": [1], "uuid": "018d7625-9ec5-4f4d-bc32-efa5b2f4dd13"}
{"doc_id": "2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539.doctags", "chunk_id": 39, "source_chunk_idxs": [45], "num_tokens": 489, "text": "References\nfor Alzheimer ' s disease: The IWG-2 criteria. The Lancet Neurology , 13 , 614 -629. Edmonds, E. C., Delano-Wood, L., Clark, L. R., Jak, A. J., Nation, D. A., McDonald, C. R., Libon, D. J., Au, R., Galasko, D., Salmon, D. P., Bondi, M. W., &amp; Alzheimer ' s Disease Neuroimaging Initiative (2015). Susceptibility of the conventional criteria for mild cognitive impairment to false-positive diagnostic errors. Alzheimer ' s &amp; Dementia , 11 , 415 -424.\nGershon, R., Nowinski, C., Peipert, J. D., Dietber, K., Ustinskiovich, V., Hook, J., Fox, R., &amp; Weintraub, S. (2020). Use of the NIH toolbox for assessment of mild cognitive impairment and Alzheimer ' s disease in general population, African-American and Spanish-speaking samples of older adults: Neuropsychology: Cognitive and functional assessment in diverse populations. Alzheimer ' s &amp; Dementia , 16 , e043372.\nGershon, R. C., Wagster, M. V., Hendrie, H. C., Fox, N. A., Cook, K. F., &amp; Nowinski, C. J. (2013). NIH toolbox for assessment of neurological and behavioral function. Neurology , 80 , S2 -6.\nGiordani, B., Goldstein, F. C., Rigby, T., Gregoire, A., Reader, J. M., Fisher, J., Gurecki, S., Bhaumik, A. K., Ho, E., Ustinoisvich, V., Gershon, R. C., &amp; Weintraub, S. (2022). Construct validity indicators from the ARMADA STUDY for the tablet computer-based NIH toolbox cognition battery. Alzheimer ' s &amp; Dementia , 18 , e068164.", "doc_items_refs": ["#/texts/147", "#/texts/148", "#/texts/149", "#/texts/150"], "page_nos": [1], "uuid": "0a6d9b94-1eb8-41c1-b74d-998097a6cd1f"}
{"doc_id": "2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539.doctags", "chunk_id": 40, "source_chunk_idxs": [46], "num_tokens": 498, "text": "References\nGokarakorda, S., &amp; Kumar, N. (2024). La Belle indifference. StatPearls. PMID: 32809677.\nHackett, K., Krikorian, R., Giovannetti, T., Melendez-Cabrero, J., Rahman, A., Caesar, E., Chen, J., Hrist, V., Hestoff, A., Mosconi, L., &amp; Isaacson, R. S. (2018). Utility of the NIH toolbox for assessment of prodromal Alzheimer ' s disease and Dementia. Alzheimer ' s &amp; Dementia: Diagnosis &amp; Assessment &amp; Disease Monitoring , 10 , 764 -772.\nHarris, C. S., Dodd, M., Kober, K. M., Dhruva, A. A., Hammer, M. J., Conley, Y. P., &amp; Miskowski, C. A. (2022). Advances in conceptual and methodological issues in symptom cluster research: A 20-year perspective. Advances in Nursing Science , 45 , 309 -322.\nHeaton, R. K., Akshoomoff, N., Tulsky, D., Mungas, D., Weintraub, S., Dikmen, S., Beaumont, J., Casaleto, K. B., Conway, K., Slotkin, J., &amp; Gershon, R. (2014). Reliability and validity of composite cores from the NIH toolbox cognition battery in adults. Journal of the International Neuropsychological Society: JINS , 20 , 588 -598.\nIsmail, Z., Smith, E. E., Geda, Y., Tultsler, D., Brody, H., Smith, G., AgüeraOrtiz, L., Sweet, R., Miller, D., Lyketsos, C. G., &amp; ISTAART Neuropsychiatric Symptoms Professional Interest Area (2016). Neuropsychiatric symptoms as early manifestations of emergent Dementia: Provisional diagnostic criteria for mild behavioral impairment. Alzheimer ' s &amp; Dementia , 12 , 195 -202.", "doc_items_refs": ["#/texts/151", "#/texts/152", "#/texts/153", "#/texts/154", "#/texts/155"], "page_nos": [1], "uuid": "183e651b-3e62-4098-a6eb-5e9e73b1db0a"}
{"doc_id": "2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539.doctags", "chunk_id": 41, "source_chunk_idxs": [47], "num_tokens": 462, "text": "References\nJang, J. Y., Ho, J. K., Blanken, A. E., Dutt, S., Nation, D. A., the Alzheimer ' s Disease Neuroimaging Initiative (2020). Affective neuropsychiatric symptoms as early signs of Dementia risk in older adults. Journal of Alzheimer ' s Disease , 77 , 1195 -1207.\nJester, D. J., Andel, R., Cechová, K., Laczó, J., Lerch, O., Marková, H., Nikolai, T., Vyhnálek, M., &amp; Hort, J. (2021). Cognitive phenotypes of older adults with subjective cognitive decline and amnicm silent cognitive impairment: The Czech brain aging study. Journal of the International Neuropsychological Society , 27 , 329 -342.\nJohnson, J. C. S., Marshall, C. R., Weil, R. S., Bamiou, D.-E., Hardy, C. J. D., &amp; Warren, J. D. (2021). Hearing and Dementia: From ears to brain. Brain , 144 , 391 -401.\nKarpouzian-Rogers, T., Ho, E., Novack, M., Chinkers, M., Bedjeti, K., Nowinski, C., Giordani, B., Gershon, R., &amp; Weintraub, S. (2023). Baseline characterization of the ARMADA (Assessing reliable measurement in Alzheimer ' s disease) study cohorts. Alzheimer ' s &amp; Dementia , 19 , 1974 -1982.\nKauer, D. I., Cummings, J., Ketchel, P., Smith, V., MacMillan, A., Shelley, T., Lopez, O., &amp; DeKosky, S. (1992). Validation of the NPI-Q, a brief clinical form of the neuropsychiatric inventory. The Journal of Neuropsychiatry and Clinical Neurosciences , 268 , 1473.", "doc_items_refs": ["#/texts/156", "#/texts/157", "#/texts/158", "#/texts/159", "#/texts/160"], "page_nos": [1], "uuid": "44a105ab-7e31-4883-b8a1-a1f5f7201848"}
{"doc_id": "2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539.doctags", "chunk_id": 42, "source_chunk_idxs": [48], "num_tokens": 487, "text": "References\nKew, C. L., Juengst, S. B., Kelley, B., &amp; Osborne, C. L. (2022). Linking problems reported by care partners of individuals with Alzheimer ' s disease and Lewy-\nBody Dementia to the international classification of functioning disability and health. Gerontology and Geriatric Medicine , 8 , 23373221422868.\nLanza, S. T., &amp; Cooper, B. R. (2016). Latent class analysis for developmental research. Child Development Perspectives , 10 , 59 -64.\nLeousats, J. M., S. Forrester, S. N., Lyketsos, C. G., &amp; Smith, G. S. (2015b). Latent classes of neuropsychiatric symptoms in NACC controls and conversion to mild cognitive impairment or Dementia. Journal of Alzheimer ' s Disease , 48 , 483 -493.\nLeousats, J.-M., S. Forrester, S. N., Lyketsos, C G., &amp; Smith, G. S. (2015a). Latent classes of neuropsychiatric symptoms in NACC controls and conversion to mild cognitive impairment or Dementia. Journal of Alzheimer ' s Disease , 48 , 483 -493.\nLivingston, G., Huntley, J., Liu, K. Y., Costafreda, S. G., Selbæk, G., Alladi, S., Ames, D., Banerjee, S., Burns, A., Brayne, C., Fox, N. C., Ferri, C., Pitlin, G. N., Howard, R., Kales, H. C., Kivimäki, M., Larson, E. B., Nakasujka, J., Rockwood, K. K., Mukadam, M. (2024). Dementia prevention, intervention, and care: 2024 report of the Lancet standing Commission. The Lancet , S014063724012960, https://doi.org/10.1601/S0140/6736-24(01296-0.", "doc_items_refs": ["#/texts/161", "#/texts/163", "#/texts/164", "#/texts/165", "#/texts/166", "#/texts/167"], "page_nos": [1], "uuid": "1aea2fb0-d5aa-4ac3-ae14-2a51e8f967d1"}
{"doc_id": "2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539.doctags", "chunk_id": 43, "source_chunk_idxs": [49], "num_tokens": 500, "text": "References\nMa, Y., Carlsson, C. M., Wahoske, M. L., Blazel, H. M., Chappell, R. J., Johnson, S. C., Asthana, S., &amp; Gleason, C. E. (2021). Latent factor structure and measurement invariance of the NIH toolbox cognition battery in an Alzheimer ' s disease research sample. Journal of the International Neuropsychological Society , 27 , 412 -425.\nMachulha, M. M., Lundt, E. S., Albertson, S. M., Kremers, W. K., Mielke, M. M., Knopman, D. S., Bondi, M. W., &amp; Petersen, R. C. (2019). Neuropsychological subtypes of incident mild cognitive impairment in the mayo clinic study of aging. Alzheimer ' s &amp; Dementia , 15 , 878 -887.\nMahoney, D., &amp; Pierce, J. D. (2022). Ovarian cancer symptom clusters: Use of the NIH symptom science model for precision in symptom recognition and management. Clinical Journal of Oncology Nursing , 26 , 533 -542.\nMartinez, G., &amp; Passel, J. (2025). Pew research center: Facts about the U.S. Black Population. https://www.pwepresearch.org/race-and-ethnicity/fact-sheet/ Martinez, G., &amp; Passel, J. (2013). Chapter 25: Latent class analysis and finite mixture modeling. In T. D. Little (Ed.), The Oxford Handbook of Quantitative Methods (Statistical Analysis . vol. 2 , p. 551 -611). Oxford University Press.\nMasyn, K. E. (2013). Chapter 2. Dying. D. (2013). Dying. J. C. S., Pohl, D. S. (2014). Dementia analysis. Journal of Wiley &amp; Sons.\nMclachlan, G. J., Peel, D. (2000). Finite Mixture Models. In Wiley Series in Probability and Statistics . John Wiley &amp; Sons.", "doc_items_refs": ["#/texts/168", "#/texts/169", "#/texts/170", "#/texts/171", "#/texts/172", "#/texts/173"], "page_nos": [1], "uuid": "d65b3d83-ac7d-4350-8187-992d1596035a"}
{"doc_id": "2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539.doctags", "chunk_id": 44, "source_chunk_idxs": [50], "num_tokens": 477, "text": "References\nMclachlan, G. J., Lee, S. X., &amp; Rathaynake, S. I. (2019). Finite mixture models. Annual Review of its and its Application , 6 , 355 -378. https://doi.org/\n10.1146/annurev-statistical 031017-100325. Powell, D. S., Oh, M., Reidr, C., Dunn, K., Fracki, D., Zimmerman, L., Xiao, C., Matco, M., &amp; Marden, S. (2017). Advancing symptom science through symptom cluster research: Expert panel proceedings and recommendations. Journal of the National Cancer Institute , 109 , dwj253.\nMis, R., Devlin, K., Drabick, D., &amp; Giovanni, T. (2019). Heterogeneity of informant-reported functional performance in mild cognitive impairment: A latent profile analysis of the functional activities questionnaire. Journal of Alzheimer ' s Disease, 68 , 1156 -1624.\nMorris, J. C. (1993). The Clinical Dementia rating (CDR) : Current version and scoring. Neurological Nursing , 43 , 2412 -2414.\nNolin, S. S., Cowart, H., Merritt, S., McInerney, K., Bharadwaj, P. K., Franchitti, M. M., Raichlen, D. A., Jessup, C. J., Hishaw, G. A., Van Etten, E. J., Trouard, T. P., Geldmacher, D. S., Yadley, V. G., Porges, E. S., Woodes, A. J., Cohen, R. A., Levin, B. E., Rundek, T., Alexander, G. E., &amp; Visscher, K. M. (2023). Validity of the NIH toolbox cognitive battery in a healthy oldest -85 + Sample. Journal of the International Neuropsychological Society , 29 , 605 -614.", "doc_items_refs": ["#/texts/174", "#/texts/175", "#/texts/176", "#/texts/177", "#/texts/178"], "page_nos": [1], "uuid": "ad149df6-4b83-459b-a695-18b3bb793a98"}
{"doc_id": "2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539.doctags", "chunk_id": 45, "source_chunk_idxs": [51], "num_tokens": 428, "text": "References\nO'Bryant, S. E. (2008). Staging Dementia using clinical Dementia rating scale of boxes scores: A Texas Alzheimer ' s research consortium study. Archives of Neurology , 65 , 1091.\nPowell, D. S., Oh, M., Reed, N. S., Lin, F. R., &amp; Deal, J. A. (2022). Hearing loss and cognition: What we know and where we need to go. Frontiers in Aging Neuroscience , 13 , 769405.\nRoberto, N., Portella, M. J., Marquíé, M., Alegret, M., Hernández, I., Maúleón, A., Rosende-Roca, M., Abdelnour, C., de Antonio, E. E., Gil, S., Tartari, J. P., Vargas, L., Espinosa, A., Ortega, G., Pérez-Córdón, A., Sanabria, Á., Orellana, A., de Rojas, I., Moreno-Grau, S. . . . Valero, S. (2021). Neuropsychiatric\nprofiles and conversion to dementia in mild cognitive impairment, a latent class analysis. Scientific Reports , 11 , 6448.\nRomero, K., Ladyka-Wojcik, N., Heir, A., Bellana, B., Leach, L., &amp; Proulx, G. B. (2022). The influence of cerebrovascular pathology on cluster analysis of neuropsychological scores in patients with mild cognitive impairment. Archives of Clinical Neuropsychology , 37 , 1480-1492.\nSchwarz, G. (1978). Estimating the dimension of a model. The Annals of Statistics , 6 (2), 461-464. https://doi.org/10.1214/aos/1176344136.", "doc_items_refs": ["#/texts/179", "#/texts/180", "#/texts/181", "#/texts/184", "#/texts/185", "#/texts/186"], "page_nos": [1], "uuid": "98298f09-e618-4993-93f0-a5c028229c64"}
{"doc_id": "2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539.doctags", "chunk_id": 46, "source_chunk_idxs": [52], "num_tokens": 499, "text": "References\nScrucca, L., Fop, M., Brendan Murphy, T., &amp; Raftery, A. E. (2016). mclust 5: Clustering, classification and density estimation using Gaussian finite mixture models. The R Journal , 8 (1), 289-317. https://doi.org/10.32614/RJ-2016-021.\nSiew, S. K. H., Yu, J., Kua, E. H., &amp; Mahendran, R. (2023). Psychosocial profiles within community-dwelling older adults with mild cognitive impairment: A prevalence and latent profile analysis study. Asian Journal of Psychiatry, 82 , 103503.\nSnitz, B. E., Tudorascu, D. L., Yu, Z., Campbell, E., Lopresti, B. L., Jaymon, C. M., Minhas, D. S., Nadkarni, N. K., Aizenstein, H. J., Klunk, W. E., Weintraub, S., Gershon, R. C., &amp; Cohen, A. D. (2020). Associations between NIH toolbox cognition battery and in vivo brain amyloid and tau pathology in nondemented older adults. Alzheimer ' s &amp; Dementia: Diagnosis, Assessment &amp; Disease Monitoring , 12 , e2018.\nTagai, K., Nagata, T., Shinagawa, S., &amp; Shigeta, M. (2020). Anosognia in patients with Alzheimer ' s disease: Current perspectives. Psychogeriatrics , 20 , 345-352. Tsormpatzoudi, S. O., Moraitou, D., Papialagkas, P., Ezekrianikis, C., &amp; Tsolaki, M. (2023). Resilience in mild cognitive impairment (MCI): Examining the level and the associations of resilience with subjective wellbeing and negative affect in early and late-stage MCI. Behavioral Sciences , 13 , 792.\nTukey, J. W. (1949). Comparing individual means in the analysis of variance. Biometrics , 99 -114.", "doc_items_refs": ["#/texts/187", "#/texts/188", "#/texts/189", "#/texts/190", "#/texts/191"], "page_nos": [1], "uuid": "7a646488-cebf-4cc4-9c1c-4e33e78be196"}
{"doc_id": "2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539.doctags", "chunk_id": 47, "source_chunk_idxs": [53], "num_tokens": 477, "text": "References\nTyner, C. E., Boulton, A. J., Slotkin, J., Cohen, M. L., Weintraub, S., Gershon, R. C., &amp; Tulsky, D. S. (2024). Exploring symptom clusters in mild cognitive impairment and Dementia with the NIH toolbox. Journal of the International Neuropsychological Society , 30 , 603-614.\nWeintraub, S., Besser, L., Dodge, H. H., Teylan, M., Ferris, S., Goldstein, F. C., Giordani, B., Kramer, J., Loewenstein, D., Mason, D., Mungas, D., Salmon,\nGiordani, B., Kramer, J., Loewenstein, D., Mason, D., Mungas, D., Salmon,\nD., Welsh-Bohmer, K., Zhou, X.-H., Shirk, S. D., Atri, A., Kukull, W. A., Phelps, C., &amp; Morris, J. C. (2018). Version 3 of the Alzheimer disease centers ' neuropsychological test battery in the Uniform Data Set (UDS). Alzheimer Disease &amp; Associated Disorders Version , 32 , 10-17.\nWeintraub, S., Karpouzian-Rogers, T., Peipert, J. D., Nowinski, C., Slotkin, J., Wortman, K., Ho, E., Rogalski, E., Carlsson, C., Giordani, B., Goldstein, F., Lucas, J., Manly, J., J., Rentz, D., Salmon, D., Snitz, B., Dodge, H. H., Riley, M., Eldes, F. . . . Gershon, R. (2022). ARMADA: Assessing reliable measurement in Alzheimer ' s disease and cognitive aging project methods. Alzheimer ' s &amp; Dementia , 18 , 1449-1460.", "doc_items_refs": ["#/texts/192", "#/texts/193", "#/texts/194", "#/texts/195", "#/texts/196"], "page_nos": [1], "uuid": "fb4fc0a6-0923-44ad-bdb6-f2282e2efec7"}
{"doc_id": "2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539.doctags", "chunk_id": 48, "source_chunk_idxs": [54], "num_tokens": 484, "text": "References\nWiseman, K., Slotkin, J., Spratford, M., Haggerty, A., Heusinkvelt, M., Weintraub, S., Gershon, R., &amp; McCreery, R. (2022). Validation of a tabletbased assessment of auditory sensitivity for researchers. Behavior Research Methods , 55 , 2838-2852.\nXu, W., Bai, A., Liang, Y., &amp; Lin, Z. (2024). Motor cognitive risk syndrome and the risk of incident Dementia: A systematic review and meta-analysis of cohort studies. Gerontology , 70 , 479-490.\nYesavage, J. A., &amp; Sheikh, J. K. (2008). Geriatric depression scale (GDS): Recent evidence and development of a shorter version. Clinical Gerontologist , 5 , 165-173.\nYu, J., &amp; Lee, T. M. C. (2018). Profiles of cognitive impairments in an older age community sample: A latent class analysis. Neuropsychology , 32 , 102-109.\nYu, K., Wild, K., Potempa, K., Hampstead, B. M., Lichtenberg, P. A., Struble, L. M., Pruitt, T., Alfaro, E. L., Lindsley, J., MacDonald, M., Kaye, J. A., Silbert, L. C., &amp; Dodge, H. H. (2021). The internet-based conversational engagement clinical trial (I-CONET) in socially isolated adults 75+ years old: Randomized controlled trial protocol and COVID-19 related study modifications. Frontiers in Digital Health , 3 , 714813.\nZhang, H., Hu, Z., Jiang, S., Hao, M., Li, Y., Liu, Y., Jiang, X., Jin, L., &amp; Wang, X. (2024). Social frailty and the incidence of motor cognitive risk syndrome in older adults. Alzheimer ' s &amp; Dementia, 20 , 2329-2339.", "doc_items_refs": ["#/texts/197", "#/texts/198", "#/texts/199", "#/texts/200", "#/texts/201", "#/texts/202"], "page_nos": [1], "uuid": "d51ac207-0ea8-49e7-ba20-2f08992aec76"}
{"doc_id": "2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cross-domain_latent_profiles_of_MCI_and_dementia_are_most_differentiated_by_soci__W4413896539.doctags", "chunk_id": 49, "source_chunk_idxs": [55], "num_tokens": 138, "text": "References\nZhang, M., Ho, E., Nowinski, C. J., Fox, R. S., Ayturk, E., Karpouzian-Rogers, T., Novack, M., Dodge, H. H., Weintraub, S., &amp; Gershon, R. (2023). The paradox in positive and negative aspects of emotional functioning among older adults with early stages of cognitive impairment. Journal of Aging and Health , 36 , 471-483. https://doi.org/10.1177/089826431199806.", "doc_items_refs": ["#/texts/203"], "page_nos": [1], "uuid": "9a60c386-872f-40a3-bc69-46ee5dd40ca3"}
