{"doc_id": "2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288.doctags", "chunk_id": 0, "source_chunk_idxs": [0, 1, 2, 3], "num_tokens": 285, "text": "&lt;!-- image --&gt;\n&lt;!-- image --&gt;\n\nOPEN ACCESS\nEDITED BY Gabriella Bottini, University of Pavia, Italy\nREVIEWED BY\nGiulia Negro,\nSan Gerardo Hospital, Italy\nSandra Invernzi,\nUniversity of Mons, Belgium\n*CORRESPONDENCE\nManuela Tondelli\nGLYPH manuela.tondelli@unimore.it\nRECEIVED 18\nJune 2025\nACCEPTED 10 September 2025 PUBLISHED 26 September 2025\n\nCITATION\nGallingani C, Tondelli M, Vannini P and Zamboni G (2025) The association between anosognosia and neuropsychiatric symptoms in neurodegenerative dementias: a narrative review.\nFront. Neurol. 16:1649627.\ndoi: 10.3389/fneur.2025.1649627\n\nCOPYRIGHT\n© 2025 Gallingani, Tondelli, Vannini and Zamboni. This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms.", "doc_items_refs": ["#/pictures/0", "#/pictures/1", "#/texts/1", "#/texts/2", "#/texts/3", "#/texts/4", "#/texts/5", "#/texts/6", "#/texts/7", "#/texts/8", "#/texts/9", "#/texts/10", "#/texts/11", "#/texts/12", "#/texts/14", "#/texts/15", "#/texts/16", "#/texts/18"], "page_nos": [1], "uuid": "bb757386-364d-4c06-b830-102753f918e8"}
{"doc_id": "2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288.doctags", "chunk_id": 1, "source_chunk_idxs": [4], "num_tokens": 488, "text": "The association between anosognosia and neuropsychiatric symptoms in neurodegenerative dementias: a narrative review\nChiara Gallingani 1,2 , Manuela Tondelli 1,2 *, Patrizia Vannini 3,4 and Giovanna Zamboni 1,2\n1 Department of Biomedical, Metabolic and Neural Sciences, University of Modena and Reggio Emilia, Modena, Italy. 2 Neurology Unit, OCB Hospital, Azienda Ospedaliero-Universitaria of Modena, Modena, Italy. 3 Brigham and Women's Hospital, Harvard Medical School, Boston, MA, United States,\n2 Massachusetts General Hospital, Harvard Medical School, Boston, MA, United States 3 Massachusetts General Hospital, Harvard Medical School, Boston, MA, United States\nAnosognosia, or unawareness of disease, is a common clinical feature in neurodegenerative dementias. Frequently reported as an early symptom, its presence has been associated with faster dementia progression and greater cognitive impairment. Similarly, neuropsychiatric symptoms (NPS) encompass non-cognitive behavioral and psychiatric disturbances that commonly affect individuals with dementia. Both aosognosia and NPS are clinically relevant in neurodegenerative diseases due to their significant implications in disease management and caregiver burden. In this narrative review, we examined studies investigating the direct relationship between anosognosia and NPS across different neurodegenerative dementias, including Alzheimer's Disease (AD), Frontotemporal Dementia (FTD) and a -synucleinopathies, such as Parkinson's Disease (PD) and Dementia with Lewy Bodies (DLB). A total of 46 studies were identified, the majority of which focused on AD. Despite considerable heterogeneity in participant selection, assessed domains, and measures of anosognosia and NPS investigated, consistent association emerged between anosognosia and global NPS scores as well as individual symptoms. Across studies, the most common finding was a negative association between anosognosia and depression and a positive association between anosognosia and apathy. Possible underlying mechanisms and shared neuroanatomical substrates of these findings are discussed. The review provides a deepened insight into key symptoms with critical implications for dementia research, clinical management, and caregiving strategies.", "doc_items_refs": ["#/texts/23", "#/texts/24", "#/texts/25", "#/texts/26"], "page_nos": [1], "uuid": "5e924f6e-6b19-42ca-8f7d-6526e0d9f4af"}
{"doc_id": "2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288.doctags", "chunk_id": 2, "source_chunk_idxs": [5], "num_tokens": 30, "text": "KEYWORDS\nanosognosia, unawareness, neuropsychiatric symptoms, dementia, Alzheimer's disease, frontotemporal dementia", "doc_items_refs": ["#/texts/28"], "page_nos": [1], "uuid": "3f9703d8-d93e-428f-be46-ce2433e26941"}
{"doc_id": "2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288.doctags", "chunk_id": 3, "source_chunk_idxs": [6], "num_tokens": 493, "text": "1 Introduction\nAnosognosia, also referred to as loss of insight, unawareness, or impaired self-awareness, is defined as the lack of recognition for a wide range of neurological and neuropsychological disturbances (1, 2). It is frequent in neurodegenerative dementias and can differentially affect the cognitive, behavioral, or functional impairments occurring in these diseases (3). It is estimated to affect from 20% to as many as 80% of individuals with Alzheimer's disease (AD) dementia (2, 4, 5), with higher proportions observed when milder forms of unawareness are\n© 2025 Frontiers in Neurology, https://www.frontiersin.org/frontiersin.org\nFrontiers in Neurology, https://www.frontiersin.org/frontiersin.org\nAnosognosia, or unawareness of disease, is a common clinical feature in neurodegenerative dementias. Frequently reported as an early symptom, its presence has been associated with faster dementia progression and greater cognitive impairment. Similarly, neuropsychiatric symptoms (NPS) encompass non-cognitive behavioral and psychiatric disturbances that commonly affect individuals with dementia. Both aosognosia and NPS are clinically relevant in neurodegenerative diseases due to their significant implications in disease management and caregiver burden. In this narrative review, we examined studies investigating the direct relationship between anosognosia and NPS across different neurodegenerative dementias, including Alzheimer's Disease (AD), Frontotemporal Dementia (FTD) and a -synucleinopathies, such as Parkinson's Disease (PD) and Dementia with Lewy Bodies (DLB). A total of 46 studies were identified, the majority of which focused on AD. Despite considerable heterogeneity in participant selection, assessed domains, and measures of anosognosia and NPS investigated, consistent association emerged between anosognosia and global NPS scores as well as individual symptoms. Across studies, the most common finding was a negative association between anosognosia and depression and a positive association between anosognosia and apathy. Possible underlying mechanisms and shared neuroanatomical substrates of these findings are discussed. The review provides a deepened insight into key symptoms with critical implications for dementia research, clinical management, and caregiving strategies.", "doc_items_refs": ["#/texts/30", "#/texts/31", "#/texts/32", "#/texts/33"], "page_nos": [1], "uuid": "f0cf978d-0f17-4160-b4d0-5d891087283a"}
{"doc_id": "2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288.doctags", "chunk_id": 4, "source_chunk_idxs": [7], "num_tokens": 247, "text": "1 Introduction\nconsidered (6). Such variability is likely related to differences in assessment methods and disease severity examined across cohorts. Although precise prevalence estimates stratified by method or stage are still lacking, anosognosia is widely recognized as a relevant symptom across the whole dementia continuum. It generally worsens with dementia progression, suggesting an association with disease severity (7, 8), although some studies have reported mixed results (9, 10), or no change (11-14). Recent studies have shown that the disorder can already manifest in the predementia stages, such as Mild Cognitive Impairment (MCI) (15), or even years before symptom onset in AD mutation carriers (16). Notably, unawareness of cognitive deficits has been identified as a predictor of disease progression along the dementia continuum, from cognitively normal status to MCI and, ultimately, to AD dementia (8, 17). Accordingly, it has been proposed that reduced awareness and underreporting of cognitive deficits may serve as an early clinical marker of dementia, more specific than Subjective Cognitive Decline (SCD), supporting the usefulness of monitoring awareness in the clinical setting (18).", "doc_items_refs": ["#/texts/36"], "page_nos": [1], "uuid": "f5183351-667b-4695-8f1f-05d06073d57f"}
{"doc_id": "2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288.doctags", "chunk_id": 5, "source_chunk_idxs": [8], "num_tokens": 423, "text": "1 Introduction\nWhile anosognosia has been primarily studied in AD, it is also recognized as a significant feature of other neurodegenerative diseases. It is frequently reported in the Frontotemporal Dementia (FTD) spectrum, where it can affect up to 75% of cases and represents a hallmark feature of the behavioral variant (bvFTD) (19). Despite having been removed from the current clinical criteria (20, 21), loss of insight is again reported as a supportive feature in proposed research criteria for prodral FTD (22). Furthermore, anosognosia has also been documented in individuals with Amyotrophic Lateral Sclerosis (ALS) exhibiting cognitive or behavioral disturbances, even in the absence of a full ALS-FTD diagnosis (23). Some studies have also reported anosognosia in α -synucleopathies, including both Dementia with Lewy Bodies (DLB) and Parkinson's Disease (PD). In DLB, unawareness of cognitive decline has been observed, though its exact prevalence remains unclear, and its presence may be influenced by AD co-pathology (24). In PD, anosognosia has been documented mostly in subjects with cognitive impairment (i.e., PD-MCI and PD dementia - PDD) and has been shown to worsen over time (25). Additionally, impaired awareness for motor symptoms has been reported in PD (26).\nThe presence of anosognosia in dementia has profound implications for patient care, as it can reduce adherence to treatment, impair the ability to recognize potentially harmful situations, and hinder compensatory strategies (2). These risks are even more critical in young-onset dementias, where patients are more likely to remain employed, make autonomous decisions, and care for their families (6). Overall, reduced awareness has been linked to greater caregiver burden and lower quality of life (2, 27), underscoring the need for a deeper understanding of this symptom to improve patient management.", "doc_items_refs": ["#/texts/37", "#/texts/38"], "page_nos": [1], "uuid": "867c831b-cda4-4ab3-a056-2af6ff126706"}
{"doc_id": "2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288.doctags", "chunk_id": 6, "source_chunk_idxs": [9], "num_tokens": 415, "text": "1 Introduction\nDifferent methods have been used to measure anosognosia, which are commonly classified into three broad approaches (28). A first method, commonly referred to as clinician rating , is based on the judgment of the clinician who rates the patient's level of awareness along an ordinal scale, following structured or unstructured interviews with the patient and the caregiver(s). The second method, patientinformant discrepancy , is based on the calculation of discrepancy scores of questionnaires completed by the patient and their caregiver, that asks identical questions about the patient's functions (29). The Anosognosia Questionnaire-Dementia (AQ-D) (30) and the Everyday\nCognition (ECog) scale (31) are examples of questionnaires used with this purpose. Most commonly used questionnaires also categorize different domains of anosognosia, as loss of insight may concern not only cognitive deficits but also behavioral disturbances, personality changes and loss of social cognition. Discrepancy scores can be treated as a continuum from full awareness to complete anosognosia, or cut-off values can be defined to classify subjects as aware or unaware. Clinician ratings and patient-informant discrepancies are frequently used in clinical settings to assess anosognosia in an offline way (32). The third method, performance discrepancy , compares the patient's actual (objective) performance on a given neuropsychological test with their self-estimated performance. Variants of this approach have traditionally been used to assess metacognition in healthy subjects but are increasingly applied to measure online and immediate awareness in patients with dementia (33-36). At present, there is no consensus on the most accurate method to detect and characterize anosognosia, resulting in the use of different instruments across studies, sometimes also in combination. In the present review, we therefore consider the literature broadly, without focusing on a single method.", "doc_items_refs": ["#/texts/39", "#/texts/43"], "page_nos": [1], "uuid": "df6c85ab-fb1c-4ea3-bad7-f8e69668f329"}
{"doc_id": "2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288.doctags", "chunk_id": 7, "source_chunk_idxs": [10], "num_tokens": 410, "text": "1 Introduction\nNumerous studies have investigated the relationship between anosognosia and cognitive features, consistently finding that greater unawareness is associated with poorer performance on memory and/ or executive function tests (5, 29, 37, 38). In contrast, the association between anosognosia and neuropsychiatric symptoms (NPS), including potential causal links and underlying neurobiological mechanisms, remains controversial and less clearly defined. NPS encompass a wide range of non-cognitive behavioral and psychiatric manifestations (39), including but not limited to depression, apathy, affective dysregulation, impulsivity, psychotic symptoms, and, less commonly, sleep and appetite disturbances. These symptoms frequently arise in dementia, from prodromal to advanced stages (40), with prevalence rates reaching up to 97% across the dementia spectrum (41). Their expression can vary across different forms of dementia, with depression, hallucinations, and delusions being more typical of AD and DLB, whereas disinhibition and compulsions more frequent in FTD (42-44). The implications of NPS are profound, as they can lead to increased caregiver burden and reduced quality of life (45-47). They have also been associated with faster progression of cognitive decline in affected individuals and worse disease prognosis (48, 49). NPS are primarily reported by caregivers and are commonly assessed using various questionnaires, among which one of the most common is the Neuropsychiatric Inventory (NPI) (50). Understanding their expression is therefore crucial to inform both pharmacological and non-pharmacological interventions aimed at improving overall patient care and alleviating caregiver burden (51).\nThis narrative review aims to consolidate recent evidence on the interplay between anosognosia and NPS, identify gaps in current knowledge, and highlight potential directions for future research to inform both the scientific understanding and clinical management of these pivotal aspects of dementia.", "doc_items_refs": ["#/texts/44", "#/texts/45"], "page_nos": [1], "uuid": "f20120c6-524b-4ec8-be97-0ef211ab3ef5"}
{"doc_id": "2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288.doctags", "chunk_id": 8, "source_chunk_idxs": [11, 12], "num_tokens": 459, "text": "2.1 Inclusion and exclusion criteria\nArticles were selected based on predefined inclusion criteria: (i) studies focusing on the relationship between awareness and\nneuropsychiatric symptoms; (ii) studies focusing on neurodegenerative dementias, including AD, FTD, and α -synucleinopathies (i.e., PD, DLB); (iii) studies available in English and with full-text access. Reviews and meta-analyses were not directly included but were examined for relevant references. Additionally, relevant publications were identified and added through manual screening of the bibliographies of full-text articles. Studies were excluded if they assessed anosognosia and/or NPS in isolation without investigating their relationship, or if the study population was not sufficiently described or classified to allow reliable inferences. We also excluded animal-based studies, case reports, and clinical trials, as well as non-original publication (editorials and letters in response to previous articles), conference abstracts, and proceedings.\n\n2.2 Search strategy\nWe performed a literature search of the MEDLINE/PubMed and Web of Science databases to identify eligible published articles from their inception to May 2, 2024. In order to capture the extent of the literature, a range of search terms were used in various combinations. The terms \"awareness,\" \"anosognosia,\" \"unawareness,\" and \"selfinsight\" were used to capture the principal topic of anosognosia, while \"dementia\" and \"neurodegenerative\" to denote the group of diseases of interest. Finally, \"neuropsychiatric,\" \"behavioral,\" \"behavioral,\" \"depression,\" \"apathy,\" and \"psychosis\" were added to capture the association with NPS. We filtered the research by excluding reviews, animal studies, and articles not published in English. Retrieved articles were imported into the Rayyan Intelligent Systematic Review Tool, to remove duplicates. Articles were first screened by titles and abstracts, then the full texts of selected studies were evaluated, excluding non-eligible articles as per established criteria. Any uncertainty in the\nselection was discussed with the senior authors (MT, GZ, PV) until a consensus was reached.", "doc_items_refs": ["#/texts/48", "#/texts/51", "#/texts/53", "#/texts/54"], "page_nos": [1], "uuid": "1dbe61a0-a460-49f3-b62e-1045ea9e0e0c"}
{"doc_id": "2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288.doctags", "chunk_id": 9, "source_chunk_idxs": [13], "num_tokens": 422, "text": "3 Results\nThe database search identified a total of 2,264 articles. We first excluded duplicates, as well as studies published in non-English languages or those without available abstract/full text. Titles and abstracts of the remaining 803 studies were reviewed, and 729 more articles were excluded based on inclusion and exclusion criteria. Seventy-four articles underwent full-text review, and a final total of 46 studies were deemed eligible (Figure 1). Among the included articles, 40 studies examined the relationship between anosognosia and NPS in AD, 7 in PD, and 2 in FTD and related syndromes. No studies specifically focused on DLB. Table 1 provides a summary of all included studies, detailing participant characteristics, median age (when available), the domains of NPS investigated, NPS and awareness assessment tools, and key findings. To improve the consistency of reported findings, in this review we grouped NPS into six broad domains that emerged from the included studies and reflect clinical plausibility: (i) depression; (ii) apathy; (iii) affective dysregulation symptoms (i.e., mania, euphoria, pathological laughing, irritability); (iv) impulse dyscontrol symptoms (i.e., disinhibition, agitation, aberrant motor behavior, inattention, tension); (v) psychotic symptoms (i.e., hallucinations, delusions); and (vi) sleep and appetite disturbances. Although this grouping is not based on a universally established consensus, it provides a systematic framework to examine heterogeneous findings across studies. In the included studies, some authors specifically investigated anosognosia with respect to a particular cognitive or behavioral domain (e.g., unawareness of memory loss, unawareness of behavioral disturbances). In these cases,\n&lt;!-- image --&gt;\n| Study                     | Participants (median age, years)   | Domains of NPS                                                                   | NPS assessment   | Awareness assessment                      | Key Findings                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        |", "doc_items_refs": ["#/texts/56", "#/pictures/2", "#/tables/0"], "page_nos": [1], "uuid": "e3dc276c-f139-476c-acb7-2e56f551428f"}
{"doc_id": "2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288.doctags", "chunk_id": 10, "source_chunk_idxs": [14], "num_tokens": 512, "text": "3 Results\n|---------------------------|------------------------------------|----------------------------------------------------------------------------------|------------------|-------------------------------------------|----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------", "doc_items_refs": ["#/tables/0"], "page_nos": [1], "uuid": "2f8da61d-a253-4b86-80b5-98f44ea2b182"}
{"doc_id": "2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288.doctags", "chunk_id": 11, "source_chunk_idxs": [15], "num_tokens": 254, "text": "3 Results\n-\n----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|", "doc_items_refs": ["#/tables/0", "#/tables/0"], "page_nos": [1], "uuid": "7de2e09c-af4c-49d6-94c0-9ad69634729f"}
{"doc_id": "2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288.doctags", "chunk_id": 12, "source_chunk_idxs": [16], "num_tokens": 326, "text": "3 Results\n| Amanzio et al. (83)       | 29 AD (75)                         | Apathy impulse dyscontrol                                                        | AES DS           | AQ-D                                      | Higher apathy and disinhibition in unaware relative to aware subjects.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                              |\n| Castrillo Sanz et al. (4) | 127 AD (80)                        | Global NPS                                                                       | NPI-Q            | CIRS                                      | High NPI-Q score predicts the presence of anosognosia.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                              |\n| Castro et al. (87)        | 52 PD (60.7)                       | Global NPS depression                                                            | NPI HADS BDI     | Subjective complaints                     | Higher depression and NPS in subjects with subjective cognitive complaints.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                         |\n| Chen et al. (66)          | 55 AD (76.6)                       | Depression apathy                                                                | CSDD AES         | GRAD Subject-informant discrepancy scores | Lower depression in subjects with anosognosia; higher apathy in subjects with anosognosia; higher depression predicts lower anosognosia.                                                                                                                                                                                                                                                                                                                                                                                                                            |\n| Cines et al. (76)         | 104 AD (77.5)                      | Depression                                                                       | GDS              | ARS                                       | Lower depression predicts anosognosia; higher anosognosia predicts lower depression.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                |\n| Clare et al. (58)         | 12 AD (71)                         | Global NPS depression                                                            | CAPE HADS        | MARS                                      | Positive correlation between anosognosia and global CAPE score; negative correlation between anosognosia and subjects' depression; positive correlation between anosognosia and caregivers' depression.                                                                                                                                                                                                                                                                                                                                                             |", "doc_items_refs": ["#/tables/0"], "page_nos": [1], "uuid": "a3db2f2d-5f6a-47aa-ae00-533347577032"}
{"doc_id": "2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288.doctags", "chunk_id": 13, "source_chunk_idxs": [17], "num_tokens": 451, "text": "3 Results\n| Conde-Sala et al. (52)    | 164 AD (77.6)                      | Global NPS depression apathy impulse dyscontrol affective dysregulation appetite | NPI GDS          | AQ-D                                      | Higher NPI score in subjects with high AQ-D score relative to AQ-D score; lower GDS score in subjects with high AQ-D score relative to low AQ-D score; higher apathy, agitation, disinhibition, AMB, irritability, and appetite scores in subjects with high AQ-D score relative to AQ-D score; in the high AQ-D score group, positive correlation between anosognosia and agitation, disinhibition, AMB, irritability, euphoria, appetite and negative correlation between anosognosia and depression; higher NPI and lower GDS scores predict severe anosognosia. |\n| Derouesné et al. (69)     | 88 AD (73.2)                       | Depression apathy                                                                | ZD, ZA PBQ       | Subject-informant discrepancy scores      | Negative correlation between anosognosia and anxiety; positive correlation between anosognosia and apathy.                                                                                                                                                                                                                                                                                                                                                                                                                                                          |\n| Gilleen et al. (67)       | 27 AD (82.4)                       | Depression                                                                       | BDI-II           | SUMD SAI-E MARS PCRS DEX                  | Negative correlation between anosognosia and depression.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                            |\n| Horning et al. (77)       | 107 AD (82.4)                      | Depression apathy                                                                | NRS AES          | NRS (Insight)                             | Higher anosognosia predicts lower depression and anxiety and higher apathy, after controlling for global cognition.                                                                                                                                                                                                                                                                                                                                                                                                                                                 |\n| Jacus (63)                | 20 AD, 20 MCI (80,5, 78.5)         | Depression apathy                                                                | BDI-II STAI AES  | PCRS SCQ                                  | Negative correlation between anosognosia and depression and anxiety; positive correlation between anosognosia and apathy; higher presence of low depression score and high apathy score among subjects with high anosognosia score.                                                                                                                                                                                                                                                                                                                                 |", "doc_items_refs": ["#/tables/0"], "page_nos": [1], "uuid": "8c8d76ed-4db5-44dd-8b5e-884870dfcb78"}
{"doc_id": "2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288.doctags", "chunk_id": 14, "source_chunk_idxs": [18], "num_tokens": 162, "text": "3 Results\n| Kashiwa et al. (7)        | 84 AD (75.5)                       | Depression impulse dyscontrol                                                    | NPI GDS          | Subject-informant discrepancy scores      | Negative correlation between anosognosia and depression; positive correlation between anosognosia and disinhibition score.                                                                                                                                                                                                                                                                                                                                                                                                                                          |\n| Kelleher et al. (73)      | 75 MCI (57 AD) (76.4)              | Depression                                                                       | NPI ADS          | AD8 discrepancy                           | Higher depression and anxiety in subjects with preserved insight relative to subjects without preserved insight; higher depression and anxiety predict lower insight.                                                                                                                                                                                                                                                                                                                                                                                               |\n\nTABLE 1 (Continued)\n| Study                   | Participants (median age, years)                                                                                  | Domains of NPS                     | NPS assessment                                       | Awareness assessment                                                                                  | Key Findings                                                                                                                                              |", "doc_items_refs": ["#/tables/0", "#/texts/69", "#/tables/1", "#/tables/1"], "page_nos": [1], "uuid": "91136e14-e3d5-4bc4-8f02-db790068eb28"}
{"doc_id": "2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288.doctags", "chunk_id": 15, "source_chunk_idxs": [19], "num_tokens": 497, "text": "3 Results\n|-------------------------|-------------------------------------------------------------------------------------------------------------------|------------------------------------|------------------------------------------------------|-------------------------------------------------------------------------------------------------------|-----------------------------------------------------------------------------------------------------------------------------------------------------------|", "doc_items_refs": ["#/tables/1"], "page_nos": [1], "uuid": "eb9c3110-8fba-4dd3-ad85-096e3f402cb0"}
{"doc_id": "2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288.doctags", "chunk_id": 16, "source_chunk_idxs": [20], "num_tokens": 468, "text": "3 Results\n| Lacerda et al. (57)     | 89 AD (78)                                                                                                        | Global NPS depression              | NPI CSDD                                             | ASPIDD                                                                                                | Positive correlation between anosognosia and NPI score and depression.                                                                                    |\n| Lehrner et al. (74)     | 280 SCD (64) 181 aMCI (67) 137 aMCI (70) 43 AD (74) 28 PD (67) 58 PD-naMCI (69) 29 PD-aMCI (69) 211 controls (66) | Depression                         | BDI                                                  | Complaint-performance discrepancy                                                                     | Negative correlation between anosognosia and depression in aMCI, naMCI, SCD, PD, PD-naMCI, and controls. No significant association in AD and PD-aMCI.    |\n| Lopez et al. (78)       | 181 AD (71.4)                                                                                                     | Depression psychosis               | Psychiatric assessment                               | Clinician rating                                                                                      | No association.                                                                                                                                           |\n| Mak et al. (79)         | 36 AD, 21 MCI (72.6, 69.2)                                                                                        | Depression apathy                  | GDS AES                                              | AQ-D                                                                                                  | Higher apathy predicts anosognosia (AQ-D total and IF only).                                                                                              |\n| Marino et al. (88)      | 58 PD (not available)                                                                                             | Depression                         | GDS                                                  | PDQ-39 (perceived cognition)                                                                          | Positive correlation between perceived cognition and depression.                                                                                          |\n| Migliorelli et al. (30) | 73 AD (72.9)                                                                                                      | Depression affective dysregulation | HAM-D BMS PLACS                                      | AQ-D                                                                                                  | Lower dysthymia in subjects with anosognosia; higher mania and pathological laughing score in subjects with anosognosia.                                  |\n| Mikos et al. (91)       | 37 PD (69)                                                                                                        | Apathy                             | AES                                                  | Subject-informant discrepancy scores                                                                  | Correlation between higher apathy and both greater under- and over- reporting.                                                                            |\n| Nakaaki et al. (64)     | 42 AD (71.4)                                                                                                      | Depression                         | Provisional diagnostic criteria for depression in AD | SMQ (discrepancy score)                                                                               | Higher discrepancy score in subjects without depression relative to subjects with depression.                                                             |", "doc_items_refs": ["#/tables/1"], "page_nos": [1], "uuid": "a0e5d97b-45f6-4034-8148-982a5a2d9eb9"}
{"doc_id": "2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288.doctags", "chunk_id": 17, "source_chunk_idxs": [21], "num_tokens": 485, "text": "3 Results\n| O'Keeffe et al. (36)    | 14 FTD, 11 CBD, 10 PSP (not available)                                                                            | Depression                         | HADS MET                                             | Composite score for metacognitive awareness, online emergent awareness, online anticipatory awareness | Negative correlation between online anticipatory awareness and depression; positive correlation between metacognitive awareness and empathy.              |\n| Oba et al. (65)         | 118 AD, 47 MCI (79.5, 76.2)                                                                                       | Depression                         | GDS                                                  | Subject-informant discrepancy scores                                                                  | Lower depression predicts anosognosia.                                                                                                                    |\n| Orfei et al. (89)       | 197 PD, 141 MCI-PD, 47 PPD (62.6, 68.6, 73.4)                                                                     | Depression                         | BDI                                                  | AQ-D                                                                                                  | Negative correlation between depression and anosognosia (AQ-D total and IF only).                                                                         |\n| Reed et al. (81)        | 57 AD                                                                                                             | Depression                         | Clinician rating                                     | Clinician rating                                                                                      | No association.                                                                                                                                           |\n| Satler and Tomaz (53)   | 21 AD (78.6)                                                                                                      | Global NPS depression              | NPI CSDD                                             | AQ-D                                                                                                  | Higher NPI score predicts higher anosognosia (AQ-D IF).                                                                                                   |\n| Sato et al. (59)        | 143 AD (72.1)                                                                                                     | Global NPS                         | NPI                                                  | AQ-D                                                                                                  | Higher NPI score predicts higher anosognosia (AQ-D BEH).                                                                                                  |\n| Seltzer et al. (71)     | 36 AD (74.6)                                                                                                      | Depression Affective Dysregulation | CSDD Subject and informant ratings                   | Subject-informant discrepancy scores                                                                  | Negative correlation between anosognosia and depression (caregiver rating); positive correlation between anosognosia and irritability (caregiver rating). |\n| Sevush and Leve (72)    | 128 AD (69.2)                                                                                                     | Depression                         | Subject and informant ratings                        | Clinician rating                                                                                      | Negative correlation between anosognosia and depression.                                                                                                  |\n| Smith et al. (68)       | 23 AD (75.3)                                                                                                      | Depression                         | GDS                                                  | AII                                                                                                   | Negative correlation between anosognosia and depression.                                                                                                  |", "doc_items_refs": ["#/tables/1"], "page_nos": [1], "uuid": "907cb291-30a8-4175-aeaf-2158161c8c4a"}
{"doc_id": "2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288.doctags", "chunk_id": 18, "source_chunk_idxs": [22], "num_tokens": 314, "text": "3 Results\n| Sousa et al. (13)       | 69 AD (76.8)                                                                                                      | Apathy impulse dyscontrol          | NPI CSDD                                             | ASPIDD                                                                                                | Positive correlation between anosognosia and apathy and agitation scores.                                                                                 |\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\nfrontiersin\n90\n\nTABLE 1 (Continued)", "doc_items_refs": ["#/tables/1", "#/texts/70", "#/texts/71", "#/texts/72", "#/texts/73", "#/texts/74", "#/texts/75", "#/texts/76", "#/texts/77", "#/texts/78", "#/texts/79", "#/texts/80", "#/texts/81", "#/texts/82", "#/texts/83", "#/texts/84", "#/texts/85", "#/texts/86", "#/texts/87", "#/texts/88", "#/texts/89", "#/texts/90", "#/texts/91", "#/texts/92", "#/texts/93", "#/texts/94", "#/texts/95", "#/texts/96", "#/texts/97", "#/texts/98", "#/texts/99", "#/texts/100", "#/texts/101", "#/texts/102", "#/texts/103", "#/texts/104", "#/texts/105", "#/texts/106", "#/texts/107", "#/texts/108", "#/texts/109", "#/texts/110", "#/texts/111", "#/texts/112", "#/texts/113", "#/texts/114", "#/texts/115", "#/texts/116", "#/texts/117", "#/texts/118", "#/texts/119", "#/texts/120", "#/texts/121", "#/texts/122", "#/texts/123", "#/texts/124", "#/texts/125", "#/texts/126", "#/texts/127", "#/texts/128", "#/texts/129", "#/texts/130", "#/texts/131", "#/texts/132", "#/texts/133", "#/texts/134", "#/texts/135", "#/texts/136", "#/texts/137", "#/texts/138", "#/texts/139", "#/texts/140", "#/texts/141", "#/texts/142", "#/texts/143", "#/texts/144", "#/texts/145", "#/texts/146", "#/texts/147", "#/texts/148", "#/texts/149", "#/texts/150", "#/texts/151", "#/texts/152", "#/texts/153", "#/texts/154", "#/texts/155", "#/texts/156", "#/texts/157", "#/texts/158", "#/texts/159", "#/texts/160", "#/texts/161", "#/texts/162", "#/texts/163", "#/texts/164", "#/texts/165", "#/texts/166", "#/texts/167", "#/texts/168", "#/texts/169", "#/texts/170", "#/texts/171", "#/texts/172", "#/texts/173", "#/texts/174", "#/texts/175", "#/texts/176", "#/texts/177", "#/texts/178", "#/texts/179", "#/texts/180", "#/texts/181", "#/texts/182", "#/texts/183", "#/texts/184", "#/texts/185", "#/texts/186", "#/texts/187", "#/texts/188", "#/texts/189", "#/texts/190", "#/texts/191", "#/texts/192", "#/texts/193", "#/texts/194", "#/texts/195", "#/texts/196", "#/texts/197", "#/texts/200", "#/texts/202", "#/tables/2"], "page_nos": [1], "uuid": "03017490-0f6b-4407-b3a5-5d377d48276b"}
{"doc_id": "2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288.doctags", "chunk_id": 19, "source_chunk_idxs": [23], "num_tokens": 482, "text": "3 Results\n| Study                     | Participants (median  age, years)               | Domains of NPS                                                           | NPS  assessment         | Awareness assessment   | Key Findings                                                                                                                                                                                                                                           |\n|---------------------------|-------------------------------------------------|--------------------------------------------------------------------------|-------------------------|------------------------|--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|", "doc_items_refs": ["#/tables/2"], "page_nos": [1], "uuid": "da9a345c-655c-4c79-b826-80d0bba3e549"}
{"doc_id": "2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288.doctags", "chunk_id": 20, "source_chunk_idxs": [24], "num_tokens": 468, "text": "3 Results\n| Spalletta et al. (54)     | 103 AD, 52 a-MCI, 54 md- MCI (76.3, 71.4, 71.2) | Global NPS apathy impulse  dyscontrol affective  dysregulation           | NPI                     | AQ-D                   | Positive correlation between anosognosia (i.e., AQ-D total, AQ-D IF,  AQ-D BEH) and NPI score, apathy, agitation, and AMB; positive  correlation between anosognosia (i.e., AQ-D total, AQ-D BEH) and  irritability.                                   |\n| Starkstein et al. (82)    | 170 AD (70.5)                                   | Depression apathy affective  dysregulation psychosis                     | HAM-D AS BMS  PLACS DPS | AQ-D                   | Higher psychosis and apathy and lower depression predict anosognosia  for cognitive deficits; higher mania and pathological laughing score  predict anosognosia for behavioral problems.                                                               |\n| Starkstein et al. (90)    | 33 AD, 33 PDD (70.3, 71)                        | Depression                                                               | HAM-D                   | AQ-D                   | Higher depression in PDD relative to AD; higher anosognosia in AD  relative to PD.                                                                                                                                                                     |\n| Starkstein et al. (80)    | 750 AD (71.6)                                   | Depression impulse dyscontrol                                            | HAM-D DS                | AQ-D                   | Positive correlation between anosognosia and disinhibition.                                                                                                                                                                                            |\n| Starkstein et al. (84)    | 77 AD (71.5)                                    | Apathy                                                                   | AS                      | AQ-D                   | Anosognosia at baseline predicts higher apathy score at follow-up.                                                                                                                                                                                     |\n| Tondelli et al. (6)       | 91 EOD, 57 LOD (64.9, 78.6)                     | Global NPS apathy                                                        | NPI                     | CIRS                   | Early anosognosia predicts NPI score in all subjects and EOD subgroup;  positive correlation between anosognosia and apathy score;  anosognosia predicts apathy score in EOD subgroup.                                                                 |", "doc_items_refs": ["#/tables/2"], "page_nos": [1], "uuid": "dc765410-c89c-4b77-a81b-81e3567ceddd"}
{"doc_id": "2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288.doctags", "chunk_id": 21, "source_chunk_idxs": [25], "num_tokens": 488, "text": "3 Results\n| Troisi et al. (70)        | 42 AD (76.2)                                    | Depression                                                               | HAM                     | HAM-I                  | Higher depression (psychic subscore, not somatic subscore) in subjects  with higher awareness.                                                                                                                                                         |\n| Turró-Garriga et al. (85) | 177 AD (77.8)                                   | Impulse dyscontrol psychosis                                             | NPI                     | AQ-D                   | Disinhibition score predicts persistence of anosognosia between  baseline and follow-up; delusion score predicts incidence of  anosognosia at follow-up.                                                                                               |\n| van Vliet et al. (75)     | 142 YOAD, 126 LOAD (61.6, 79.1)                 | Depression                                                               | NPI                     | GRAD                   | Negative correlation between anosognosia and depression, more in  YOAD than in LOAD.                                                                                                                                                                   |\n| Verhülsdonk et al. (55)   | 47 AD (76.5)                                    | Global NPS depression                                                    | NPI GDS NOSGER          | AQ-D                   | Positive correlation between anosognosia and NPI score; positive  correlation between anosognosia and depression reported by  informants (NPI-depression score, NOSGER mood), no correlation  between anosognosia and depression reported by subjects. |\n| Vogel et al. (56)         | 321 AD (76.2)                                   | Global NPS depression                                                    | NPI-Q CSDD              | ARS MDR                | Higher NPI-Q score (total severity score and distress score) in subjects  with no insight relative to subjects with full insight classified through  ARS; positive correlation between NPI-Q score and MDR score.                                      |\n| Wang et al. (61)          | 237 MCI (132 A+) (73)                           | Global NPS apathy impulse  dyscontrol affective  dysregulation psychosis | NPI                     | ECog                   | Higher NPI total score, agitation and disinhibition scores in unaware  subjects; earlier onset of NPS (i.e., apathy, agitation, disinhibition, AMB,  irritability, delusion, and hallucination) in unaware subjects relative to  aware ones.           |\n(Continued)\nGallinganti et al.\n103389/hrneur.2025.16496627\n40\n\nTABLE 1 (Continued)", "doc_items_refs": ["#/tables/2", "#/texts/203", "#/texts/204", "#/texts/205", "#/texts/207", "#/texts/210", "#/tables/3"], "page_nos": [1], "uuid": "f52e94ac-7334-4dfb-aaf3-cd5f1dfc6f64"}
{"doc_id": "2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288.doctags", "chunk_id": 22, "source_chunk_idxs": [26], "num_tokens": 490, "text": "3 Results\n| Study                      | Participants (median  age, years)   | Domains of NPS                                            | NPS  assessment   | Awareness assessment              | Key Findings                                                                                                                                                                                                            |\n|----------------------------|-------------------------------------|-----------------------------------------------------------|-------------------|-----------------------------------|-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| Yoo et al. (86)            | 340 PD (67.2)                       | Global NPS depression                                     | NPI BDI           | Complaint-performance discrepancy | Higher NPI total score in subjects with cognitive underestimation; lower depression in subjects with anosognosia.                                                                                                       |", "doc_items_refs": ["#/tables/3"], "page_nos": [1], "uuid": "b84e0c19-9ac3-437e-a4e2-add098276a60"}
{"doc_id": "2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288.doctags", "chunk_id": 23, "source_chunk_idxs": [27], "num_tokens": 142, "text": "3 Results\n| Yoon et al. (60)           | 616 early onset AD (62.6)           | Global NPS impulse  dyscontrol psychosis sleep,  appetite | NPI               | Clinician rating                  | Higher NPI score in subjects with anosognosia compared to subjects  without anosognosia, only for CDR 0.5-1; higher agitation, AMB,  delusion, hallucination, sleep, and appetite scores in subjects with  anosognosia. |\n| Zilli and Damasceno,  (62) | 21 AD (72.4)                        | Global NPS depression                                     | NPI CSDD          | SCQ DIS                           | No association.                                                                                                                                                                                                         |", "doc_items_refs": ["#/tables/3"], "page_nos": [1], "uuid": "2d3437b2-b4ea-460e-9119-57277b6d861d"}
{"doc_id": "2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288.doctags", "chunk_id": 24, "source_chunk_idxs": [28], "num_tokens": 512, "text": "3 Results\nStudies are presented in alphabetical order according to first authors' names. AD: Alzheimer's Disease; AD8: Eight-item Informant Interview to Differentiate Aging and Dementia; ADS: Anxiety Depression Scale; AES: Apathy Evaluation Scale; AII: Assessment of Impaired Insight; AMB: Aberrant Motor Behavior; AQ-D: Anosognosia Questionnaire for Dementia (IF: Intellectual Functions; BEH: Behavior); ARS: Anosognosia Rating Scale; AS: Apathy Scale; ASPID: Anosognosia Scale for Psychosis and Inhibitory Dysregulation in Dementia; A+: amyloid positive; BDI: Beck Depression Inventory; BDI-II: Beck Depression Inventory - II version; BMS: Bech Mania Scale; CAPE: Behavior Problems Checklist of the Clifton Assessment Procedures for the Elderly; CBD: Corticobasal Degeneration; CIRS: Cumulative Illness Rating Scale; CSDD: Cornell Scale for Depression in Dementia; DEX: Dysecuric Questionnaire; DIS: Denial of Illness Scale; DPS: Dementia Psychosis Scale; DIS: Disinhibition scale; ECog: Everyday Cognition Scale; EOD: Early-Onset Dementia; GDS: Geriatric Depression Scale; GRAD: Guidelines for the Rating of Awareness Deficits; HAM: Hamilton Depression Rating Scale (HAM-D: depression item; HAM-I: insight item); HADS: Hospital Anxiety and Depression Scale; LOAD: LateOnset Alzheimer's Disease; LOD: Late-Onset Dementia; MARS: Memory Awareness Rating Scale; MCI: Mild Cognitive Impairment (a-MCI; amnesic MCI; na-MCI: non-amnesic MCI; md-MCI: multidomain-MCI; MDR: Memory Discrepancy Rating; MET: Measure of Empathic Tendency; NPI: Neuropsychiatric Inventory; NPI-Q: Neuropsychiatric Inventory; NPS: Neuropsychiatric symptoms; NOSGER: Nurses' Observation Scale for Geriatric Patients; NRS: Neuropsychelial Rating Scale; PBQ: Psychobehavioural Questionnaire; PCRS: Patient Competency Rating Scale; PD: Parkinson's Disease; PDD: Parkinson's Disease Dementia; PDQ-39: Parkinson's Disease Questionnaire-39; PLACS: Pathological Laughing and", "doc_items_refs": ["#/texts/211"], "page_nos": [1], "uuid": "1502ae48-2e36-4e34-9343-a579ca3a8d3d"}
{"doc_id": "2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288.doctags", "chunk_id": 25, "source_chunk_idxs": [29], "num_tokens": 145, "text": "3 Results\nCrying Scale; PSP: Progressive Supranuclear Palsy; SAI-E: Scale for Assessment of Insight-Extended; SCD: Subjective Cognitive Decline; SCQ: Self-Consciousness Questionnaire; SMQ: Short Memory Questionnaire; STAI-State: Trait Anxiety Inventory; SUMD: Scale for the Unawareness of Mental Disorder; YOAD: Young-Onset Alzheimer's Disease; ZA: Zung Self-Rating Scales for Apathy; ZD: Zung Self-Rating Scales for Depression.\nwe explicitly report the domain-specific form of anosognosia. Otherwise, the term \"anosognosia\" is used alone to denote a generalized lack of disease awareness.", "doc_items_refs": ["#/texts/211", "#/texts/215"], "page_nos": [1], "uuid": "36d103a1-95bd-4c36-8982-b66c04ea3f6f"}
{"doc_id": "2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288.doctags", "chunk_id": 26, "source_chunk_idxs": [30], "num_tokens": 474, "text": "3.1.1 Global measures of neuropsychiatric symptoms\nThe literature exploring the relationship between anosognosia and NPS in AD is extensive and relatively well established.\nFirst, a positive correlation between anosognosia-measured either as a continuous variable or as a categorical presence/absence using the AQ-D-and the NPI total score has been consistently reported (52-55). The same association has been observed when anosognosia was assessed using alternative instruments, such as the Anosognosia Rating Scale Memory Discrepancy Rating (4), the Cognitive Insight Rating Scale (56), the Anosognosia Scale for Psychosis and Inhibitory Dysregulation in Dementia (57) and the Memory Awareness Rating Scale (58). Notably, Sato et al. (59) found in a large group of subjects ( n = 143 AD) that this relationship was specific to anosognosia for behavioral complaints (i.e., AQ-D BEH), whereas anosognosia for cognitive deficits (i.e., AQ-D IF) was not significantly associated with NPS.\nIn early-onset AD, Yoon et al. (60) reported an association between anosognosia and NPS only in individuals with MCI or mild dementia (Clinical Dementia Rating Scale, CDR = 0,5 or 1), but not in more advanced stages (CDR = 2), suggesting that as dementia progresses, NPS may emerge independently of anosognosia. In addition, Tondelli et al. (6), compared early-onset (EOD) and latenset dementia (LOD), and found a significant positive correlation between anosognosia and NPS only in EOD. Further supporting this pattern, a longitudinal study in MCI populations showed that individuals with anosognosia had higher NPI global scores at baseline and experienced an earlier onset of NPS over time compared to subjects with preserved awareness (61).\nIn contrast, Zilli and Damasceno did not observe this association when measuring anosognosia with Self-Consciousness Questionnaire (SCQ) and Denial of Illness Scale (DIS) in a small cohort of subjects ( n = 21 AD) (62).", "doc_items_refs": ["#/texts/218", "#/texts/219", "#/texts/220", "#/texts/221"], "page_nos": [1], "uuid": "10f65464-c9ec-4f08-87b3-ee27a366ea26"}
{"doc_id": "2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288.doctags", "chunk_id": 27, "source_chunk_idxs": [31], "num_tokens": 471, "text": "3.1.2 Depression\nWhen examining specific neuropsychiatric symptoms, most studies have reported an inverse correlation between anosognosia and depressive symptoms. In other words, individuals who are more aware of their deficits tend to experience more depressive symptoms than those who are unaware (7, 52, 63-72). This relationship has been observed not only in AD dementia but also in MCI and SCD individuals, regardless of amyloid status (73, 74), and has been shown to be stronger in young-onset AD dementia relative to late-onset AD (75). Cines et al. (76) demonstrated that depression can both predict and be predicted by anosognosia in a cross-sectional design on 104 AD individuals. Furthermore, a longitudinal study by Horning et al. (77), found that the levels of awareness at baseline in a sample of 107 AD predicted subsequent development of depressive mood and anxiety, even after controlling for global cognition.\nThree of these studies analyzed the concept of depression along with anxiety, which is frequently interpreted as a symptom accompanying depression, and found that increased anosognosia was associated with lower anxiety (63, 73, 77). One study by Derouesné et al. (69) has reported an association between anosognosia with anxiety and not with depression.\nIt is also important to note that anosognosia can also manifest as lack of awareness of depressive symptoms, a phenomenon referred to as affective anosognosia. For example, two studies reported a positive correlation between anosognosia and depression only when depressive symptoms were assessed by an informant, not by the patient (55, 58). The authors suggested that unaware individuals may appear less depressed simply because they under-recognize and under-report their own depressive symptoms (55).\nIn contrast, seven studies failed to find an association between anosognosia and depression (53, 56, 62, 78-81). For instance, Lopez et al. (78) relied on psychiatric assessments and clinician ratings rather than standardized questionnaires for measuring NPS and anosognosia. Migliorelli et al. (30) only demonstrated a significant association between increased anosognosia and lower dysthymia, instead of depression.", "doc_items_refs": ["#/texts/223", "#/texts/227", "#/texts/228", "#/texts/229"], "page_nos": [1], "uuid": "1aaca332-063e-4e52-b91c-1a677ebd2c86"}
{"doc_id": "2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288.doctags", "chunk_id": 28, "source_chunk_idxs": [32, 33], "num_tokens": 379, "text": "3.1.2 Depression\nOnly a few studies have reported an inverse association, such that anosognosia was positively correlated with depression (55, 57, 58). More specifically, Lacerda et colleagues (57) showed a positive correlation between anosognosia and both awareness for emotional state and social functioning, whereas two other studies reported this positive correlation only when depression was measured through caregivers (55, 58). Finally, some authors proposed a differential model in which depressive symptoms are negatively related to unawareness for cognitive deficits (i.e., AQ-D IF), but not to unawareness of behavioral symptoms (66, 82). This interpretation underscores the multifaceted nature of anosognosia, suggesting that different domains of unawareness may have distinct relationships with specific neuropsychiatric symptoms.\n\n3.1.3 Apathy\nAnother significant association is the one between increased levels of anosognosia and greater apathy, observed both in MCI and dementia stages (13, 52, 54, 63, 66, 69, 79, 83, 84). Similarly to depression, apathy appeared to be more strongly associated with anosognosia for cognitive deficits (i.e., AQ-D IF) than with anosognosia for behavioral disturbances (79, 82). Moreover, this association remained significant even after controlling for global cognition (77). Longitudinal studies have also demonstrated that both apathy and anosognosia tend to worsen over time, and that baseline anosognosia predicts an earlier onset and greater severity of apathy at follow-up (61, 84).\nWhen distinguishing between EOD and LOD, including but not limited to AD, the positive association between anosognosia and apathy has been documented only in EOD subjects (6).", "doc_items_refs": ["#/texts/230", "#/texts/232", "#/texts/233"], "page_nos": [1], "uuid": "6662e10e-ed7b-4baa-a01f-6da06c09319c"}
{"doc_id": "2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288.doctags", "chunk_id": 29, "source_chunk_idxs": [34, 35, 36, 37], "num_tokens": 490, "text": "3.1.4 Affective dysregulation symptoms\nA more limited number of studies have investigated the association between anosognosia and affective dysregulation symptoms, including mania, euphoria, pathological laughing, and irritability. These studies have consistently reported higher scores for these symptoms in individuals with anosognosia compared to those who were aware of their deficits (30, 52, 54, 71, 82), not only in the\ndementia stages but also in MCI individuals (61). More specifically, Starkstein et al. (82) observed that this association was significant for mania and pathological laughing scores only when considering anosognosia for behavioral disturbances (i.e., AQ-D BEH), rather than anosognosia for cognitive deficits.\n\n3.1.5 Impulse dyscontrol symptoms\nImpulse dyscontrol symptoms, including disinhibition, agitation, aberrant motor behavior (AMB), inattention, and tension, have been found to be positively correlated with anosognosia (7, 13, 52, 54, 60, 80, 83, 85), and this association has also been observed in individuals with MCI (61). Moreover, longitudinal evidence has suggested that baseline levels of agitation and AMB may predict the later emergence of anosognosia (54).\n\n3.1.6 Psychotic symptoms\nThe presence of psychotic symptoms, namely delusions and hallucinations, has also been linked to anosognosia (60, 61, 82, 85). In a longitudinal study, delusional symptoms at baseline were found to predict the persistence of anosognosia at follow-up (85). Conversely, in individuals with MCI, baseline anosognosia was associated with an earlier onset of both delusion and hallucination over time (61). However, one study with a small sample size failed to confirm this association (78).\n\n3.1.7 Sleep and appetite disturbances\nFinally, few studies reported an association between higher levels of anosognosia and greater disruption in sleep habits and patterns (60), as well as appetite disturbances (52, 60). These findings suggest that anosognosia may be linked to broader homeostatic and circadian regulatory impairments, although further research is needed to clarify the underlying mechanisms.", "doc_items_refs": ["#/texts/235", "#/texts/238", "#/texts/240", "#/texts/242", "#/texts/244"], "page_nos": [1], "uuid": "5aab0d6d-9da8-40d6-8736-e0cbbcfbd2da"}
{"doc_id": "2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288.doctags", "chunk_id": 30, "source_chunk_idxs": [38], "num_tokens": 333, "text": "3.2 Anosognosia and neuropsychiatric symptoms in frontotemporal dementia\nDespite being regarded as a core symptom of FTD, particularly its behavioral variant (bvFTD), anosognosia and its association with neuropsychiatric symptoms have been less extensively explored in this form of dementia. O ' Koeff et al. (36) distinguished three different facets of awareness (namely metacognitive, emergent, and anticipatory awareness) in subjects with FTD, Corticobasal Degeneration (CBD) and Progressive Supranuclear Palsy (PSP). They found that FTD individuals exhibited significantly higher levels of anosognosia compared to both other patient groups and controls, and that anticipatory anosognosia (i.e., the inability to predict difficulties in performing a task because one ' s own deficits) was negatively correlated with depression while metacognitive awareness (i.e., the declarative knowledge about one ' s own abilities) was positively correlated with empathy. The study of Tondelli et al. (6), which investigated differences between EOD and LOD and also included 28 FTD subjects, demonstrated that anosognosia was more frequent in bvFTD, as well as in the behavioral/dysexutive variant of FAD. This study also found that only apathy was positively associated with anosognosia, independent from age and clinical diagnosis. Specifically, higher levels of unawareness at baseline were linked to the subsequent development of apathy.", "doc_items_refs": ["#/texts/246"], "page_nos": [1], "uuid": "b30a2309-5e17-41e4-b67f-981a55075d49"}
{"doc_id": "2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288.doctags", "chunk_id": 31, "source_chunk_idxs": [39], "num_tokens": 440, "text": "3.3 Anosognosia and neuropsychiatric symptoms in α -synucleinopathies\nSimilar to FTD, the investigation of anosognosia and NPS in α -synucleinopathies remains scarce. A few studies on PD demonstrated that individuals with PD who exhibited greater anosognosia for cognitive difficulties had lower scores on depression scales, consistent with findings in AD (74, 86). In particular, Lehrner et al. (74) showed this association in PD without cognitive impairments and in PD with non-amnesic MCI (not in the small group of PD with amnesic MCI). However, in contrast to AD, higher NPI global scores were observed in individuals with cognitive underestimation (i.e., the tendency to overestimate cognitive difficulties, as opposed to anosognosia) (86). Two additional studies, although not directly measuring anosognosia, reported increased depressive symptoms in PD subjects who expressed greater subjective concerns regarding their cognitive performance (87, 88). In both, Orfei et al. (89) observed a negative association between anosognosia for cognitive impairment (i.e., AQ-D IF) and depression in both PD-MCI and PD without cognitive complaints, though this association was not observed in PDD, despite increasing levels of anosognosia in PD-MCI and PDD, respectively. Starkstein et al. (90) found that, while not directly assessing the relationship between anosognosia and depression in AD and PDD individuals, AD subjects exhibited increased levels of anosognosia and decreased levels of depression, while PDD subjects showed increased levels of depression and decreased levels of anosognosia.\nRegarding the relationship with apathy, Mikos et al. (91) documented that PD subjects with inaccurate self-reporting of emotional expressivity -whether over-reporting or under-reporting had increased levels of apathy, which supports the emotion hypothesis of anosognosia, suggesting that apathy diminished concern about deficits, which in turn leads to inaccurate self-reporting.", "doc_items_refs": ["#/texts/251", "#/texts/252"], "page_nos": [1], "uuid": "ed2acf1f-150f-4f1d-9827-1e8bdb095d12"}
{"doc_id": "2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288.doctags", "chunk_id": 32, "source_chunk_idxs": [40], "num_tokens": 191, "text": "3.3 Anosognosia and neuropsychiatric symptoms in α -synucleinopathies\nNo studies have directly examined the association between anosognosia and NPS specifically in DLB. However, it is worth noting that some of the articles discussed in Section 3.1 included individuals with MCI, particularly multi-domain MCI, regardless of amyloid status. Therefore, potential diagnoses other than AD, such as DLB, may be relevant in those cohorts. Specifically, these studies confirmed increased levels of depression and anxiety in individuals with decreased anosognosia (73) and higher NPI total score, agitation, and disinhibition in subjects with greater anosognosia (61). Additionally, Tondelli et al. (6) reported a positive correlation between anosognosia and apathy score in a cohort of EOD, including 12 individuals with DLB.", "doc_items_refs": ["#/texts/253"], "page_nos": [1], "uuid": "58f7e9d0-8e51-480c-b784-5769f31b91cc"}
{"doc_id": "2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288.doctags", "chunk_id": 33, "source_chunk_idxs": [41], "num_tokens": 386, "text": "4 Discussion\nThis narrative review provides an overview of the current evidence on the association between anosognosia and NPS, two common and critical symptoms in neurodegenerative dementias, which substantially impact patient management and quality of life. The findings highlight a complex interplay between these two clinical features, with significant variability depending mostly on the specific domains of anosognosia and NPS under investigation, as well as the neurodegenerative condition examined. The Sankey diagram reported in Figure 2 summarizes the findings of this review, illustrating which\nFigure caption: FIGURE 2\nSankey diagram illustrating the association between anosognosia and neuropsychiatric symptoms in neurodegenerative dementias. On the left, the neurodegenerative diseases investigated in the review with significant findings; on the right, the neuropsychiatric symptoms associated with anosognosia. The thickness of each connection represents the number of studies focusing on a specific association (i.e., the association between anosognosia and depression was assessed in 28 studies on AD, 1 study on FTD, and 6 studies on PD; the association between anosognosia and apathy was assessed in 13 studies on AD, 1 study on FTD, and 1 study on PD; the association between anosognosia and impulse dyscontrol symptoms was assessed in 9 studies on AD; the association between anosognosia and affective dysregulation symptoms was assessed in 6 studies on AD; the association between anosognosia and psychosis was assessed in 5 studies on AD; the association between anosognosia and sleep and appetite was assessed in 2 studies on AD; the association between anosognosia and empathy was assessed in 1 study on FTD).\nassociations between NPS and anosognosia have been investigated in each neurodegenerative disease.", "doc_items_refs": ["#/texts/255", "#/pictures/3", "#/texts/259", "#/texts/260"], "page_nos": [1], "uuid": "5a1fbc08-e1e6-4541-8bf7-5f2260c58f35"}
{"doc_id": "2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288.doctags", "chunk_id": 34, "source_chunk_idxs": [42], "num_tokens": 308, "text": "4 Discussion\nThe most substantial body of literature concerns AD, where anosognosia was initially characterized and has since been the subject of extensive investigation. In AD, a consistent positive association has been observed between anosognosia and global scores of NPS, pointing to a potential causal link and a shared neurobiological substrate underlying their co-occurrence (54, 61). Conversely, in FTD, studies exploring the relationship between anosognosia and NPS remain scarce and are even absent in the linguistic variants of FTD. The existing articles suggest a higher prevalence of NPS in unaware subjects (6, 36), but their limited number and the heterogeneity of the included patient populations prevent definitive conclusions. Importantly, it could also be debated whether the lack of awareness of behavioral symptoms in FTD represents true anosognosia or rather stems from the loss of social manner and decorum that characterize these patients, as part of a broader disinhibition syndrome. In other words, individuals with FTD may appear unaware of their behavior, yet they might be indifferent to it because of the absence of recognition regarding the social inappropriateness of their actions. Similarly, evidence regarding α -synucleinopaths remains scarce and inconclusive. Two studies report, in contrast to AD, higher NPS in\nPD individuals with cognitive underestimation or subjective complaints (86, 87), while in DLB dedicated studies focusing exclusively on the association between anosognosia and NPS are lacking.", "doc_items_refs": ["#/texts/261", "#/texts/265"], "page_nos": [1], "uuid": "28868b9e-3416-4f57-9e2e-17e2a54b3860"}
{"doc_id": "2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288.doctags", "chunk_id": 35, "source_chunk_idxs": [43], "num_tokens": 508, "text": "4 Discussion\nNotably, more informative findings arise from studies that analyze specific NPS domains individually, with particular emphasis on depression and apathy. In AD, the relationship between anosognosia and depression appears to be robustly inverse, with greater awareness of cognitive decline associated with increased depressive symptoms (7, 52, 65, 66, 77, 82). Despite more limited evidence, the same association is suggested in FTD (36) and PD individuals (74, 86-90). Two main hypotheses have been proposed to explain this association. One posits that a depressed mood-characterized by a gloomy perspective on the future and pessimistic ideation about current condition, may lead to a cognitive negative bias, resulting in underestimation of one's abilities (92). The alternative hypothesis suggests that reduced awareness of one's deficits may act as a psychological defense mechanism, protecting individuals from emotional distress (92). In essence, the first hypothesis frames depression as a determinant of increased awareness, while the second conceptualizes anosognosia as a protective factor against depression. Interestingly, some studies have reported a negative association between anosognosia and dysthymia, but not with major depressive\ndisorder. This finding has led to the suggestion that major depression may reflect a more biologically driven mood disorder, whereas dysthymia could represent a more reactive emotional response to cognitive decline -particularly in individuals with preserved awareness (71). Additionally, the possibility of affective anosognosia , or a lack of awareness regarding one ' s own depressive symptoms, must be considered. In such cases, patients may underreport symptoms, contributing to discrepancies in the observed associations (31). Finally, anosognosia is increasingly recognized as a multidimensional construct, with distinct domains potentially relating differently to NPS. For example, Starkstein et al. (58) proposed that only unawareness of cognitive deficits is associated with depressive symptoms, suggesting that domain-specific distinctions in anosognosia may clarify inconsistent findings. Moreover, empirical evidence indicates that different dimensions of anosognosia are not necessarily interrelated. For instance, unawareness of having a disease has been shown to correlate with anosognosia for apathy, but not with unawareness of depressive symptoms (72). These nuances underscore the need for a more refined conceptual and methodological approach in future research.", "doc_items_refs": ["#/texts/266", "#/texts/269"], "page_nos": [1], "uuid": "d2d0923e-a30d-451c-a268-7e159ce55b3b"}
{"doc_id": "2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288.doctags", "chunk_id": 36, "source_chunk_idxs": [44], "num_tokens": 455, "text": "4 Discussion\nIn the domain of apathy, anosognosia has been consistently associated with increased apathy severity in both AD (52, 54, 61, 69, 77, 83, 84) and FTD (6). In regard to PD individuals, the association with increased apathy has been shown both for over- and underreporting of emotional expressivity, suggesting that apathy determines a general reduced concern about one ' s own deficits (91). To explain this association, it has been proposed that apathy may contribute to anosognosia through mechanisms such as affective blunting and diminished performance monitoring, whereby cognitive errors lose emotional salience and fail to trigger self-awareness processes (92, 93). Conversely, from a metacognitive perspective, anosognosia may exacerbate apathy by impairing self-reflection and reducing the capacity for goal-directed behavior and motivation, processes that are reliant on intact metacognitive functioning (94). Starkstein et al. (61) further proposed a longitudinal model in which anosognosia and apathy represent distinct but sequential manifestations of progressive frontal lobe dysfunction. According to this framework, anosognosia may emerge early as an initial response to frontal damage, while apathy may develop later as frontal degeneration becomes more widespread. Interestingly, both apathy and anosognosia have been associated to frontal regions: apathy has been related to dorsal lateral and medial prefrontal cortex, orbitofrontal cortex, and anterior cingulate cortex (ACC) (95, 96), while ACC has been involved in the error monitoring processes, which are fundamental for the recognition of one ' s cognitive deficits. Thus, ACC dysfunction could be a shared biological hallmark of both apathy and anosognosia (92). Notably, discrepancies in the severity and impact of apathy have been reported across patient subgroups, such as in comparisons between EOD and LOD. Some studies suggest that EOD may be associated with more pronounced apathy, potentially due to the disruption of work, family, and social roles, which may heighten demotivation and disengagement (3).", "doc_items_refs": ["#/texts/270"], "page_nos": [1], "uuid": "53864977-6df4-4044-9c87-2b35b62e9653"}
{"doc_id": "2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288.doctags", "chunk_id": 37, "source_chunk_idxs": [45], "num_tokens": 388, "text": "4 Discussion\nThe literature on other NPS, including affective dysregulation, impulse dyscontrol disorders, and psychosis, is more sparse. However, available evidence suggests a positive association with anosognosia. In particular, unawareness of behavioral symptoms may be a key factor in the emergence of affective dysregulation symptoms (82). The relationship between anosognosia and impulse dyscontrol symptoms\nsupports the involvement of frontal circuits in both phenomena, since frontal regions such as the ACC and orbitofrontal cortex (OFC) and their connections have been implicated in agitation, AMB, and disinhibition (7, 97, 98) as well as in anosognosia (99) suggesting a common neuroanatomical basis to explain their co-occurrence. Additionally, reduced connectivity in the Default Mode Network (DMN), a brain network involved in self-referential processing, has been associated with both anosognosia (100) and NPS (101), particularly hyperactivity symptoms. A recent review further points to the amygdala and limbic system as crucial hubs in this network, given their role in emotional regulation and behavioral control. The amygdala appears highly vulnerable to neurodegeneration, and its disconnection from OFC and frontal cortices may contribute to disinhibition, impulsivity, and agitation. These converging results suggest a crucial role for the disruption of interconnected frontal and limbic circuits and their interactions with the DMN (102). Finally, a bidirectional relationship between anosognosia and psychosis has been shown, suggesting that deficits in reality monitoring -a cognitive function essential for distinguishing internally generated thoughts from external realit-may underlie both anosognosia and psychotic symptoms (60).", "doc_items_refs": ["#/texts/271", "#/texts/275"], "page_nos": [1], "uuid": "f1f3b47c-6874-46ac-855c-0df24e734b18"}
{"doc_id": "2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288.doctags", "chunk_id": 38, "source_chunk_idxs": [46], "num_tokens": 286, "text": "4 Discussion\nSome limitations should be highlighted and may explain part of the inconsistency across studies. First, there is considerable methodological variability in the assessment of both anosognosia and NPS, particularly in relation to depressive symptoms. Anosognosia extends beyond cognitive deficits to include unawareness for behavioral disturbances, personality changes, and deficits in social cognition. However, the operationalization of this construct is not homogeneous, and appropriate standardized instruments are still needed to capture this complexity. Similarly, the tools used to assess NPS vary widely across studies, contributing to inconsistencies in reported associations. A second limitation concerns sample heterogeneity, including small sample sizes, differences in patient selection, and variability in disease severity (e.g., MCI versus dementia). In particular, many studies on AD relied on clinical criteria without biomarker confirmation, or MCI cohorts without verified underlying AD pathology, thereby introducing additional variability. Finally, the included studies display substantial heterogeneity in design, diagnostic criteria, measurement tools, and sample characteristics. This variability was not systematically controlled for or coded through a formal quality assessment framework (e.g., risk of bias/quality chart), given the narrative design of the present review. This further constrains the interpretability of pooled findings and underscores the need for standardized methodological approaches in future work.", "doc_items_refs": ["#/texts/276"], "page_nos": [1], "uuid": "7b52c50e-c945-401c-a62f-9c6a15e530db"}
{"doc_id": "2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288.doctags", "chunk_id": 39, "source_chunk_idxs": [47, 48, 49, 50], "num_tokens": 456, "text": "5 Conclusion\nThis narrative review highlights the complex interplay between anosognosia and NPS across neurodegenerative dementias. While the association with global NPS, depression, and apathy in AD is well-documented, evidence in FTD and α -synucleinopathies, as well as data regarding impulse dyscontrol symptoms, affective dysregulation, and psychosis remains limited and inconclusive. Patient selection criteria and methodological heterogeneity in assessing both anosognosia and NPS represent a major challenge, contributing to variability in findings. Standardized and\nmultidimensional approaches, which extend beyond anosognosia for cognitive deficits to include behavioral and social domains, are needed to clarify the underlying neurobiological mechanisms linking anosognosia to NPS. A better understanding of this relationship is critically needed as it has potential implications for early diagnosis, personalized intervention strategies, and may help improve both patients' and caregivers' quality of life in neurodegenerative dementias.\n\nAuthor contributions\nCG: Methodology, Visualization, Formal analysis, Data curation, Writing - original draft, Conceptualization, Writing - review &amp; editing, Investigation. MT: Conceptualization, Writing - review &amp; editing, Supervision, Writing - original draft. PV: Writing - original draft, Conceptualization, Writing - review &amp; editing, Supervision. GZ: Writing -original draft, Funding acquisition, Supervision, Conceptualization, Writing - review &amp; editing.\n\nFunding\nThe author(s) declare that financial support was received for the research and/or publication of this article. PV was supported by the National Institutes of Health, National Institute on Aging. R01 AG061083. MT and GZ are funded by the European Union ERC, UnaWireD, project number 101042625.\n\nAcknowledgments\nWe would like to thank all the colleagues from the Cognitive Neurology Unit in Modena for the continuous and enriching exchange of ideas, which has greatly contributed to the development of this review. We are also deeply grateful to the patients and their families, whose experiences and perspectives inspire and guide our work.", "doc_items_refs": ["#/texts/278", "#/texts/281", "#/texts/283", "#/texts/285", "#/texts/287"], "page_nos": [1], "uuid": "f3bfec93-2d43-42aa-944c-7d710c02cbfd"}
{"doc_id": "2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288.doctags", "chunk_id": 40, "source_chunk_idxs": [51], "num_tokens": 512, "text": "References\n- 1. Prigatano GP. Anosognia: clinical and ethical considerations. Curr Opin Neurol. (2009) 22:606-11. doi: 10.1097/WCO.0b013e328332a1e7\n- 2. Kaszniak A, Edmonds E. Anosognia and Alzheimer's disease: behavioral studies In: The study of anosognosia, Ed. Prigatano, George P. (New York, Oxford: Oxford University Press) (2010) 189-228.\n- 3. Ecklund-Johnson E, Torres I. Unawareness of deficits in Alzheimer's disease and other dementias: operational definitions and empirical findings. Neuropsychol Rev. (2005) 15:147-66. doi: 10.1007/s11065-005-9026-7\n- 4. Castrillo Sanz A, Andrés Calvo M, Repiso Gento I, Izquierdo Delgado E, Gutierrez Ríos, Rodríguez Herrero R, et al. Anosogniosia in Alzheimer disease: prevalence, associated factors, and influence on disease progression. Neurologia. (2016) 31:296-304. doi: 10.1016/j.nrl.2015.03.006\n- 5. Orfei MD, Varsi AE, Blundo C, Celia E, Casini AR, Caltagirone C, et al. Anosogniosia in mild cognitive impairment and mild Alzheimer's disease frequency and neuropsychological correlates. Am J Geriatr Psychiatry. (2010) 18:1133-40. doi: 10.1097/JGP0b013e3181dd1c50\n- 6. Tondelli M, Galli C, Vicindei G, Fiondella L, Salme S, Carbone C, et al. Anosogniosia in early- and late-onset dementia and its association with neuropsychiatric symptoms. Front Psych. (2021) 12:658934. doi: 10.33899/psyt.2021.658934\n- 7. Kashiwa Y, Kitabayashi Y, Narumoto J, Nakamura K, Ueda H, Fukui K. Anosogniosia in Alzheimer's disease: association with patient characteristics, psychiatric symptoms", "doc_items_refs": ["#/texts/289", "#/texts/290", "#/texts/291", "#/texts/292", "#/texts/293", "#/texts/294", "#/texts/295"], "page_nos": [], "uuid": "858e7f4e-54b7-4b18-8b9f-06dcadd785ef"}
{"doc_id": "2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288.doctags", "chunk_id": 41, "source_chunk_idxs": [52, 53, 54, 55], "num_tokens": 271, "text": "Conflict of interest\nGZ has received speaker honoraria from Ely Lilly.\nThe remaining authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest.\nThe author(s) declared that they were an editorial board member of Frontiers, at the time of submission. This had no impact on the peer review process and the final decision.\n\nGenerative AI statement\nThe authors declare that no Gen AI was used in the creation of this manuscript.\nAny alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us.\n\nPublisher's note\nAll claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher.\n\nAuthor disclaimer\nViews and opinions expressed are those of the author(s) only and do not necessarily reflect those of the European Union or the European Research Council Executive Agency. Neither the European Union nor the granting authority can be held responsible for them.", "doc_items_refs": ["#/texts/299", "#/texts/300", "#/texts/301", "#/texts/303", "#/texts/304", "#/texts/306", "#/texts/308"], "page_nos": [1], "uuid": "9e20b910-03c2-483a-beab-a6cf65c75ee7"}
{"doc_id": "2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288.doctags", "chunk_id": 42, "source_chunk_idxs": [56], "num_tokens": 509, "text": "Author disclaimer\n- and cognitive deficits. Psychiatry Clin Neurosci. (2005) 59:697-704. doi: 10.1111/j.1440-1819.2005.01439.x\n- 8. Hanseewu B, Scott MR, Sikes KSAM, Properzi M, Gatchel JR, Salmon E, et al. Evolution of anosognosia in alzheimer's disease and its relationship to amyloid. Ann Neurol. (2020) 87:267-80. doi: 10.1002/ana.25649\n- 9. McDaniel KD, Edland SD, Heyman A. Relationship between level of insight and severity of dementia in Alzheimer disease. Alzheimer Dis Assoc Disord. (1995) 9:101-4. doi: 10.1097/00002093-199509020-00007\n- 10. Akai T, Hanyu H, Sakurahi H, Sato T, Iwamoto T. Longitudinal patterns of awareness of memory deficits in mild Alzheimer's disease. Geriatr Gerontol Int. (2009) 9:16-20. doi: 10.1111/j.1447-0594.2008.00512.x\n- 11. Clare L, Wilson BA. Longitudinal assessment of awareness in early-stage Alzheimer's disease using comparable questionnaire-based and performance-based measures: a prospective one-year follow-up study. Aging Ment Health. (2006) 10:156-65. doi: 10.1080/1360786050031188\n- 12. Clare L, Nelis SM, Martyr A, Whitaker CJ, Marková IS, Roth I, et al. Longitudinal trajectories of awareness in early-stage dementia. Alzheimer Dis Assoc Disord. (2012) 26:140-7. doi: 10.1097/WAD.0b013e31822c55c4\n- 13. Sousa MFB, Santos RL, Nogueira ML, Belfort T, Rosa DRL, Torres B, et al. Awareness of disease is different for cognitive and functional aspects in mild Alzheimer's\ndisease: a one-year observation study. J Alzheimer's Dis. (2015) 43:905-13. doi: 10.3233/JAD-140342", "doc_items_refs": ["#/texts/309", "#/texts/310", "#/texts/311", "#/texts/312", "#/texts/313", "#/texts/314", "#/texts/315", "#/texts/319"], "page_nos": [1], "uuid": "d371c1f6-ec81-41e9-92ec-04a7e4c202b1"}
{"doc_id": "2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288.doctags", "chunk_id": 43, "source_chunk_idxs": [57], "num_tokens": 506, "text": "Author disclaimer\n- 14. Vogel A, Waldorff FB, Waldemar G. Longitudinal changes in awareness over 36 months in patients with mild Alzheimer's disease. Int. Psychogeriatr. (2015) 27:95-102. doi: 10.1017/S1041610214001562\n- 15. Vannini P, Amariglio R, Hanseeuw B, Johnson KA, McLaren DG, Chhatwal J, et al. Memory self-awareness in the preclinical and prodormal stages of Alzheimer's disease. Neuropsychologia. (2017) 99:343-9. doi: 10.1016/j.neuropsychologia.2017.04.002\n- 16. Vannini P, Hanseeuw BJ, Gatchel JR, Sikkes SM, Alzate D, Zuluaga Y, et al. Trajectory of unawareness of memory decline in individuals with autosomal dominant Alzheimer disease. JAMA Netw Open. (2020) 3:e2027472. doi: 10.1001/jamanetworkopen.2020.27472\n- 17. Gerretsen P, Chung JK, Shah P, Plitman E, Iwata Y, Caravaggio F, et al. Anosognosia is an independent predictor of conversion from mild cognitive impairment to Alzheimer's disease and is associated with reduced brain metabolism. J Clin Psychiatry. (2017) 78:e1187-96. doi: 10.4088/JCP16m11367\n- 18. Cacciamani F, Tandetik C, Gagliardi G, Bertin H, Habert MO, Hampel H, et al. Low cognitive awareness, but not complaint, is a good maker of preclinical Alzheimer's disease. J Alzheimer's Dis. (2017) 59:753-62. doi: 10.3323/JAD-170399\n- 19. Muñoz-Neira C, Tedde A, Coulardth E, Thai NJ, Pennington C, Neural correlates of altered insight in frontotemporal dementia: a systematic review. Neuroimage Clin. (2019) 24:102066. doi: 10.1016/j.ncnl.2019.102066", "doc_items_refs": ["#/texts/320", "#/texts/321", "#/texts/322", "#/texts/323", "#/texts/324", "#/texts/325"], "page_nos": [], "uuid": "7f487d6a-7107-462b-a31e-1725f076282f"}
{"doc_id": "2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288.doctags", "chunk_id": 44, "source_chunk_idxs": [58], "num_tokens": 479, "text": "Author disclaimer\n- 20. Rascovsky K, Hodges JR, Knopman D, Mendez MF, Kramer JH, Neuhaus J, et al. Sensitivity of revised diagnostic criteria for the behavioural variant of frontotemporal dementia. Brain. (2011) 134:2456-77. doi: 10.1093/brain/awr179\n- 21. Evers K, Kilander L, Lindau M. Insight in frontotemporal dementia: conceptual analysis and empirical evaluation of the consensus criterion \"loss of insight\" in frontotemporal dementia. Brain Cogn. (2007) 63:13-23. doi: 10.1016/j.bancd.2006.07.001\n- 22. Barker MS, Gottesman RT, Manoechochre M, Chapman S, Appleby BS, Brushaber D, et al. Proposed research criteria for prodromal behavioural variant frontotemporal dementia. (2022) 145:1097-1079. doi: 10.1093/brain/awab365\n- 23. Salah AB, Pradet PR, Villain M, Calcerac A, Pradet-Diehl P, Salachas F, et al. Anosognosia in amyotrophic lateral sclerosis: a cross-sectional study of 85 individuals and their relatives. Ann Phys Rehabil Med. (2021) 64:1014. doi: 10.1016/j.rehab.2020.08.004\n- 24. Calil V, Sudo FK, Santiago-Bravo G, Lima MA, Mattos P. Anosognosia in dementia with Lewy bodies: a systematic review. Arq Neurospiaktis. (2021) 79:334-42. doi: 10.1590/0004-28nx.2020.07.004\n- 25. Maier F, Greuel A, Hock K, Maur R, Tahmasam M, Schwartz F, et al. Impaired self-awareness of cognitive deficits in Parkinson's disease relates to cingulate cortex dysfunction. Psychol Med. (2023) 53:1244-53. doi: 10.0017/5003321721002725", "doc_items_refs": ["#/texts/326", "#/texts/327", "#/texts/328", "#/texts/329", "#/texts/330", "#/texts/331"], "page_nos": [], "uuid": "23920b37-541f-4ac7-8f39-4be1326184a3"}
{"doc_id": "2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288.doctags", "chunk_id": 45, "source_chunk_idxs": [59], "num_tokens": 511, "text": "Author disclaimer\n- 26. Maier F, Williamson KL, Tahmasam M, Rochhaus L, Ellenle A, Prilastog A, Dörnberg, et al. Behavioural and neuroimaging correlates of impaired self-awareness of how-hyperkinetics in Parkinson's disease. Cort. (2016) 85:3247- doi: 10.1016/j.cortex.2016.05.019\n- 27. Condela S, Jalle T, Rurró-Gagner Q, Pián-Nérán G, Zondes-Porti C, Alvarez D, Góssán-Carriroy J, et al. Effects of anosognosia and neuropsychiatric symptoms on the quality of life of patients with Alzheimer's disease: a 24-month follow-up study. Int J Geriatr Psychiatry. (2016) 31:109-19. doi: 10.1002/gps.4298\n- 28. Clare L, Marková IS, Roth I, Morris RG. Awareness in Alzheimer's disease and associated dementia: theoretical framework and clinical implications. Aging Ment. (2011) 95: 15336-44. doi: 10.1080/13607863.201.583630\n- 29. Hannesdottir K, Morris RG. Primary and secondary anosognosia for memory impairment in patients with Alzheimer's disease. Cort. (2007) 43:1020-30. doi: 10.1016/s10050-9452(08)70698-1\n- 30. Migliorelli R, Tesón A, Sable E, Petracca G, Petracchi M, Leiguarda R, et al. Anosognosia in Alzheimer's disease: a study of associated fictions. Neuropsychiatry Clin. Neurosci. (1995) 7:338-44. doi: 10.1176/jnp.7.3.338\n- 31. Farias ST, Mungas D, Reed BR, Cahn-Weiner JD, Wagust J, Baynes K, et al. The measurement of everyday cognition (ECog): scale development and psychometric properties. Neuropsychology. (2008) 22:531-44. doi: 10.1037/0894-4105.22.4.531", "doc_items_refs": ["#/texts/332", "#/texts/333", "#/texts/334", "#/texts/335", "#/texts/336", "#/texts/337"], "page_nos": [], "uuid": "eb102ffd-4abf-489f-b8b2-4bf2d9778865"}
{"doc_id": "2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288.doctags", "chunk_id": 46, "source_chunk_idxs": [60], "num_tokens": 454, "text": "Author disclaimer\n- 32. Sunderaraman P, Cosentino S. Integrating the constructs of Anosognosia and metacognition: a review of recent findings in dementia. Curr Neuroll Neurosci Rep. (2017) 17:27. doi: 10.1007/s11910-017-0734-1\n- 33. Martyr A, Nelis SM, Clare L. Predictors of perceived functional ability in earlystage dementia: self-ratings, informant ratings and discrepancy scores. Int J Geriatr Psychiatry. (2014) 29:852-62. doi: 10.1002/gps.4071\n- 34. Andrade K, Gueysefs T, Medani T, Kochell E, Pantazis D, Budois B. The dualpath hypothesis for the emergence of anosognosia in Alzheimer's disease. Front Neurol. (2023) 14:1239057. doi: 10.3389/fneur.2023.1239057\n- 35. Mimmack K, Jaggiardi GPL, Marshall GA, Vannini PALzheimer's Disease Neuroimaging Initiative. Measurement of dimensions of self-awareness of memory function and their association with clinical progression in cognitively normal older adults. JAMA Netw Open. (2023) 6:e239964. doi: 10.1001/jamanetworkopen.2023.9964\nJapanese version of the Anosognosia questionnaire for dementia (AQ-D). Psychiatry Clin Neurosci. (2007) 62: 672-7. doi: 10.1111/j.1440-1819.2007.01734.x\n60. Yoon B, Shim YS, Hong JY, Choi SH, Park HK, Park SA, et al. Anosognosia and its relation to psychiatric symptoms in early-onset Alzheimer disease. J Geriatr Psychiatry Neurol. (2017) 30:170-7. doi: 10.1177/089198717700508", "doc_items_refs": ["#/texts/338", "#/texts/339", "#/texts/340", "#/texts/341", "#/texts/346", "#/texts/347"], "page_nos": [1], "uuid": "0114ab5f-1f2f-46a1-868a-e712c0713173"}
{"doc_id": "2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288.doctags", "chunk_id": 47, "source_chunk_idxs": [61], "num_tokens": 469, "text": "Author disclaimer\n61. Wang S, Mimmack K, Cacciamani F, Elnamaiszawy M, Munro C, Gatchel J, et al. Anosognosia is associated with increased prevalence and faster development of neuropsychiatric symptoms in mild cognitive impairment. Front Aging Neurosci. (2022) 16:1335878. doi: 10.3389/fnagi.2024.1335878\n62. BBC Z, Damaseno BP. Anosognosia in Alzheimer's disease: a neuropsychological approach. Dement Neuropsychol. (2007) 1:81-8. doi: 10.1590/S1980-57642008DN10100013\n63. Jacus JP. Awareness, apathy, and depression in Alzheimer's disease and mild cognitive impairment. Brain Behav. (2017) 7:e00661. doi: 10.1002/brb3.661\n64. Nakaaki S, Murata Y, Sato, Shinagawa Y, Higuchi J, et al. Impact of depression on insight into memory capacity in patients with Alzheimer disease. Alzheimer Dis Assoc Disord. (2008) 22: 369-74. doi: 10.1097/WAD.0b013e31818f2058\n65. Oba H, Matsuoka T, Imai A, Fujimoto H, Katoya J, Tashiata B, et al. Participation between memory impairment and depressive symptoms can exacerbate anosognosia: a comparison of Alzheimer's disease with mild cognitive impairment. Aging Mental Health. (2019) 23:595-401. doi: 10.1080/13607863.2018.14422\n66. Chen YL, Chen HM, Huang MF, Yeh YC, Yen CF, Chen CS. Clinical correlates of unawareness of deficits among patients with dementia: 1. Debut to Alzheimer's disease. Am J Alzheimers Dis Other Dement. (2014) 29:533-9. doi: 11.1177/13337517145248430", "doc_items_refs": ["#/texts/348", "#/texts/349", "#/texts/350", "#/texts/351", "#/texts/352", "#/texts/353"], "page_nos": [1], "uuid": "76705651-c54b-44c9-92e5-5b654c99caa2"}
{"doc_id": "2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288.doctags", "chunk_id": 48, "source_chunk_idxs": [62], "num_tokens": 472, "text": "Author disclaimer\n67. Gilleen J, Greenwood K, Archer N, Lovestone S, David AS. The role of premorbid personality and cognitive factors in awareness of illness, memory, and behavioural functioning in Alzheimer's disease. Cogn Neuropsychiatry. (2012) 17:227-45. doi: 10.1080/13546850.2011.588700\n68. Smith SM, Jenkins M, Woolrich MW, Becknich CF, Behrens TEJ, Johansen HB, et al. Advances in functional and structural MR image analysis and implementation as FSL. NeuroImage. (2004) 23:5208-19. doi: 10.1016/j.neuroimage.2004.07051\n69. Derouesné C, Thibault S, Lagha-Pierucci S, Baudouin-Madev, A Ncri, A Lomblez L. Decreased awareness of cognitive deficits in patients with mild dementia of the Alzheimer type. Int J Geriatr Psychiatry. (1999) 14:1019-30. doi: 10.1002/SICI)1999/116619(9912)14:12-1019:AID-GPS61&gt;3.0.CO:2-F\n70. Troisi A, Pasini A, Gori G, Sorbi T, Baroni A, Ciani N. Clinical predictors of somatic and psychological symptoms of depression in Alzheimer's disease. J Psychiatry. (1996) 11:23-7. doi: 10.1002/(SICI)1099-116619(9912)14:12-1019:AID-GPS61\n71. Seltzer B, Vasterling JJ, Hale MA, Khura R. Anawareness of memory deficit in Alzheimer's disease: relation to mood and other diseases. Cogn Behav Neurol. (1995) 8:176.\n72. Sevush S, Leve N. Denial of memory deficit in Alzheimer's disease. Am J Psychiatry. (1993) 150:748-51. doi: 10.1176/ajp.150.5.748", "doc_items_refs": ["#/texts/354", "#/texts/355", "#/texts/356", "#/texts/357", "#/texts/358", "#/texts/359"], "page_nos": [1], "uuid": "28f29b36-05be-4d49-8147-9103c6ac5458"}
{"doc_id": "2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288.doctags", "chunk_id": 49, "source_chunk_idxs": [63], "num_tokens": 509, "text": "Author disclaimer\n73. Kelleher M, Tole MA, GIvin J. Anosognosia increases caregiver burden in mild cognitive impairment. Int J Geriatr Psychiatry. (2016) 31:799-808. doi: 10.1002/gps.4394\n74. Lehrner J, Kogler S, Lamm C, Dormer M, Kugl S, Pusswald G, et al. Awareness of memory deficits in subjective cognitive decline, mild cognitive impairment, Alzheimer's disease and Parkinson's disease. Int Psychogeriatr. (2015) 27:357-66. doi: 10.1017/S1041610214002245\n75. van Vliet D, de Vugt ME, Köhler S, Aalen T, Bäker C, Pijnenburg YAL, et al. Awareness and its association with effective symptoms in young-onset and late-alarren Alzheimer disease: a prospective study. Alzheimer Dis Assoc Disord. (2013) 27:265. doi: 10.1097/WAD0b013e31826cffa\n76. Cines S, Farrell M, Steffener J, Sullo L, Huey E, Karlawish J, et al. Examining the pathways between self-awareness and well-being in mind to moderate Alzheimer disease. Am J Geriatr Psychiatry. (2015) 23:1297-306. doi: 10.1016/j.jap.2015.05.005\n77. Horning SM, Melrose R, Sultzer D. Insight in Alzheimer's disease and its relation to psychiatric and behavioral disturbances. Int J Geriatr Psychiatry. (2014) 29:77-84. doi: 10.1002/gps.3972\n78. Lopez OL, Becker JT, Somsak D, Dew MA, DeKosky ST. Awareness of cognitive deficits and anosognosia in probable Alzheimer's disease. Eur Neurol. (1994) 34:277-82. doi: 10.1159/000117056\n79. Mak E, Chin R, Ng LT, Yeo D, Hameed S. Clinical associations of anosognosia in mild cognitive impairment and Alzheimer's disease. Int J Geriatr Psychiatry. (2015) 30:1207-14. doi: 10.1002/gps.4275", "doc_items_refs": ["#/texts/360", "#/texts/361", "#/texts/362", "#/texts/363", "#/texts/364", "#/texts/365", "#/texts/366"], "page_nos": [1], "uuid": "3af233fe-e0bd-4efe-9793-d3a49ef135d3"}
{"doc_id": "2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288.doctags", "chunk_id": 50, "source_chunk_idxs": [64], "num_tokens": 478, "text": "Author disclaimer\n80. Starkstein SE, Jorge R, Mizrahi R, Robinson RG. A diagnostic formulation for anosognosia in Alzheimer's disease. J Neurol Neurosurg Psychiatry. (2006) 77:719-25. doi: 10.1136/jnnp.2005.085373\n81. Reed BR, Jagust WJ, Coulter R. Anosognosia in Alzheimer's disease: relationships to depression, cognitive function, and cerebral perfusion. J Clin Exp Neuropsychol. (1993) 15:231-44. doi: 10.1080/1688639308402560\n82. Starkstein SE, Sabe L, Cermerski E, Jason L, Leiguarda R. Two domains of anosognosia in Alzheimer's disease. J Neurol Neurosurg Psychiatry. (1996) 61:485-90. doi: 10.1136/jnnp.61.5.485\n83. Amanzio M, Woolrich M, Torta DSE, Macco K, Cauda F, D'Agata F, Duca S, et al. Unawareness of deficits in Alzheimer's disease: role of the cingulate cortex. Brain. (2011) 134:1061-76. doi: 10.1093/brain/awr020\n84. Starkstein SE, Brockman S, Bruce D, Petraca G. Anosognosia is a significant predictor of apathy in Alzheimer's disease. J Neuropsychiatry Clin Neuropsychi. (2010) 22:378-83. doi: 10.1116/jnp.2010.22.4.378\n85. Turnbull R, Gárraga O, Regr-Olmo J, Calv-Pálys Ex, Réne-L'Amire-Ríz, G'ascón-Bayarri J, Condela JL. Course and determinants of Anosognosia in Alzheimer's disease: a 12-month follow-up. Alzheimer's Dis. (2016) 51:357-66. doi: 10.3233/JAD-150706.", "doc_items_refs": ["#/texts/367", "#/texts/368", "#/texts/369", "#/texts/370", "#/texts/371", "#/texts/372"], "page_nos": [1], "uuid": "2e6b40a7-a1e7-41db-928a-e7d1d5dd490e"}
{"doc_id": "2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288.doctags", "chunk_id": 51, "source_chunk_idxs": [65], "num_tokens": 505, "text": "Author disclaimer\n86. Yoo HS, Chung SJ, Lee YH, Ye BS, Soohn YH, Lee PH. Cognitive anosognosia is associated with frontal dysfunction and lower depression in Parkinson's disease. Eur J Neurosci. (2022) 95:27-81. doi: 10.1111/ej.1480\n87. Castro PC, Aquino CC, Felcio AC, Doná F, Maredi MLOGI, Silva SMA, et al. Presence or presence of absence cognitive complaints in Parkinson's disease: mood disorder or anosognosia? Arq Neuropsiqaria Disposibili. (2016) 74:439-44. doi: 10.1590/0004-282x2016060\n88. Narel SE, Mader K, Jolionr W, DKow MS, Evenador MZ, Helfer SAA, Ej. T perceptive Subjective perception of cognition is related to mood and not performance. Epilepsy Behav. (2009) 14:59-64. doi: 10.1059/k02.4.280\n89. Orfei MD, Asgassa P, Delfinano C, Pontiello E, Carrantine C, Pierantonez G, Pinteranzzi M, and dementia and mild cognitive impairment. Pearson's disease with mild dementia and mild cognitive impairability. J Neuropsychol. (2007) 16:1019-4. doi: 10.1016/j.jpe.2014.10.005\n90. Starkstein SE, Sabe L, Petra C, Ghermer C, Knutz E, Garsmel M, et al. Neuropsychological and psychiatric differences between Alzheimer's disease and Parkinson's disease with dementia. J Neurol Neurosurg Psychiatry. (1996) 11:61-38-7. doi: 10.1136/jn61.4.1.6\n91. Mikos A, Springer US, Nienzo AN, Kellison IL, Fernandez HH, OkusM, et al. Awareness of expressivity deficits in non-demented Parkinson disease. Clin Neuropsychol. (2009) 23:805-17. doi: 10.1080/13854040802572434", "doc_items_refs": ["#/texts/373", "#/texts/374", "#/texts/375", "#/texts/376", "#/texts/377", "#/texts/378"], "page_nos": [1], "uuid": "4f952360-cf9a-4893-8af3-e9e7c33e61f2"}
{"doc_id": "2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288.doctags", "chunk_id": 52, "source_chunk_idxs": [66], "num_tokens": 497, "text": "Author disclaimer\n92. Magrabe DT, Morris RG, Cross on the relation among mood, apathy, and anosognosia Alzheimer's Disease. (1981) 31:120. doi: 10.3233/JAD-201426. 10.1073/S13567713001276\n93. Tagai K, Nagata T, Shinagawa S, Shiga M. Anosognosia in patients with Alzheimer's disease: current perspectives. Psychogeriatry. (2020) 20:345-52. doi: 10.1.1011/psyg.\n94. Luther B, Fai K, Linas BM, Gilbert RL, Buck KD, Choi J, Dimaggio G, et al. Metacognition is necessary for the emergence of motivation in people with schizophrenia Spectrum disorders. a necessary condition analysis. J Nervent Dis. 2016-05-60. doi: 10.1097/MDIM00000000753\n95. Apostolova LG, Akopyan G, Partali N, Steiner CA, Dutton RA, Hayashi KM, et al. Structural correlates of apathy in Alzheimer's disease. Dement Geriatr Cogn Disord. (2009) 24:91-11. doi: 10.1059/k093103914\n96. Levy R, Dubois B. Apathy and Catarbion P. Ciarbion. (2016) 16:916-28. doi: 10.1093/ccerb/j4043\n97. Nagata T, Shinagawa S, Chaiouh D, Kaja H, Kasaraha H, Kuriyanka E, et al. Relationship of frontal dysplasia function and aberrant motor control. J Neurophysiol. (2013) 26:463-9. doi: 10.1023/S16104102099993\n98. Tek S, Mega MS, Dermman DM, Chow T, Garakiewicz M, Drion M, 10.1016/j.jap.2015.10.005. 49. Bernden E, van Dukkeren E, Laks D, Durode MCN, Bernards G, Landeirfern J, et al.", "doc_items_refs": ["#/texts/379", "#/texts/380", "#/texts/381", "#/texts/382", "#/texts/383", "#/texts/384", "#/texts/385"], "page_nos": [1], "uuid": "13b8e9f9-1545-4683-9c9d-f2ff1484248e"}
{"doc_id": "2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__The_association_between_anosognosia_and_neuropsychiatric_symptoms_in_neurodegene__W4414552288.doctags", "chunk_id": 53, "source_chunk_idxs": [67], "num_tokens": 141, "text": "Author disclaimer\n99. Bernden E, van Dukkeren E, Laks J, Durode MCN, Bernards G, Landeirfern J, et al. 2019:31-1250. doi: 10.3233/JAD-201426. 10.1021/JAS-20112\n100. Antoino N, Bahri MA, Bastin C, Collette F, Phillips C, Balteau E, et al. Anosognosia and default mode network dysfunction in Alzheimer's disease. Hum Brain Mapp. (2019) 40:5320-40. doi: 10.1002/hbm.24775", "doc_items_refs": ["#/texts/386", "#/texts/387"], "page_nos": [1], "uuid": "c4ef7934-4dd5-44b3-a71e-b1c1e35c610b"}
