{"doc_id": "2025__Editorial_Neurocognitive_disorders_in_the_community_a_global_perspective__W4414218012", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Editorial_Neurocognitive_disorders_in_the_community_a_global_perspective__W4414218012.doctags", "chunk_id": 0, "source_chunk_idxs": [0, 1], "num_tokens": 143, "text": "&lt;!-- image --&gt;\n&lt;!-- image --&gt;\n\nOPEN ACCESS\nEDITED AND REVIEWED BY Wendy Moyle, Griffith University, Australia\n*CORRESPONDENCE Panagiotis Alexopoulos\nGLYPH These authors have contributed equally to this work\nRECEIVED 10 July 2025 ACCEPTED 22 August 2025\nPUBLISHED 09 September 2025\nCITATION\nAlexopoulos P, Lawler K, Ogbguu C, Sanchez AA and Maharani A (2025) Editorial: Neurocognitive disorders in the community: a global perspective. Front. Dement. 4:1663449. doi: 10.3389/frdem.2025.1663449", "doc_items_refs": ["#/pictures/0", "#/pictures/1", "#/texts/1", "#/texts/2", "#/texts/3", "#/texts/4", "#/texts/5", "#/texts/6", "#/texts/7"], "page_nos": [1], "uuid": "ba907ae1-8d7e-4450-987a-6b5be9312ecd"}
{"doc_id": "2025__Editorial_Neurocognitive_disorders_in_the_community_a_global_perspective__W4414218012", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Editorial_Neurocognitive_disorders_in_the_community_a_global_perspective__W4414218012.doctags", "chunk_id": 1, "source_chunk_idxs": [2], "num_tokens": 424, "text": "COPYRIGHT\n© 2025 Alexopoulos, Lawler, Ogbguu, Sanchez and Maharani. This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms.\nPanagiotis Alexopoulos 1,2,3,4*1, Katherine Lawler$^{5,6}$, Chukwuuanugo Ogbguu$^{7,8}$, Arianna Almirall Sanchez 2,9 and Asri Maharani 10\n$^{1}$Mental Health Services, Faculty of Medicine, School of Health Sciences, University of Patras, Patras, Greece, 2 Global Brain Health Institute, School of Medicine, Trinity College Dublin, The University of Dublin, Dublin, Ireland, 3 Department of Psychiatry and Psychotherapy, Klinikum Rechts der Isar, Technical University of Munich, Munich, Germany, $^{4}$Patras Dementia Day Care Centre, Patras, Greece, 5 Wicking Dementia Research and Education Centre, University of Tasmania, Hobart, TAS, Australia, 6 School of Allied Health, Human Services and Sport, La Trobe University, Melbourne, VIC, Australia, 7 Nnamdi: Azikite University Teaching Hospital, Nnewi, Nigeria, 8 Global Brain Health Institute, University of California, San Francisco, San Francisco, CA, United States, 9 Department of Public Health and Primary Care, School of Medicine, Trinity College Dublin, Dublin, Ireland, 10 Mental Health Research Group, Division of Nursing, Midwifery and Social Work, School of Health Sciences, University of Manchester and Manchester Academic Health Science Centre (MAHSC), Manchester, United Kingdom\nKEYWORDS\ndementia, brain health, collaborative services, equity, prevention", "doc_items_refs": ["#/texts/9", "#/texts/13", "#/texts/14", "#/texts/15", "#/texts/16"], "page_nos": [1], "uuid": "7260c728-3f32-411c-a1c6-c7456d9d49cb"}
{"doc_id": "2025__Editorial_Neurocognitive_disorders_in_the_community_a_global_perspective__W4414218012", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Editorial_Neurocognitive_disorders_in_the_community_a_global_perspective__W4414218012.doctags", "chunk_id": 2, "source_chunk_idxs": [3], "num_tokens": 485, "text": "Editorial on the Research Topic\nNeurocognitive disorders in the community: a global perspective\nThe prevalence of neurocognitive disorders is projected to rise substantially, particularly in low- and middle-income countries (LMICs) (Sachdev et al., 2014; Nichols et al., 2022). Interestingly, the development, clinical expression and progression of brain pathologies causing neurodegenerative conditions, are influenced by modifiable risk factors like low cognitive brain reserve, sensory loss and hypertension, which account for approximately 45% of dementia cases (Livingston et al., 2024). The deciphering of this complex interplay triggers a shift from disease-based management strategies to brain health-promoting ones (Fox et al.). This Research Topic of papers explores global approaches to brain health promotion and dementia prevention, the impact of neurocognitive disorders on communities at individual and societal levels, and innovative approaches to diagnostic and post diagnostic care services addressing inequities.\nThe rapidly increasing number of people with cognitive decline renders radical changes in the paradigm of care services for neurocognitive disorders inevitable. Three papers in this Research Topic highlight that in low-resource settings memory clinics and old-age mental health services are scarce and primary healthcare providers do not routinely carry out cognitive screening in older people (Ogbguu et al., 2023; Fox et al.; Ali et al.; Novotni et al.). Collaborative healthcare services, bridging primary healthcare services with secondary or tertiary ones, may pragmatically address the changing and complex healthcare needs of people with neurocognitive disorders (Novotni et al.; Aggeletaki et al.; Tunnard et al.), and the needs of their care partners (Kennedy et al.). They are based on multiprofessional teams who are aware of the particularities of the local setting. In this Research Topic, three living labs (Wolff et al., 2024) of such collaborative community services are presented, mainly\na multiprofessional case management and e-psychoeducation model of services delivered by mobile teams (Novotni et al.) and two telehealth-based memory clinic models embedded within primary healthcare services in low-resource settings (Aggeletaki et al.).", "doc_items_refs": ["#/texts/18", "#/texts/19", "#/texts/20", "#/texts/23"], "page_nos": [1], "uuid": "2e27e5e5-4c95-488d-bd40-6835a35cbbc4"}
{"doc_id": "2025__Editorial_Neurocognitive_disorders_in_the_community_a_global_perspective__W4414218012", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Editorial_Neurocognitive_disorders_in_the_community_a_global_perspective__W4414218012.doctags", "chunk_id": 3, "source_chunk_idxs": [4], "num_tokens": 467, "text": "Editorial on the Research Topic\nConsidering the significant impact of modifiable risk factors on the development of cognitive decline in aging and the still small effect sizes of potentially disease modifying drugs, dementia prevention remains a priority and was the primary focus of two papers in the Research Topic (Andreoletti and Blasimme; Fox et al.). Indeed, dementia prevention has been included as a strategic goal in the National Dementia plans of several European and North American countries, while in LMICs like Pakistan, no such plans have been enacted at all (Andreoletti and Blasimme; Ali et al.). In both papers the benefits of evidence-based population-wide approaches to dementia prevention over those relying on lifestyle interventions alone are underscored. Nonetheless, even if included in National Dementia plans, prevention actions are commonly depicted in very general terms and their implementation is undermined by staff shortages, lack of interest of healthcare professionals, pervasive stigma pertaining to aging and dementia and widespread misconceptions regarding the nature of age-related cognitive decline (Fox et al.).\nModifiable cognitive decline risk factors are related to cardiovascular, sensory, mental and physical health, as well as to societal determinants of brain health which makes multiprofessional cooperation essential for implementing dementia prevention strategies (Gorelick and Sordon, 2024). Interestingly, the ties of collaborative community healthcare services to local contexts may facilitate localized approaches to addressing dementia risk factors, brain health promotion and destigmatization of aging and dementia (Fox et al.). Indeed, the impact of each dementia risk factor may vary across different contexts, considering for instance the high rates of brain injuries in Pakistan because of lack of road regulations, domestic and sexual violence or the better memory function of older rural-dwellers compared to urbandwellers in Southern Nevada in the United States, even though rural living commonly poses putative risk for cognitive decline and dementia (Ali et al.; Miller et al.). This variability warrants in-depth investigation and should inform local awareness raising campaigns, prevention and care. In addition, the central role of primary healthcare professionals in collaborative healthcare services enables a \"one-stop-shop\" approach to the management of several risk factors of cognitive decline (Aggeletaki et al.).", "doc_items_refs": ["#/texts/24", "#/texts/25"], "page_nos": [1], "uuid": "c0b3482e-69bf-4d62-ab6f-14e8724e0aef"}
{"doc_id": "2025__Editorial_Neurocognitive_disorders_in_the_community_a_global_perspective__W4414218012", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Editorial_Neurocognitive_disorders_in_the_community_a_global_perspective__W4414218012.doctags", "chunk_id": 4, "source_chunk_idxs": [5], "num_tokens": 461, "text": "Editorial on the Research Topic\nCollaborative community healthcare services are increasingly based on telemedicine, with technology a key focus of two papers in the Research Topic (Aggeletaki et al.; Tunnard et al.). E-health tools facilitate communication between collaborating healthcare professionals serving at spatially distant services, between service users and healthcare professionals, distant monitoring of symptoms and behavior of older people living alone, support for their informal care partners and/or assessment and decision-making for people with dementia living in care homes (Schaller et al., 2015; Vuong et al., 2015) (Tunnard et al.). For instance, e-health tools can be used by the staff of care homes to communicate the symptoms of the residents through video consultations, safeguarding appropriate prescribing, advance care planning and reduction of hospitalizations (Tunnard et al.).\nAlthough telemedicine contributes to the quality of dementia care, it can also lead to inequities in access and usage (Wolff et al., 2024). Equity promoting e-health solutions was a recurring theme in this Research Topic of papers. The development of practical guidelines for equitable e-health solutions for dementia care in the UK is depicted (Wolff et al., 2024), so does a tablet-based, brain health assessment tool which was adapted to the cultural nuances of communities in Southeast Nigeria (Ogbuagu et al.).\nDespite efforts reported in this Research Topic, there remains a strong and ongoing need for action to tackle inequities at local and national levels. Work relating to National Dementia Action Plans remains of foundational importance. Yet every dementia researcher and clinician could also consider inequity when planning future work and/or in their everyday clinical practice. What partnerships could be developed, big or small, to nudge toward health equity for people living with dementia or cognitive impairment? What tweaks could be made to a research project to allow access for people living in low-resource settings? In addition, it is urgent that researchers and clinicians from LMICs are resourced or supported to shape innovative dementia research and care agendas in their countries rather than having to adapt work from other parts of the world later.", "doc_items_refs": ["#/texts/26", "#/texts/30", "#/texts/31"], "page_nos": [1], "uuid": "023715cc-6f3f-4f67-b01a-7b8d2a0b614c"}
{"doc_id": "2025__Editorial_Neurocognitive_disorders_in_the_community_a_global_perspective__W4414218012", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Editorial_Neurocognitive_disorders_in_the_community_a_global_perspective__W4414218012.doctags", "chunk_id": 5, "source_chunk_idxs": [6, 7, 8, 9, 10], "num_tokens": 315, "text": "Editorial on the Research Topic\nIn conclusion, the papers included in this Research Topic provide valuable insights into the challenges of care and prevention of age-related cognitive decline in diverse communities worldwide. They can inform the development of pragmatic community services that are adjusted to local contexts and meet local brain health needs, and fuel future research endeavors.\n\nAuthor contributions\nPA: Conceptualization, Writing -original draft, Writing review &amp; editing. KL: Writing -original draft, Writing -review &amp; editing. CO: Writing -original draft, Writing -review &amp; editing. AA: Writing -original draft, Writing -review &amp; editing. AM: Writing -original draft, Writing -review &amp; editing.\n\nConflict of interest\nThe authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest.\nThe author(s) declared that they were an editorial board member of Frontiers, at the time of submission. This had no impact on the peer review process and the final decision.\n\nGenerative AI statement\nThe author(s) declare that no Gen AI was used in the creation of this manuscript.\nAny alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us.\n\nPublisher's note\nAll claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated", "doc_items_refs": ["#/texts/32", "#/texts/34", "#/texts/36", "#/texts/37", "#/texts/39", "#/texts/40", "#/texts/44"], "page_nos": [1], "uuid": "b26beb32-0281-4ea5-be3a-3cccaea4ccd3"}
{"doc_id": "2025__Editorial_Neurocognitive_disorders_in_the_community_a_global_perspective__W4414218012", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Editorial_Neurocognitive_disorders_in_the_community_a_global_perspective__W4414218012.doctags", "chunk_id": 6, "source_chunk_idxs": [11], "num_tokens": 428, "text": "References\nGorelick, P. B., and Sorond, F. A. (2024). What is brain health? Cereb. Circ. Cogn. Behav. 6:100190. doi: 10.1016/j.cccb.2023.100190\nLivingston, G., Huntley, J., Liu, K. Y., Costafreda, S. G., Selbek, G., Alladi, S., et al. (2024). Dementia prevention, intervention, and care: 2024 report of the Lancet standing Commission. Lancet 404, 572 -628. doi: 10.1016/S0140-6736(24)01296-0\nNichols, E., Steinmetz, J. D., Vollset, S. E., Fukutaki, K., Chalek, J., Abd-Allah, F., et al. (2022). Estimation of the global prevalence of dementia in 2019 and forecasted prevalence in 2050: an analysis for the Global Burden of Disease Study 2019. Lancet Public Health 7, e105 -e125. doi: 10.1016/S2468-2667(21)00249-8\nOgbuagu, C., Uwakwe, R., Kahn, J. G., Ogbuagu, E., Emelumadu, O., Okereke, U., et al. (2023). Primary health care providers knowledge of dementia and cognitive assessment tools for elderly populations in Southeast Nigeria: a pilot survey. SAGE Open Med. 11:2050312123120124. doi: 10.1177/20503121212312 04224\norganizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher.", "doc_items_refs": ["#/texts/46", "#/texts/47", "#/texts/48", "#/texts/49", "#/texts/52"], "page_nos": [1], "uuid": "97852f23-0531-4f9b-bc5d-9924759007c2"}
{"doc_id": "2025__Editorial_Neurocognitive_disorders_in_the_community_a_global_perspective__W4414218012", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Editorial_Neurocognitive_disorders_in_the_community_a_global_perspective__W4414218012.doctags", "chunk_id": 7, "source_chunk_idxs": [12], "num_tokens": 370, "text": "References\nSachdev, P. S., Blacker, D., Blazer, D. G., Ganguli, M., Jeste, D. V., Paulsen, J. S., et al. (2014). Classifying neurocognitive disorders: the DSM-5 approach. Nat. Rev. Neurol. 10, 634 -642. doi: 10.1038/NRNEUROL.2014.181\nSchaller, S., Marinova-Schnidt, V., Gobin, J., Criegee-Rieck, M., Griebel, L., Engel, S., et al. (2015). Tailored e-Health services for the dementia care setting: a pilot study of \"eHealthMonitor.\" BMC Med. Inform. Decis. Mak. 15:58. doi: 10.1186/S12911-015-0182-2\nVuong, N. K., Chan, S., and Lau, C. T. (2015). \"mHealth sensors, techniques, and applications for managing wandering behavior of people with dementia: a review,\" in Mobile Health , ed. S. Adibi (Cham: Springer), 11 -42. doi: 10.1007/978-3-319-12817-7\\_2\nWolff, B., Nielsen, S., and Kiwanuka, A. (2024). Practical guidelines for developing digital health solutions to increase equity in dementia care in the UK. Front. Digit. Health. 6:1490156. doi: 10.3389/fdgth.2024.1490156", "doc_items_refs": ["#/texts/53", "#/texts/54", "#/texts/55", "#/texts/56"], "page_nos": [1], "uuid": "368cb8f7-5456-44e0-8cb5-2160696e6c70"}
