{"doc_id": "2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251.doctags", "chunk_id": 0, "source_chunk_idxs": [0, 1, 2], "num_tokens": 197, "text": "&lt;!-- image --&gt;\n&lt;!-- image --&gt;\n\nOPEN ACCESS\nEDITED BY\nChuanming Li,\nChongqing University Central Hospital, China\nREVIEWED BY\nBenedetta Tafuri,\nUniversity of Salento, Italy\nAdria Arboix,\nSacred Heart University Hospital, Spain\n*CORRESPONDENCE\nDesheng Li\n13996045029@163.com\nWeiguo Li\ntengtong2007@163.com\n$^{†}$These authors have contributed equally to this work and share first authorship\nRECEIVED 16 June 2025\nACCEPTED 04 August 2025\nPUBLISHED 26 August 2025\n\nCITATION\nDu L, Wang L, Shen G, Zeng M, Li D and Li W (2025) Progress of radiomics research on white matter hyperintensity lesions. Front. Neurol. 16:1647724. doi: 10.3389/fneur.2025.1647724", "doc_items_refs": ["#/pictures/0", "#/pictures/1", "#/texts/1", "#/texts/2", "#/texts/3", "#/texts/4", "#/texts/5", "#/texts/6", "#/texts/7", "#/texts/8", "#/texts/9", "#/texts/10", "#/texts/11", "#/texts/12", "#/texts/13", "#/texts/14", "#/texts/15", "#/texts/16", "#/texts/17", "#/texts/19"], "page_nos": [1]}
{"doc_id": "2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251.doctags", "chunk_id": 1, "source_chunk_idxs": [3], "num_tokens": 492, "text": "COPYRIGHT\n© 2025 Du, Wang, Shen, Zeng, Li and Li. This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms.\nProgress of radiomics research on white matter hyperintensity lesions\nLin Du 1f, Lieping Wang 1f, Gang Shen 1, Min Zeng 1, Desheng Li 1* and Weiguo Li 2*\n$^{1}$Department of Radiology, Chongqing Tongliang District Hospital of Traditional Chinese Medicine, Chongqing, China, $^{2}$Department of Acupuncture and Pain, Chongqing Tongliang District Hospital of Traditional Chinese Medicine, Chongqing, China\nWhite matter hyperintensity (WMH) is the core imaging hallmark of cerebral small vessel disease (CSVD). This phenomenon is closely related to nervous system damage, such as cognitive impairment, dementia and increased risk of stroke. However, traditional diagnostic methods have significant limitations in terms of quantitative assessment, analysis of pathological mechanisms, and clinical decision support, which severely restrict their clinical application. Through high-throughput feature extraction and comprehensive analysis of clinical, laboratory, histological, and genomic data, radiomics in its current form can not only achieve the highprecision identification and staging of WMH but also help to reveal its pathological mechanism, which has shown important value in the diagnosis, prognosis, and evaluation of WMH-related diseases. Againsthisbackdrop, we strictly adhered to the norms of systematic literature reviews, conducting a comprehensive and transparent literature search. We also thoroughly reviewed the data using a predefined strategy and strict inclusion/exclusion criteria (detailed in the text). This article systematically reviews the progress of radiomics research in characterizing the pathological mechanism of WMH and in the early identification, classification and prognostic evaluation of related diseases, aiming to provide a theoretical basis and a technical reference for the early identification of high-risk groups, the optimization of diagnosis and treatment decision-making, and the practice of collaborative patient management.", "doc_items_refs": ["#/texts/21", "#/texts/25", "#/texts/26", "#/texts/27", "#/texts/28"], "page_nos": [1]}
{"doc_id": "2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251.doctags", "chunk_id": 2, "source_chunk_idxs": [4, 5], "num_tokens": 344, "text": "KEYWORDS\nwhite matter hyperintensity (WMH), cerebral small vessel disease (CSVD), radiomics, cognitive impairment, stroke risk\n\n1 Introduction\nWhite matter hyperintensity (WMH) is an imaging feature based on magnetic resonance imaging (MRI). WMH lesions present high signal intensity on T2-weighted imaging (T2WI) or fluid-attenuated inversion recovery (FLAIR) sequences and are mainly distributed in the bilateral deep brain and periventricular white matter, symmetrically or asymmetrically (1). Clinically, WMH is recognized as the core imaging marker of cerebral small vessel disease (CSVD) (1, 2), which is closely related to nervous system damage, such as cognitive dysfunction, dementia and increased risk of stroke (3-5). Furthermore, some researchers have reported that WMH in acute cerebrovascular diseases is mainly associated with the subtype of lacunar infarction (6). According to the literature, WMH increases the risk of cognitive impairment and all-cause dementia (ACD) by 14% while increasing the risk of Alzheimer's disease (AD) by 25% and the risk of vascular dementia (VaD) by 73% (5). Other studies have shown that WMH can be used\nas an independent predictor of stroke (7), and its severity is significantly associated with an increased risk of ischemic and hemorrhagic stroke (7, 8). In clinical practice, early and accurate identification and staging of WMH are of great clinical importance for the diagnosis and prognosis of the disease.", "doc_items_refs": ["#/texts/30", "#/texts/32", "#/texts/35"], "page_nos": [1]}
{"doc_id": "2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251.doctags", "chunk_id": 3, "source_chunk_idxs": [6], "num_tokens": 210, "text": "1 Introduction\nMRI findings combined with Fazekas scale scores are commonly used to assess the severity of WMH (9-11). However, owing to the shortcomings of artificial subjectivity, quantitative bias and lack of pathological interpretation, their value in clinical and scientific research is limited. In recent years, radiomics has been used to extract quantitative and highly reproducible information from CT, MR, PET/SPECT and other imaging images; capture tissue and lesion characteristics; and comprehensively evaluate the obtained feature patterns by combining clinical, laboratory, histological, and genomic data. It has shown broad application prospects in analyzing the pathophysiology of diseases and predicting therapeutic effects, and it has also shown great potential in research on WMH-related diseases (12-14). This article reviews the progress of radiomics research on the pathological mechanism of WMH and the early identification, classification and prognostic evaluation of related diseases to provide a clinical basis for the formulation of early intervention strategies.", "doc_items_refs": ["#/texts/36"], "page_nos": [1]}
{"doc_id": "2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251.doctags", "chunk_id": 4, "source_chunk_idxs": [7], "num_tokens": 348, "text": "2 Methods\nThis study strictly adhered to the systematic literature search protocol of the Preferred Reporting Items for Systematic Review and Meta-Analyses (PRISMA) guidelines (15).\nDuring the data collection stage, we conducted a detailed and comprehensive search of the PubMed and Springer databases using logical combinations of keywords to ensure the reliability and coverage of the data. The adopted search strategy included terms such as \"white matter hyperintensity,\" \"cerebral small vessel disease,\" \"radiomics,\" \"stroke,\" \"cognitive dysfunction,\" \"dementia,\" \"Alzheimer's disease\" and \"Parkinson's disease.\" The references obtained through manual search were used to identify more published articles. The research is limited to non-conference academic publications published in English. The date of this literature search ranged from January 2000 to March 2025. A total of 6,069 records were ultimately retrieved. After careful adjustment and optimization of the search strategy, 26 records were deemed relevant to the research topic and were included in the study. The following is a schematic workflow of the study (Figure 1). The neurology literature feature extraction is shown in Table 1.\nThe inclusion criteria for the literature were online publications specifically related to the abovementioned topic and those published in English. The exclusion criteria were duplicate publications, studies with insufficient or incomplete data for which relevant information could not be extracted, studies without a clear research objective, and studies published in languages other than English. The researchers used EndNote X9 reference management software to eliminate duplicate studies. Two researchers independently screened the titles and abstracts to determine whether they met the inclusion criteria. Disagreements were resolved by discussion; if there was still disagreement, a third researcher was consulted.", "doc_items_refs": ["#/texts/38", "#/texts/39", "#/texts/40"], "page_nos": [1]}
{"doc_id": "2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251.doctags", "chunk_id": 5, "source_chunk_idxs": [8], "num_tokens": 333, "text": "3.1.1 Epidemiology\nThe prevalence of WMH increases with age and ranges from approximately 20-100% (16-18). Wide variation exists due to differences in the race, sex, and age of the subjects and the different research methods used (such as examination methods, observation sites, and evaluation criteria). The prevalence of WMH varies significantly among different races, with studies showing higher prevalence and progression rates of WMH among black people than white people (19, 20). Another study reported that the prevalence of confluent WMH in the Han Chinese population was significantly greater than that in Australian Caucasians (21). Differences also exist in the incidence of WMH in patients according to sex. Lohner et al. (22) reported that the rate of progression and the proportion of severe WMH lesions (Fazekas ≥ 2) in postmenopausal women were significantly greater than those in contemporary men, and women with uncontrolled hypertension were found to have a greater WMH burden than men, which was unrelated to menopausal status. In middle-aged people, the prevalence of WMH is approximately 20-50% (17). Among people aged 60-70 years, 87% had deep white matter hyperintensity (DWMH), and 68% had periventricular white matter hyperintensity (PVWMH). The prevalence of DWMH and PVWMH reached 100 and 95%, respectively, in people aged 80-90 years (16, 18).", "doc_items_refs": ["#/texts/47"], "page_nos": [1]}
{"doc_id": "2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251.doctags", "chunk_id": 6, "source_chunk_idxs": [9, 10], "num_tokens": 431, "text": "3.1.2 Risk factors\nThe development of WMH is related to the interaction of multiple systems, and the main risk factors include vascular endothelial dysfunction and hemodynamic disorders caused by hypertension, diabetes, atherosclerosis and smoking (17, 23-26); cerebral metabolic abnormalities and vasomotor disorders caused by hyperlipidemia, migraine, and sleep disorders (27-29); and genetic diseases (such as andreukleoidystrophy) and immune-mediated inflammatory diseases (such as multiple sclerosis) (30-32).\n\n3.1.3 Pathological mechanism\nThe pathogenesis of WMH is complex, and the core pathological changes are characterized by demyelination, oligodendrocyte apoptosis, axial injury and reactive gliosis (16). The current mainstream hypotheses include the following four categories: (1) Hypoperfusion and ischemic injury: Factors such as arterial stenosis and endothelial dysfunction lead to chronic white matter hypoperfusion, which leads to disordered oligodendocyte energy metabolism and ischemic demyelination (16, 23, 33). (2) Blood-brain barrier (BBB) disruption: Vascular permeability is abnormally increased, and plasma components (such as inflammatory factors and fibrinogen) leak into the brain parenchyma, directly damaging myelin structure and reducing white matter fiber density (34). (3) Vein collagen hyperplasia and microcirculation disorder: Venous ischemia, collagen deposition in venules around the ventricles and obstruction of flow in the jugular vein occur, resulting in intensified microcirculation blockage and obstacles to the removal of metabolic waste (35). (4) Hypoperfusion, BBB destruction and other pathological\n&lt;!-- image --&gt;\nprocesses activate microglia and release proinflammatory factors, which further accelerate white matter damage (32).", "doc_items_refs": ["#/texts/49", "#/texts/51", "#/pictures/2", "#/texts/54"], "page_nos": [1]}
{"doc_id": "2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251.doctags", "chunk_id": 7, "source_chunk_idxs": [11], "num_tokens": 418, "text": "3.2.1 Diagnostic MRI techniques for WMH\nMRI is a noninvasive, radiation-free and high-resolution method to evaluate the brain structure and function of patients with WMH. In clinical practice, the MRI techniques related to the diagnosis of WMH mainly include conventional plain MRI (T1-weighted imaging (T1WI), T2WI and T2-FLAIR) (1), arterial spin labeling (ASL) (36), diffusion tensor imaging (DTI) (37-39) and diffusion kurtosis imaging (DKI) (39-42).\nT2WI and T2-FLAIR are highly sensitive in detecting WMH. In particular, 3D-T2-FLAIR, which was developed on the basis of\nT2-FLAIR, has characteristics including high resolution and fast imaging speed, which are highly valuable for the detection of WMH, but this modality cannot define the pathogenesis of the lesions and the pathological changes associated with them. ASL can directly and quantitatively measure cerebral blood flow (CBF) by labeling water molecules in arterial blood as an endogenous tracer. It has high value for evaluating WMH induced by hypoperfusion, but it is less sensitive to small lesions and is easily disturbed by motion artifacts. DTI can quantify the microstructure and integrity of white matter by detecting the diffusion characteristics of water molecules in white matter fiber tracts, which has the advantages of noninvasiveness, safety, high sensitivity, three-dimensional visualization, fiber tracking and dynamic monitoring. However, there is confusion and interference in the crossing area of nerve fiber tracts, which affects the measurement results of WMH lesions. DKI introduces a fourth-order tensor model, which can more accurately analyze the non-Gaussian characteristics of water molecular diffusion and compensate for the\n\nTABLE 1 The neurological literature feature extraction table.\n|   Number | Authors/Ref.            | Paper title                                                                                                                                     | Study design                       | Sample size ( n )                                                                                                                                        | Research objectives                                                                                                                                                                                                                                               | Main conclusions                                                                                                                                                                                                                                                                                                                                           |", "doc_items_refs": ["#/texts/57", "#/texts/58", "#/texts/62", "#/texts/66", "#/tables/0", "#/tables/0"], "page_nos": [1]}
{"doc_id": "2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251.doctags", "chunk_id": 8, "source_chunk_idxs": [12], "num_tokens": 512, "text": "3.2.1 Diagnostic MRI techniques for WMH\n|----------|-------------------------|-------------------------------------------------------------------------------------------------------------------------------------------------|------------------------------------|----------------------------------------------------------------------------------------------------------------------------------------------------------|----------------------------------------------------------------------------------------------------------------------------", "doc_items_refs": ["#/tables/0"], "page_nos": [1]}
{"doc_id": "2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251.doctags", "chunk_id": 9, "source_chunk_idxs": [13], "num_tokens": 497, "text": "3.2.1 Diagnostic MRI techniques for WMH\n-\n--------------------------------------------------------------------------------------------------------------------------------------|------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|", "doc_items_refs": ["#/tables/0", "#/tables/0"], "page_nos": [1]}
{"doc_id": "2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251.doctags", "chunk_id": 10, "source_chunk_idxs": [14], "num_tokens": 503, "text": "3.2.1 Diagnostic MRI techniques for WMH\n|        1 | Etherton MR et al.  (7) | Normal-Appearing White Matter  Microstructural Injury Is Associated with  White Matter Hyperintensity Burden in  Acute Ischemic Stroke          | A retrospective  study             | 319 AIS patients (mean age  64.9 ± 15.9 years) with MRI (DTI/  FLAIR) within 48 h of onset.                                                              | To characterize diffusion tensor imaging  (DTI) features of normal-appearing white  matter (NAWM) and white matter  hyperintensity (WMH) in acute ischemic  stroke (AIS) patients, and explore  associations between NAWM  microstructural injury and WMH burden. | Normal-appearing white matter axial diffusivity  increases with age and is an independent  predictor of white matter hyperintensity  volume in acute ischemic stroke.                                                                                                                                                                                      |\n|        2 | Giese AK et al. (53)    | White Matter Hyperintensity Burden in  Acute Stroke Patients Diffs by Ischemic  Stroke Subtype                                                  | A retrospective  study             | 3,301 AIS patients, with 2,529  patients analyzed after quality  control of FLAIR MRI data.                                                              | To examine etiologic stroke subtypes and  vascular risk factor profiles and their  association with white matter hyperintensity  (WMH) burden in patients hospitalized for  acute ischemic stroke (AIS).                                                          | Vascular risk factor profiles and extent of  WMH burden differ by Causative Classification  of Ischemic Stroke (CCS)subtype, with the  highest lesion burden detected in patients with  small artery occlusion (SAO). These findings  further support the small vessel hypothesis of  WMH lesions detected on brain MRI of  patients with ischemic stroke. |\n|        3 | Gupta R et al. (50)     | Quality Assessment of Radiomics Studies  on Functional Outcomes After Acute  Ischemic Stroke-A Systematic Review                                | Review                             | 14 Studies using radiomics- extracted features to predict  functional outcomes among AIS  patients using the modified Rankin  Score (mRS) were included. | To assess the quality of existing studies  which use radiomics methods to predict  functional outcomes in patients following  AIS.                                                                                                                                | Included studies showed low-to-moderate  quality. As per the QUADAS-2, 6/14 (42.9%)  studies had risk of bias concern and 0/14 (0%)  had applicability concern.                                                                                                                                                                                            |", "doc_items_refs": ["#/tables/0"], "page_nos": [1]}
{"doc_id": "2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251.doctags", "chunk_id": 11, "source_chunk_idxs": [15], "num_tokens": 393, "text": "3.2.1 Diagnostic MRI techniques for WMH\n|        4 | Guo Y et al. (54)       | Novel Survival Features Generated by  Clinical Text Information and Radiomics  Features May Improve the Prediction of  Ischemic Stroke Outcome. | A retrospective  study             | A total of 80 DSC-PWI images  from 56 patients with ischemic  stroke were included.                                                                      | To evaluate the performance of clinical text  information (CTI), radiomics features, and  survival features (SurvF) for predicting  functional outcomes of patients with  ischemic stroke.                                                                        | The combination of mRSRF and CTI can  accurately predict functional outcomes in  ischemic stroke patients with proper machine  learning models. Moreover, combining SurvF  will improve the prediction effect compared  with the original features.                                                                                                        |\n|        5 | Tang T-y et al. (55)    | Penumbra-Based Radiomics Signature as  Prognostic Biomarkers for Thrombolysis  of Acute Ischemic Stroke Patients: A  Multicenter Cohort Study.  | A multicenter  retrospective study | 168 AIS patients within 9 h after  onset were collected from seven  hospitals and divided into a  training dataset and an external  validation dataset.  | To develop a radiomics signature (R score)  as prognostic biomarkers based on  penumbra quantification and to validate the  radiomics nomogram to predict the clinical  outcomes for thrombolysis for acute  ischemic stroke (AIS) patients.                      | The radiomics signature is an independent  biomarker for estimating the clinical outcomes  in AIS patients. By improving the  individualized prediction of the clinical  outcome for AIS patients 3 months after onset,  the radiomics nomogram adds more value to  the current clinical decision-making process.                                          |\n(Continued)\n\nTABLE 1 (Continued)\n|   Number | Authors/Ref.            | Paper title                                                                                                                                  | Study design          | Sample size ( n )                                                                                                        | Research objectives                                                                                                                                                                                                                                                                                                                   | Main conclusions                                                                                                                                                                                                                                                                                                                                  |", "doc_items_refs": ["#/tables/0", "#/texts/67", "#/texts/72", "#/tables/1", "#/tables/1"], "page_nos": [1]}
{"doc_id": "2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251.doctags", "chunk_id": 12, "source_chunk_idxs": [16], "num_tokens": 512, "text": "3.2.1 Diagnostic MRI techniques for WMH\n|----------|-------------------------|----------------------------------------------------------------------------------------------------------------------------------------------|-----------------------|--------------------------------------------------------------------------------------------------------------------------|----------------------------------------------------------------------------------------------------------------------------------------------------------------------------", "doc_items_refs": ["#/tables/1"], "page_nos": [1]}
{"doc_id": "2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251.doctags", "chunk_id": 13, "source_chunk_idxs": [17], "num_tokens": 508, "text": "3.2.1 Diagnostic MRI techniques for WMH\n-\n----------------------------------------------------------------------------------------------------------------------------------------------------------|---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|", "doc_items_refs": ["#/tables/1", "#/tables/1"], "page_nos": [1]}
{"doc_id": "2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251.doctags", "chunk_id": 14, "source_chunk_idxs": [18], "num_tokens": 486, "text": "3.2.1 Diagnostic MRI techniques for WMH\n|        6 | Guo K et al. (56)       | Machine Learning-Based Nomogram: Integrating Mri Radiomics and Clinical Indicators for Prognostic Assessment in Acute Ischemic Stroke.       | A retrospective study | 506 AIS patients involved                                                                                                | To develop and validate a nomogram that combines a multi-MRI radiomics signature with clinical factors for predicting the prognosis of AIS.                                                                                                                                                                                           | The study underscores the efficacy of the clinical-radiomics model in forecasting AIS prognosis, offering a significant leap toward more individualized and effective healthcare solutions.                                                                                                                                                       |\n|        7 | Xia Y et al. (57)       | Machine Learning Prediction Model for Functional Prognosis of Acute Ischemic Stroke Based on Mri Radiomics of White Matter Hyperintensities. | A retrospective study | 202 inpatients with acute anterior circulation ischemic stroke from the Department of Neurology.                         | To explore the value of a nomogram that integrates clinical factors and MRI white matter hyperintensities (WMH) radiomics features in predicting the prognosis at 90 days for patients with acute ischemic stroke (AIS).                                                                                                              | The FLAIR sequence-based WMH radiomics approach demonstrates effective prediction of the 90-day functional prognosis in patients with AIS. The integration of TWMH radiomics and clinical factors in a combined model exhibits superior performance.                                                                                              |\n|        8 | Bonkhoff AK et al. (58) | Association of Stroke Lesion Pattern and White Matter Hyperintensity Burden with Stroke Severity and Outcome.                                | A retrospective study | 928 AIS patients (severity analysis) and 698 followed-up patients (outcome analysis) from the MRI- GENIE cohort          | To examine whether high white matter hyperintensity (WMH) burden is associated with greater stroke severity and worse functional outcomes in lesion pattern- specific ways.                                                                                                                                                           | 1. High WMH burden exacerbated severity for lesions in left insular-inferior frontal (language) and right temporo-parietal (attention) regions 2. High WMH burden independently increased unfavorable outcomes. 3. Bilateral subcortical lesions (thalamus, internal capsule) were strongest predictors of severity/outcomes, independent of WMH. |", "doc_items_refs": ["#/tables/1"], "page_nos": [1]}
{"doc_id": "2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251.doctags", "chunk_id": 15, "source_chunk_idxs": [19], "num_tokens": 352, "text": "3.2.1 Diagnostic MRI techniques for WMH\n|        9 | Bretzner M, et al. (59) | MRI Radiomic Signature of White Matter Hyperintensities Is Associated with Clinical Phenotypes.                                              | A retrospective study | A multi-center cohort of 4,163 acute ischemic stroke (AIS) patients (mean age 62.8 years, 42% female) with T2-FLAIR MRI. | To evaluate radiomics for predicting white matter hyperintensity (WMH) burden and assessing brain structural integrity using conventional MRI.                                                                                                                                                                                        | Radiomics extracted from T2-FLAIR images of AIS patients capture microstructural damage of the cerebral parenchyma and correlate with clinical phenotypes, suggesting different radiographical textural abnormalities per cardiovascular risk profile.                                                                                            |\n|       10 | Meng F, et al. (16)     | Research Progress on Mri for White Matter Hyperintensity of Presumed Vascular Origin and Cognitive Impairment.                               | Review                | Middle-aged and elderly individuals                                                                                      | To review the association between WMH and cognitive impairment and the application of dynamic contrast-enhanced MRI, structural MRI, diffusion tensor imaging, 3D-arterial spin labeling, intravoxel incoherent motion, magnetic resonance spectroscopy, and resting-state functional MRI for examining WMH and cognitive impairment. | Multimodal MRI enables non-invasive assessment of structural, metabolic, and functional abnormalities in WMH, providing an important tool for early diagnosis, pathophysiological research, and treatment monitoring of cognitive impairment.                                                                                                     |\n(Continued)\n|   Number | Authors/Ref.                     | Paper title                                                                                                                                                                  | Study design                         | Sample size ( n )                                                                                                                                                                                  | Research objectives                                                                                                                                                                                                                                                                                                                                                        | Main conclusions                                                                                                                                                                                                                                                                                                                                        |", "doc_items_refs": ["#/tables/1", "#/texts/73", "#/tables/2"], "page_nos": [1]}
{"doc_id": "2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251.doctags", "chunk_id": 16, "source_chunk_idxs": [20], "num_tokens": 512, "text": "3.2.1 Diagnostic MRI techniques for WMH\n|----------|----------------------------------|------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|--------------------------------------|----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|------------------------------------------", "doc_items_refs": ["#/tables/2"], "page_nos": [1]}
{"doc_id": "2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251.doctags", "chunk_id": 17, "source_chunk_idxs": [21], "num_tokens": 13, "text": "3.2.1 Diagnostic MRI techniques for WMH\n-", "doc_items_refs": ["#/tables/2"], "page_nos": [1]}
{"doc_id": "2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251.doctags", "chunk_id": 18, "source_chunk_idxs": [22], "num_tokens": 512, "text": "3.2.1 Diagnostic MRI techniques for WMH\n---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------", "doc_items_refs": ["#/tables/2"], "page_nos": [1]}
{"doc_id": "2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251.doctags", "chunk_id": 19, "source_chunk_idxs": [23], "num_tokens": 180, "text": "3.2.1 Diagnostic MRI techniques for WMH\n-\n----------------------------------------------------------------------------------------------------------------------------------------------------------------------|", "doc_items_refs": ["#/tables/2", "#/tables/2"], "page_nos": [1]}
{"doc_id": "2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251.doctags", "chunk_id": 20, "source_chunk_idxs": [24], "num_tokens": 441, "text": "3.2.1 Diagnostic MRI techniques for WMH\n|       11 | Pasi M, et al. (60)              | Clinical Relevance of Cerebral Small  Vessel Diseases. Stroke                                                                                                                | Review                               | Middle-aged and elderly populations                                                                                                                                                                | To review the main clinical phenotypes of  cerebral small vessel disease (SVD),  including acute ischemic/hemorrhagic  events and cognitive impairment, explore  the clinical significance of MRI markers  (e.g., white matter hyperintensities, lacunes,  microbleeds), and analyze the impact of  asymptomatic SVD on disabling conditions  such as stroke and dementia. | Associated with elevated ischemic/hemorrhagic  stroke risk; severe WMH triples dementia risk.                                                                                                                                                                                                                                                           |\n|       12 | Grau-Olivares M, et al. (61)     | Mild Cognitive Impairment in Stroke  Patients with Ischemic Cerebral Small- Vessel Disease: A Forerunner of Vascular  Dementia?                                              | Review                               | Middle-aged and elderly patients with ischemic stroke  Asymptomatic elderly individuals with MRI-detected SVD markers  and patients with mild cognitive  impairment (MCI) or early  dementia.      | To investigate the association between  ischemic cerebral small vessel disease (SVD)  and cognitive impairment, and to evaluate  whether vascular mild cognitive impairment  (vMCI) is a precursor of subcortical  vascular dementia.                                                                                                                                      | Sereve WMH (particularly periventricular)  independently predicts slowed processing  speed and memory decline, strongly associated  with dementia risk.                                                                                                                                                                                                 |\n|       13 | Tang L, et al. (65)              | Individualized Prediction of Early  Alzheimer's Disease Based on Magnetic  Resonance Imaging Radiomics, Clinical,  and Laboratory Examinations: A  60-Month Follow-up Study. | Retrospective cohort  study          | 162 mild cognitive impairment  (MCI) patients                                                                                                                                                      | To develop and validate radiomics models  and multipredictor nomogram for  predicting the time to progression (TTP)  from MCI to AD                                                                                                                                                                                                                                        | The prediction of individual TTP from MCI to  AD could be accurately conducted using the  radiomics clinical-laboratory model and  multipredictor nomogram.                                                                                                                                                                                             |", "doc_items_refs": ["#/tables/2"], "page_nos": [1]}
{"doc_id": "2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251.doctags", "chunk_id": 21, "source_chunk_idxs": [25], "num_tokens": 459, "text": "3.2.1 Diagnostic MRI techniques for WMH\n|       14 | Dadar M, et al. (66)             | White Matter Hyperintensity Distribution  Differences in Aging and  Neurodegenerative Disease Cohorts.                                                                       | Cross-sectional  observational study | 976 participants from the  COMPASS-NID cohort of the  Canadian Consortium on  Neurodegeneration in Aging  (CCNA).                                                                                  | To compare the distribution characteristics  of white matter hyperintensities (WMH) in  aging and neurodegenerative disease  cohorts, including prevalence, regional  differences, sex-specific patterns, and  hemispheric asymmetry, and explore  associations with cognitive impairment.                                                                                 | There were distinct differences in WMH  prevalence and distribution across diagnostic  groups, sexes, and in terms of asymmetry.  WMH burden was significantly greater in all  neurodegenerative dementia groups, likely  encompassing areas exclusively impacted by  neurodegeneration as well as areas related to  cerebrovascular disease pathology. |\n|       15 | Garnier-Crussard  A, et al. (67) | White Matter Hyperintensity Topography  in Alzheimer's Disease and Links to  Cognition.                                                                                      | Cross-sectional  observational study | 54 cognitively impaired amyloid  beta- positive AD (Aβpos-AD),  compared to 40 cognitively  unimpaired amyloid beta- negative  older controls (Aβneg-controls)  matched for vascular risk factors. | To investigate the topographic distribution  of white matter hyperintensities (WMH) in  Alzheimer's disease (AD) and their  independent associations with cognitive  function, excluding the effects of amyloid  deposition and brain atrophy.                                                                                                                             | 1. AD patients had larger WMH volumes than  controls in all regions, with the most significant  increase in the spenium of the corpus callosum  (S-CC). 2. Total WMH volume and S-CC WMH were  strongly associated with cognitive decline (e.g.,  executive function, memory) in AD,  independent of Aβ deposition and atrophy.                         |\n|   Number | Authors/Ref.                      | Paper title                                                                                                                                                           | Study design                                                              | Sample size ( n )                                                                                                    | Research objectives                                                                                                                                                                                                                                                                                         | Main conclusions                                                                                                                                                                                                                                             |", "doc_items_refs": ["#/tables/2", "#/tables/3"], "page_nos": [1]}
{"doc_id": "2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251.doctags", "chunk_id": 22, "source_chunk_idxs": [26], "num_tokens": 512, "text": "3.2.1 Diagnostic MRI techniques for WMH\n|----------|-----------------------------------|-----------------------------------------------------------------------------------------------------------------------------------------------------------------------|---------------------------------------------------------------------------|----------------------------------------------------------------------------------------------------------------------|-----------------------------------------------------------------------------------------", "doc_items_refs": ["#/tables/3"], "page_nos": [1]}
{"doc_id": "2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251.doctags", "chunk_id": 23, "source_chunk_idxs": [27], "num_tokens": 480, "text": "3.2.1 Diagnostic MRI techniques for WMH\n-\n-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|", "doc_items_refs": ["#/tables/3", "#/tables/3"], "page_nos": [1]}
{"doc_id": "2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251.doctags", "chunk_id": 24, "source_chunk_idxs": [28], "num_tokens": 407, "text": "3.2.1 Diagnostic MRI techniques for WMH\n|       16 | Fiord CM, et al. (68)             | Automated White Matter Hyperintensity  Segmentation Using Bayesian Model  Selection: Assessment and Correlations  with Cognitive Change.                              | Retrospective cohort  study                                               | Magnetic resonance images from  30 control and 30 AD participants                                                    | To evaluate the performance of Bayesian  Model Selection (BaMoS) for automated  white matter hyperintensity (WMH)  segmentation and validate its ability to  predict longitudinal cognitive decline in  individuals with normal cognition, mild  cognitive impairment (MCI), and  Alzheimer's disease (AD). | BaMoS is suitable for large-scale multi-center  studies, providing reliable quantification of  WMH to explore its role in cognitive  impairment.                                                                                                             |\n|       17 | Carvalho de Abreu  DC, et al. (3) | Is White Matter Hyperintensity Burden  Associated with Cognitive and Motor  Impairment in Patients with Parkinson's  Disease? A Systematic Review and Meta- Analysis. | A systematic review  and meta-analysis                                    | Fifty eligible studies were included,  involving PD patients, PD-MCI  patients, PDD patients, and healthy  controls. | To examine the association between WMH  and cognitive and motor performance in PD  through a systematic review and meta- analysis.                                                                                                                                                                          | WMH burden appears to increase with PD  worse cognitive and motor status in PD  by 2020.                                                                                                                                                                     |\n|       18 | Hou M, et al. (70)                | Characteristics of Cognitive Impairment  and Their Relationship with Total Cerebral  Small Vascular Disease Score in  Parkinson's Disease.                            | A retrospective  study                                                    | 174 idiopathic PD patients who  underwent brain magnetic  resonance imaging (MRI) were  recruited                    | To investigate the characteristics of  cognitive dysfunctions and their  relationship with total cerebral small  vascular disease (CSVD) in Parkinson's  disease (PD)                                                                                                                                       | CSVD can independently contribute to  cognitive decline in PD and cause damage in  specific cognitive domains. Promoting  neurovascular health may help preserve  cognitive functions in PD.                                                                 |", "doc_items_refs": ["#/tables/3"], "page_nos": [1]}
{"doc_id": "2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251.doctags", "chunk_id": 25, "source_chunk_idxs": [29], "num_tokens": 475, "text": "3.2.1 Diagnostic MRI techniques for WMH\n|       19 | Huang X, et al. (76)              | Periventricular White Matter  Hyperintensity Burden and Cognitive  Impairment in Early Parkinson's Disease.                                                           | Cross-sectional  study (baseline data  analysis of a  prospective cohort) | 175 non-dented early PD  patients who had undergone  baseline brain MRI were included.                               | Quantified the total brain and  periventricular white matter  hyperintensities (WMHs) burdens in  patients with early Parkinson disease (PD)  and explored their associations with  cardiovascular risk factors and cognitive  performance.                                                                 | Periventricular WMHs burden was  independently associated with PD-MCI, as well  as worse executive function and visuospatial  function.                                                                                                                      |\n|       20 | Wu H, et al. (77)                 | Regional White Matter Hyperintensity  Volume in Parkinson's Disease and  Associations with the Motor Signs.                                                           | Combined cross- sectional and  longitudinal study                         | A total of 50 PD participants and  47 age- and gender-matched  controls were enrolled.                               | To investigate the association between  regional white matter hyperintensity  (WMH) volumes and Parkinson's disease  (PD), and to assess their impact on motor  signs through cross-sectional and  longitudinal analyses.                                                                                   | PD participants in this study were characterized  by greater WMH at the occipital region, and  greater occipital WMH volume had cross- sectional associations with worse motor signs,  while its longitudinal impact on motor signs  progression was limited |\n|       21 | Liu H, et al. (78)                | The Influence of White Matter  Hyperintensity on Cognitive Impairment  in Parkinson's Disease.                                                                        | Meta-analysis                                                             | 15 eligible studies                                                                                                  | To review systematically and to identify the  relationship between the severity and  location of white matter hyperintensities  (WMHs) and the degree of cognitive decline  in patients with Parkinson's disease (PD).                                                                                      | WMHs might be imaging markers for cognitive  impairment in PDD but not in PD-MCI,  regardless of age, vascular risk factors, or race.  Further prospective studies are needed to  validate the conclusions.                                                  |\n\nTABLE 1 (Continued)\n|   Number | Authors/Ref.            | Paper title                                                                                                                                                         | Study design                       | Sample size (n)                                                                                 | Research objectives                                                                                                                                                                                                                | Main conclusions                                                                                                                                                                                                                                  |", "doc_items_refs": ["#/tables/3", "#/texts/90", "#/tables/4", "#/tables/4"], "page_nos": [1]}
{"doc_id": "2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251.doctags", "chunk_id": 26, "source_chunk_idxs": [30], "num_tokens": 512, "text": "3.2.1 Diagnostic MRI techniques for WMH\n|----------|-------------------------|---------------------------------------------------------------------------------------------------------------------------------------------------------------------|------------------------------------|-------------------------------------------------------------------------------------------------|-----------------------------------------------------------------------------------------------------------------------------------------------------------------", "doc_items_refs": ["#/tables/4"], "page_nos": [1]}
{"doc_id": "2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251.doctags", "chunk_id": 27, "source_chunk_idxs": [31], "num_tokens": 324, "text": "3.2.1 Diagnostic MRI techniques for WMH\n-\n------------------------------------------------------------------|---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|", "doc_items_refs": ["#/tables/4", "#/tables/4"], "page_nos": [1]}
{"doc_id": "2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251.doctags", "chunk_id": 28, "source_chunk_idxs": [32], "num_tokens": 399, "text": "3.2.1 Diagnostic MRI techniques for WMH\n|       22 | Shu Z, et al. (48)      | An Integrative Nomogram for Identifying Early-Stage Parkinson's Disease Using Non-Motor Symptoms and White Matter- Based Radiomics Biomarkers from Whole-Brain Mri. | Retrospective cohort study         | 336 participants (168 PD patients, 168 healthy controls)                                        | To develop and validate an integrative nomogram based on white matter (WM) radiomics biomarkers and nonmotor symptoms for the identification of early- stage Parkinson's disease (PD).                                             | This integrative nomogram is a new potential method to identify patients with early-stage PD.                                                                                                                                                     |\n|       23 | Rektor I, et al. (79)   | White Matter Alterations in Parkinson's Disease with Normal Cognition Precede Gray Matter Atrophy.                                                                  | Cross-sectional case-control study | Twenty PD patients and twenty- one healthy controls (HC)                                        | To detect gray matter (GM) and white matter (WM) changes in PD patients without cognitive impairment.                                                                                                                              | WM microstructural damage occurs early in PD prior to overt GM atrophy, suggesting WM alterations as a sensitive biomarker for early PD.                                                                                                          |\n|       24 | Shu ZY, et al. (80)     | Predicting the Progression of Parkinson's Disease Using Conventional Mri and Machine Learning: An Application of Radiomic Biomarkers in Whole-Brain White Matter.   | Retrospective cohort study         | 144 PD patients (72 progressive, 72 stable)                                                     | To develop and validate a radiomics model based on whole-brain white matter and clinical features to predict the progression of Parkinson disease (PD).                                                                            | Conventional structural MRI can predict the progression of PD. This work also supports the use of a simple radiomics signature built from whole-brain white matter features as a useful tool for the assessment and monitoring of PD progression. |", "doc_items_refs": ["#/tables/4"], "page_nos": [1]}
{"doc_id": "2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251.doctags", "chunk_id": 29, "source_chunk_idxs": [33], "num_tokens": 352, "text": "3.2.1 Diagnostic MRI techniques for WMH\n|       25 | Haliasos N, et al. (81) | Personalizing Deep Brain Stimulation Therapy for Parkinson's Disease with Whole-Brain Mri Radiomics and Machine Learning.                                           | Retrospective cohort study         | A total of 120 PD patients underwent Deep brain stimulation (DBS) of the subthalamic nucleus. T | To develop a machine learning-driven predictive model for DBS patient selection using whole-brain white matter radiomics and common clinical variables.                                                                            | Machine learning models can be used in clinical decision support tools which can deliver true personalized therapy recommendations for PD patients.                                                                                               |\n|       26 | Tubi MA, et al. (81)    | White Matter Hyperintensities and Their Relationship to Cognition: Effects of Segmentation Algorithm.                                                               | Cross-sectional study              | 260 non-demonited participants                                                                  | To investigate how different WMH segmentation algorithms affect the relationship between WMH volume and cognitive function, and to analyze whether Alzheimer's disease (AD)-specific pathology masks the cognitive effects of WMH. | AD neuropathology may mask WMH effects on clinical diagnosis and cognition.                                                                                                                                                                       |\nshortcomings of DTI, which is based on the Gaussian diffusion model only. Compared with DTI, DKI is more sensitive to tissue microstructural changes, and the measurement results in the crossing area of nerve fibers are more reliable, which improves the ability to detect early lesions. However, owing to the limited image resolution, the display of WMH lesions is greatly limited. Moreover, DTI and DKI require considerable equipment, and the interpretation of parameters is complex, which makes these techniques less popular in clinical practice.", "doc_items_refs": ["#/tables/4", "#/texts/94"], "page_nos": [1]}
{"doc_id": "2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251.doctags", "chunk_id": 30, "source_chunk_idxs": [34], "num_tokens": 366, "text": "3.2.2 Grading criteria\nThe Fazekas grading system is the classical imaging standard for assessing the severity of WMH (9-11, 43). The most common classification of WMHs is location, as per viverticular white matter hyperintensities (PWMHs) around the lateral ventricles and deep white matter hyperintensities (DWMHs) in the deep part of the subcortical white matter are assigned grades 0-3. According to the morphology of the lesions, PWMHs are divided into no lesions (0 grade), cap or pencil-thin lesions (1 grade), smooth halo lesions (2 grade) and irregular extension into the deep white matter (3 grade). DWMH scores are assigned as follows: no lesion (0 grade), punctate lesions (1 grade), lesions beginning to fuse into plaque (2 grade) and large areas of lesions fused into patches (3 grade). The modified Fazekas classification was as follows: grade 1 (scattered punctate lesions with a speckle-like appearance), grade 2 (some lesions fused to a plaque), and grade 3 (large lesions fused to a patch). The characteristic MR imaging findings on white matter hyperintensity lesions refer to Figure 2 for details.\nThe Fazekas classification is easy to apply and is the most widely used method in clinical practice, but it is prone to subjective effects arising from equipment and manual interpretation. Therefore, we need to introduce a more objective, sensitive, accurate and efficient tool to reduce human error, improve the display rate of lesions, accurately localize and quantify lesions, reveal the etiology and pathological changes of the disease, and lay a solid foundation for clinical diagnosis and treatment.", "doc_items_refs": ["#/texts/96", "#/texts/97"], "page_nos": [1]}
{"doc_id": "2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251.doctags", "chunk_id": 31, "source_chunk_idxs": [35], "num_tokens": 336, "text": "3.3 Overview of radiomics\nRadiomics is a technique for high-throughput extraction of quantitative features from CT, MR, PET/SPECT and other imaging modalities, combining clinical, genetic or molecular data and using machine learning or deep learning to construct predictive models. The process mainly includes the following five stages (12-14): (1) Data acquisition and preprocessing: Appropriate imaging modalities, such as CT, MRI, and PET, are selected, and the standardization of the data is ensured; (2) Region of interest (ROI) segmentation: There are three methods: manual, semiautomatic and automatic segmentation; (3) Feature extraction: high-throughput extraction of many valuable quantitative features from the segmented region of interest (ROI), including first-order statistical features, texture features, shape features and high-order features; (4) Feature selection and dimension reduction: To avoid model overfitting, it is necessary to screen out the features that are stable and related to the prediction target from the extracted features; and (5) Model construction and validation: According to the research purpose and data type, appropriate machine learning or deep learning algorithms were selected to construct prediction models (including logistic regression,\nsupport vector machines, random forests, neural networks, etc.) based on the selected features. Finally, cross-validation and external validation methods were used to evaluate the reliability and generalizability of the model. Radiomics can identify the microscopic characteristics of lesions by deep mining of the collected data, which provides a theoretical basis for the diagnosis, pathological analysis and prognostic evaluation of diseases.", "doc_items_refs": ["#/texts/99", "#/texts/103"], "page_nos": [1]}
{"doc_id": "2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251.doctags", "chunk_id": 32, "source_chunk_idxs": [36], "num_tokens": 512, "text": "3.4.1 The application and progress of radiomics in basic pathological research on WMH\nA longitudinal study of 51 general elderly individuals (44) demonstrated that radiomics texture analysis based on conventional MRI can be used for the early detection of white matter hyperintensity (WHM), providing patients with early indications of disease and more time for treatment. Shao et al. (45) reported that a radiomics model based on the WMH penumbra (WMHP) was significantly better than a whole-brain white matter (WBWM) model at predicting the progression and speed of WMH. The progression rate of WMH was correlated with only the rad-score from the WMHP ROI. The reason for this difference may be related to the evolution mechanism of WMH, which affects mainly the foci and gradually spreads to the periphery. The WMHP region has greater microstructural heterogeneity and is more sensitive to early dynamic changes. Hou et al. (46) constructed a radiomic hybrid model based on CT-fractional flow reserve (CT-FFR) and the pericoronary fat attenuation index (pFAI) to predict the progression of WMH. The pFAI† and CT-FFR↓ (the ↑ indicates \"increase\" and the ↓ indicates \"decrease\") can predict white matter damage, and the common pathological mechanism of cardiac and cerebral microcirculation diseases is related to the inflammatory response. Shu et al. (47) developed a radiomics nomogram to screen out graylevel cooccurrence matrix (GLCM), form factor, and run-length matrix (RLM) features, which can noninvasively predict WMH progression in elderly patients aged ≥ 60 years. Shu et al. (48) constructed an integrated nomogram model of radiomics based on white matter, which could effectively distinguish scans of patients with Parkinson's disease (PD) from scans without evidence of dopaminergic deficit (SWEDD). These findings suggest that white matter microstructural heterogeneity may underlie the pathological heterogeneity of PD and is associated with cognitive impairment. In addition, damage to white matter axons and the myelin sheath in PD patients occurs earlier than typical pathological changes, such as the loss of substantia nigra dopaminergic neurons.", "doc_items_refs": ["#/texts/106"], "page_nos": [1]}
{"doc_id": "2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251.doctags", "chunk_id": 33, "source_chunk_idxs": [37, 38], "num_tokens": 212, "text": "3.4.1 The application and progress of radiomics in basic pathological research on WMH\nRamon et al. (49) analyzed the textural features of different brain tissues and multisequence MR images through two traditional machine learning methods, and the results revealed that lacunar stroke was related to blood-brain barrier damage and that the white matter microstructural changes caused by it could be sensitively captured through textural features.\n\n3.4.2 The clinical application of radiomics in the study of WMH-related diseases\nWMH can be observed in a variety of clinical diseases, including cerebrovascular diseases, demyelinating diseases,\nFigure caption: Fazekas grade 1\nFIGURE 2\nCharacteristic MR imaging findings on white matter hyperintensity lesions (Fazekas).\ninflammatory reactions, tumors or other space-occupying lesions, brain trauma, and metabolic diseases. Among them, WMHs are particularly closely related to cerebrovascular diseases and neurodegenerative diseases.", "doc_items_refs": ["#/texts/106", "#/texts/108", "#/pictures/3", "#/texts/112", "#/texts/113", "#/texts/114"], "page_nos": [1]}
{"doc_id": "2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251.doctags", "chunk_id": 34, "source_chunk_idxs": [39], "num_tokens": 431, "text": "3.4.2.1 Application of radiomics in cerebrovascular diseases\nCerebrovascular accidents (CVAs) are the second leading cause of death and neurological disease, with the highest burden of death and disability in the world (50, 51). According to the pathological mechanism, CVAs can be divided into ischemic stroke and hemorrhagic stroke, and the former is the most common, accounting for 62.4% of cases (52). Studies have shown that ischemic stroke is associated with WMH (7, 53). At present, many studies have used radiomics technology to predict the individualized functional outcomes of patients with acute ischemic stroke (AIS) after discharge (50, 54-56), but relatively few studies have focused on the imaging features of WMH. Xia et al. (57) integrated radiomics and clinical factors to construct a combined model to predict the prognosis of acute ischemic stroke (AIS). The results showed that the radiomics model of total white matter hyperintensity (TWMH) using the\nsupport vector machine (SVM) classifier performed best in predicting the prognosis of AIS patients. Bonkhoff et al. (58) explored the associations between WMH burden and the severity and prognosis of stroke. The results revealed that a high WMH burden in specific lesion locations (such as the language-related area in the left hemisphere and the attention-related area in the right hemisphere) significantly aggravated the severity of the acute phase of stroke and increased the risk of poor long-term prognosis. Bretzner et al. (59) constructed a model for predicting WMH burden on the basis of conventional T2-FLAIR images of AIS patients and explored its association with clinical phenotypes. The results indicated that radiomics analysis of conventional T2-FLAIR images could capture microstructure damage in WMH and was significantly associated with clinical phenotypes such as age and cardiovascular risk factors.", "doc_items_refs": ["#/texts/116", "#/texts/119"], "page_nos": [1]}
{"doc_id": "2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251.doctags", "chunk_id": 35, "source_chunk_idxs": [40], "num_tokens": 421, "text": "3.4.2.1 Application of radiomics in cerebrovascular diseases\nCerebral small vessel disease (CSVD) is a group of chronic and progressive diseases caused by a variety of factors that affect cerebral tiny arteries, capillaries, and venules. CSVD manifests as microstructure damage to white matter in the brain and has become the most common cause of vascular cognitive impairment, accounting for 45% of dementia cases (2, 38, 60). In clinical studies, subcortical vascular dementia is the most common type of dementia in patients\nwith CSVD, accounting for 36 -67% of all cases of vascular dementia (61). The signs of cerebral small vessel disease on conventional MRI include white matter hyperintensities, recent subcortical lacunar infarcts (clinically symptomatic), lacunes (clinically silent), cerebral microbleeds, prominent perivascular spaces, and cerebral atrophy (62). On MR images, WMH is a typical marker of CSVD, and its volume burden (WMH burden) can quantitatively reflect the cumulative degree of pathological damage, such as chronic cerebral ischemia, blood -brain barrier dysfunction and axonal demyelination (16, 60). Evidence (61) is available suggesting that the cognitive features of WMH include executive dysfunction, slowed information processing speed, and reduced language fluency. Moreover, the degree of cognitive impairment is significantly correlated with the location and quantity of white matter hyperintensity lesions in the brain. When patients progress to subcortical vascular dementia, the typical cognitive syndrome is executive dysfunction syndrome, which includes slowed information processing, memory deficits, behavioral and psychiatric symptoms, and language function that usually remains until the late stage of the disease. Owing to the diverse imaging manifestations and clinical symptoms of CSVD, radiomics research on WMH alone cannot be used as an independent diagnostic tool but can be used only as an auxiliary means. Therefore, further research in this field is needed.", "doc_items_refs": ["#/texts/120", "#/texts/124"], "page_nos": [1]}
{"doc_id": "2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251.doctags", "chunk_id": 36, "source_chunk_idxs": [41], "num_tokens": 436, "text": "3.4.2.2 The application of radiomics in neurodegenerative diseases such as Alzheimer ' s disease and Parkinson ' s disease\nAlzheimer ' s disease (AD), a complex neurodegenerative disease, is not only the leading cause of dementia worldwide but also is associated with increasing incidence, high mortality, high medical expenditures and long-term care needs. It is rapidly becoming one of the most expensive, deadly and burdensome diseases of the century (63). Currently, studies on Alzheimer ' s disease (AD) based on radiomics mainly focus on gray matter regions (64, 65). In recent years, an increasing number of studies have reported that the cognitive function impairment of AD patients is closely related to the volume of WMH (66, 67) and the distribution of brain regions (66, 67). However, Tang et al. (65) believed that the severity of white matter lesions is related to cognitive decline, but the volume of WMH is not an independent risk factor for the progression of MCI to AD. Fiford et al. (68) evaluated the performance of the Bayesian model selection (BaMoS) algorithm in the segmentation of WMH and analyzed its correlation with cognitive changes. The study revealed that the volume of WMH was significantly associated with subjective/significant memory concern (SMC), early mild cognitive impairment (EMCI), and late mild cognitive impairment (LMCI) in terms of cognitive decline but was not significantly associated with patients in the AD stage.\nBased on the above research, consensus is still lacking on whether a correlation exists between the volume of WMH and cognitive impairment in AD patients, and some of the results are even contradictory. However, most scholars agree that the volume of WMH is related to cognitive impairment in AD patients. Radiomics is expected to make certain contributions to the study of the relationship between WMH in the brains of AD patients and changes in cognitive function.\nParkinson ' s disease (PD) is a neurological disorder characterized by the progressive deterioration of motor and cognitive function with clinical manifestations of motor dysfunction and nonmotor", "doc_items_refs": ["#/texts/126", "#/texts/127", "#/texts/128"], "page_nos": [1]}
{"doc_id": "2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251.doctags", "chunk_id": 37, "source_chunk_idxs": [42], "num_tokens": 512, "text": "3.4.2.2 The application of radiomics in neurodegenerative diseases such as Alzheimer ' s disease and Parkinson ' s disease\nsymptoms, which seriously affects quality of life, and disease progression is associated with increased mortality (69, 70). In recent years, the application of radiomics in the research of Parkinson ' s disease (PD) has made some progress, but most studies have focused on specific brain regions (such as the substantia nigra) or relied on multimodal combined applications (such as neuromelanin imaging, DTI, DKI, etc.), with some difficulty in clinical popularization and promotion (71-75). Numerous studies have shown that white matter hyperintensity (WMH), an imaging marker of white matter damage, may exacerbate cognitive and motor dysfunction (3, 76-78). The total WMH burden of PD patients is significantly greater than that of healthy controls, and its severity is positively correlated with the degree of cognitive decline (normal cognition → mild cognitive impairment [PD-MCI] → dementia (PDD)). A high WMH burden can also increase the risk of PD and related dementia (PDD) (3, 70, 76-78). Other studies have confirmed that in PD patients, white matter undergoes extensive structural changes before gray matter atrophy and cognitive impairment, and white matter (WM) changes may be a sensitive indicator of early PD (79). In clinical work, understanding the changes in WM microstructure and assessing the severity of PD are very important for the treatment and prognosis of PD patients. Shu et al. (80) constructed a joint model based on wholebrain white matter radiomics and clinical features to predict the progression of Parkinson ' s disease (PD). Research has shown that the combined model can effectively predict the progression of PD, and a radiomic marker (rad-score) can also distinguish the severity of the disease. This method is low-cost, simple to perform, and can effectively predict the progression of PD, which is more suitable for clinical promotion. Shu et al. (48) developed a comprehensive homolog model based on biomarkers and nonmotor symptoms of whole-brain MRI white matter radiomics for the identification of early Parkinson ' s disease (PD). The results show that the model can effectively distinguish between typical PD patients and atypical PD patients (SWEDD: no evidence of", "doc_items_refs": ["#/texts/132"], "page_nos": [1]}
{"doc_id": "2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251.doctags", "chunk_id": 38, "source_chunk_idxs": [43, 44], "num_tokens": 481, "text": "3.4.2.2 The application of radiomics in neurodegenerative diseases such as Alzheimer ' s disease and Parkinson ' s disease\ndopaminergic deficiency on imaging) and provides a new method for the early diagnosis of PD. Haliasos et al. (81) developed a machine learning model based on radiomics of whole-brain white matter and clinical variables to predict the efficacy of deep brain stimulation (DBS) in patients with Parkinson ' s disease. The results show that the combined model of machine learning can accurately screen patients who will benefit from DBS, which can be used as a clinical decision support tool to provide truly personalized treatment recommendations for PD patients. In summary, compared with other PD prediction models that rely on specific brain regions or complex MRI sequences, the radiomics model based on whole-brain white matter is more comprehensive and more likely to capture global brain structural changes, which compensates for the limited value of conventional MRI in the early diagnosis of PD, reduces the technical threshold, and facilitates adoption in primary medical care. However, there are still challenges, such as relatively small sample sizes and a lack of external validation, and the pathological mechanism of white matter features is not fully understood, which needs to be further explored and determined in future research.\n\n3.5 Limitations\nThis article reviews the progress of radiomics research on the pathological mechanism of WMH and the early identification,\nclassification and prognostic evaluation of related diseases. It provides a theoretical basis and technical reference for the early identification of high-risk populations, the optimization of diagnosis and treatment decisions, and collaborative patient management. Importantly, our research methods have two main limitations. First, we relied solely on the PubMed, and Springer databases for the comprehensive review of the literature, which may have led to confounding biases. Second, the correlation between the volume of WMH and cognitive impairment in AD patients remains inconclusive. According to previous scholars, this is related to the differences in the definition of lesion boundaries caused by different segmentation methods of WMH (82). Therefore, merely exploring the correlation between WMH and cognitive impairment in AD patients through radiomics may have certain limitations. Combining deep learning to optimize the segmentation method of WMH is expected to solve this problem, but this aspect was not covered in this article.", "doc_items_refs": ["#/texts/132", "#/texts/134", "#/texts/137"], "page_nos": [1]}
{"doc_id": "2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251.doctags", "chunk_id": 39, "source_chunk_idxs": [45], "num_tokens": 294, "text": "4 Summary and outlook\nAs the core imaging marker of cerebral small vessel disease, WMH is closely related to nervous system damage, such as cognitive impairment, dementia and increased risk of stroke. Early identification of WMH is highly important for the diagnosis, treatment and prognosis of related diseases. In recent years, radiomics has emerged as an innovative tool that effectively compensates for the shortcomings of traditional imaging diagnostic methods, providing new approaches for the early identification and pathological analysis of WMH. However, cognitive dysfunction is a common manifestation of a series of neurodegenerative diseases, and its correlation with WMH in the brain is still not fully understood. In the workflow of radiomics, accurate segmentation and precise quantification of WMH and surrounding brain regions are vital for determining the severity of disease. This requires the combination of multiple different deep learning algorithms to explore the optimal solution for WMH, which is conducive to the establishment of more accurate artificial intelligence diagnostic and prognostic models. Second, cognitive impairment is a dynamic process that is constantly changing. In the future, through dynamic omics, subgroup analysis, combined with metabolomics, a multicenter prospective experiment can be established for longitudinal analysis to construct a predictive model with broad interpretability to enhance the clinical application value of WMH in multiple fields, such as patient stratification, clinical decision making, and rehabilitation assistance.", "doc_items_refs": ["#/texts/139"], "page_nos": [1]}
{"doc_id": "2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251.doctags", "chunk_id": 40, "source_chunk_idxs": [46], "num_tokens": 284, "text": "References\n- 1. Duering M, Biessels GJ, Brodmann A, Chen C, Cordonnier C, de Leeuw F-E, et al. Neuroimaging standards for research into small vessel disease - advances since 2013. Lancet Neurol. (2023) 22:602 -18. doi: 10.1016/s1474-4422(23)00131-x\n- 2. An L, Yuan W, Wang Y, Li S, Zong C, Gao Y, et al. The positional relationship between lacune and white matter Hyperintensity in patients with cerebral small vessel disease. Curr Neurovasc Res. (2023) 20:399 -409. doi: 10.2174/15672026662207231124707\n- 3. Carvalho de Abreu DC, Pieruccini-Faria F, Son S, Montero-Oasdo M, Camicioli R. Is white matter Hyperintensity burden associated with cognitive and motor impairment in patients with Parkinson ' s disease? A systematic review and Meta-analysis. Neurosci Biobehav Rev. (2024) 161:105677. doi: 10.1016/j.neubiorev.2024.105677", "doc_items_refs": ["#/texts/141", "#/texts/142", "#/texts/143"], "page_nos": []}
{"doc_id": "2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251.doctags", "chunk_id": 41, "source_chunk_idxs": [47, 48, 49, 50], "num_tokens": 272, "text": "Author contributions\nLD: Conceptualization, Data curation, Formal analysis, Investigation, Methodology, Writing -original draft. LW: Data curation, Formal analysis, Investigation, Writing -original draft. GS: Data curation, Formal analysis, Investigation, Writing -original draft. MZ: Data curation, Formal analysis, Investigation, Writing -original draft. DL: Conceptualization, Investigation, Methodology, Project administration, Supervision, Writing -review &amp; editing. WL: Conceptualization, Funding acquisition, Investigation, Methodology, Project administration, Supervision, Writing -review &amp; editing.\n\nFunding\nThe author(s) declare that financial support was received for the research and/or publication of this article. This work was supported by Special Fund for WL ' s National Grassroots Renowned Veteran Traditional Chinese Medicine Experts Heritage Studio.\n\nConflict of interest\nThe authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest.\n\nGenerative AI statement\nThe authors declare that no Gen AI was used in the creation of this manuscript.\nAny alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us.", "doc_items_refs": ["#/texts/148", "#/texts/150", "#/texts/152", "#/texts/154", "#/texts/155"], "page_nos": [1]}
{"doc_id": "2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251.doctags", "chunk_id": 42, "source_chunk_idxs": [51], "num_tokens": 329, "text": "Publisher ' s note\nAll claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher.\n- 4. Keller JA, Sigurdsson S, Klaassen K, Hirschler L, van Buchem MA, Launer LJ, et al. White matter Hyperintensity shape is associated with long-term dementia risk. Alzheimers Dement. (2023) 19:5632 -41. doi: 10.1002/alz.133345\n- 5. Hu H-Y, Ou Y-N, Shen X-N, Qu Y, Ma Y-H, Wang Z-T, et al. White matter Hyperintensities and risks of cognitive impairment and dementia: a systematic review and Meta-analysis of 36 prospective studies. Neurosci Biobehav Rev. (2021) 120:16 -27. doi: 10.1016/j.neubiorev.2020.11.007\n- 6. Arboix A, Massons J, García-Eroles L, Targa C, Comes E, Parra O, et al. Nineteen-year trends in risk factors, clinical characteristics and prognosis in lacunar infarcts. Neuroepidemiology. (2010) 35:231 -6. doi: 10.1159/000319460", "doc_items_refs": ["#/texts/157", "#/texts/158", "#/texts/159", "#/texts/160"], "page_nos": [1]}
{"doc_id": "2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251.doctags", "chunk_id": 43, "source_chunk_idxs": [52], "num_tokens": 476, "text": "Publisher ' s note\n- 7. Etherton MR, Wu O, Giese A-K, Rost NS. Normal-appearing white matter microstructural injury is associated with white matter hyperintensity burden in acute ischemic stroke. J Int Stroke . (2019) 16:184-91. doi: 10.1177/1747493019895707\n- 8. Park J-H, Kwon SU, Kwon HS, Heo SH. Prior intracerebral hemorrhage and white matter hyperintensity burden on recurrent stroke risk. Sci Rep . (2021) 11:3. doi: 10.1038/s41598-021-96809-3\n- 9. Pradeep A, Raghavan S, Przybelski SA, Prebesko GM, Schwarz CG, Lowe VJ, et al. Can white matter Hyperintensities based Fazekas visual assessment scales inform about Alzheimer ' s disease pathology in the population? Alzheimer ' s Res Ther . (2024) 16:157. doi: 10.1186/s13195-024-01525-5\n- 10. Cedres N, Ferreira D, Machado A, Shams S, Sachieu W, Aern M, et. Predicting Fazekas scores from automatic segmentations of white matter signal abnormalities. Aging . (2020) 12:894-901. doi: 10.18632/aging.102662\n- 11. Andere A, Jindal G, Molino J, Collins S, Merck D, Burton T, et. Volumetric white matter Hyperintensity ranges correspond to Fazekas scores on brain. Mri . J Stroke Cerebrovasis . (Dis022) 31:106333. doi: 10.1016/j.jstrokecoberevasdis.2022.106333\n- 12. Mayerhoefer ME, Materka A, Langs G, Häggström I, Szczypiński P, Gibbs P, et. Introduction to Radiomics. J Nucl Mead . (2020) 61:488-95. doi: 10.2967/jnumed.118.22893", "doc_items_refs": ["#/texts/163", "#/texts/164", "#/texts/165", "#/texts/166", "#/texts/167", "#/texts/168"], "page_nos": []}
{"doc_id": "2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251.doctags", "chunk_id": 44, "source_chunk_idxs": [53], "num_tokens": 485, "text": "Publisher ' s note\n- 13. Bamin L, Pejenaar RTH, Deist TM, Peerlings J, de Jong EEC, van Timmeren J, et al. Radiomics: the bridge between medical imaging and personalized nature. Med Rev Clin Oncol . (2017) 14:749-62. doi: 10.3810/ncrlinc.2017.141\n- 14. Attenberger UI, Langs G. How does radiomics actually work? -review. Röfi . (2020) 193-652. doi: 10.1055/a-1293-8953\n- 15. Page M, McKenzie JE, Bossuyt PM, Broutron I, Hoffmann TC, Mulrow CD, et al. The Prisma 2020 statement: An updated guideline for reporting systematic reviews. BMJ . (2021) 372:n71. doi: 10.1136/bmj.n71\n- 16. Meng F, Yang Y, Jin G. Research Progress on Mri for white matter Hyperintensity of presumed vascular origin and cognitive impairment. Front Neurosci . (2022) 13:13. doi: 10.3389/fneur.2220.865920\n- 17. Karvelas N, Elahi FM. White matter Hyperintensities: complex predictor of complex outcomes. J Am Heart Assoc . (2023) 12:0e35031. doi: 10.1161/jaha.123.030351\n- 18. Alber J, Alladi S, Bae HJ, Barton DA, Beckett LA, Bell JM, et. White matter Hyperintensities in vascular contributions to cognitive impairment and dementia (Vci): knowledge gaps and opportunities. Alzheimers Dempt . (2019) 5:107-17. doi: 10.1016/j.trci.2019.02.001\n- 19. Herman AL, de Havenon A, Falcone GJ, Prabakaran S, Sheth KN. Racial/ethnic variation in white matter Hyperintensity progression in the accordion study. Neurologist . (2022) 28:157-9. doi: 10.9701/nrl.00000000000000454", "doc_items_refs": ["#/texts/169", "#/texts/170", "#/texts/171", "#/texts/172", "#/texts/173", "#/texts/174", "#/texts/175"], "page_nos": []}
{"doc_id": "2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251.doctags", "chunk_id": 45, "source_chunk_idxs": [54], "num_tokens": 490, "text": "Publisher ' s note\n- 20. Sexas A, Turner AD, Bubu OM, Jean-Louis G, de Leon MJ, Osorio RS, et al. Obesity and race may explain differential burden of white matter Hyperintensity load. Clin Interv Aging . (2021) 16:1563-71. doi: 10.2147/cia.S316064\n- 21. Mok V, Srikanth V, Xiong Y, Phan TG, Moran C, Chu S, et al. Race-ethnicity and cerebral small vessel disease -comparison between Chinese and white populations. Int J Stroke . (2019) 4:36-42. doi: 10.1111/jjs.12702\n- 22. Lohner V, Pehlivan S, Romana G, Moschelski A, Schirmer MD, Stöcker T, et al. Relation between sex, menopause, and white matter Hyperintensities. Neurology . (2022) 99:e935-43. doi: 10.1212/wl.000000000000282\n- 23. Tamura A, Kuriyama N, Akazawa K, Ozaki E, Watanabe I, Ohshima Y, et al. A 10-year longitudinal study of deep white matter lesions on magnetic resonance imaging. Neuroradiology . (2021) 63:1599-609. doi: 10.1007/s00420-0234-026-026\n- 24. Zhang B, Wang Y, Wang B, Chu YH, Jiang Y, Cui M, et. Mri-based investigation of association between cerebrovascular structural alteration and white matter Hyperintensity induced by high blood pressure. J Magn Reson Imaging . (2021) 54:1516-26. doi: 10.1002/jmri.27815\n- 25. Gros S, Lorusbe R, Janderh P, Froszczs S, Baberg F, Schlett CL, et al. White matter Hyperintensity volume in pre-diabetes, diabetes and Normoglycemia. BM] Open Diabetes Res . Care (2021) 9:2050. doi: 10.1366/bmjrc-2020-005020", "doc_items_refs": ["#/texts/176", "#/texts/177", "#/texts/178", "#/texts/179", "#/texts/180", "#/texts/181"], "page_nos": []}
{"doc_id": "2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251.doctags", "chunk_id": 46, "source_chunk_idxs": [55], "num_tokens": 440, "text": "Publisher ' s note\n- 26. Park K-I, Jung K-H, Lee E-J, Lee W-J, Hwang SA, Kim S, et al. Classification of white matter lesions and characteristics of small vessel disease markers. Eur Radiol . (2022) 33:1143-51. doi: 10.1007/s00330-022-09070-1\n- 27. Busby N, Wilson S, Wilmskoeter J, Newman-Norlund R, Sayers S, Newman-Norlund S, et al. White matter Hyperintensity load mediates the relationship between age and cognition. Neurobiol Aging . (2023) 132:56-66. doi: 10.1016/j.neurobiolaging.2023.08.007\n- 28. Zhang W, Cheng Z, Fu F, Zhan Z. Prevalence and clinical characteristics of white matter hyperintensities in migraine: a meta-analysis. NeuroImage . (2023) 37:312. doi: 10.1016/j.nicl.2023.103312\n- 29. Qi X, Pei Y, Malone SK, Wu B. Social isolation, sleep disturbance, and cognitive functioning (Hrs): a longitudinal mediation study. J Gerontol A Bi Sci Med Sci . (2023) 78:1826-33. doi: 10.1093/gerona/glad004\n- 30. Sehrawat P, Gupta A, Garg A, Vishnu V, Rajan R, Bhatia R, et al. Adult-ondervolekoudystrophy presenting with atypical location of white matter lesions. Neurology . (2022) 99:1051-2. doi: 10.1212/wn.00000000020043714\nanalysis for the global burden of disease study 2019. Lancet Neurol. (2021) 20:795-820. doi: 10.1016/s1474-4422(21)00252-0", "doc_items_refs": ["#/texts/182", "#/texts/183", "#/texts/184", "#/texts/185", "#/texts/186", "#/texts/191"], "page_nos": [1]}
{"doc_id": "2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251.doctags", "chunk_id": 47, "source_chunk_idxs": [56], "num_tokens": 503, "text": "Publisher ' s note\n53. Giese AK, Schirmer MD, Dalca AV, Sridharan R, Donahue KL, Nardin M, et al. White matter Hyperintensity burden in acute stroke patients differs by ischemic stroke subtype. Neurology. (2020) 95:e79-88. Epub 2020/06/05. doi: 10.1212/wnl.0000000000009728\n54. Guo Y, Yang Y, Cao F, Li W, Wang M, Luo Y, et al. Novel survival features generated by clinical text information and Radiomics features may improve the prediction of ischemic stroke outcome. Diagnostics. (2022) 12:664. doi: 10.3390/diagnostics12071664\n55. Tang T-y, Jiao Y, Cui Y, Zhao D-1, Zhang Y, Wang Z, et al. Penumbra-based radiomics signature as prognostic biomarkers for thrombolysis of acute ischemic stroke patients: a multicenter cohort study. J Neurol. (2020) 267:1454-0971-7\n56. Guo K, Zhu B, Li R, Xi J, Wang Q, Chen K, et al. Machine learning-based nomogram: integrating Mri Radiomics and clinical indicators for prognostic assessment in acute ischemic stroke. Front Neurol. (2024) 15:9031. doi: 10.3389/fneur.2024.1379031\n57. Xia Y, Li L, Liu P, Zhai T, Shi Y, Machine learning prediction model for functional prognosis of acute ischemic stroke based on Mri Radiomics of white matter hyperintensities. BMC Med Imaging. (2025) 91:50. doi: 10.1186/jS128-0205-0326-013\n58. Bonhakk OFF, BNSzert, Mestrer M, Schmidner Narghead, RWGR, ASVAR et al. Association of Stroke Lesion Pattern and White Matter Hyperintensity Burden with stroke severity and outcome. Neurology. (2022) 99:e1364-79. doi: 10.1212/wnl.000000000000926", "doc_items_refs": ["#/texts/192", "#/texts/193", "#/texts/194", "#/texts/195", "#/texts/196", "#/texts/197"], "page_nos": [1]}
{"doc_id": "2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251.doctags", "chunk_id": 48, "source_chunk_idxs": [57], "num_tokens": 446, "text": "Publisher ' s note\n59. Bretzner M, Bonhakk OFF, Schirmer MD, Hong S, Dalca AV, Donahue KL, et al. Mri Radiomic signature of white matter Hyperintensities is associated with clinical types. Front Neurosci. (2021) 15:244. doi: 10.3389/fns.2021.691244\n60. Pasi M, Cordonnier C. Clinical relevance of cerebral small vessel diseases. Stroke. (2020) 51:47-53. doi: 10.1161/stakeha.119224.01963\n61. Graud-Olivares M, Arbox A. Mild cognitive impairment in stroke patients with ischemic cerebral small-vessel disease: a forenurner of vascular dementia? Expert Rev Neurother. (2009) 9:1201-17. Epub 2009/08/14. doi: 10.1586/ern.09.73\n62. Rudolitoso S, Rodriguez-Vázquez A, Arrua X, Arbox A. The potential impact of neuromaging and translational research on the clinical management of lacustran mice. Int J Mol Sci. (2022) 23:497. doi: 10.3390/ijms2303149\n63. Scheltsens P, De Trooper S, Bkiwivel K, Hstegel A, Chétatel G, Teussen CE, et al. Alzheimer's disease. Lancet. (2021) 39:1577-90. doi: 10.1016/s0140-6736(2032)205-4\n64. Leandrou S, Lammisenos D, Bougies H, Stogiannos N, Georgiadou E, Achilleos KG, et al. A cross-sectional study of explainable machine learning in Alzheimer's disease: diagnostic classification using MR radiomic feature. Front Aging Neurosci. (2023) 15:871. doi: 10.3389/fnagi.2023.1149871", "doc_items_refs": ["#/texts/198", "#/texts/199", "#/texts/200", "#/texts/201", "#/texts/202", "#/texts/203"], "page_nos": [1]}
{"doc_id": "2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251.doctags", "chunk_id": 49, "source_chunk_idxs": [58], "num_tokens": 503, "text": "Publisher ' s note\n65. Tang L, Wu X, Liu H, Wu F, Song R, Zhang W, et al. Individualized prediction of early Alzheimer's disease based on magnetic resonance imaging Radiomics, clinical, and laboratory examinations: a 60-month follow-up study. J Magn Reson Imaging. (2021) 54:1647-57. doi: 10.1002/jmri.27689\n66. Dadar M, Mahmoud S, Zhernovaia M, Camicioli R, Maranzano J, Duchesne S. White matter hyperintensity distribution differences in aging and neurodegenerative disease cohorts. NeuroImage. (2022) 36:3204. doi: 10.1016/j.nicl.2022.103204\n67. Garnier-Crassard A, Bougacha S, Wirth M, Dauticourt S, Sherif S, Landeau E, et al. White matter hyperintensity topography in Alzheimer's disease and links to cognition. Alzheimers Dement. (2021) 18:422-33. doi: 10.1002/alz.12410\n68. Fiford CM, Sudre CH, Pemberton H, Walsh P, Manning E, Malone IB, et al. Automated white matter hyperintensity segmentation using Bayesian model selection: assessment and correlations with cognitive change. Neuroinformatics. (2020) 18:429-49. doi: 10.1007/s12021-01909-4396\n69. Chen K, Jin Z, Fang J, Qi Li, Liu C, Wang R, et al. The impact of cerebral small vessel disease burden and its imaging markers on gait, postural control, and cognition in Parkinson's disease. Neurosci. (2022) 44:1223-33. doi: 10.1007/s10072-022-06563-1\n70. Hou M, Hou X, Qiu Y, Wang J, Zhang M, Mao X, et al. Characteristics of cognitive impairment and their relationship with total cerebral small vascular disease score in Parkinson's disease. Front Aging Neurosci. (2022) 14:506. doi: 10.3389/fnagi.2022.884506", "doc_items_refs": ["#/texts/204", "#/texts/205", "#/texts/206", "#/texts/210", "#/texts/211", "#/texts/212"], "page_nos": [1]}
{"doc_id": "2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251.doctags", "chunk_id": 50, "source_chunk_idxs": [59], "num_tokens": 478, "text": "Publisher ' s note\n71. Kang JJ, Chen Y, Xu GD, Bao SL, Wang J, Ge M, et al. Combining quantitative susceptibility mapping to Radiomics in diagnosing Parkinson's disease and assessing cognitive impairment. Eur Radiol. (2022) 32:6992-7003. doi: 10.1007/s00330-022-08790-8\n72. Ren Bashat D, Thaler A. Leaman Shapham H, Even-Sapir F, Heston-L, Heston M, Evans KC, et al. Neuromelanin T2*-Mri for the assessment of genetically at-risk, prodromal, and symptomatic Parkinson's disease. Npj. Parkinson Dis. (2022) 8:13:199. doi: 10.3853/s1415-0322-00545-9\n73. Li J, Liu X, Wang X, Liu H, Lin Z, Xiong N, Diffusion tensor imaging Radiomics, for diagnosis of Parkinson's disease. Brain Sci. (2022) 12:851. doi: 10.3389/bruincips120715068\n74. Nada A. Advances in Parkinson's disease diagnosis through diffusion kurtosis imaging and Radiomics. Acad Radiol. (2025) 32:930-1. doi: 10.1016/j.acra.2024.12.048\n75. Sun J, Cong C, Li X, Zhou W, Xia R, Liu H, et al. Identification of Parkinson's disease and multiple system atrypohy using multimodal PET/MRI radiomics. Eur Radiol. (2025) 32:662-10. doi: 10.1007/s00330-0123-0003-9\n76. Huang X, Wen MC, Ng SY, Honteon S, Chia NSY, Choi X, et al. Periventricular white matter hyperintensity burden and cognitive impairment in early Parkinson's disease. Eur J Noncell. (2020) 27:9159-66. doi: 10.1111/ene.14192", "doc_items_refs": ["#/texts/213", "#/texts/214", "#/texts/215", "#/texts/216", "#/texts/217", "#/texts/218"], "page_nos": [1]}
{"doc_id": "2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Progress_of_radiomics_research_on_white_matter_hyperintensity_lesions__W4413612251.doctags", "chunk_id": 51, "source_chunk_idxs": [60], "num_tokens": 492, "text": "Publisher ' s note\n77. Wu H, Hong H, Wang H, Cui J, Qin J, Zhou C, Tan S, et al. Regional white matter hyperintensity Volume in Parkinson's disease and associations with the motor signs. Anim Clin Transl Neuro. (2023) 10:1502-12. doi: 10.1002/acn3.51839\n78. Liu H, Deng B, Xie R, Yang X, Xie Z, Chen Y, et al. The influence of white matter Hyperintensity on cognitive impact in Parkinson's disease. Anim Clin Transl Neuro. (2021) 19:17-10. doi: 10.3422/cncn3.51429\n79. Rektor I, Svátková A, Vojtísk E, Zikmlov D, Ivaníkově D, Ivaník J, Kříaly A, et al. White matter alterations in Parkinson's disease with Normal condition precoarse grey matter. PLoS One. (2018) 13:e0187939. doi: 10.1371/journal.pone.0187939\n80. Shu ZY, Cui SJ, Wu X, Xu Y, Huang P, Pang PP, et al. Predicting the progression of Parkinson's disease using conventional MRI and machine learning: an application of radiomic biomarkers in whole-brain white matter. Magn Reson Med. (2020) 85:1611-24. doi: 10.1002/mmr.28522\n81. Haliasos N, Giakoumettis D, Gnanaratnasingham P, Low HL, Misbahuddin A, Zikos et al. Personalizing deep brain stimulation therapy for Parkinson's disease with whole-brain MRI radiomics and machine learning. Curese. (2024) 16. doi: 10.7759/cureus.c195\n82. Tubi MA, Feingold FW, Kothapalli D, Hare ET, King KS, Thompson PM, et al. White matter Hyperintensities and their relationship to cognition: effects of segmentation algorithm. NeuroImage. (2020) 206.327. doi: 10.1016/j.neuroimage.2019.116327", "doc_items_refs": ["#/texts/219", "#/texts/220", "#/texts/221", "#/texts/222", "#/texts/223", "#/texts/224"], "page_nos": [1]}
