{"doc_id": "2025__Protein-profile_alterations_induced_by_a_model_of_sporadic_Alzheimers_disease__W4413281328", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Protein-profile_alterations_induced_by_a_model_of_sporadic_Alzheimers_disease__W4413281328.doctags", "chunk_id": 0, "source_chunk_idxs": [0, 1], "num_tokens": 268, "text": "&lt;!-- image --&gt;\n0\n\nProtein-profile alterations induced by a model of sporadic Alzheimer's disease\nDimitar Bakalov 1 , Daniela Pechlivanova 2 , Elitsa Stoyanova 3 , Zafer Sabit 1 , Radka Tafradjiiska-Hadjiolova 1 , Lubomir Traikov 3\n- 1 Department of Physiology and Pathophysiology, Medical University of Sofia, Sofia, Bulgaria\n- 2 Institute of Neurobiology, Bulgarian Academy of Sciences, Sofia, Bulgaria\n- 3 Department of Medical Physics and Biophysics, Medical University of Sofia, Sofia, Bulgaria\nCorresponding author: Dimitar Bakalov (d.bakalov92@gmail.com)\nReceived 31 January 2025 ♦ Accepted 14 May 2025 ♦ Published 18 August 2025\nCitation: Bakalov D, Pechlivanova D, Stoyanova E, Sabit Z, Tafradjiiska-Hadjiolova R, Traikov L (2025) Protein-profile alterations induced by a model of sporadic Alzheimer's disease. Pharmacia 72: 1-8. https://doi.org/10.3897/pharmacia.72.e148412", "doc_items_refs": ["#/pictures/0", "#/texts/2", "#/texts/5", "#/texts/6", "#/texts/7", "#/texts/8", "#/texts/9", "#/texts/10", "#/texts/11"], "page_nos": [1], "uuid": "c74f342e-364d-4f4a-9403-b4ddc8d070fa"}
{"doc_id": "2025__Protein-profile_alterations_induced_by_a_model_of_sporadic_Alzheimers_disease__W4413281328", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Protein-profile_alterations_induced_by_a_model_of_sporadic_Alzheimers_disease__W4413281328.doctags", "chunk_id": 1, "source_chunk_idxs": [2, 3], "num_tokens": 291, "text": "Abstract\nAlzheimer's disease (AD), one of the most common forms of dementia, where loss of memory is the first and most characteristic symptom, is emerging as one of the biggest public health burdens in the aging Western society. Although the diagnosis is frequently made with cognitive tests and imaging, the use of biochemical markers in clinical practice is emerging for early diagnosis and prevention. This research aimed to study the effects of the experimental model of AD on the protein profile of the hippocampus and cerebrospinal fluid (CSF). We used an experimental model of sporadic AD induced by intracerebroventricular (ICV) injection of streptozotocin (STZ) in adult male Wistar rats. We performed SDS-PAGE and compared the results to known alterations in the protein profiles of AD patients. This model of AD caused the occurrence of impaired spatial memory and some unexpected protein changes demonstrated by unusual spikes in the densitogram, suggesting posttranslational changes of albumin and other transporter proteins in the hippocampus and CSF. These data suggest that such posttranslational changes may partly contribute to the pathogenesis of AD and can serve as a starting point for further evaluation of the STZ model's strengths and limitations in studying this disorder.\n\nKeywords\nAlzheimer's disease, Pharmacological model, Protein Profile, Electrophoresis", "doc_items_refs": ["#/texts/13", "#/texts/15"], "page_nos": [1], "uuid": "1e56fc45-e722-4c46-bc04-ce862144a7e1"}
{"doc_id": "2025__Protein-profile_alterations_induced_by_a_model_of_sporadic_Alzheimers_disease__W4413281328", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Protein-profile_alterations_induced_by_a_model_of_sporadic_Alzheimers_disease__W4413281328.doctags", "chunk_id": 2, "source_chunk_idxs": [4], "num_tokens": 353, "text": "Introduction\nAlzheimer's disease (AD) is the most common neurodegenerative disease worldwide. Globally, approximately 47 million people are affected. The World Health Organization (WHO) reports that the number of patients will most likely double by 2030, and by 2050 it might even triple (Prince 2015).\nOverall, Alzheimer's disease (AD) is a complex condition whose underlying mechanisms are not fully understood. One of the main contributing factors is believed\nto be central nervous system inflammation. Several studies have shown that neuroinflammatory processes are associated with accelerated cell death (Ranshoff 2016). Neurodegeneration leads to progressive dysfunction of the hippocampus and many other subcortical and cortical structures. This results in deterioration of episodic memory and overall cognitive function, ultimately culminating in dementia (Jahn 2013; Nelson et al. 2012; Small et al. 2011). Many different experimental models have been developed to study the causes and the possible new therapies for AD. Most models have\n&lt;!-- image --&gt;\nboth positive and negative features. Pathogenetic models involving knockout animals provide highly realistic results but require significant funding and specialized conditions for animal maintenance. Pharmacological models are more accessible but frequently diverge from the actual pathogenetic mechanisms. Some models occupy an intermediate position, offering pathomorphological relevance at a relatively affordable cost. Streptozotin and LPS-induced inflammation have been used in experimental in vitro and in vivo models of neuroinflammation and have been shown to promote β-amyloid deposition (Grieb 2016; Miklossy et al. 2008; Sheng et al. 2003).", "doc_items_refs": ["#/texts/17", "#/texts/18", "#/texts/19", "#/pictures/1", "#/texts/23"], "page_nos": [1], "uuid": "842d3f71-ae88-4ea0-a838-66ea18dbb111"}
{"doc_id": "2025__Protein-profile_alterations_induced_by_a_model_of_sporadic_Alzheimers_disease__W4413281328", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Protein-profile_alterations_induced_by_a_model_of_sporadic_Alzheimers_disease__W4413281328.doctags", "chunk_id": 3, "source_chunk_idxs": [5, 6], "num_tokens": 450, "text": "Introduction\nIn this article, we will review one of the most popular pharmacological models of hippocampal dysfunction-the intracerebroventricular (ICV) administration of streptozotocin (STZ) in rodents, which has been accepted as a successful model of the sporadic form of AD. STZ, a bacterial product developed in 1963 in an attempt to produce new anti-cancer therapy, is selectively toxic to insulin-producing pancreatic beta cells and induces diabetes mellitus in experimental animals (Schnedl et al. 1994). The targeted GLUT2 proteins are expressed not only in the pancreas but also in the kidneys, liver, and hy -pothalamus (Leturque et al. 2005). The intracerebroventricular injection of STZ induces characteristic changes of sporadic AD through a mechanism that remains incompletely understood (Grieb 2016; Miklossy et al. 2008; Sheng et al. 2003).\nIn our study, we evaluated the protein composition of the cerebrospinal fluid in animals treated with ICV STZ and examined its correspondence to the pathogenetic mechanisms underlying Alzheimer's disease.\n\nStereotaxic injection of STZ\nIn this study, we used sexually mature male Wistar rats (~300 g) and implanted guide cannulas into both lateral cerebral ventricles (Fig. 1). Cannula implantation was performed using a stereotaxic technique on pre-anesthetized animals (ketamine 80 mg/kg, i.m., and xylazine 4 mg/kg, i.p.) with implantation coordinates AP = -1 mm, ML = 1.5 mm, and DV = -3.8 mm (Fig. 2).\nAfter the recovery period, the rats were divided into two groups. Controls received intracerebroventricular (ICV) injections of PBS, while the Alzheimer group received 3 mg/kg STZ (Merck KGaA) via ICV injection. The two injections were administered 48 hours apart to induce an experimental model of sporadic AD.", "doc_items_refs": ["#/texts/24", "#/texts/25", "#/texts/28", "#/texts/29"], "page_nos": [1], "uuid": "041c2699-8c1a-42cb-abf1-35b138969722"}
{"doc_id": "2025__Protein-profile_alterations_induced_by_a_model_of_sporadic_Alzheimers_disease__W4413281328", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Protein-profile_alterations_induced_by_a_model_of_sporadic_Alzheimers_disease__W4413281328.doctags", "chunk_id": 4, "source_chunk_idxs": [7, 8, 9], "num_tokens": 412, "text": "SDS-PAGE\nFor the analysis of the protein content in the CSF, we used sodium dodecyl sulfate-polyacrylamide gel electrophoresis (SDS-PAGE), a variant of molecular gel electrophoresis (Fig. 3). The solution of sodium dodecyl sulfate (SDS) is used to equalize charge distribution in proteins, enabling their separation based solely on molecular mass (Laemmli 1970). Our research team follows the \"Cold Spring Harbor\" Protocol for SDS-PAGE gel preparation.\nIn our investigations, we used the OmniPAGE Mini Vertical system (CVS10DSYS-CU), manufactured by Clever Scientific Ltd., UK.\n\nSTUDY DESIGN\nFigure caption: Figure 1. Design of the experiment.\n&lt;!-- image --&gt;\n&lt;!-- image --&gt;\n&lt;!-- image --&gt;\nFigure caption: Figure 2. Stereotaxic coordinates of implantation according to the Paxinos atlas (Paxinos and Watson 2006): A. Axial, B. Coronal, C. Sagittal slides.\nAfter adding 12 μl of BPB-stained samples with buffer to each lane, we provide SDS.\n\nSDS-PAGE analysis\n- 1. Gels after staining and fixation are scanned at a resolution of 2080 dpi.\n- 2. Densitometric analysis was performed using OriginPro 2022b.\nThe captured gel images (Fig. 4) were analyzed by OriginPro 2022b software (OriginLab Corporation, Northampton, MA, USA) according to the user guide (Fig. 5). The molecular weight of each band was calculated according to the SigmaMarker™ wide range, mol wt 6,500-200,000 Da (Sigma-Aldrich) protein marker (Table 1).\nQuantitative protein gels analysis was conducted using Origin pro-2022b software to obtain each protein band's", "doc_items_refs": ["#/texts/32", "#/texts/33", "#/pictures/2", "#/pictures/3", "#/pictures/4", "#/pictures/5", "#/pictures/6", "#/texts/39", "#/texts/41", "#/texts/42", "#/texts/43", "#/texts/44"], "page_nos": [1], "uuid": "c172c604-7605-4e84-ad09-544d9ea9b007"}
{"doc_id": "2025__Protein-profile_alterations_induced_by_a_model_of_sporadic_Alzheimers_disease__W4413281328", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Protein-profile_alterations_induced_by_a_model_of_sporadic_Alzheimers_disease__W4413281328.doctags", "chunk_id": 5, "source_chunk_idxs": [10], "num_tokens": 479, "text": "SDS-PAGE analysis\nTable 1. SigmaMarker™ wide range, mol wt 6500-200000 Da (Sigma-Aldrich) protein marker.\n\n| Protein                                                     | Molecular Weight  (Da)   | High Range  (S8320)   | Wide Range  (S8445)   | Low Range  (M3913)   |\n|-------------------------------------------------------------|--------------------------|-----------------------|-----------------------|----------------------|\n| Myosin from porcine heart                                   | 200,000                  | X                     | X                     |                      |\n| β-Galactosidase from  E. coli                               | 116,000                  | X                     | X                     |                      |\n| Phosphorylase b from rabbit muscle                          | 97,000                   | X                     | X                     |                      |\n| Albumin, bovine serum                                       | 66,000                   | X                     | X                     |                      |\n| Glutamic Dehydrogenase from bovine liver                    | 55,000                   | X                     | X                     |                      |\n| Ovalbumin from chicken egg                                  | 45,000                   | X                     | X                     |                      |\n| Glyceraldehyde-3-phosphate Dehydrogenase from rabbit muscle | 36,000                   | X                     | X                     |                      |\n| Carbonic Anhydrase from bovine erythrocytes                 | 29,000                   |                       | X                     | X                    |\n| Trypsinogen from bovine pancreas                            | 24,000                   |                       | X                     | X                    |\n| Trypsin Inhibitor from soybean                              | 20,000                   |                       | X                     | X                    |\n| α-Lactalbumin from bovine milk                              | 14,200                   |                       | X                     | X                    |\n| Aprotinin from bovine lung                                  | 6,500                    |                       | X                     | X                    |", "doc_items_refs": ["#/texts/47", "#/tables/0"], "page_nos": [1], "uuid": "6493968d-c3af-462e-9b5c-b5d0c76ccb1c"}
{"doc_id": "2025__Protein-profile_alterations_induced_by_a_model_of_sporadic_Alzheimers_disease__W4413281328", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Protein-profile_alterations_induced_by_a_model_of_sporadic_Alzheimers_disease__W4413281328.doctags", "chunk_id": 6, "source_chunk_idxs": [11], "num_tokens": 421, "text": "SDS-PAGE analysis\nFigure caption: Figure 4. SDS PAGE of: 1. and 2. Cerebrospinal fluid isolated from rats with induced Alzheimer's; 3. Control CSF; 4. and 5. Brain supernatant isolated from the cortex in control rats; 6. and 7. Brain supernatant isolated from the cortex in rats with induced Alzheimer's; 8. and 9. Brain supernatant isolated from the hippocampus in control animals; 10. and 11. Brain supernatant isolated from the hippocampus in rats with induced Alzheimer's; 12. Standard.\nabsolute band density (INT/mm2). For the sake of eliminating the discrepancy caused by possible differences in protein loading amount, normalization of the absolute band density was performed by dividing the total band density of one sample by the density of each separated band from this sample, which was herein named as relative band content (%).\nIn the densitogram of cerebrospinal fluid (CSF) isolated from Cisterna magna in a control animal depicted in Fig. 6, two well-defined peaks are seen one between 76 and 66 kDa, which corresponds to albumin (Alb) and its isomeric forms. A characteristic maximum at 14 kDa is also observed, associated with the reduced chains of the protein Transthyretin (TTR). Under non-reducing conditions, TTR has a molecular mass of 55-60 kDa.\nThe densitogram of CSF isolated from the cisterna magna in a rat infused with ICV streptozotocin (STZ),\nshown in Figs 8, 9, displays four well-defined peaks: the first between 97 and 94 kDa; the second at 66 kDa, corresponding to the albumin (Alb) fraction; the third between 60 and 55 kDa, likely representing non-reduced forms of TTR; and the fourth at 14 kDa, corresponding to the reduced chains of TTR.", "doc_items_refs": ["#/pictures/7", "#/texts/49", "#/texts/50", "#/texts/51", "#/texts/52"], "page_nos": [1], "uuid": "a64e8b85-3d17-4d38-8807-6218ed63f6d2"}
{"doc_id": "2025__Protein-profile_alterations_induced_by_a_model_of_sporadic_Alzheimers_disease__W4413281328", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Protein-profile_alterations_induced_by_a_model_of_sporadic_Alzheimers_disease__W4413281328.doctags", "chunk_id": 7, "source_chunk_idxs": [12], "num_tokens": 120, "text": "SDS-PAGE analysis\nFig. 9 shows the densitograms of the brain supernatant isolated from the cortex of an ICV streptozotocin (STZ) infused rat (6 and 7) superimposed on the densitograms from the brains of control animals (4 and 5). By comparison, a well-defined peak at 55 kDa corresponding to the previously described non-reduced forms of TTR is seen. In one of the injected animals, characteristic peaks were also seen at 14 kDa corresponding to the reduced chains of TTR.", "doc_items_refs": ["#/texts/53"], "page_nos": [1], "uuid": "bdfe350c-fa25-4913-be0b-97e5bddc166e"}
{"doc_id": "2025__Protein-profile_alterations_induced_by_a_model_of_sporadic_Alzheimers_disease__W4413281328", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Protein-profile_alterations_induced_by_a_model_of_sporadic_Alzheimers_disease__W4413281328.doctags", "chunk_id": 8, "source_chunk_idxs": [13], "num_tokens": 447, "text": "Discussion\nIn our experiments, we analyzed the CSF proteome of rats with STZ-induced sporadic AD. STZ is implicated in promoting the significant production of neuroinflammatory mediators-a key feature of Alzheimer's disease (AD)which arise prior to the formation of amyloid plaques and neurofibrillary tangles, which are also characteristics of AD. There is a strong link between neuroinflammation and AD, and this relationship revolves around the activation of glial cells (Rai et al. 2014). Free radicals produced during neuroinflammation can also cause further damage to neurons by generating pro-inflammatory mediators and toxic substances. Some studies have indicated that insulin in neurons may protect against neuroinflammation and redox stress, while a deficiency in brain insulin may impair neuronal function (Csjadbók and Tamás 2016).\nIn our experimental animals, we observed a characteristic increase in the TTR fraction in the CSF proteome, suggesting its overexpression. This raises the question: what is the role of TTR in AD? Transthyretin (also known as prealbumin) is a 55 kDa tetrameric transport protein found in the plasma and CSF. It is produced in the liver, retina, and choroid plexus. The blood-brain barrier (BBB) prevents the passage of serum TTR into\nFigure caption: Figure 5. The working window of OriginPro 2022b for setting up the sensitivity of the densitometric profiles (staining intensity, signal amplitude).\nFigure caption: Figure 6. Densitogram of line 3. Control CSF.\nCSF, meaning that CSF TTR concentration is regulated by choroid plexus production and is independent of serum TTR levels. Even factors that reduce the serum levels significantly, e.g., fasting, do not affect the CSF concentrations. The concentration of TTR is also stable across the compartments of the CSF system, making it an easily accessible marker to measure using a spinal tap. (Ingenbleek and Young 1994).", "doc_items_refs": ["#/texts/55", "#/texts/56", "#/pictures/8", "#/pictures/9", "#/texts/61"], "page_nos": [1], "uuid": "6b8861e4-1f81-4839-b257-8287b98a3717"}
{"doc_id": "2025__Protein-profile_alterations_induced_by_a_model_of_sporadic_Alzheimers_disease__W4413281328", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Protein-profile_alterations_induced_by_a_model_of_sporadic_Alzheimers_disease__W4413281328.doctags", "chunk_id": 9, "source_chunk_idxs": [14], "num_tokens": 473, "text": "Discussion\nAlthough its main role is to transport thyroxine and retinol-retinol binding complex (RBP-complex) to different parts of the body and brain (Raz and Goodman 1969; Power et al. 2000), several studies have reported significantly higher TTR levels in the CSF of AD patients compared to healthy controls. This increased TTR expression is associated with high levels of oxidative stress in the brains of mice affected by AD compared to controls of the same age (Li et al. 2011). It is well established that the oxidative stress associated with the accumulation of β-amyloid is one of the reasons for the progressive neurotoxicity and neuronal cell loss in Alzheimer's disease (Butterfield\net al. 2001). The increase in the levels of TTR was implicated in mitigating the pathological effects of β-amyloid deposits and playing a preventive role in sporadic AD (Nilsson et al. 2018). This upregulation of TTR is regulated by receptors for hormones such as estradiol and glucocorticoids. Incubating cells with these hormones led to an increase in TTR protein and mRNA concentrations, while incubating the cells with receptor antagonists suppressed TTR initiation. (Martinho et al. 2012).\nThese changes in TTR concentrations may not only help mitigate beta-amyloid deposition and prevent Alzheimer's disease but also serve as potential biomarkers or therapeutic targets for oxidative stress-related disorders (Buxbaum et al. 2008; Silva et al. 2017). Additionally, inducing acute or chronic stress in rats resulted in the upregulation of TTR expression in the liver, choroid plexus, and cerebrospinal fluid (CSF). (Wakasugi et al. 1986) These findings suggest that TTR has a strong relationship with oxidative stress and may play a role in the development of neurodegeneration.\n&lt;!-- image --&gt;\nFigure caption: Figure 8. Densitogram of line 2-cerebrospinal fluid isolated from rats with induced Alzheimer's.\nFigure caption: Figure 10. TTR modification in Alzheimer's disease-simplified route.", "doc_items_refs": ["#/texts/62", "#/texts/63", "#/texts/64", "#/pictures/10", "#/pictures/11", "#/pictures/12"], "page_nos": [1], "uuid": "04207379-3b70-4109-a512-8d1a35366ac0"}
{"doc_id": "2025__Protein-profile_alterations_induced_by_a_model_of_sporadic_Alzheimers_disease__W4413281328", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Protein-profile_alterations_induced_by_a_model_of_sporadic_Alzheimers_disease__W4413281328.doctags", "chunk_id": 10, "source_chunk_idxs": [15], "num_tokens": 426, "text": "Discussion\nTTR has been shown to sequester beta-amyloid, inhibit plaque formation and oligomerization, and use its protease activity to degrade beta-amyloid into smaller, non-amyloidogenic fragments (Costa et al. 2008; Silva et al. 2017; Sharma et al. 2019). TTR forms a stable complex with amyloid-beta (Aβ), which is speculated to be a protective mechanism against the formation of amyloid plaques (Schwarzman et al. 1994). TTR also has a higher affinity for Aβ aggregates than fibrils, and the binding occurs in a chaperone-like manner in both intracellular fluid (ICF) and extracellular fluid (ECF).\nThe greater the binding affinity between TTR and Aβ, the greater the inhibitory potential, as stabilizers that increase TTR tetramer stability can enhance the inhibitory effect. TTR mutations that are more stable than the wild-\ntype TTR also tend to have more disaggregating potential (Fig. 10) (Cascella et al. 2013).\nIn the case of the streptozotocin model, it is possible to detect traces of these post-translational modifications by looking for the appearance of two additional peaks that have been scientifically proven to be high-molecular AGEs. These AGEs are caused by impaired glucose metabolism in the central nervous system.\nBased on current evidence, TTR may serve as a biomarker due to its role as a scavenger protein in neuroin -flam mation and sporadic Alzheimer's disease and for evaluating the efficacy of emerging therapies targeting amyloid sequestration. In addition to AD, numerous neuronal disorders are associated with oxidative stress.\nThese include psychological disorders (e.g., depression), movement disorders (e.g., Parkinson's disease), and various cognitive impairments. Therefore, the association between TTR levels and these disorders may be explored for potential use as a biomarker or therapeutic target.", "doc_items_refs": ["#/texts/69", "#/texts/70", "#/texts/71", "#/texts/72", "#/texts/73", "#/texts/76"], "page_nos": [1], "uuid": "2f9ab19c-9f7f-4cff-91ff-01ad44ff21a4"}
{"doc_id": "2025__Protein-profile_alterations_induced_by_a_model_of_sporadic_Alzheimers_disease__W4413281328", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Protein-profile_alterations_induced_by_a_model_of_sporadic_Alzheimers_disease__W4413281328.doctags", "chunk_id": 11, "source_chunk_idxs": [16, 17], "num_tokens": 90, "text": "Conflict of interest\nThe authors have declared that no competing interests exist.\n\nEthical statements\nThe authors declared that no clinical trials were used in the present study.\nThe authors declared that no experiments on humans or human tissues were performed for the present study.\nThe authors declared that no informed consent was obtained from the humans, donors or donors' representatives participating in the study.\nExperiments on animals: Bulgarian Agency of Food Safety Approval Number: 330/01.06.2022", "doc_items_refs": ["#/texts/79", "#/texts/81", "#/texts/82", "#/texts/83", "#/texts/84"], "page_nos": [1], "uuid": "6d4e7136-2646-46af-8c8f-0ae5f6153aa8"}
{"doc_id": "2025__Protein-profile_alterations_induced_by_a_model_of_sporadic_Alzheimers_disease__W4413281328", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Protein-profile_alterations_induced_by_a_model_of_sporadic_Alzheimers_disease__W4413281328.doctags", "chunk_id": 12, "source_chunk_idxs": [18], "num_tokens": 503, "text": "References\nButterfield DA, Drake J, Pocernich C, Castegna A (2001) Evidence of oxidative damage in Alzheimer's disease brain: central role for amyloid beta-peptide. Trends in Molecular Medicine 7: 548-554. https://doi. org/10.1016/S1471-4914(01)02173-6\nBuxbaum JN, Ye Z, Reixach N, Friske L, Levy C, Das P, Golde T, Masliah E, Roberts AR, Bartfai T (2008) Transthyretin protects Alzheimer's mice from the behavioral and biochemical effects of amyloid beta toxicity. Proceedings of the National Academy of Sciences of the USA 105: 2681-2686. https://doi.org/10.1073/ pnas.0712197105\nCascella R, Conti S, Mannini B, Li X, Buxbaum JN, Tirbili B, Chiti F, Cecchi C (2013) Transthyretin suppresses the toxicity of oligomers formed by misfolded proteins in vitro. Biochimica et Biophyacta Sigma 1832: 2302-2314. https://doi.org/10.1016/j.bbadis.2013.09.011\nCsjbakó ÉA, Tamás G (2016) Cerebral cortex: a target and source of insulin? Diabetologia 59: 1609-1615. https://doi.org/10.1007/s00125016-3996-2\nCosta R, Ferreira-Da-Silva F, Saraiva MJ, Cardoso I (2008) Transthyretin protects against A-beta peptide toxicity by proteolytic cleavage of the peptide: a mechanism sensitive to the kunitz protease inhibitor. PLOS ONE 3: e2899. https://doi.org/10.1371/journal. pone.0002899\nGrieb P (2016) Intracerebroventricular streptozotocin injections as a model of Alzheimer's disease: in search of a relevant mechanism. Molecular Neurobiology 53: 1741-1752. https://doi.org/10.1007/ s12035-015-9132-3", "doc_items_refs": ["#/texts/86", "#/texts/87", "#/texts/88", "#/texts/89", "#/texts/90", "#/texts/91"], "page_nos": [1], "uuid": "2b473cb3-3a2e-438c-aa67-ad87ea65a615"}
{"doc_id": "2025__Protein-profile_alterations_induced_by_a_model_of_sporadic_Alzheimers_disease__W4413281328", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Protein-profile_alterations_induced_by_a_model_of_sporadic_Alzheimers_disease__W4413281328.doctags", "chunk_id": 13, "source_chunk_idxs": [19, 20, 21, 22], "num_tokens": 373, "text": "References\nIngenbleek Y, Young V (1994) Transthyretin (prealbumin) in health and disease: nutritional implications. Annual Review of Nutrition 14: 495-533. https://doi.org/10.1146/annrev.nu.14.070194.002431\nJahn H (2013) Memory loss in Alzheimer's disease. Dialogues in Clinical Neuroscience 15(4): 445-454. https://doi.org/10.31887/ DCNS.2013.15.4/hjahn\nThe authors declared that no commercially available immortalised human and animal cell lines were used in the present study.\n\nFunding\nNo funding was reported.\n\nAuthor contributions\nD.P., L.T., D.B., Z.S. and R.T-H. conceived and planned the experiments. D.P., L.T., D.B., Z.S. and E.S. carried out the experiments. D.P., L.T., D.B., Z.S., R.T-H. and E.S. contributed to the interpretation of the results. D.B., and L.T. took the lead in writing the manuscript. All authors provided critical feedback and helped shape the research, analysis and manuscript.\n\nAuthor ORCIDs\nDimitar Bakalov https://orcid.org/0000-0002-1049-8813 Daniela Pechlivanova https://orcid.org/0000-0001-7727-8762 Lubomir Traikov https://orcid.org/0000-0002-7209-8444", "doc_items_refs": ["#/texts/92", "#/texts/93", "#/texts/94", "#/texts/96", "#/texts/98", "#/texts/100"], "page_nos": [1], "uuid": "938e678e-9877-4c3b-b6ce-44b99f122031"}
{"doc_id": "2025__Protein-profile_alterations_induced_by_a_model_of_sporadic_Alzheimers_disease__W4413281328", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Protein-profile_alterations_induced_by_a_model_of_sporadic_Alzheimers_disease__W4413281328.doctags", "chunk_id": 14, "source_chunk_idxs": [23], "num_tokens": 394, "text": "Data availability\nAll of the data that support the findings of this study are available in the main text.\nLeturque A, Brot-Laroche E, Le Gall M, Stolarczyk E, Tobin V (2005) The role of GLUT2 in dietary sugar handling. Journal of Physiology and Biochemistry 61(4): 529-537. https://doi.org/10.1007/BF03168378\nLi J, X Masliah, E Reixach, N Buxbaum, JN (2011) Neuronal production of transthyretin in human and murine Alzheimer's disease: is it protective? Journal of Neuroscience 31: 12483-12490. https://doi. org/10.1523/JNEUROSCI.2417-11.2011\nMartinho A, Goncalves I, Costa M, Santos CR (2012) Stress and glucocorticoids increase transthyretin expression in rat choroid plexus via mineralocorticoid and glucocorticoid receptors. Journal of Molecular Neuroscience 48: 1-13. https://doi.org/10.1007/s12031-012-9715-7\nMiklossy J, Steele JC, Yu S, McCall S, Sandberg G, McGeer EG, McGeer PL (2008) Enduring involvement of tau, beta-amyloid, alpha-synuclein, ubiquitin and TDP-43 pathology in the amyotrophic lateral sclerosis/koinrisonment-dementia complex of Guam (ALS/PDC). Acta Neuropathologica 116(6): 625-637. https://doi.org/10.1007/ s00401-008-0439-2", "doc_items_refs": ["#/texts/102", "#/texts/103", "#/texts/104", "#/texts/105", "#/texts/106"], "page_nos": [1], "uuid": "b44c156a-71d6-4a58-aa9e-d27c62a1efd4"}
{"doc_id": "2025__Protein-profile_alterations_induced_by_a_model_of_sporadic_Alzheimers_disease__W4413281328", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Protein-profile_alterations_induced_by_a_model_of_sporadic_Alzheimers_disease__W4413281328.doctags", "chunk_id": 15, "source_chunk_idxs": [24], "num_tokens": 512, "text": "Data availability\nNelson PT, Alafuzoff I, Bigo EH, Bouras C, Braak H, Cairns NJ, Castellani RJ, Crain BJ, Davies P, Del Tredici K, Duyckaerts C, Frosch MP, Haroutunian V, Hof PR, Hulette CM, Hyman BT, Iwatsubo T, Jellinger KA, Jicha GA, Kövari E, Kukull WA, Leverenz JB, Love S, Mackenzie IR, Mann DM, Masliah E, McKee AC, Montine TJ, Morris JC, Schneider JA, Sonnen JA, Thal DR, Trojanowski J, Troncoso JC, Wisniewski T, Woltjer RL, Beach TG (2012) Correlation of Alzheimer disease neuropathologic changes with cognitive status: a review of the literature. Journal of Neuropathology &amp; Experimental Neurology 71(5): 362-381. https://doi.org/10.1097/NEN.0b013e31825018f7\nNilsson L, Pamren A, Islam T, Brannstrom K, Golchin SA, Pettersson N, Iakovleva I, Sandblad L, Gharibyan AL, Olofsson A (2018) Transthyretin interferes with abeta amyloid formation by redirecting oligomeric nuclei into non-amyloid aggregates. Journal of Molecular Biology 430: 2722-2733. https://doi.org/10.1016/j.jmb.2018.06.005\nPaxinos G, Watson C (2006) The rat brain in stereotaxic coordinates: hard cover edition. Elsevier, Amsterdam. Prince MJ (2015) World Alzheimer Report 2015: The global impact of dementia: An analysis of prevalence, incidence, cost and trends. Alzheimer's Disease International, United Kingdom. http://www.alz.co.uk/research/world-report-2015\nPower DM, Elias NP, Richardson SJ, Mendes J, Soares CM, Santos CR (2000) Evolution of the thyroid hormone-binding protein, transthyretin. General and Comparative Endocrinology 119: 241-255. https://doi.org/10.1006/gcen.2000.7520", "doc_items_refs": ["#/texts/107", "#/texts/108", "#/texts/111", "#/texts/112"], "page_nos": [1], "uuid": "16978361-106f-415a-871f-a3df144e81c4"}
{"doc_id": "2025__Protein-profile_alterations_induced_by_a_model_of_sporadic_Alzheimers_disease__W4413281328", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Protein-profile_alterations_induced_by_a_model_of_sporadic_Alzheimers_disease__W4413281328.doctags", "chunk_id": 16, "source_chunk_idxs": [25], "num_tokens": 475, "text": "Data availability\nRai S, Kamat PK, Nath C, Shukla R (2014) Glial activation and post-synaptic neurotoxicity: the key events in Streptozotocin (ICV) induced memory impairment in rats. Pharmacology Biochemistry and Behavior 117: 104-117. https://doi.org/10.1016/j.pbb.2013.11.035\nRansohoff RM (2016) How neuroinflammation contributes to neurodegeneration. Science 353(6301): 777-783. https://doi.org/10.1126/ science.aag2590\nRaz A, Goodman DS (1969) The interaction of thyroxine with human plasma prealbumin and with the prealbumin-retinol-binding protein complex. Journal of Biological Chemistry 244: 3230-3237. https:// doi.org/10.1016/S0021-9258(18)93118-2\nSharma M, Khan S, Rahman S, Singh LR (2019) The extracellular protein, transtyretin is an oxidative stress biomarker. Frontiers in Physiology 10: 5. https://doi.org/10.3389/fpsyn.2019.00005\nSchnedl WJ, Ferber S, Johnson JH, Newgard CB (1994) STZ transport and cytotoxicity. Specific enhancement in GLUT2-expressing cells. Diabetes 43(11): 1323-1333. https://doi.org/10.2337/diab.43.11.1326\nSchwarzman AL, Gregori L, Vitek MP, Lyubski S, Strittman WJ, Enghilde JJ, Bhasin R, Silverman J, Weisgraber KH, Coyle PK (1994) Transtyretin sequesters amyloid β protein and prevents amyloid formation. Proceedings of the National Academy of Sciences of the USA 91: 8368-8372. https://doi.org/10.1073/pnas.91.18.8368", "doc_items_refs": ["#/texts/113", "#/texts/114", "#/texts/115", "#/texts/116", "#/texts/117", "#/texts/118"], "page_nos": [1], "uuid": "477916da-796e-4891-b1c4-2b58b4e50018"}
{"doc_id": "2025__Protein-profile_alterations_induced_by_a_model_of_sporadic_Alzheimers_disease__W4413281328", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Protein-profile_alterations_induced_by_a_model_of_sporadic_Alzheimers_disease__W4413281328.doctags", "chunk_id": 17, "source_chunk_idxs": [26], "num_tokens": 332, "text": "Data availability\nSheng JG, Bora SH, Xu G, Borch DR, Price DL, Koliatsos VE (2003) Lipopolysaccharide-induced-neuroinflammation increases intracellular accumulation of amyloid precursor protein and amyloid beta peptide in APPs strengvenic mice. Neurobiology of Disease 14(1): 133-145. https://doi.org/10.1016/S0969-9961(03)00069-X\nSilva AR, Pinho MS, Macedo L, Moulin C, Caldeira S, Firmino H (2017) It is not only memory: effects of sensecam on improving well-being in patients with mild Alzheimer disease. International Psychogeriatrics 29(5): 741-754. https://doi.org/10.1017/S104161021600243X\nSmall SA, Schobel SA, Buxton RB, Witter MP, Barnes CA (2011) A pathophysiological framework of hippocampal dysfunction in ageing and disease. Nature Reviews Neuroscience 12(10): 585-601. https:// doi.org/10.1038/nrn3085\nWakasugi S, Maeda S, Shimada K (1986) Structure and expression of the mouse prealbumin gene. Journal of Biochemistry 100: 49-58. https:// doi.org/10.1093/oxfordjournals.jbchem.a121705", "doc_items_refs": ["#/texts/119", "#/texts/120", "#/texts/121", "#/texts/122"], "page_nos": [1], "uuid": "01e7b19a-3077-44e9-9c77-7291ab53b8a2"}
