{"doc_id": "2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975.doctags", "chunk_id": 0, "source_chunk_idxs": [0], "num_tokens": 490, "text": "Muscle-brain crosstalk as a driver of brain health in aging\nB. L. McNeish · I. Miljkovic · T. Liu-Ambrose · F. Ambrosio · K. Esser · M. Fahnestock · C. Rosano\nReceived: 15 May 2025 / Accepted: 4 August 2025 © The Author(s) 2025\nAbstract Cognitive impairment and dementia in older adults represent significant global health challenges. Although the bidirectional relationship between physical function and brain health is well established, the mechanistic drivers of this link remain poorly understood. Muscle function and quality are central to physical function, and muscle's secretome is increasingly recognized for its systemic\nSupplementary Information The online version contains supplementary material available at https://doi. org/10.1007/s11357-025-01833-0.\nB. L. McNeish ( &amp; ) Department of Physical Medicine and Rehabilitation, University of Michigan, Ann Arbor, MI, USA e-mail: Brendan.McNeish@gmail.com; mcneishb@med. umich.edu\nB. L. McNeish Department of Physical Medicine and Rehabilitation, University of Pittsburgh, Pittsburgh, PA, USA\nI. Miljkovic · C. Rosano Department of Epidemiology, School of Public Health, University of Pittsburgh, Pittsburgh, PA, USA\ne-mail: ivm1@pitt.edu\nC. Rosano e-mail: RosanoC@edc.pitt.edu\nT. Liu-Ambrose Department of Physical Therapy, University of British Columbia, Vancouver, BC, Canada e-mail: teresa.ambrose@ubc.ca\nhealth effects-supporting the potential for muscleto-brain crosstalk. This concept was explored at the 3rd International Research Symposium on Brain Health, jointly hosted by Vancouver Coastal Health and the University of British Columbia. We present the findings of this symposium, which reviewed the current state of the literature on muscle-to-brain crosstalk from multiple perspectives, spanning population studies to preclinical models. A key focus was the muscle secretome, particularly myokines and extracellular vesicles, as potential messengers\nF. Ambrosio Department of Physical Medicine and Rehabilitation, Harvard Medical School, Boston, MA, USA e-mail: FAMBROSIO@MGH.HARVARD.EDU", "doc_items_refs": ["#/texts/4", "#/texts/5", "#/texts/6", "#/texts/7", "#/texts/8", "#/texts/9", "#/texts/10", "#/texts/11", "#/texts/12", "#/texts/13", "#/texts/14", "#/texts/15"], "page_nos": [1], "uuid": "a04b56d9-9d1b-416e-bae0-25153506aa4e"}
{"doc_id": "2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975.doctags", "chunk_id": 1, "source_chunk_idxs": [1], "num_tokens": 182, "text": "Muscle-brain crosstalk as a driver of brain health in aging\nK. Esser Department of Physiology and Aging, University of Florida, Gainesville, FL, USA e-mail: kaesser@ufl.edu\nM. Fahnestock Department of Psychiatry and Behavioural Neurosciences, McMaster University, Hamilton, ON, Canada e-mail: fahnest@mcmaster.ca\n&lt;!-- image --&gt;\ninfluencing brain health. The symposium also identified critical takeaways and proposed next steps to further elucidate the underlying mechanisms of muscle-to-brain crosstalk and explore how these pathways might be harnessed through exercise or pharmacologic interventions to promote brain health in older adults.\nKeywords Myosteatosis · Brain health · Alzheimer's disease · Myokines · Extracellular vesicles · Muscle-brain crosstalk", "doc_items_refs": ["#/texts/16", "#/texts/17", "#/pictures/0", "#/texts/18", "#/texts/19"], "page_nos": [1], "uuid": "5a28c127-c4a1-4fa6-a7d3-65dfb87fafbc"}
{"doc_id": "2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975.doctags", "chunk_id": 2, "source_chunk_idxs": [2], "num_tokens": 487, "text": "Introduction\nLate-life cognitive impairment and dementia impose soaring costs on the individual, the community, AND the public health system [1]. The complexity of dementia etiology taxes our traditional models of inquiry, limiting our ability to develop interventions that effectively prevent it or slow down its disease course. A novel and integrative paradigm is needed to identify modifiable targets for interventions for life cognitive impairment and dementia.\nThere is a well-established bidirectional relationship between physical activity, physical function, and brain health in older adults. Skeletal muscle, a key driver of physical activity and function, is now emerging as a novel source of neuroprotection in aging; it is also a promising target for preventing and treating cognitive impairment and dementia. Observational studies show muscle function and quality are associated with cognitive function and neuroimaging indices of brain integrity [2, 3]. Specifically, it is now recognized that skeletal muscles produce and secrete circulating factors including nucleic acids, fatty acids, peptides, and proteins known as myokines. Myokines have been the subject of major inquiry and have been shown to possess neuroprotective effects [4, 5]. Myokines include cytokines or peptides synthesized by myocytes in muscle tissue [6]. Myokines mediate communication between muscle and other organs, including the brain (i.e., muscle-brain cross-talk), as well as within the muscle. For example, accumulating evidence suggests that the myokine cathepsin B passes through the blood-brain barrier to enhance local brain-derived neurotrophic factor production, enhancing neurogenesis, memory, and learning [7, 8]. It has been suggested that myokines may, in part,\nunderlie the benefits of physical activity on the central nervous system. More recently, circulating extracellular vesicles (EVs), which comprise a plasma membrane that encapsulates molecular cargoes, are emerging as carriers of signaling molecules between muscle and brain. Emerging research on the relationship between sleep and cognitive health suggests that the circadian clock within skeletal muscle plays a significant role in maintaining overall circadian integrity and regulating sleep-both of which have important implications for brain health. Figure 1 presents a conceptual framework for muscle-brain crosstalk, integrating key mechanisms, signaling molecules, and bidirectional communication across systems.", "doc_items_refs": ["#/texts/21", "#/texts/22", "#/texts/24"], "page_nos": [1], "uuid": "44fdddf0-44f4-4aaa-9bd0-d1468bbc35ac"}
{"doc_id": "2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975.doctags", "chunk_id": 3, "source_chunk_idxs": [3], "num_tokens": 386, "text": "Introduction\nTo date, the majority of studies on muscle-brain crosstalk have been performed among individuals at the extremes of muscle health spectrum, such as healthy individuals who are able to engage in highintensity or volume of exercise, or individuals with neuromuscular disease (i.e., Duchenne's Muscular Dystrophy) [9]. Despite impaired mobility and cognitive impairment being recognized as \"geriatric giants,\" there is a dearth of studies focused on community-dwelling older adults.\nTo harness the potential of muscle-brain crosstalk in maintaining or promoting brain health in aging, the Centre for Aging SMART at Vancouver Coastal Health and the University of British Columbia in Vancouver held the 3rd International Research Symposium on Brain Health: The Role of Muscle-Brain Crosstalk to Promote Healthy Aging . The symposium, funded by the Canadian Institutes of Health Research, offered a critical review of inter-related disciplines in aging, with a focus on cognitive and muscle health, physical activity/exercise, neuroscience, and functional genomics. Topics encompassed current knowledge of the molecular links between muscle and brain aging and a review of mechanisms that are critical for muscle health and interventions that stimulate muscle contractility. The findings and recommendations of this symposium are presented here. Our objective is to summarize the muscle-brain crosstalk evidence relevant to brain aging and to provide recommendations for future research directions.\nIn the \"Myosteatosis: a marker of muscle quality, aging and disease\" section, we review current knowledge on muscle's physiological changes with age and the neuroprotective effects of physical activity in older adults. In the \"Epidemiological\nFigure caption: Fig. 1 Conceptual framework of muscle-brain crosstalk. Aging skeletal muscle secretes muscle derived factorsmyokines, extracellular vesicles, and clock gene productsthat influence neural inflammation, neuroelasticity, circadian", "doc_items_refs": ["#/texts/25", "#/texts/26", "#/texts/27", "#/pictures/1"], "page_nos": [1], "uuid": "4c05d007-aa28-45d7-91a4-99c822911424"}
{"doc_id": "2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975.doctags", "chunk_id": 4, "source_chunk_idxs": [4], "num_tokens": 471, "text": "Introduction\nassociation of muscular contractile activity and brain health\" section, we review evidence that both aerobic and resistance exercise benefit brain health, but highlight a key gap in understanding the biological mechanisms-particularly how different exercise types alter the muscle secretome. In the \"Mechanisms of muscle-brain crosstalk: circadian rhythms, muscle clocks, myokines and extracellular vesicles\" section, we examine how circulating mediators-such as myokines and EVs-influence brain health from systems-level (e.g., circadian rhythms) to molecular-level neurotrophic effects. We review recent work on EVs in aging models, pointing to novel messaging between muscle and brain and the therapeutic potential of EV engineering. Lastly, in the \"Discussion/conclusions\" section, we synthesize insights from the first three sections, highlight crosscutting themes, and outline future research directions to advance understanding of muscle-brain crosstalk and its therapeutic application. Supplementary Table 1 lists the presenters for the four sections from the symposium Muscle-Brain Crosstalk as a Driver of Brain Health in Aging .\nCritical knowledge gaps the symposium aimed to address: How do changes in muscle quality-specifically myostatosis-influence brain health?\nWhich characteristics of muscle might underlie the known cognitive benefits of physical activity?\nGiven muscle's emerging role as a secretory organ, what is the contribution of the muscle secretome to brain health in older age?\nThrough which putative molecular and systems-level mechanisms might muscle-derived circulating factors influence brain health?\nWhat are the translational challenges that need to be solved to progress the pipeline of muscle interventions and muscle secretome therapeutics to promote brain health in older adults?\nMyostatosis: a marker of muscle quality, aging, and disease\nSkeletal muscle mass, function, and quality decline with increasing age. After the age of 50, muscle mass declines in both males and in females, with reduced muscle fiber number and size, mainly due\nto a progressive loss of motoneurons [10]. The agerelated decline in muscle quality [11], characterized by increase in myosteatosis [12], occurs earlier than the reduction in muscle mass. In addition the muscle's architecture is modified, type II fibers decline, and muscle vasculature is reduced with aging [13].", "doc_items_refs": ["#/texts/30", "#/texts/31", "#/texts/32", "#/texts/33", "#/texts/34", "#/texts/35", "#/texts/36", "#/texts/37", "#/texts/39"], "page_nos": [1], "uuid": "02db6640-8bd3-45cd-8d2f-cf20d3597b58"}
{"doc_id": "2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975.doctags", "chunk_id": 5, "source_chunk_idxs": [5], "num_tokens": 477, "text": "Introduction\nFat accumulation in the muscle (myosteatosis) is an important measure of muscle quality and is especially relevant in aging due to its impact on metabolism [14] and function [11]. Myosteatosis can occur in different regions with respect to the muscle fascicle, including inter-muscular (i.e., fat depots between fascicles of muscle fibers) and/or intra-muscular (i.e., fat depots within the fascicles of muscle fibers). Intermuscular adipose tissue (IMAT) is quantified by measuring the area of IMAT within a specific muscle or body region using imaging modalities such as CT, and MRI [15]. These techniques rely on differences in tissue density to distinguish fat from muscle in defined anatomical regions. Intramuscular fat depots can refer to both myocellular fat (fat within myocytes) and extramyocellular fat (fat located outside of myocytes but within muscle fascicles, between muscle fibers). Differentiating these types of intramuscular adiposity is technically challenging and requires magnetic resonance spectroscopy or muscle biopsy [16]. Imaging methods used to measure IMAT and intramuscular fat remain without strong consensus, and the similarities and differences in the development of these skeletal muscle fat depots are not well understood. Furthermore, the physiological significance of these similarities and differences remains unclear. In the literature, the term myosteatosis has been used to encompass both IMAT and intramuscular fat, and therefore, this terminology was adopted by the symposium [16-18].\nMyosteatosis has local effects and can impact muscle function, including muscle contractility performance, as it relates to specific force and torque, but less known is its strong systemic effect on metabolism and link to metabolic dysfunction [19] such as insulin resistance, type 2 diabetes, hypertension, obesity [20], and systemic inflammation [16]. These are well-established risk factors for cognitive impairment and dementia in older adults [21]. Notably, myosteatosis is a strong predictor of metabolic disorders, independent of total body fat [22]. Myosteatosis also varies within populations of older adults including by sex and ethnicity. Specifically, myosteatosis tends to be higher in women than in men 1 and may", "doc_items_refs": ["#/texts/40", "#/texts/41"], "page_nos": [1], "uuid": "fedcc2d1-f8a3-4644-840f-36dc3610bc6d"}
{"doc_id": "2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975.doctags", "chunk_id": 6, "source_chunk_idxs": [6], "num_tokens": 302, "text": "Introduction\nalso be elevated in individuals of African and South Asian ancestry [23]. As a result, it may represent a critically important risk factor for metabolic dysfunction in these populations, particularly where measures of central adiposity do not fully account for the observed metabolic impairments [16].\nUnderstanding the mechanisms linking myosteatosis to metabolic disorders may be critical to uncovering the impact of muscle health on brain health. It is hypothesized that the close proximity of adipose tissue to and within muscle disrupts the muscle microenvironment-either through increased local or systemic proinflammatory cytokine release or through impaired myokine secretion, which is reviewed in the next section. The inflammatory secretome associated with myosteatosis may contribute to subsequent metabolic and muscular dysfunction, particularly insulin resistance, muscle atrophy, and diminished contractility [24]. Additionally, elevated levels of myosteatosis may impair nutritive blood flow to muscle [13]. Early in this pathological process, modifications to muscle proteins and loss of coordinated regulation between contractile, mitochondrial, and sarcoplasmic reticulum proteins occur, followed by motoneuron loss [10]. This neuronal loss is inadequately compensated by reinnervation from surviving motoneurons. This cascade initiates a vicious cycle that can lead to cognitive impairment-where declining physical performance reduces physical activity, leading to less social stimulation and cognitive engagement [25].", "doc_items_refs": ["#/texts/43", "#/texts/44"], "page_nos": [1], "uuid": "f0bc28cc-de15-4576-8b7a-edd58cc268a8"}
{"doc_id": "2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975.doctags", "chunk_id": 7, "source_chunk_idxs": [7], "num_tokens": 411, "text": "Interventions for myosteatosis\nWhile numerous intervention studies have focused on increasing muscle mass and function, there is a notable lack of studies specifically targeting myosteatosis. Existing studies are limited by small sample sizes and are primarily conducted in older adults. Emerging evidence suggests that exercise is a promising strategy for reducing myosteatosis in this population. A systematic review and meta-analysis found that both aerobic exercise and combined aerobic and strength training can reduce myosteatosis, although significant heterogeneity exists in the methods used to assess it [26]. Additionally, some studies report that diet alone, or in combination with exercise, may influence myosteatosis [26]. However, additional randomized controlled trials (RCTs) are needed to evaluate the effects of various exercise modalities-such as aerobic training, high-intensity\ninterval training (HIIT), and resistance training-as well as their combinations. These trials should also assess how differences in exercise intensity, frequency, and duration, along with dietary factors, impact myostatosis and the associated muscle secretome.\nInformed by mechanistic insights into myokine signaling, pharmaceutical interventions are also being explored. For example, drugs targeting myostatin have shown preliminary efficacy in improving muscle mass and function in phase II clinical trials, though phase III data are not yet available [ 27 ]. In mice, even short-term (4-week) treatment with an anti-myostatin antibody led to increased whole-body muscle mass, enhanced grip strength, improved insulin sensitivity, and reduced ectopic lipid accumulation [ 28 ]. While anabolic hormones are being tested in populations with myopathies, there is hesitancy to apply these treatments to older adults due to potential secondary health risks [ 29 , 30 ]. In summary, RCTs that evaluate the individual and combined efficacy of exercise, pharmaceutical, diet, and lifestyle interventions on myostatosis are urgently needed in older adults.\nEpidemiological association of muscular contractile activity and brain health", "doc_items_refs": ["#/texts/46", "#/texts/48", "#/texts/49", "#/texts/50"], "page_nos": [1], "uuid": "a6625dce-167e-4425-8a96-e0d6fb5921f8"}
{"doc_id": "2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975.doctags", "chunk_id": 8, "source_chunk_idxs": [8], "num_tokens": 243, "text": "Interventions for myosteatosis\nEpidemiological studies demonstrate a consistent relationship between higher physical activity levels and reduced dementia risk [ 13 , 16 , 21 , 23 , 25 , 31 ]. The lack of physical activity presents the largest risk of developing late life cognitive decline and dementia among other established risk factors [ 32 ]. However, many epidemiology studies do not distinguish between different types of physical activity or exercise-a subset of physical activity that is planned, structured, and repetitive [ 23 ]. There are two main types of exercise training: aerobic exercise and resistance training, each with distinct physiological mechanisms and benefits [ 33 ]. Aerobic exercise is characterized by a sustained elevated heart rate and primarily improves cardiovascular fitness-measured by maximal oxygen uptake (VO$\\_{2}$ max)-and, at the muscle level, targets type I muscle fibers to enhance carbohydrate and fat metabolism [ 34 ]. In contrast, strength and resistance training lead to fewer cardiovascular adaptations but emphasize the activation of motor units, particularly type II muscle fibers [ 34 ]. This results in improved neuromuscular synchrony and muscle fiber hypertrophy, ultimately increasing muscle strength and power.", "doc_items_refs": ["#/texts/51"], "page_nos": [1], "uuid": "bc1f27df-3e1c-484f-915c-63e57d16180b"}
{"doc_id": "2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975.doctags", "chunk_id": 9, "source_chunk_idxs": [9], "num_tokens": 455, "text": "Interventions for myosteatosis\nRandomized controlled trials show exercise positively impacts brain health, including neuropsychological function and brain neuroimaging indices of size and brain function [ 24 , 25 ]. To date, the majority of RCTs of exercise and brain health in older adults have focused on aerobic exercise training [ 24 ]. However, the potential of resistance training for brain health is now recognized [ 26 -28 ]. The benefit of resistance training on brain health can be observed among older adults who are cognitively normal as well as those with mild cognitive impairment. For example, Liu-Ambrose showed 2 × /week resistance training improved executive function in older women with and without mild cognitive impairment [ 4 , 6 ]. Moreover, 2 × /week resistance training reduced the progression of cerebral small vessel disease [ 9 ]-a condition that contributes to 45% of dementia cases [ 29 ]. Recent reports show that resistance training significantly improves memory, preserves white matter integrity, and maintains hippocampal grey matter in older adults with mild cognitive impairment, compared to a unimpaired control group, following a 24-week intervention [ 35 ]. The effects of different exercise training (i.e., aerobic training and resistance training) on the muscle secretome remain to be elucidated, particularly among older adults. Evidence to date from studies of acute exercise suggests both types of exercise training induce changes in myokine levels in healthy adults [ 30 ]. Overall, there is a general dearth of research examining the muscle secretome response to acute and chronic resistance exercise in older adults.\nMechanisms of muscle-brain crosstalk: circadian rhythms, muscle clocks, myokines, and extracellular vesicles\nCircadian rhythms and muscle clocks: a potential systems biology link supporting muscle to brain bidirectional communication\nCircadian rhythms have evolved to synchronize physiology and behavior with the 24-h rotation of the Earth. These rhythms are governed by an intrinsic molecular clock, present in nearly every mammalian cell, which is aligned to the external light-dark cycle. Population studies have shown that irregular and insufficient sleep are strong, independent risk factors for mild cognitive impairment (MCI) and incident dementia [ 36 ]. Irregular sleep and activity patterns", "doc_items_refs": ["#/texts/52", "#/texts/53", "#/texts/54", "#/texts/55"], "page_nos": [1], "uuid": "1f30e3ae-63fc-4cd3-9223-7ad5b1686c3d"}
{"doc_id": "2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975.doctags", "chunk_id": 10, "source_chunk_idxs": [10], "num_tokens": 470, "text": "Interventions for myosteatosis\nhave been linked to disrupted circadian rhythm integrity, which is thought to be a significant contributor to declining brain health, as measured by cognitive performance, cerebrospinal fluid (CSF) biomarkers, and neuroimaging findings [37-39]. Given that physical activity is a key factor influencing circadian rhythm integrity-and that skeletal muscle plays a central role in generating physical activity-it is plausible that muscle itself may contribute to the regulation of the circadian behaviors. Moreover, the growing body of evidence linking circadian rhythms to both brain health and physical activity supports a systems biology rationale for investigating the interactions between the musculoskeletal system and the central nervous system. Specifically, this line of inquiry may help determine whether circadian clock mechanisms serve as a biological link connecting musculoskeletal health to central nervous system function.\nSome of the earliest work to identify musclespecific circadian clock output genes collected muscle tissue every 4 h over a 24-h period in order to identify genes exhibiting circadian expression patterns [40]. Specifically, this resulted in approximately 215 mRNAs expressed in a circadian manner in skeletal muscle, including core clock genes such as Bmal1 , Per2 , and Cry2 [40]. Over time, mounting evidence has shown that the genetic regulators of the core circadian clock mechanism in mouse and human skeletal muscle, as well as downstream clockcontrolled outputs, are highly conserved across species [41]. Comparative studies of genes expressed in a circadian pattern have identified key musclespecific transcription factors such as MyoD1 , as well as genes essential for glucose metabolism, including hexokinase and Glut4 [41]. In relation to muscle-brain communication, it has also been observed that Fndc5 , the precursor to the myokine irisin, is a clock output gene in skeletal muscle as are other genes that contribute to extracellular vesicle formation and transport [42]. These observations support the importance of the muscle clock beyond muscle strength and metabolism, and they highlight potential molecular targets that modify muscle to brain communication [42-44].\nA novel investigation advanced the understanding of skeletal muscle's potential role in brain health by demonstrating that skeletal muscle is a key", "doc_items_refs": ["#/texts/57", "#/texts/58", "#/texts/59"], "page_nos": [1], "uuid": "c83fdadc-8982-450f-8e1d-b886030fe45c"}
{"doc_id": "2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975.doctags", "chunk_id": 11, "source_chunk_idxs": [11], "num_tokens": 434, "text": "Interventions for myosteatosis\ncontributor to features of non-rapid eye movement (NREM) sleep in mice [45]. Specifically, restoration of Bmal1 expression in skeletal muscle tissue alone was sufficient to rescue both the total amount of NREM sleep and the slow-wave activity recovery response following sleep deprivation in Bmal1 knockout mice [45]. These findings underscore the critical role of skeletal muscle-and in particular, the molecular clock gene Bmal1 within muscle-in maintaining both sleep quantity and quality. Although the downstream molecular mechanisms linking skeletal muscle to the regulation of NREM sleep remain unclear, this work highlights a novel communication pathway between the musculoskeletal system and the central nervous system, particularly the brain.\nGiven the critical role of skeletal Bmal1 in maintaining circadian integrity and regulating sleep, several research groups have extended investigations to examine the impact of restoring Bmal1 specifically in skeletal muscle on additional outcomes in Bmal1 knockout mice. The mice lacking Bmal1 in all cells of the body have been proposed as a model of advanced aging with diminished cage activity and a significantly reduced lifespan [46]. Restoration of skeletal muscle Bmal1 has been associated with extending the Bmal1 KO mouse lifespan, improved systemic glucose homeostasis, and reduced levels of systemic inflammation [42, 47, 48]. Additionally, mice with restored muscle Bmal1 exhibited increased voluntary wheel-running activity, suggesting that improved muscle health can influence the brain to modify activity behavior [45]. These changes in muscle function and behavior were accompanied by improved markers of tissue and systemic health, including enhanced metabolic profiles and reduced inflammation in both the lungs and white adipose tissue [47]. Although the brain was not directly studied in these experiments, the findings highlight the capacity of healthy muscle to communicate with other biological systems to support both physical activity and overall health.\nIn summary, studies of the circadian clock mechanism in skeletal muscle have revealed new insights into how muscle-intrinsic circadian regulation contributes not only to muscle health, but also to broader systemic and brain health.\nMolecular messengers of muscle-brain crosstalk: the role of myokines", "doc_items_refs": ["#/texts/61", "#/texts/62", "#/texts/63", "#/texts/65"], "page_nos": [1], "uuid": "4cbc7681-5246-4d66-9d7f-48148d8c2145"}
{"doc_id": "2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975.doctags", "chunk_id": 12, "source_chunk_idxs": [12], "num_tokens": 463, "text": "Interventions for myosteatosis\nSkeletal muscle is a highly active endocrine organ with a complex secretome that includes nucleic acids, fatty acids, and-most notably-bioactive peptides and proteins collectively known as myokines [5]. These may be secreted directly or encapsulated within EVs [49]. To date, over a thousand putative myokines have been identified; however, only a small subset has been consistently examined in human population-based studies, with many others remaining promising but largely investigated in animal models or in vitro [50]. The majority of identified myokines have also been previously classified as cytokines. These molecules are not secreted exclusively by myocytes but are also produced by adipocytes located within muscle and other fat depots-leading to the term adipomyokines in some contexts [51]. Furthermore, there is considerable overlap between the muscle secretome and those of other organs, particularly the liver [5].\nMyokines are thought to play a critical role in maintaining whole-body metabolic homeostasis through autocrine, paracrine, and endocrine signaling, influencing nearly every organ system-including the brain.5 Among the diverse mechanisms underlying muscle-brain interactions are metabolic regulation, immune modulation, cerebrovascular health, and direct neurotrophic effects. Myokines most frequently associated with both metabolic and brain health include monocyte chemoattractant protein-1 (MCP-1), interleukin-6 (IL-6), Cathepsin B, myostatin, fibronectin type III domain-containing protein 5 (FNDC5)/irisin, and brain-derived neurotrophic factor (BDNF) [45-50]. Since the discovery that IL-6-a known cytokine-is also produced and released by skeletal muscle, interest has grown in the crosstalk between muscle and brain as a key pathway for understanding how exercise promotes systemic health [31].\nThe following sections will review myokines linked to brain health, beginning with evidence from population-based studies, followed by their relationship to biomarkers and mechanisms associated with cognitive decline and AD.", "doc_items_refs": ["#/texts/66", "#/texts/67", "#/texts/68"], "page_nos": [1], "uuid": "52a2fea7-7af1-4838-b333-cf558263a488"}
{"doc_id": "2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975.doctags", "chunk_id": 13, "source_chunk_idxs": [13], "num_tokens": 491, "text": "Interventions for myosteatosis\nHigher plasma levels of MCP-1 were associated with the following: lower scores and faster decline in episodic memory in cognitively normal adults [52, 53], faster conversion from MCI to dementia with potential underlying AD [54], AD, dementia with potential underlying AD, or MCI status compared to normal cognition [55-58], and faster cognitive decline in patients with MCI or dementia with potential underlying AD [59]. Patterns of associations were similar for studies using other measures of MCP-1 (e.g., gene polymorphism [60], and CSF levels [61, 62]). As a myokine, IL-6 has differential effects depending on the chronicity of its elevation. Acute increases in IL-6 following muscle contraction promote glucose uptake, lipolysis, and activation of anti-inflammatory pathways [5]. In contrast, chronically elevated IL-6 levels, particularly when accompanied by larger levels of intradividual variability, are associated with cognitive decline [63-66]. Higher circulating levels of Cathepsin B, as well as greater increases in serum Cathepsin B concentrations, exhibit potential associations with improvements in cognitive function in response to exercise. However, existing studies have not demonstrated consistent relationships between increased Cathepsin B levels and improvements in cognition, and they show considerable heterogeneity in both the type and duration of exercise regimens as well as in the cognitive assessments used [67, 68]. Recent reviews have highlighted the need for greater consensus in study designs and have emphasized the importance of larger, longitudinal studies examining Cathepsin B and its association with cognition at the population level in older adults [69]. Myostatin has been associated with a neuroprotective phenotype with sustained cognitive function, both cross-sectionally and longitudinally, in a large epidemiological study of older adults without dementia [70]. In a separate study, myostatin has showed no relationship with cognitive function but was positively associated with incident dementia with potential underlying AD [71]. It is difficult to interpret these conflicting results given the limited number of existing studies and the possibility that an increase in myostatin may represent an adaptive or compensatory response in older\nadults with incident dementia. These findings underscore the need for further research at the population level.", "doc_items_refs": ["#/texts/70", "#/texts/72"], "page_nos": [1], "uuid": "0f4c9eaa-e012-4aed-ae76-d1a2f0c2d0f0"}
{"doc_id": "2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975.doctags", "chunk_id": 14, "source_chunk_idxs": [14], "num_tokens": 495, "text": "Interventions for myosteatosis\nHigher plasma irisin was associated with better global cognition and episodic memory among middle aged adults with familial history of AD [ 72 ], and with normal cognition compared to dementia with potential underlying AD [ 73 , 74 ]. In apparent contrast with these findings, a study of patients aged 45-75 with uncontrolled type II diabetes (T2D) found plasma irisin was higher in MCI compared to healthy unimpaired controls and was inversely correlated with cognition [ 75 ]. As mentioned previously, it has been suggested that myokine levels increase as adaptive responses to dysfunction in metabolism; for example, irisin may increase in patients with type II diabetes mellitus as an adaptive/compensatory response, but its neuroprotective effects may not be sufficient to combat the neurodegenerative effects of pro-inflammatory adipokines. Most prior studies tested these cytokines in isolation, which thus could not assess how they interact with each other. Studies in humans were mostly conducted in US and Asia and did not include persons of African ancestry. Future research proposals should address these limitations. Irisin is a particularly interesting myokine because it has been shown to have neuroprotective effects [ 76 ], in particular in the hippocampus, by increasing BDNF levels [ 77 ].\nWhile most BDNF research has focused on its endogenous effects on neural plasticity in preclinical models, BDNF is also known to be expressed in muscle in response to exercise [ 78 ] and is present in measurable amounts in plasma and serum [ 79 ]. This raises the possibility that BDNF may mediate a direct muscle-to-brain signaling pathway. Studies measuring serum BDNF levels have shown that lower circulating BDNF is associated with dementia with potential underlying AD compared to cognitively healthy, unimpaired older adults [ 80 , 81 ]. However, serum BDNF levels do not appear to reliably distinguish between individuals with MCI and healthy unimpaired controls, or between those with dementia with potential underlying AD and MCI. BDNF levels vary greatly from individual to individual and are influenced by sex, physical activity, diet, sleep, stress, and other environmental factors. A limitation of current studies is that, while some have measured cognition", "doc_items_refs": ["#/texts/73", "#/texts/74"], "page_nos": [1], "uuid": "39e5f205-f129-4b81-9d55-906c37e9468c"}
{"doc_id": "2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975.doctags", "chunk_id": 15, "source_chunk_idxs": [15], "num_tokens": 506, "text": "Interventions for myosteatosis\nlongitudinally, many have not measured withinsubject BDNF levels over time. Tracking individual changes in BDNF could offer additional insight. Another limitation involves the plausibility of whether BDNF, a serum protein, can cross the blood-brain barrier; BDNF present in the bloodstream arises from endothelial cells and peripheral tissues and is stored in platelets [ 79 ]. These issues raise the possibility that serum or plasma BDNF may instead serve as a surrogate marker of physical function or muscle health. An alternative mechanism is that muscle-derived EVs may encapsulate BDNF and other molecular cargo, potentially allowing them to cross the blood-brain barrier and interact directly with the brain.\nMyokines, biological biomarkers of dementia, and mechanisms of muscle-brain interactions in human studies\nInformation on myokines, AD pathology, and muscle-brain interactions is supported by animal studies, but is only recently emerging in humans. Plasma MCP-1 was positively associated with CSF levels of phosphorylated and total tau in asymptomatic older adults [ 62 ]. Exposure of human cell cultures to MCP-1 resulted in increased Tau phosphorylation [ 82 ]. Patterns of associations were overall similar for CSF levels of irisin and MCP-1 predicting CSF levels of AD biomarkers [ 58 , 61 , 62 , 77 ]. MCP-1 plays an important role in regulating vascular permeability, and it is hypothesized that elevated circulating levels of MCP-1 may alter the selectivity of the blood-brain barrier. Supporting this, endothelial cells from individuals with AD show increased levels of inflammatory factors, including MCP-1, compared to those from individuals without AD. Notably, high concentrations of MCP-1 have been observed in preclinical models within the brain microvasculature of individuals with AD, but not in those without AD [ 83 ]. Increased permeability of the blood-brain barrier may expose the brain to factors that contribute to cognitive decline, including inflammatory mediators and circulating amyloid.\nChronically elevated serum levels of IL-6, similar to MCP-1, have been associated with an inflammation-mediating role in AD. For example, both IL-6 and MCP-1 have shown strong correlations between serum and CSF levels in individuals with", "doc_items_refs": ["#/texts/76", "#/texts/77", "#/texts/78", "#/texts/79"], "page_nos": [1], "uuid": "42ed9fd2-bb7e-4a6e-b53d-5b17a105224e"}
{"doc_id": "2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975.doctags", "chunk_id": 16, "source_chunk_idxs": [16], "num_tokens": 502, "text": "Interventions for myosteatosis\nprobable AD [ 84 ]. This supports the hypothesis that increased blood-brain barrier permeability may allow serum inflammatory mediators to access the CSF and, consequently, the brain-thereby promoting inflammatory pathways, a recognized hallmark of AD [ 85 ]. Another possibility involving IL-6 is that exercise is known to lead to large increases in IL-6, and in preclinical mouse models, elevated IL-6 has been shown to induce reduced appetite [ 86 ]. This may have important implications given the strong link between metabolic syndrome and cognitive decline. These findings suggest that both chronic elevations and activity-induced fluctuations in serum IL-6 levels could contribute to distinct cognitive phenotypes.\nCathepsin B is a myokine known to be released directly from skeletal muscle in response to both aerobic and strength-based exercise regimens in human populations. In rodent models, Cathepsin B has been shown to cross the blood-brain barrier [ 87 , 88 ]. It influences neural substrates vulnerable in dementia, particularly the hippocampus and prefrontal cortex, and promotes neural plasticity by enhancing neurogenesis and synaptic connectivity. Cathepsin B also contributes to the degradation of amyloid-beta, directly interacting with AD pathological mechanisms. The pathways through which Cathepsin B enhances neurogenesis and synaptic function are multifaceted and include the proliferation and differentiation of neural progenitor cells, axial growth, reduction of neuroinflammation, and induction of local BDNF expression [ 69 , 87 ]. The effect of Cathepsin B on amyloid-beta accumulation is likely mediated through increased lysosomal activity that supports cellular recycling [ 69 , 89 ].\nIn human studies, higher circulating levels of myostatin have been associated with higher plasma Aβ42/40 ratios, which are indicative of lower amyloid burden [ 90 ]. Additionally, elevated serum myostatin levels have been linked to more favorable neuroimaging profiles and reduced amyloid deposition as measured by PET scans [ 70 ]. Although research in this area is still limited, these findings suggest a potential neuroprotective role for myostatin. Mechanistically, impaired autophagy and disrupted protein degradation are thought to contribute to the accumulation of amyloid plaques and neurofibrillary tangles. Therefore, it is biologically plausible that myostatin,", "doc_items_refs": ["#/texts/81", "#/texts/82", "#/texts/83"], "page_nos": [1], "uuid": "f590d47c-aea2-4b33-8c01-db2fd580e8b6"}
{"doc_id": "2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975.doctags", "chunk_id": 17, "source_chunk_idxs": [17], "num_tokens": 368, "text": "Interventions for myosteatosis\nby decreasing protein synthesis and/or enhancing autophagy pathways through mechanisms such as protein ubiquitination, may be associated with reduced amyloid accumulation.\nPlasma levels of irisin in middle-aged adults with familial AD were inversely associated with serum amyloid Aβ42, although this association only approached statistical significance-likely due to the small sample size ( N = 64 ) and relatively young average age (55 years) of participants [ 91 ]. In CSF, irisin levels correlated with several biomarkers of AD pathology, including a positive correlation with CSF Aβ42 (indicative of lower central nervous system amyloid burden), a positive association with BDNF, and a negative trend with total tau (t-tau) [ 77 , 92 ]. Preclinical work using 3D brain organoid models suggests that irisin may reduce amyloid burden through activation of the Aβ-degrading enzyme neprilysin [ 93 ]. As a myokine, irisin has garnered considerable attention due to its ability to influence multiple brain cell types-neurons, astrocytes, and microglia-and activate a range of neuroprotective molecular pathways, including those regulating amyloid pathogenesis, neuroinflammation, mitochondrial function, and BDNF production [ 94 ]. Particularly relevant to the muscle-brain axis, peripheral irisin expression has been shown to drive BDNF production in the brain in response to exercise in mouse models [ 64 ]. Therefore, elucidating the mechanisms by which FNDC5/irisin exerts its effects is critical for developing therapeutic strategies to mitigate cognitive dysfunction-especially for individuals who are frail, injured, or otherwise unable to engage in physical activity.", "doc_items_refs": ["#/texts/84", "#/texts/85"], "page_nos": [1], "uuid": "24c0fe8a-19c1-4d81-881c-fb437627f8f1"}
{"doc_id": "2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975.doctags", "chunk_id": 18, "source_chunk_idxs": [18], "num_tokens": 242, "text": "Interventions for myosteatosis\nBDNF is a key molecule that promotes neurogenesis, dendritic and synaptic health, neuronal survival, plasticity, and excitability, all of which are disrupted in neurological and cognitive disorders, including AD. While BDNF is released by skeletal muscle, it is thought to act primarily through autocrine mechanisms. Nonetheless, BDNF remains central to investigations of muscle-brain interactions, as physical activity-and the associated circulation of myokines and EV cargo-is believed to influence BDNF production within the brain. Consequently, BDNF is increasingly viewed as a biomarker for cognitive decline and resilience. Although muscle may not contribute substantially to serum BDNF levels, significant input comes from platelets, endothelial cells, and\npossibly the brain itself via blood-brain barrier crossing [ 95 ]. Importantly, BDNF not only promotes direct neuroprotection but also has bidirectional relationships with AD-related mechanisms involving tauopathy and amyloid pathology, reinforcing its relevance in studies of muscle-brain mechanisms [ 96 , 97 ].", "doc_items_refs": ["#/texts/86", "#/texts/87"], "page_nos": [1], "uuid": "bc3407d0-cfb9-4724-b64b-6d0b847d6192"}
{"doc_id": "2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975.doctags", "chunk_id": 19, "source_chunk_idxs": [19], "num_tokens": 430, "text": "Interventions for myosteatosis\nExtracellular vesicles as carriers of molecular communication from muscle to brain Extracellular vesicles (EVs) are present in fluids throughout the body, including the blood, urine, lymphatic fluids, and saliva. Notably, these EVs serve as critical carriers of information in the form of nucleic acids, proteins, and lipids, for example. As they circulate through the fluid, EVs are eventually taken up by a recipient cell, where they can dictate physiological cascades and/or pathological processes. Recent work demonstrated that young serum exerts beneficial effects on both skeletal muscle regenerative potential and cognitive function in aged mice, but that the effects were significantly blunted when the serum was depleted of circulating EVs. [ 98 , 99 ] Further investigation demonstrated that young EVs enhanced the mitochondrial function of aged muscle progenitor cells, a major cell population that participates in the skeletal muscle regenerative cascade [ 98 ]. These data suggest that mitochondria may be a target of circulating EVs, and that age-related declines in the carcovers of these EVs may contribute to the loss of tissue health over time. This raises the intriguing possibility that EVs may serve as mediators of the muscle brain-axis and that interventions such as exercise or muscle contractile activity may serve as a promising means to reverse the effect of time on the information contained within these nanoparticles. Indeed, we recently demonstrated that 2 weeks of neuromuscular electrical stimulation performed in aged animals significantly altered EV cargoes and enhanced their ability to support skeletal muscle regeneration [ 100 ]. Future studies are needed to identify the molecular mediators of these effects.\nEVs offer a promising avenue to study the full secretome of skeletal muscle, particularly in relation to their potential targeting of the brain. The encapsulated cargo within EVs protects nucleic acids including small RNAs with signaling capacity, enables identification of the tissue of origin, and stabilizes bioactive lipids that may otherwise degrade in free circulation [ 101 ]. While these techniques are not yet", "doc_items_refs": ["#/texts/88", "#/texts/89"], "page_nos": [1], "uuid": "83b1134e-d787-47c5-b96f-23ebea22f23f"}
{"doc_id": "2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975.doctags", "chunk_id": 20, "source_chunk_idxs": [20], "num_tokens": 148, "text": "Interventions for myosteatosis\nfully developed for muscle-derived EVs, they are rapidly emerging in the context of brain-derived EVs, with growing number of reports detailing methods for isolating and identifying brain-derived EVs from the circulation [ 49 , 102 -104 ]. These approaches could be applied to identify muscle-derived EVs and potentially those specifically targeted to the brain. Moreover, the detection of brain-derived EVs in systemic circulation supports the biological plausibility that EVs can cross the blood-brain barrier and protect their molecular cargo [ 102 ]. Future research integrating EVs from muscle and brain, and translating brain EV isolation techniques to muscle, holds substantial promise for advancing our understanding of musclebrain interactions.", "doc_items_refs": ["#/texts/91"], "page_nos": [1], "uuid": "af55db81-6947-4841-992a-ac081f7f1c4b"}
{"doc_id": "2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975.doctags", "chunk_id": 21, "source_chunk_idxs": [21], "num_tokens": 423, "text": "Discussion/conclusions\nThe symposium, The Role of Muscle-Brain Crosstalk to Promote Healthy Aging , aimed to elucidate current evidence, limitations, and future directions for understanding muscle's role in brain health. Discussions centered on four key topics, each providing take-home messages, identifying limitations, and cross-cutting themes. A primary and recurring recommendation across sessions was the need for further exploration of the emerging relationship between muscle quality and brain health. In particular, there was strong emphasis on the need for investigating muscle's secretome of circulating factors-such as myokines and EVs-as mechanistic links in musclebrain crosstalk.\nMyosteatosis: a marker of muscle quality, aging, and disease\nThe first topic of the symposia, Muscle Quality in Aging and Disease , established that while past assessments of muscle have primarily focused on muscle mass (e.g. muscle area) and strength, muscle quality is one of the earliest changes in aging and strongly impacts muscle strength, the risk of metabolic disorders (e.g., insulin resistance), and systemic inflammation [ 11 , 12 , 16 , 17 ]. These factors, in turn, have wellestablished causal relationships with cognition and dementia. This supports the biologic plausibility that muscle quality, measured by myosteatosis, may play a significant role in brain health.\nA recommendation from this session was the need for further investigation into myosteatosis as a predictor for cognition and brain health in aging populations. Additionally, there is a critical need to develop targeted therapies and interventions that address myosteatosis in conjunction with muscle mass and function. However, progress in effectively targeting myosteatosis is hindered by three major limitations: (1) the lack of consensus on standardized morphological measurement methodologies (e.g., ultrasound, computed tomography, MRI) for myosteatosis, (2) the relevance of intermuscular and intramuscular skeletal fat depots, and (3) the absence of muscle-derived biomarkers associated with myosteatosis.", "doc_items_refs": ["#/texts/93", "#/texts/94", "#/texts/95", "#/texts/97"], "page_nos": [1], "uuid": "553fd148-b6fd-4b54-87cd-8dad5868f48d"}
{"doc_id": "2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975.doctags", "chunk_id": 22, "source_chunk_idxs": [22], "num_tokens": 409, "text": "Discussion/conclusions\nA cross-cutting theme that emerged early in the symposia was the importance of understanding the muscle pathophysiology underlying myosteatosis, particularly the role of myokines. In this context, secreted mediators such as myokines and the cargo of EVs have been proposed as potential molecular biomarkers. This is especially relevant given that current assessments of myosteatosis primarily rely on imaging-based morphometric analyses.\nEpidemiological association of muscle contractility and brain health\nThe second topic, Epidemiological Association of Muscle Contractility and Brain Health , highlighted the critical role of muscle function in enabling physical activity. However, the direct link between muscle health characteristics, muscle biology, and brain health remains underdeveloped. A key emphasis was that most exercise interventions focus on endurance and sustained aerobic exercise, which primarily targets substrate metabolism but may have limited direct effects on myosteatosis. In contrast, resistance training, which influences changes to muscle fiber density, structure, and the muscle's secretome, have been less studied in the context of brain health [17, 105].\nRecommendations to advance muscle contractility's association to brain health is summarized by the need for clinical trials directly comparing resistance training and aerobic exercise to assess their differential impacts on brain health. These trials should simultaneously evaluate both the acute and chronic responses of myokines and EVs and their relationship to cognitive and brain health outcomes. Future research should also adopt standardized definitions of\nbrain health, such as those proposed by the Alzheimer's Association and NIA, which integrate cognitive impairment and biomarkers to classify stages including unimpaired AD, mild cognitive impairment, and the spectrum of dementia with potential AD and AD [106]. Additionally, resistance training protocols should be refined to distinguish between power, strength, and hypertrophy-focused interventions using established variables in exercise prescription, as each may have distinct effects on myosteatosis and neuroprotection [24].", "doc_items_refs": ["#/texts/98", "#/texts/99", "#/texts/100", "#/texts/101", "#/texts/102"], "page_nos": [1], "uuid": "91b4e46f-f38d-4440-9a85-84b649419575"}
{"doc_id": "2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975.doctags", "chunk_id": 23, "source_chunk_idxs": [23], "num_tokens": 430, "text": "Discussion/conclusions\nBuilding on the first symposia's recommendations, the discussion of Muscle Contractility's association with brain health reinforced the themes of understanding the mechanistic role of muscle quality-specifically myosteatosis-in brain health. Further, the integration of myokine and EV biology into exercise research is essential to uncover molecular pathways linking muscle contractility to neuroprotection. Given the reliance on imaging-based assessments for myosteatosis, identifying myokine and extracellular vesicle biomarkers could provide more accessible and scalable methods to track muscle-related cognitive benefits.\nMechanisms of muscle-brain crosstalk: circadian rhythms, muscle clocks, myokines, and extracellular vesicles\nCircadian rhythms and muscle clocks\nThe third topic, Circadian Rhythms and Muscle Clocks, explored the biologic plausibility of skeletal muscle's role in brain health through a systems biology perspective. A key insight emerging from this discussion is that skeletal muscle circadian clocks play a crucial role in maintaining overall circadian rhythm integrity, which is increasingly recognized as a factor in cognitive health [42, 45].Disruptions in circadian rhythms due to aging, declining physical activity, or night shift work have been linked to cognitive decline and dementia [37, 37, 38]. Skeletal muscle health, particularly the regulation of its molecular pathways (e.g., BMAL1), is fundamental to preserving circadian function. While the relationship between myosteatosis and skeletal muscle clocks remains largely unexplored, this perspective further reinforces the role of skeletal muscle in neuroprotection beyond its cardiovascular, metabolic, and inflammatory effects.\nFurther research is needed to determine how skeletal muscle contributes to system-wide circadian regulation and whether the molecular mediators involved in circadian signaling differ from those influencing cardiovascular, metabolic, and neurologic outcomes. Additionally, studies should evaluate how myosteatosis interacts with skeletal muscle clocks to impact brain function. A major limitation in advancing this field is the lack of research on specific biomarkers linking skeletal muscle circadian function to brain health.", "doc_items_refs": ["#/texts/103", "#/texts/104", "#/texts/105", "#/texts/106", "#/texts/108"], "page_nos": [1], "uuid": "b7180dbc-f44d-40c3-ad6f-f5cfd5ee5e91"}
{"doc_id": "2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975.doctags", "chunk_id": 24, "source_chunk_idxs": [24], "num_tokens": 387, "text": "Discussion/conclusions\nBuilding on previous symposia discussions, this topic reinforces the critical role of skeletal muscle beyond traditional metabolic and functional perspectives, integrating circadian biology into the broader discussion of muscle's neuroprotective potential. Additionally, it expands the scope of potential interventions beyond exercise alone to include diet, sleep regulation, and the timing of physical activity as strategies to optimize muscle quality and its impact on brain health. Given that myosteatosis assessments currently rely on imaging, identifying circadian-related biomarkers in muscle-derived factors such as myokines and EVs could offer novel and accessible tools for tracking muscle's influence on neuroprotection.\nMolecular mechanisms of muscle-brain interactions\nThe fourth topic, Molecular Mechanisms of MuscleBrain Interactions, focused on two key objectives: (1) strengthening the causal relationship between muscle and brain health and (2) identifying molecular targets for translational applications, including exercise and pharmacologic interventions. The primary mechanisms underlying muscle-brain interactions include effects on metabolism, immune function, cerebrovascular health, and direct neural pathways. Skeletal muscle secretes myokines and EVs containing cargo such as nucleic acids and fatty acids, with neuroactive myokines-such as MCP-1, IL-6, Cathepsin B, myostatin, irisin, and BDNF-receiving significant attention [5]. These molecules have been implicated in brain health through both preclinical studies and associations in older adult populations. EVs are of particular interest due to their biological advantages: they protect molecular cargo with a plasma membrane, contain proteins that may aid in targeting, and have demonstrated the ability to cross the blood-brain barrier in preclinical models. This\npresents an exciting avenue for understanding and potentially modulating muscle-derived influences on neuroplasticity and brain function.", "doc_items_refs": ["#/texts/109", "#/texts/110", "#/texts/111", "#/texts/113"], "page_nos": [1], "uuid": "f10f9f66-775c-42df-b727-d2dc4d8b8f04"}
{"doc_id": "2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975.doctags", "chunk_id": 25, "source_chunk_idxs": [25], "num_tokens": 499, "text": "Discussion/conclusions\nOne major challenge in studying myokines and EVs is determining their tissue or cellular origin, as many of these molecules are not muscle-specific. For example, interventions such as resistance training may elevate serum levels of irisin or BDNF, but it remains difficult to distinguish whether these effects result from muscle signaling or secondary activation of the brain's endogenous BDNF production. Additionally, there is ongoing debate about whether irisin or BDNF can cross the blood-brain barrier. Innovative methodologies are needed to enhance the interpretation of interventional studies investigating the effects of muscle-targeted interventions on myokines and EVs, neuroplasticity, and cognition.\nEVs present a promising intervention strategy, supported by ongoing advances in identifying their surface proteins and profiling their cargo. Clinically, EVs are of particular interest because they can cross the blood-brain barrier and be engineered with surface proteins to target specific payloads [107]. As a result, they are being actively explored as therapeutic candidates in brain disorders such as glioblastoma (GBM) and stroke recovery [108]. This therapeutic potential could also be extended to neurodegenerative conditions, including AD.\nTo accelerate progress, the development of multidisciplinary research teams is crucial. Given that EVs appear to participate in bidirectional communication between the brain and periphery-with the discovery of brain-derived EVs-there is an emerging potential for EVs to serve not only as therapeutic vectors but also as molecular readouts, akin to a \"liquid brain biopsy\" [102]. Collaborative teams integrating expertise in skeletal muscle physiology, myosteatosis assessment, EV biology, aging research, and multimodal brain assessments would significantly advance the field.\nThis discussion expands on prior symposia topics by reinforcing the biological plausibility of skeletal muscle's role in brain health, expanding from its metabolic, cardiovascular, and circadian influences to molecular-level interactions. Additionally, it highlights EVs as a novel biomarker and therapeutic strategy, aligning with the broader need to refine molecular readouts of muscle function beyond imaging-based assessments of myosteatosis. Further, the potential for\nbidirectional brain-muscle communication through EVs underscores the need for integrative research approaches that connect muscle biology with neurodegenerative and cognitive health frameworks.", "doc_items_refs": ["#/texts/114", "#/texts/115", "#/texts/116", "#/texts/117", "#/texts/119"], "page_nos": [1], "uuid": "9bd8ae5e-07c2-482b-bd0b-1f65b3a35762"}
{"doc_id": "2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975.doctags", "chunk_id": 26, "source_chunk_idxs": [26], "num_tokens": 371, "text": "Discussion/conclusions\nNext steps for research: mechanisms, interventions, and the necessity of multidisciplinary collaboration\nFigure 2 illustrates a proposed translational pipeline for muscle-brain crosstalk research, from mechanistic discovery to precision therapeutics. Specifically, future research must prioritize the precise characterization and measurement of myostateositis, myokines, and EVs as well as their cargo to establish a clearer understanding of the muscle secretome and its role in brain health. A critical step toward this goal is the development of consensus methodologies for assessing myostateositis, particularly differentiating between intermuscular and intramuscular fat depots and defining their specific relevance to brain health. Standardizing imaging techniques (e.g., CT, ultrasound, MRI) alongside molecular profiling (e.g., myokine and EV cargo signatures) will be essential to capturing muscle health at both macroscopic and molecular levels. Advancements in proteomics and transcriptomics should be leveraged to better identify the muscle-derived secretome with greater specificity and differentiate muscle-derived factors from those originating in other tissues.\nUnderstanding the putative mechanisms linking muscle health to cognitive function requires an integrative, systems-level approach that considers cardiovascular, metabolic (e.g., insulin sensitivity), inflammatory, neurotrophic, and blood-brain barrier\npermeability mechanisms. Special attention should be given to the circadian regulation of muscle function, as skeletal muscle clocks have emerged as key regulators of systemic circadian rhythms, metabolism, and brain health. Future research should explore how disruptions in muscle circadian rhythms contribute to cognitive decline and whether interventions targeting circadian alignment (e.g., optimized exercise timing, sleep regulation, or meal timing) can enhance both muscle health and neuroprotection.", "doc_items_refs": ["#/texts/120", "#/texts/121", "#/texts/122", "#/texts/123"], "page_nos": [1], "uuid": "92141630-18f3-4444-9afd-6b8f52ebbad2"}
{"doc_id": "2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975.doctags", "chunk_id": 27, "source_chunk_idxs": [27], "num_tokens": 257, "text": "Discussion/conclusions\nTo establish causal relationships, longitudinal and interventional studies are needed to assess the direct effects of myokines and EVs on brain health. While epidemiological data strongly support the link between physical activity and brain health, definitive evidence that muscle-derived factors mediate these effects is still lacking. Clinical and preclinical studies should investigate how interventions-such as exercise prescription, drugs, dietary modifications, and sleep optimization-modulate muscle clocks and influence brain aging. The use of animal models, including genetically engineered mouse models, can provide insight into how EVs are secreted, transported, and act on distant tissues. Additionally, innovative tracking techniques for EV circulation and brain uptake will be necessary to determine their mechanistic contributions to neuroprotection.\nTo harness the translational potential of muscle brain crosstalk, future studies should leverage randomized controlled trials that investigate exercise interventions, particularly resistance training, and assess changes in circulating myokines, EV content, and brain health outcomes. A particularly promising\nFigure caption: Fig. 2 Translational pipeline for muscle-brain crosstalk research. This model maps the proposed research trajectory-from mechanistic discovery to biomarker integration, intervention testing, and precision therapeutics-to highlight potential clinical impact", "doc_items_refs": ["#/texts/124", "#/texts/125", "#/pictures/2"], "page_nos": [1], "uuid": "c59a8bb5-8670-4ed5-a1a4-fe0009e0789b"}
{"doc_id": "2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975.doctags", "chunk_id": 28, "source_chunk_idxs": [28], "num_tokens": 340, "text": "Discussion/conclusions\navenue is the engineering of muscle-derived EVs loaded with neuroprotective cargo-such as BDNF, irisin, and neurotrophic small RNAs-for potential therapeutic applications in neurodegenerative diseases. The ability of muscle-derived EVs to cross the blood-brain barrier suggests their potential as both biomarkers (\"liquid brain biopsy\") and delivery vehicles for targeted therapeutics. To accelerate clinical translation, collaboration is needed among experts in muscle physiology, myosteatosis, aging, omics, and multimodal assessments of brain health. This includes integrating neuropsychological evaluation, brain biomarker analysis, and neuroimaging to establish robust associations and identify causative mechanisms. Such interdisciplinary efforts will help lay the groundwork for developing muscle-brain crosstalk therapies for neurodegenerative conditions. Additionally, these findings could inform public health policies by reinforcing the role of muscle health and physical activity in cognitive aging and dementia risk modulation, guiding the development of exercise and rehabilitation strategies tailored to enhance brain health in aging adults. To support multidisciplinary collaboration, funding agencies should structure funding notices to promote research that advances understanding of muscle-brain crosstalk at the molecular level, while simultaneously supporting clinical investigations-including exercise, lifestyle, and pharmaceutical interventions-to improve muscle quality, brain health, and inform clinical trials.\nThe highlighted and aforementioned next steps for research are summarized in Fig. 2 , which outlines a proposed translational pipeline for muscle-brain crosstalk-talk-from mechanistic discovery to biomarker development, intervention testing, and precision therapeutics.", "doc_items_refs": ["#/texts/128", "#/texts/129"], "page_nos": [1], "uuid": "9aefe6a3-17a5-4602-87d3-c4a4fd0e5abc"}
{"doc_id": "2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975.doctags", "chunk_id": 29, "source_chunk_idxs": [29], "num_tokens": 340, "text": "Symposiums impact\nThe symposium, The Role of Muscle-Brain Crossstalk to Promote Healthy Aging, elucidated the current state of the field and examined the underlying mechanisms linking muscle-brain crosstalk to the wellestablished relationship between physical activity and brain health. Particular emphasis was placed on the limitations of the existing research base and the opportunities for future studies to strengthen the evidence supporting this emerging area. Given the growing associations between muscle quality-specifically\nmyosteatosis-and cognitive function across diverse cohorts of older adults, the lasting impact of the symposium is its call for the formation of multidisciplinary teams to rigorously investigate the molecular mediators of muscle-brain crosstalk, with special focus on myokines and EVs.\nWith the advent of multi-omic analytic approaches, this next step is increasingly feasible and essential for uncovering the mechanisms and molecular pathways involved in neuroprotection and cognitive risk. Identifying a neuroprotective myokine and EV signature could enable the development of novel therapeutic studies-for example, engineering EVs with targeted bioactive cargo designed to reach the brain. Ultimately, the rehabilitation and therapeutic strategies informed by this research could transform how we address aging muscle and brain in older adults.\nAuthor contribution All authors contributed to the study conception and design. The first draft of the manuscript was written by Brendan L. McNeish and all authors commented on previous versions of the manuscript. All authors read and approved the final manuscript.\nFunding The work was supported in part by Canadian Institutes of Health Research, P30AG02482 to Pittsburgh Pepper Center.\nData Availability Data is available from reasonable request from the Health-ABC study.", "doc_items_refs": ["#/texts/131", "#/texts/133", "#/texts/134", "#/texts/135", "#/texts/136", "#/texts/137"], "page_nos": [1], "uuid": "098c4488-d1a3-4a9b-a6cc-20846c7ada45"}
{"doc_id": "2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975.doctags", "chunk_id": 30, "source_chunk_idxs": [30], "num_tokens": 247, "text": "Declarations\nConflict of interest The authors declare no competing interests.\nOpen Access This article is licensed under a Creative Commons Attribution 4.0 International License, which permits use, sharing, adaptation, distribution and reproduction in any medium or format, as long as you give appropriate credit to the original author(s) and the source, provide a link to the Creative Commons licence, and indicate if changes were made. The images or other third party material in this article are included in the article's Creative Commons licence, unless indicated otherwise in a credit line to the material. If material is not included in the article's Creative Commons licence and your intended use is not permitted by statutory regulation or exceeds the permitted use, you will need to obtain permission directly from the copyright holder. To view a copy of this licence, visit http://creativecommons.org/licenses/by/4.0/.\nThe authors' consent to the use of this article is in writing and cannot be revoked without prior written consent. The authors' rights to use this article are limited to the use of the article. The use of this article is not permitted without the written consent of the author(s) and the editor(s).", "doc_items_refs": ["#/texts/139", "#/texts/140", "#/texts/141"], "page_nos": [1], "uuid": "b1d1d2a8-68f8-4d81-9cc3-d5664acd9472"}
{"doc_id": "2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975.doctags", "chunk_id": 31, "source_chunk_idxs": [31], "num_tokens": 458, "text": "References\n- 1. Herold F, Törpel A, Schega L, Müller NG. Functional and/or structural brain changes in response to resistance exercises and resistance training lead to cognitive improvements - a systematic review. Eur Rev Aging Phys Act. 2019;16(1): 10. https://doi.org/10.1186/s11556-019-0217-2 .\n- 2. Beck D, de Lange AMG, Alnaes D, et al. Adipose tissue distribution from body MRI is associated with cross-sectional and longitudinal brain age in adults. NeuroImage: Clinical. 2022;33:102949. https://doi.org/10.1016/j.nicl.2022.102949 .\n- 3. Sui SX, Williams LJ, Holloway-Kew KL, et al. Skeletal muscle density and cognitive function: a cross-sectional study in men. Calcif Tissue Int. 2021;108(2):165-75. https://doi.org/10.1007/s00223-020-00759-3 .\n- 4. Pedersen BK. Physical activity and muscle-brain crossstalk. Nat. Rev Endocrinol. 2019;15(7):383-92. https://doi.org/10.1038/s41574-019-0174-x .\n- 5. Severensin MCK, Pedersen BK. Muscle-organ-crossstalk: the emerging roles of myokines. Endocr Rev. 2020;41(4):594-609. https://doi.org/10.1210/endrev/bnaa016 .\n- 6. Leal LG, Lopes MA, Batista ML. Physical exercisedind myokines and muscle-adipose tissue crossstalk: a review of current knowledge and the implications for health and metabolic diseases. Front Physiol. 2018;9:1307. https://doi.org/10.3389/fphys.2018.01307 .", "doc_items_refs": ["#/texts/144", "#/texts/145", "#/texts/146", "#/texts/147", "#/texts/148", "#/texts/149"], "page_nos": [], "uuid": "b1401cf5-b32d-4b15-bcd0-2ac0124eaa4b"}
{"doc_id": "2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975.doctags", "chunk_id": 32, "source_chunk_idxs": [32], "num_tokens": 508, "text": "References\n- 7. Hook V, Yoon M, Mosier C, et al. Cathepsin B in neurodegeneration of Alzheimer's disease, traumatic brain injury, and related brain disorders. BiochemiCetica and Physica Acta (BBA). 2020;1868(8):140428. https://doi. org/10.1016/j.bbapap.2020.140428 .\n- 8. Hook G, Hook V, Kindy M. The cysteine protease inhibitor, E64d, reduces brain amyloid-β and improves memory deficits in Alzheimer's disease animal models by inhibiting cathepsin B, but not BACE1, β-secretase activity. J Alzheimers Dis. 2011;26(2):387-408. https://doi. org/10.3233/JAD-2011-110101 .\n- 9. D'Angelo MG, Bresolin N. Cognitive impairment in neuromuscular disorders. Muscle nerve. 2006;34(1):16-33. https://doi.org/10.1002/mus.20535 .\n- 10. Wilkinson DJ, Piasecki M, Atherton PJ. The age-related loss of skeletal muscle mass and function: measurement and physiology of muscle fibre atrophy and muscle fibre loss in humans. Ageing Res Rev. 2018;47:123-32. https://doi.org/10.1016/j.arr.2018.007.005 .\n- 11. Goodpaster BH, Carlson CL, Visser M, et al. Attenuation of skeletal muscle and strength in the elderly: the health ABC study. J Appl Physiol. 2001;90(6):2157-65. https:// doi.org/10.1152/jappl.2001.90.6.2157 .\n- 12. Newman AB, Haggerty CL, Goodpaster B, et al. Strength and muscle quality in a well-functioning cohort of older adults: the health, aging and body composition study. J Am Geriatr Soc. 2003;51(3):323-30. https://doi.org/10. 1046/j.1532-5415.2003.51105.x .", "doc_items_refs": ["#/texts/150", "#/texts/151", "#/texts/152", "#/texts/153", "#/texts/154", "#/texts/155"], "page_nos": [], "uuid": "37238362-3603-48fc-9787-a72b4d8c023f"}
{"doc_id": "2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975.doctags", "chunk_id": 33, "source_chunk_idxs": [33], "num_tokens": 496, "text": "References\n- 13. Prior SJ, Ryan AS, Blumenthal JB, Watson JM, Katzel LI, Goldberg AP. Sarcopenia is associated with lower skeletal muscle capillarization and exercise capacity in older adults. J Gerontol A Biol Sci Med Sci. 2016;71(8):1096- 101. https://doi.org/10.1093/gerona/glw017 .\n- 14. Forsberg AM, Nilsson E, Werneman J, Bergström J, Hultman E. Muscle composition in relation to age and sex. Clin Sci Lond Engl. 1991;81(2):249-56. https://doi. org/10.1042/cs0810249 .\n- 15. Amini B, Boyle SP, Boutin RD, Lenchik L. Approaches to assessment of muscle mass and myosteatosis on computed tomography: a systematic review. The Journals of Gerontology: Series A. 2019;74(10):1671-8. https://doi. org/10.1093/gerona/glz034 .\n- 16. Miljkovic I, Vella CA, Allison M. Computed tomography-derived myosteatosis and metabolic disorders. Diabetes Metab J. 2021;45(4):482-91. https://doi.org/10. 4093/dmi.2020.0277 .\n- 17. Correa-de-Araujo R, Addison O, Miljkovic I, et al. Myosteatosis in the context of skeletal muscle function deficit: an interdisciplinary workshop at the national institute on aging. Front Physiol. 2020;11. Accessed February 29, 2024. https://www.frontiersin.org/journals/physiology/articles/https://doi.org/10.3389/fphys.2020.00963 .\n- 18. Miljkovic I, Zmuda JM. Epidemiology of myosteatosis. Curr Opin Clin Nutr Metab Care. 2010;13(3):260-4. https://doi.org/10.1097/MCO.0b013e328337d826 .", "doc_items_refs": ["#/texts/156", "#/texts/157", "#/texts/158", "#/texts/159", "#/texts/160", "#/texts/161"], "page_nos": [], "uuid": "3fe85c82-9fb1-496c-ba2d-76614f4d3cdf"}
{"doc_id": "2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975.doctags", "chunk_id": 34, "source_chunk_idxs": [34], "num_tokens": 468, "text": "References\n- 19. Abbatecola AM, Paolisso G, Fattoretti P, et al. Discovering pathways of sarcopenia in older adults: a role for insulin resistance on mitochondria dysfunction. J Nutr Health Aging. 2011;15(10):890-5. https://doi.org/10. 1007/s12603-011-0366-0 .\n- 20. Beydoun MA, Beydoun HA, Wang Y. Obesity and central obesity as risk factors for incident dementia and its subtypes: a systematic review and meta-analysis. Obes Rev. 2008;9(3):204-18. https://doi.org/10.1111/j.146787X.2008.00473.x .\n- 21. Kuller LH, Lopez OL, Newman A, et al. Risk factors for dementia in the cardiovascular health cognition study. Neuroepidemiology. 2003;22(1):13-22. https://doi.org/ 10.1159/000067109 .\n- 22. Miljkovic I, Cauley JA, Wang PY, et al. Abdominal myosteatosis is independently associated with hyperinsulinemia and insulin resistance among older men without diabetes. Obesity. 2013;21(10):2118-25. https://doi.org/ 10.1002/oby.20346 .\n- 23. Miljkovic I, Cauley JA, Petit MA, et al. Greater adipose tissue infiltration in skeletal muscle among older men of African ancestry. J Clin Endocrinol Metab. 2009;94(8):2735-42. https://doi.org/10.1210/jc.2008-2541 .\n- 24. Dondero K, Friedman B, Rekant J, Landers-Ramos R, Addison O. The effects of myosteatosis on skeletal muscle function in older adults. Physiol Rep. 2024;12(9):e16042. https://doi.org/10.14814/phy2.16042 .", "doc_items_refs": ["#/texts/162", "#/texts/163", "#/texts/164", "#/texts/165", "#/texts/166", "#/texts/167"], "page_nos": [], "uuid": "fa95af91-4294-4785-ab05-01533cf2f992"}
{"doc_id": "2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975.doctags", "chunk_id": 35, "source_chunk_idxs": [35], "num_tokens": 193, "text": "References\n- 25. Weaver AN, Jaeggi SM. Activity engagement and cognitive performance amongst older adults. Front Psychol. 2021. https://doi.org/10.3389/fpsyg.2021.620867 .\n- 26. Ramírez-Vélez R, Ezzatvar Y, Izquierdo M, García-Hermoso A. Effect of exercise on myosteatosis in adults: a systematic review and meta-analysis. J Appl Physiol. 2021;130(1):245- 55. https://doi.org/10.1152/japplphysiol.00738.2020 .\n- 27. Becker C, Lord SR, Studenski SA, et al. Myostatin antibody (LY2495565) in older weak fallers: a proofof-concept, randomised, phase 2 trial. Lancet Diabetes", "doc_items_refs": ["#/texts/168", "#/texts/169", "#/texts/170"], "page_nos": [], "uuid": "92b1143d-8c0f-408b-a2a7-f4acf33465b1"}
{"doc_id": "2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975.doctags", "chunk_id": 36, "source_chunk_idxs": [36], "num_tokens": 424, "text": "References\n- 40. McCarthy JJ, Andrews JL, McDearmon EL, et al. Identification of the circadian transcriptome in adult mouse skeletal muscle. Physiol Genomics. 2007;31(1):86-95. https://doi.org/10.1152/physiolgenomics.00066.2007.\n- 41. Gutierrez-Monreal MA, Harmsen JF, Schrauwen P, Esser KA. Ticking for metabolic health: the skeletal muscle clocks. Obes Silver Spring Md. 2020;28(Suppl 1):S4654. https://doi.org/10.1002/oby.22826.\n- 42. Schroder EA, Harfmann BD, Zhang X, et al. Intrinsic muscle clock is necessary for musculoskeletal health. J Physiol. 2015;593(24):5387-404. https://doi.org/10. 1113/JP271436.\n- 43. Dvar KA. Ciciliot S. Wright LE, et al. Muscle insulin sensitivity and glucose metabolism are controlled by the intrinsic muscle clock. Mol Metab. 2014;3(1):29-41. https://doi.org/10.1016/j.molmet.2013.10.005.\n- 44. Dyar KA, Hubert MJ, Mir AA, et al. Transcriptional programming of lipid and amino acid metabolism by the skeletal muscle circadian clock. PLoS Biol. 2018;16(8):e2005886. https://doi.org/10.1371/journal. pbio.2005886.\n- 45. Ehlen JC, Brager AJ, Bags J, et al. Bmal1 function in skeletal muscle regulates sleep. Elife. 2017;6:e26557. https://doi.org/10.7554/eLife.26557.", "doc_items_refs": ["#/texts/172", "#/texts/173", "#/texts/174", "#/texts/175", "#/texts/176", "#/texts/177"], "page_nos": [], "uuid": "025ff27c-d656-4ca2-a75f-1c1025099b1f"}
{"doc_id": "2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975.doctags", "chunk_id": 37, "source_chunk_idxs": [37], "num_tokens": 434, "text": "References\n- 46. Kondratov RV, Kondratova AA, Gorbacheva VY, Vykhovanets OV, Antoch MP. Early aging and agederelated pathologies in mice deficient in BMAL1, the core component of the circadian clock. Genes Dev. 2006;20(14):1868-73. https://doi.org/10.1101/gad.14322 06.\n- 47. Gutierrez-Monreal MA, Wolff CA, Rijos EE, et al. Targeted Bmal1 restoration in muscle prolongs lifespan with systemic health effects in aging model. JCI Insight. 2024;9(22):e174007. https://doi.org/10.1172/jci.insight. 174007.\n- 48. Harfmann BD, Schroder EA, Kachman MT, Hodge BA, Zhang X, Esser KA. Muscle-specific loss of Bmal1 leads to disrupted tissue glucose metabolism and systemic glucose homeostasis. Skelet Muscle. 2016;6(1):12. https:// doi.org/10.1186/s13395-016-0082-x.\n- 49. Watanabe S, Sudo Y, Makino T, et al. Skeletal muscle releases extracellular vesicles with distinct protein and microRNA signatures that function in the muscle microenvironment. PNAS Nexus. 2022;1(4):pgac173. https:// doi.org/10.1093/pnasnexus/pgac173.\n- 50. Mancinelli R, Checcaglini F, Coscia F, Gigliotti P, Fulle S, Fanò-Illic G. Biological aspects of selected myokines in skeletal muscle: focus on aging. Int J Mol Sci. 2021;22(16):8520. https://doi.org/10.3390/ijms22168520.", "doc_items_refs": ["#/texts/178", "#/texts/179", "#/texts/180", "#/texts/181", "#/texts/182"], "page_nos": [], "uuid": "9e13af56-f52d-46b8-9928-f9e70cc6c077"}
{"doc_id": "2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975.doctags", "chunk_id": 38, "source_chunk_idxs": [38], "num_tokens": 185, "text": "References\n- 51. Görgens SW, Eckardt K, Jensen J, Drevon CA, Eckel J. Chapter thirteen - exercise and regulation of adipokine and myokine production. In: Bouchard C, ed. Progress in Molecular Biology and Translational Science. Vol 135. Molecular and Cellular Regulation of Adaptation to Exercise. Academic Press; 2015:313-336. https://doi. org/10.1016/bs.mbts.2015.07.002\n- 52. Bettcher BM, Neuhaus J, Wynn MJ, et al. Increases in a pro-inflammatory chemokine, MCP-1, are related to decreases in memory over time. Front Aging Neurosci. 2019;11:25. https://doi.org/10.3389/fnagi.2019.00025.", "doc_items_refs": ["#/texts/183", "#/texts/184"], "page_nos": [], "uuid": "4c47892c-8688-4ee6-a0f7-6d2a3eb5c802"}
{"doc_id": "2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975.doctags", "chunk_id": 39, "source_chunk_idxs": [39], "num_tokens": 456, "text": "References\n- 53. Bettcher BM, Fitch R, Wynn MJ, et al. Mcp-1 and eotaxin-1 selectively and negatively associate with memory in MCI and Alzheimer's disease dementia phenotypes. Alzheimer's &amp; Dementia: Diagnosis, Assessment &amp; Disease Monitoring. 2016;3:91-7. https://doi.org/10. 1016/j.dadm.2016.05.004.\n- 54. Westin K, Buchhave P, Nielsen H, Minthon L, Janciauskiene S, Hansson O. CCL2 is associated with a faster rate of cognitive decline during early stages of Alzheimer's disease. PLoS ONE. 2012;7(1):e30525. https://doi.org/ 10.1371/journal.pone.0030525.\n- 55. Schipke CG, Menne F, Rubow S, Sigle JP, Peters O, Grimmer T. Value of a panel of 6 serum biomarkers to differentiate between healthy controls and mild cognitive impairment due to Alzheimer disease. Alzheimer Dis Assoc Discord. 2020;34(4):318-24. https://doi.org/10. 1097/WAD.0000000000000397.\n- 56. Shen XN, Niu LD, Wang YJ, et al. Inflammatory markers in Alzheimer's disease and mild cognitive impairment: a meta-analysis and systematic review of 170 studies. J Neurol Neurosurg Psychiatry. 2019;90(5):590-8. https:// doi.org/10.1136/jnnp-2018-319148.\n- 57. Galimberti D, Fenoglio C, Lovati C, et al. Serum MCP-1 levels are increased in mild cognitive impairment and mild Alzheimer's disease. Neurobiol Aging. 2006;27(12):1763-8. https://doi.org/10.1016/j.neuro biolaging.2005.10.007.", "doc_items_refs": ["#/texts/186", "#/texts/187", "#/texts/188", "#/texts/189", "#/texts/190"], "page_nos": [], "uuid": "d924db84-9d55-4c36-ab91-33eb6bca9a6c"}
{"doc_id": "2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975.doctags", "chunk_id": 40, "source_chunk_idxs": [40], "num_tokens": 506, "text": "References\n- 58. Nordgen K, Kirsebom BE, Henjum K, et al. Glial activation and inflammation along the Alzheimer's disease continuum. J Neuroinflammation. 2019;16(1):46. https:// doi.org/10.1186/s12974-019-1399-2.\n- 59. Lee WJ, Liao YC, Wang YF, Lin IF, Wang SJ, Fuh JL. Plasma MCP-1 and cognitive decline in patients with Alzheimer's disease and mild cognitive impairment: a two-year follow-up study. Sci Rep. 2018;8(1):1280. https://doi.org/10.1038/s41598-018-19807-y.\n- 60. Xu L, Dong Q, Xu L, Zou W, Li H. The MCP-1 A-2518G polymorphism increases the risk of Alzheimer's disease: a case-control study. Neurosci Lett. 2021;749:135710. https://doi.org/10.1016/j.neulet.2021.135710.\n- 61. Clark C, Dayon L, Masoodi M, Bowman GL, Popp J. An integrative multi-omics approach reveals new central nervous system pathway alterations in Alzheimer's disease. Alzheimers Res Ther. 2021;13(1):71. https:// doi.org/10.1186/s13195-021-00814-7.\n- 62. Bettcher BM, Johnson SC, Fitch R, et al. Cerebrospinal fluid and plasma levels of inflammation differentially relate to CNS markers of Alzheimer's disease pathology and neuronal damage. J Alzheimers Dis. 2018;62(1):38597. https://doi.org/10.3233/JAD-170602.\n- 63. Economos A, Wright CB, Moon YP, et al. Interleukin 6 plasma concentration associates with cognitive decline: the Northern Manhattan Study. Neuroepidemiology. 2013;40(4):253-9. https://doi.org/10.1159/000343276.", "doc_items_refs": ["#/texts/191", "#/texts/192", "#/texts/193", "#/texts/194", "#/texts/195", "#/texts/196"], "page_nos": [], "uuid": "853d8b65-9fc2-4e9b-bcaa-6888e5e7d8c9"}
{"doc_id": "2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975.doctags", "chunk_id": 41, "source_chunk_idxs": [41], "num_tokens": 471, "text": "References\n- 64. Mooijaart SP, Sattar N, Trompe S, et al. Circulating interleukin-6 concentration and cognitive decline in old age: the PROSPER study. J Intern Med. 2013;274(1):7785. https://doi.org/10.1111/joim.12052.\n- 65. Yaffe K, Lindquist K, Penninx BW, et al. Inflammatory markers and cognition in well-functioning\n- African-American and white elders. Neurology. 2003;61(1):76-80. https://doi.org/10.1212/01.WNL. 0000073620.4204.7D.\n- 66. Metti AL, Aizenstein H, Yaffe K, et al. Trajectories of peripheral interleukin-6, structure of the hippocampus, and cognitive impairment over 14 years in older adults. Neurobiol Aging. 2015;36(11):3038-44. https://doi.org/ 10.1016/j.neurobiolaging.2015.07.025.\n- 67. Gökçe E, Gün N. The relationship between exercise, cathepsin B, and cognitive functions: systematic review. Percept Mot Skills. 2023;130(4):1366-85. https://doi. org/10.1177/00315125231176980.\n- 68. Gaitán JM, Moon HY, Stremlau M, et al. Effects of aerobic exercise training on systemic biomarkers and cognition in late middle-aged adults at risk for Alzheimer's disease. Front Endocrinol. 2021;12: 660181. https://doi. org/10.3389/fendo.2021.660181.\n- 69. Yu Q, Zhang Z, Herold F, et al. Physical activity, cathepsin B, and cognitive health. Trends Mol Med. 2025. https://doi.org/10.1016/j.molmed.2024.12.010.", "doc_items_refs": ["#/texts/197", "#/texts/198", "#/texts/199", "#/texts/200", "#/texts/201", "#/texts/202", "#/texts/203"], "page_nos": [], "uuid": "dba8a5e6-0e52-49e1-82b6-9f1fd81256fb"}
{"doc_id": "2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975.doctags", "chunk_id": 42, "source_chunk_idxs": [42], "num_tokens": 508, "text": "References\n- 70. Tanaka T, Lavery R, Varma V, et al. Plasma proteomic signatures predict dementia and cognitive impairment. Alzheimers Dement (N Y). 2020. https://doi.org/10.1002/trc2.12018.\n- 71. Newman AB, Patel S, Kizer JR, et al. Evaluation of associations of growth differentiation factor-11, growth differentiation factor-8, and their binding proteins follatistin and follatistin-like protein-3 with dementia and cognition. J Gerontol A Biol Sci Med Sci. 2023. https://doi. org/10.1093/genona/glad019.\n- 72. Küster OC, Laptopskaya D, Fessler P, et al. Novel bloodbased biomarkers of cognition, stress, and physical or cognitive training in older adults at risk of dementia: preliminary evidence for a role of BDNF, irisin, and the kynureine pathway. J Alzheimers Dis. 2017;59(3):1097111. https://doi.org/10.3233/JAD-170447.\n- 73. de Freitas GB, Lourenco MV, De Felice FG. Protective actions of exercise-related FNDC5/Irisin in memory and Alzheimer's disease. J Neurochem. 2020;155(6):602-11. https://doi.org/10.1111/jnc.15039.\n- 74. Pignataro P, Dicarlo M, Zerlotin R, et al. FNDC5/irisin system in neuroinflammation and neurodegenerative diseases: update and novel perspective. Int J Mol Sci. 2021;22(4):1605. https://doi.org/10.3390/ijms22041605.\n- 75. Lin H, Yuan Y, Tian S, et al. In addition to poor glycemic control, a high level of irisin in the plasma portents early cognitive deficits clinically in Chinese patients with type 2 diabetes mellitus. Front Endocrinol. 2019;10:634. https://doi.org/10.3389/fendo.2019.00634.", "doc_items_refs": ["#/texts/204", "#/texts/205", "#/texts/206", "#/texts/207", "#/texts/208", "#/texts/209"], "page_nos": [], "uuid": "6df7ff06-65e7-41b8-bcfa-88e4bc8e5985"}
{"doc_id": "2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975.doctags", "chunk_id": 43, "source_chunk_idxs": [43], "num_tokens": 217, "text": "References\n- 76. Wrann CD. FNDC5/irisin - their role in the nervous system and as a mediator for beneficial effects of exercise on the brain. Brain Plast. 2015;1(1):55-61. https://doi.org/ 10.3233/BPL-150019.\n- 77. Lourenco MV, Ribeiro FC, Sudo FK, et al. Cerebrospinal fluid irisin correlates with amyloidβ, BDNF, and cognition in Alzheimer's disease. Alzheimer's &amp; Dementia: Diagnosis, Assessment &amp; Disease Monitoring. 2020;12(1):e12034. https://doi.org/10.1002/dad2.12034.\n- 78. Matthews VB, Åström MB, Chan MHS, et al. Brainderived neurotrophic factor is produced by skeletal muscle cells in response to contraction and enhances fat oxidation via activation of AMP-activated protein kinase.", "doc_items_refs": ["#/texts/210", "#/texts/211", "#/texts/212"], "page_nos": [], "uuid": "9317ca5f-5e86-430a-954e-94c6c5abb251"}
{"doc_id": "2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975.doctags", "chunk_id": 44, "source_chunk_idxs": [44], "num_tokens": 496, "text": "References\n- dementia scores in Alzheimer disease. Ann Neurol. 2024;96(1):61-73. https://doi.org/10.1002/ana.26946.\n- 93. Kim E, Kim H, Jedrychowski MP, et al. Irisin reduces amyloidβ by inducing the release of nerulipysin from astrocytes following downregulation of ERK-STAT3 signaling. Neuron. 2023;111(22):3619-3633.e8. https:// doi.org/10.1016/j.neuron.2023.08.012.\n- 94. Chen K, Wang K, Wang T. Protective effect of irisin against Alzheimer's disease. Front Psychiatry. 2022. https://doi.org/10.3389/fpsyt.2022.967683.\n- 95. Rasmussen P, Brassard P, Adser H, et al. Evidence for a release of brain-derived neurotrophic factor from the brain during exercise. Exp Physiol. 2009;94(10):1062-9. https://doi.org/10.1113/expphysiol.2009.048512.\n- 96. Rosa E, Mahendam S, Ke YD, Ittner LM, Ginsberg SD, Fahnestock M. Tau downregulates BDNF expression in animal and cellular models of Alzheimer's disease. Neurobiol Aging. 2016;48:135-42. https://doi.org/10.1016/j. neurobiolaging.2016.08.020.\n- 97. Tanila H. The role of BDNF in Alzheimer's disease. Neurobiol Dis. 2017;97:114-8. https://doi.org/10.1016/j. nbd.2016.05.008.\n- Sahu A, Clemens ZJ, Shinde SN, et al. Regulation of aged skeletal muscle regeneration by circulating extracellular vesicles. Nat Aging. 2021;1(12):1148-61. https:// doi.org/10.1038/s43587-021-00143-2.", "doc_items_refs": ["#/texts/216", "#/texts/217", "#/texts/218", "#/texts/219", "#/texts/220", "#/texts/221", "#/texts/222"], "page_nos": [], "uuid": "011c2459-bece-47e4-b948-5230413e9632"}
{"doc_id": "2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975.doctags", "chunk_id": 45, "source_chunk_idxs": [45], "num_tokens": 479, "text": "References\n- 98. Sahu A, Clemens ZJ, Shinde SN, et al. Regulation of aged skeletal muscle regeneration by circulating extracellular vesicles. Nat Aging. 2021;1(12):1148-61. https:// doi.org/10.1038/s43587-021-00143-2.\n- 99. Fitz NF, Sahu A, Lu Y, Ambrosio F, Lefterov I, Koldamova R. Extracellular vesicles in young serum contribute to the restoration of age-related brain transcriptomes and cognition in old mice. Int J Mol Sci. 2023;24(16): 12550. https://doi.org/10.3390/ijms241612550.\n- 100. Bean AC, Sahu A, Piechocki C, et al. Neuromuscular electrical stimulation enhances the ability of serum extracellular vesicles to regenerate aged skeletal muscle after injury. Exp Gerontol. 2023;177:112179. https://doi.org/ 10.1016/j.exger.2023.112179.\n- 101. Liu X, Yao Z, Zhang L, Shyh-Chang N. Muscle-derived bioactive factors: MyoEvYs and myokines. Cell Prolif. 2025;58(3):e13801. https://doi.org/10.1111/cpr.13801.\n- 102. Kumar A, Nader MA, Deep G. Emergence of extracellular vesicles as \"liquid biopsy\" for neurological disorders: boom or bust. Pharmacol Rev. 2024;76(2):199-227. https://doi.org/10.1124/pharmrev.122.000788.\n- 103. Kumar A, Su Y, Sharma M, et al. Microrna expression in extracellular vesicles as a novel blood-based biomarker for Alzheimer's disease. Alzheimers Dement. 2023;19(11):4952-66. https://doi.org/10.1002/alz.13055.", "doc_items_refs": ["#/texts/223", "#/texts/224", "#/texts/225", "#/texts/226", "#/texts/227", "#/texts/228"], "page_nos": [], "uuid": "446b23d2-4423-4f75-9dea-c0b06d6ed7ba"}
{"doc_id": "2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Muscle-brain_crosstalk_as_a_driver_of_brain_health_in_aging__W4413139975.doctags", "chunk_id": 46, "source_chunk_idxs": [46], "num_tokens": 449, "text": "References\n- 104. Norman M, Shamhi-shah A, D'Amaddo SC, et al. Toward identification of markers for brain-derived extracellular vesicles in cerebrospinal fluid: a large-scale, unbiased analysis using proximity extension assays. J Extracell Vesicles. 2025;14(3):e70052. https://doi.org/10.1002/ jev2.70052.\n- 105. Xu J, Fu SN, Hug F. Age-related increase in muscle stiffness is muscle length dependent and associated with muscle force in senior females. BMC Musculoskeleton Disord. 2021;22(1):829. https://doi.org/10.1186/ s12891-021-0459-8.\n- 106. Jack CR Jr., Andrews JS, Beach TG, et al. Revised criteria for diagnosis and staging of Alzheimer's\ndisease: Alzheimer's Association workgroup. Alzheimers Dement. 2024;20(8):5143-69. https://doi.org/10.1002/ alz.13859.\n- 107. Nieland L, Mahjoum S, Grandell E, Breyne K, Breakeafie XO. Engineered EVs designed to target diseases of the CNS. J Controlled Release. 2023;356:493-506. https://doi.org/10.1016/j.jconrel.2023.03.009.\n- 108. Simon T, Jackson E, Giamas G. Breaking through the glioblastoma micro-environment via extracellular\nvesicles. Oncogene. 2020;39(23):4477-90. https://doi. org/10.1038/s41388-020-1308-2.\nPublisher'sNote Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations.\n&lt;!-- image --&gt;", "doc_items_refs": ["#/texts/229", "#/texts/230", "#/texts/231", "#/texts/233", "#/texts/234", "#/texts/235", "#/texts/236", "#/texts/237", "#/pictures/3"], "page_nos": [1], "uuid": "8865e489-98a1-4cb8-b32b-ba4a2622ecb7"}
