{"doc_id": "2025__Sensitivity_and_specificity_of_the_Montreal_cognitive_assessment_using_US_Nation__W4414443841", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Sensitivity_and_specificity_of_the_Montreal_cognitive_assessment_using_US_Nation__W4414443841.doctags", "chunk_id": 0, "source_chunk_idxs": [0, 1, 2], "num_tokens": 465, "text": "RESEARCH\nOpen Access\n\nSensitivity and specificity of the Montreal cognitive assessment using U.S. National Alzheimer coordinating centre uniform data set: a retrospective analysis of 16,309 participants\nYoussef A. Ismail$^{1,2*}$, Huda A. Auf$^{1}$, Shahd A. Sadik$^{1}$, Nada M. Ahmed$^{1}$ and Yasmeen Ali$^{1}$\n\nAbstract\nBackground Neurodegenerative diseases (NDDs), like Alzheimer's disease, are characterized by progressive cognitive decline, with limited effective treatments available. Several screening tools are available for diagnosing various types of dementia, including the Montreal Cognitive Assessment (MoCA), the Mini-Mental State Examination (MMSE), and the Dementia Rating Scale (DRS).\nObjective This study aims to evaluate the sensitivity and specificity of MoCA to determine its suitability as a screening tool.\nMethods This study analyzed data from participants aged 55 and older, recruited from U.S. Alzheimer's Disease Research Centers (ADRCs), using a National Alzheimer Coordinating Center Uniformed Data Set (NACC-UDS). Participants were classified based on patient records into demented and non-demented groups, with the nondemented group further categorized into those with normal cognition and cognitive impairment (CI). This analysis examines the correlation between these classifications and MoCA scores.\nResults This study utilized an initial dataset of 188,700 participant records from NACC. After applying inclusion criteria, 16,309 participants were included. The participants had complete diagnostic information, clinician-conducted cognitive assessments, and MoCA scores. The participants were categorized into three groups: 7,624 with no cognitive impairment (NoCI), 4,893 with CI, and 3,792 with dementia. This study focused on MoCA scores, revealing significant differences among diagnostic groups. ROC analysis demonstrated the MoCA's strong diagnostic capability, with AUC values significantly above 0.5 ( P\n*Correspondence: Youssef A. Ismail youssefesmail1321@gmail.com\nFull list of author information is available at the end of the article\n&lt;!-- image --&gt;", "doc_items_refs": ["#/texts/2", "#/texts/4", "#/texts/6", "#/texts/7", "#/texts/8", "#/texts/9", "#/texts/10", "#/texts/11", "#/pictures/0"], "page_nos": [1], "uuid": "3397ee0a-39d4-462f-8a9b-f997fd6689c7"}
{"doc_id": "2025__Sensitivity_and_specificity_of_the_Montreal_cognitive_assessment_using_US_Nation__W4414443841", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Sensitivity_and_specificity_of_the_Montreal_cognitive_assessment_using_US_Nation__W4414443841.doctags", "chunk_id": 1, "source_chunk_idxs": [3], "num_tokens": 368, "text": "Abstract\n© The Author(s) 2025. Open Access This article is licensed under a Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International License, which permits any non-commercial use, sharing, distribution and reproduction in any medium or format, as long as you give appropriate credit to the original author(s) and the source, provide a link to the Creative Commons licence, and indicate if you modified the licensed material. You do not have permission under this licence to share adapted material derived from this article or parts of it. The images or other third party material in this article are included in the article's Creative Commons licence, unless indicated otherwise in a credit line to the material. If material is not included in the article's Creative Commons licence and your intended use is not permitted by statutory regulation or exceeds the permitted use, you will need to obtain permission directly from the copyright holder. To view a copy of this licence, visit http://creati vecommons.org/licenses/by-nc-nd/4.0/.\n&lt;!-- image --&gt;\nAlthough PPV was generally low, the high NPV across comparisons underscores the MoCA's effectiveness in ruling out cognitive impairment.\nConclusion The study confirms MoCA as an effective tool for detecting dementia, showing 83% sensitivity and 82% specificity at a cutoff value of 21. With a high NPV of 94%, MoCA is particularly reliable for ruling out dementia. Its ability to detect MCI is moderate, with a sensitivity of 77.3% at cutoff of 24 among normal population.\nKeywords Alzheimer's disease (AD), Mild cognitive impairment (MCI), Montreal cognitive assessment (MoCA), Diagnostic tools", "doc_items_refs": ["#/texts/12", "#/pictures/1", "#/texts/16", "#/texts/17", "#/texts/18"], "page_nos": [1], "uuid": "a081c76b-1e75-4a6a-bb3a-c7e7c70edb59"}
{"doc_id": "2025__Sensitivity_and_specificity_of_the_Montreal_cognitive_assessment_using_US_Nation__W4414443841", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Sensitivity_and_specificity_of_the_Montreal_cognitive_assessment_using_US_Nation__W4414443841.doctags", "chunk_id": 2, "source_chunk_idxs": [4], "num_tokens": 493, "text": "Introduction\nNeurodegenerative diseases (NDDs) are disorders characterized by irreversible damage to nervous tissue and progressive degeneration to mental status, and according to DSM-5 diagnostic criteria of dementia, it could be due to more than one etiologic subtype, such as Alzheimer's Disease (AD) or Vascular Dementia (VD), being first and second most common causes of dementia [1, 2, 3, 4, 5].\nAccording to DSM-5 [4], Dementia has been classified as major neurocognitive disorder and it typically presented with substantial impairment in at least one cognitive domain, interfering with day-to-day activities and if the impairment was moderate and yet to interfere severely with activities, it would be diagnosed as mild neurocognitive disorder, corresponding to Mild Cognitive Impairment (MCI) [4, 5]. Despite continuous medical research efforts to discover effective treatments for NDDs the results have been disappointing [3].\nThere are many screening tools available, but the Saint Louis University Mental Status Examination (SLUMS) [6], a 30-point questionnaire, is highly validated for screening both MCI and dementia. The Montreal Cognitive Assessment (MoCA) [7] also can be used but the Mini-Mental State Examination (MMSE) [8] and the Dementia Rating Scale (DRS) [9] are not recommended in detecting MCI and early-stage dementia [10, 11, 12, 13]. Both, MoCA and MMSE, are accurate in detecting AD, but MoCA has been reported superior to MMSE in identifying MCI [12].\nAccurate assessment of general cognitive ability in older adults is crucial to identify those at higher risk of developing dementia and to evaluate the efficacy of clinical trials conducted on individuals living with dementia. The MoCA is a neuropsychological screening tool designed to measure cognitive functioning and decline. It effectively distinguishes between different states of cognitive impairment, but this is not the same as distinguishing between the etiologies, and is standardized for individuals aged 55-85 [14, 15]. It is scored on a 30-point scale and can be administered in 10 min. The MoCA evaluates short-term memory, visuospatial/executive functioning, attention, concentration, working memory, language, and orientation to place and time [14].", "doc_items_refs": ["#/texts/20", "#/texts/21", "#/texts/22", "#/texts/23"], "page_nos": [1], "uuid": "08cb47a2-2cd3-459d-90f6-65be391e329c"}
{"doc_id": "2025__Sensitivity_and_specificity_of_the_Montreal_cognitive_assessment_using_US_Nation__W4414443841", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Sensitivity_and_specificity_of_the_Montreal_cognitive_assessment_using_US_Nation__W4414443841.doctags", "chunk_id": 3, "source_chunk_idxs": [5, 6], "num_tokens": 350, "text": "Introduction\nA new version of the MoCA, called MoCA-Basic (MoCA-B), was developed to overcome the limitations of the original MoCA for those with low education. Additionally, the newly introduced MoCA Memory Index Score helps clinicians predict which participants with MCI are most likely to advance to dementia [16, 17].\nIn a Delphi Global Consensus conducted in 2023, the MoCA was ranked the top tool out of 53 for assessing cognitive abilities in clinical practice [18, 19]. Studies compared the cognitive assessment capabilities of the MoCA and the MMSE, finding that MoCA is more effective at detecting dementia. In contrast to a 2015 study that considered the MMSE the best and most frequently used screening tool for evaluating cognitive impairment, other studies found that the MoCA is more effective at detecting dementia [16, 20].\nIn order to address previous studies' limitations of relatively small sample size and to be more comprehensive, this study aims to evaluate the sensitivity and specificity of the Montreal Cognitive Assessment (MoCA) to determine its suitability as a screening tool in screening programs.\n\nParticipants\nVolunteers recruited from Alzheimer's Disease Research Centers (ADRCs) funded by the National Institute on Aging across the United States participated in the study. The National Alzheimer's Coordinating Center (NACC) maintains a comprehensive database of neuropathologic and clinical data for these participants. To be included in the analysis, participants needed to be 55 years or older and received a diagnosis at their initial visit. The publicly available dataset from NACC was utilized for the study. The inclusion criteria focused on initial visit evaluations and a complete dataset for diagnostic and clinical investigations, with particular emphasis on the MoCA.", "doc_items_refs": ["#/texts/24", "#/texts/25", "#/texts/26", "#/texts/29"], "page_nos": [1], "uuid": "b498d193-f36c-4a60-99d9-5350b9a00178"}
{"doc_id": "2025__Sensitivity_and_specificity_of_the_Montreal_cognitive_assessment_using_US_Nation__W4414443841", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Sensitivity_and_specificity_of_the_Montreal_cognitive_assessment_using_US_Nation__W4414443841.doctags", "chunk_id": 4, "source_chunk_idxs": [7, 8], "num_tokens": 277, "text": "Diagnostic data\nAll participants underwent evaluation with the MoCA, conducted by a trained research assistant or psychiatric nurse practitioner independently of the diagnostic process. The MoCA covers several cognitive domains, such as executive function, visuospatial skills, naming,\nshort-term memory, attention and working memory, language, concentration, verbal abstraction, and orientation. The test takes approximately 10 min to complete, with a maximum score of 30 indicating flawless cognitive performance. A score below 26 was the original recommended cutoff for identifying cognitive impairment (CI).\n\nReference test\nThe final diagnosis was made during multidisciplinary team meetings involving an experienced psychiatrist, neuropsychologist, and geriatrician. The team used a combination of clinical assessments, cognitive tests, and participant history to evaluate each case. Based on these assessments, they determined if the participant met the criteria for dementia, or not. The non-demented individuals been further classified into normal cognition or not. Cognitive Impairment (CI) was characterized by noticeable cognitive decline that did not impact daily activities, which was assessed by Functional Activities Questionnaire (FAQ). In contrast, dementia involved more severe and persistent cognitive decline, affecting daily functioning and necessitating intervention. Participants with no observable impairment were classified as cognitively normal. This collaborative process ensured a comprehensive and accurate diagnosis, reflecting the complex nature of cognitive health.", "doc_items_refs": ["#/texts/31", "#/texts/34", "#/texts/36"], "page_nos": [1], "uuid": "c59c9962-22f1-432b-bbaa-66c23268c548"}
{"doc_id": "2025__Sensitivity_and_specificity_of_the_Montreal_cognitive_assessment_using_US_Nation__W4414443841", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Sensitivity_and_specificity_of_the_Montreal_cognitive_assessment_using_US_Nation__W4414443841.doctags", "chunk_id": 5, "source_chunk_idxs": [9, 10, 11], "num_tokens": 422, "text": "Statistical analysis\nData cleaning was conducted on MS Excel 2019, and statistical analyses were conducted using Jamovi 2.3.28 and MedCalc. The chi-squared test was used to compare categorical variables such as sex, race, marital status, level of independence, and history of CI and depression over the past two years among the groups with dementia, CI, or no cognitive impairment (NoCI). The Kruskal-Wallis's test was employed to compare continuous variables such as age, years of education, GCDR, and MoCA scores, followed by post hoc test.\nTo evaluate the diagnostic accuracy of the MoCA, receiver operating characteristic (ROC) analysis was used to calculate the area under the curve (AUC). Different ROC curves were generated to distinguish between dementia and non-dementia cases and to identify CI in clinical settings. Positive predictive value (PPV) and negative predictive value (NPV) were calculated based on the \"optimal\" cutoff scores determined by the Youden J index.\n\nStudy groups\nThe initial NACC dataset included a total of 188,700 longitudinal participant data. The selection process was based on inclusion criteria of; initial visit cohort and informed consent for research, which resulted in\nexcluding 137,738 participant data being follow-up visits, and complete data cohort, which resulted in excluding 34,653 participant data due to missing values regarding either MoCA or definitive diagnosis. 16,309 participant data, who had complete records of diagnosis information, cognitive assessment by clinician and MoCA score, were included in the study. According to the diagnosis information available, the included participants were classified according to their diagnosis of cognition to; 7624 no cognitive impairment (NoCI) (patients with other conditions other than CI and found in the same database), 4893 MCI and 3792 demington (Fig. 1). This final dataset provided a robust foundation for analyzing the clinical and cognitive characteristics of the study population.\n\nDemographic findings\nWithin the referred participants, there was a significant difference in age ( P", "doc_items_refs": ["#/texts/38", "#/texts/39", "#/texts/42", "#/texts/44", "#/texts/46"], "page_nos": [1], "uuid": "f93c1f4d-fb8f-408f-b929-b503dba79c5d"}
{"doc_id": "2025__Sensitivity_and_specificity_of_the_Montreal_cognitive_assessment_using_US_Nation__W4414443841", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Sensitivity_and_specificity_of_the_Montreal_cognitive_assessment_using_US_Nation__W4414443841.doctags", "chunk_id": 6, "source_chunk_idxs": [12], "num_tokens": 461, "text": "MoCA outcome\nThe median MoCA scores differed significantly between groups; the differences in average MoCA scores between the individual referred groups were significant ( P\nThe results of the ROC analysis, for clinical situations, are shown in (Fig. 2). Table 2 displays the AUCs of these and additional analyses, as well as their sensitivity and specificity at the literature-recommended cutoff scores of 26 and 21. All AUCs were significantly different from 0.5 (no diagnostic accuracy) ( P\nFor the original suggested cutoff score of 26 to discriminate MCI from NoCI, the sensitivity and specificity are 53% and 87%, respectively (in the original article 90% and 87%) [21]. A cutoff score for diagnosing dementia is still under debate but is often set around 21 [22, 23, 24], which in our study results in a sensitivity of 83%. The specificity and sensitivity were calculated for different scores of the MoCA to find the best cutoff score for our population [Table 3].\nThe optimal cutoff scores against NoCI as calculated by the Youden index were less than 24 for detecting MCI, sensitivity 77% (95% CI, 76-78), specificity 69% (95% CI, 67-69), cutoff scores against MCI as calculated by the Youden index were less than 19 for detecting dementia, sensitivity 72% (95% CI, 70-73), specificity 80% (95% CI,\nFigure caption: Fig. 1 Flowchart referred patients and study selection criteria. CI: cognitive impairment; NoCI: no cognitive impairment; MoCA; Montreal Cognitive Assessment\n79-81), and cutoff scores against NoDem as calculated by the Youden index were less than 21 for detecting dementia, sensitivity 83% (95% CI, 82-85), specificity 82% (95% CI, 81-83) [Table 4].\nThe PPV and NPV were calculated [Table 5] for the scores with the highest computed Youden index between each pair of groups. The PPV was low in almost all situations (except cutoff score of 19 between dementia and NoCI) whereas the NPV was high in all situations.", "doc_items_refs": ["#/texts/48", "#/texts/49", "#/texts/50", "#/texts/51", "#/pictures/2", "#/texts/56", "#/texts/57"], "page_nos": [1], "uuid": "a3ad264d-e990-46c1-ac15-096ea70bb6e9"}
{"doc_id": "2025__Sensitivity_and_specificity_of_the_Montreal_cognitive_assessment_using_US_Nation__W4414443841", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Sensitivity_and_specificity_of_the_Montreal_cognitive_assessment_using_US_Nation__W4414443841.doctags", "chunk_id": 7, "source_chunk_idxs": [13], "num_tokens": 355, "text": "Discussion\nIn this retrospective study, patients with dementia were significantly older than other groups without. There were more female participants in each group, which is representative of the old age psychiatry population.\nIt was found that the prevalence of dementia rises as individuals become older, as demonstrated by a comprehensive review that found that about one in four adults between 90 and 91 years old are affected [25]. Female participants constituted a larger portion in each category. The NACC cohort may be subject to sampling biases, as women are often more likely to participate in studies, potentially due to caregiving roles or other factors [26]. In contrast, an American study revealed that males are more prone to CI and dementia [27].\nThe study demonstrated that, over the past two years, active depression levels were elevated in all groups, which was statistically significant, with higher levels of depression in more cognitive-impaired population, and with highest levels observed in individuals with dementia (33%).\nThis result indicates that there is a close connection between them, emphasizing the strong ties between emotions and cognitive health. This finding contrasts with prior research as reported that cognitive defects may continue even after the active phase of depression has remitted [28]. On the contrary, Song et al., showed that there is an association between depression and MCI [29]. Furthermore, an observational study revealed that within five years, more than 70% of old participants with pseudodementia developed overt dementia, while only 18% of intact participants did. This clearly illustrates that cognitive impairment in old individuals with depression is a significant predictor of subsequent dementia [30].\nIn this study, the MoCA had a sensitivity of 83% for detecting mild dementia (\n\nTable 1 Baseline characteristics of study participants", "doc_items_refs": ["#/texts/59", "#/texts/60", "#/texts/61", "#/texts/62", "#/texts/63", "#/texts/67", "#/tables/0"], "page_nos": [1], "uuid": "611ce684-09f0-49b8-85a1-4698b5c9e67c"}
{"doc_id": "2025__Sensitivity_and_specificity_of_the_Montreal_cognitive_assessment_using_US_Nation__W4414443841", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Sensitivity_and_specificity_of_the_Montreal_cognitive_assessment_using_US_Nation__W4414443841.doctags", "chunk_id": 8, "source_chunk_idxs": [14], "num_tokens": 507, "text": "Discussion\n|                                                    | Total a N = 16,309   | NoCI b N = 7624   | CI c N = 4893   | Dem d N = 3792   | Statistical Sig. ( p   | Age, Median (IQR)   | 70 (12)   | 69 (10)   | 71 (12)   | 70 (14)   | Sig. (d > c > b)   |\n|----------------------------------------------------|----------------------|-------------------|-----------------|------------------|------------------------|---------------------|-----------|-----------|-----------|-----------|--------------------|\n| Gender                                             |                      |                   |                 |                  | Sig.                   |                     |           |           |           |           |                    |\n| Female, N (%)                                      | 9380 (57.5)          | 4981 (65.33)      | 2527 (51.65)    | 1872 (49.4)      | Sig.                   |                     |           |           |           |           |                    |\n| Race                                               |                      |                   |                 |                  | Sig.                   |                     |           |           |           |           |                    |\n| White, N (%)                                       | 12,387 (76)          | 5532 (72.6)       | 3561 (72.8)     | 3294 (87)        |                        |                     |           |           |           |           |                    |\n| African American, N (%)                            | 2555 (15.7)          | 1343 (17.62)      | 934 (19.1)      | 278 (7.33)       |                        |                     |           |           |           |           |                    |", "doc_items_refs": ["#/tables/0"], "page_nos": [1], "uuid": "eb973ac0-94ed-402e-aad7-7176cd46dee5"}
{"doc_id": "2025__Sensitivity_and_specificity_of_the_Montreal_cognitive_assessment_using_US_Nation__W4414443841", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Sensitivity_and_specificity_of_the_Montreal_cognitive_assessment_using_US_Nation__W4414443841.doctags", "chunk_id": 9, "source_chunk_idxs": [15], "num_tokens": 495, "text": "Discussion\n| American Indian, N (%)                             | 119 (0.7)            | 79 (1.04)         | 33 (0.8)        | 7 (0.2)          |                        |                     |           |           |           |           |                    |\n| Native Hawaiian, N (%)                             | 13 (0.1)             | 6 (0.08)          | 3 (0.06)        | 4 (0.11)         |                        |                     |           |           |           |           |                    |\n| Asian, N (%)                                       | 474 (2.9)            | 252 (3.31)        | 138 (3)         | 84 (2.22)        |                        |                     |           |           |           |           |                    |\n| Multiracial, N (%)                                 | 468 (2.9)            | 266 (3.5)         | 143 (3)         | 59 (1.6)         |                        |                     |           |           |           |           |                    |\n| Unknown, N (%)                                     | 293 (1.8)            | 146 (2)           | 81 (1.7)        | 66 (1.7)         |                        |                     |           |           |           |           |                    |\n| Education, years (IQR)                             | 16 (4)               | 16 (4)            | 16 (4)          | 16 (5)           | Sig. (b > c > d)       |                     |           |           |           |           |                    |\n| Marital Status                                     |                      |                   |                 |                  | Sig.                   |                     |           |           |           |           |                    |\n| Married, N (%)                                     | 10,759 (66)          | 4673 (61)         | 3149 (64)       | 2937 (77.5)      |                        |                     |           |           |           |           |                    |\n| Widowed, N (%)                                     | 1712 (10.5)          | 832 (11)          | 527 (11)        | 353 (9.31)       |                        |                     |           |           |           |           |                    |\n| Divorced, N (%)                                    | 2225 (13.6)          | 1200 (15.74)      | 720 (15)        | 305 (8.01)       |                        |                     |           |           |           |           |                    |\n| Separated, N (%)                                   | 213 (1.3)            | 114 (1.5)         | 70 (1)          | 29 (0.8)         |                        |                     |           |           |           |           |                    |\n| Never Married, N (%)                               | 1025 (6.3)           | 615 (8.1)         | 316 (6.5)       | 94 (2.5)         |                        |                     |           |           |           |           |                    |", "doc_items_refs": ["#/tables/0"], "page_nos": [1], "uuid": "db368839-47c5-4837-a79c-0c5bb56b5695"}
{"doc_id": "2025__Sensitivity_and_specificity_of_the_Montreal_cognitive_assessment_using_US_Nation__W4414443841", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Sensitivity_and_specificity_of_the_Montreal_cognitive_assessment_using_US_Nation__W4414443841.doctags", "chunk_id": 10, "source_chunk_idxs": [16], "num_tokens": 497, "text": "Discussion\n| Domestic Partner, N (%)                            | 299 (1.8)            | 146 (2)           | 88 (2)          | 65 (2)           |                        |                     |           |           |           |           |                    |\n| Unknown, N (%)                                     | 76 (0.5)             | 44 (0.6)          | 23 (0.5)        | 9 (0.24)         |                        |                     |           |           |           |           |                    |\n| Level of Independence                              |                      |                   |                 |                  | Sig.                   |                     |           |           |           |           |                    |\n| Independent, N (%)                                 | 12,570 (77.1)        | 7511 (98.52)      | 4063 (83.04)    | 996 (26.27)      |                        |                     |           |           |           |           |                    |\n| Requires assistance with complex activities, N (%) | 2696 (16.5)          | 72 (0.94)         | 707 (14.45)     | 1917 (51)        |                        |                     |           |           |           |           |                    |\n| Requires assistance with basic activities, N (%)   | 792 (4.9)            | 20 (0.26)         | 79 (1.61)       | 693 (18.3)       |                        |                     |           |           |           |           |                    |\n| Dependent, N (%)                                   | 134 (0.8)            | 0 (0)             | 4 (0.082)       | 130 (3.42)       |                        |                     |           |           |           |           |                    |\n| Unknown, N (%)                                     | 117 (0.7)            | 21 (0.28)         | 40 (0.82)       | 56 (1.5)         |                        |                     |           |           |           |           |                    |\n| Indicator of Mother with Impaired Cognition, N (%) | 5492/16,302          | 2771/4617         | 1600/4893       | 1121/3792        | Sig.                   |                     |           |           |           |           |                    |\n|                                                    | (33.7)               | (60.02)           | (32.7)          | (29.6)           |                        |                     |           |           |           |           |                    |\n| Indicator of Father with Impaired Cognition, N (%) | 2818/16,302          | 1391/4617         | 788/4893        | 639/3792         | Sig.                   |                     |           |           |           |           |                    |\n|                                                    | (17.3)               | (30.13)           | (16.1)          | (17)             | Sig.                   |                     |           |           |           |           |                    |", "doc_items_refs": ["#/tables/0"], "page_nos": [1], "uuid": "baebd4bb-8024-4b51-b8e6-89656f506c4c"}
{"doc_id": "2025__Sensitivity_and_specificity_of_the_Montreal_cognitive_assessment_using_US_Nation__W4414443841", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Sensitivity_and_specificity_of_the_Montreal_cognitive_assessment_using_US_Nation__W4414443841.doctags", "chunk_id": 11, "source_chunk_idxs": [17], "num_tokens": 510, "text": "Discussion\n| Active depression in the last two years, N (%)     | 3876/16,045          | 1330/7517         | 1302/4828       | 1224/3700        | Sig.                   |                     |           |           |           |           |                    |\n|                                                    | (24.16)              | (18)              | (27)            | (33.1)           | (d > c > b)            |                     |           |           |           |           |                    |\n| GCDR, Median (IQR)                                 |                      |                   |                 |                  | Sig.                   |                     |           |           |           |           |                    |\n|                                                    | 0.5 (0.5)            | 0 (0)             | 0.5 (0.5)       |                  | (d > c > b)            |                     |           |           |           |           |                    |\n| MoCA, Median (IQR)                                 |                      |                   |                 |                  | Sig.                   |                     |           |           |           |           |                    |\n|                                                    | 24 (7)               | 27 (3)            | 23 (5)          | 16 (9)           | (b > c > d)            |                     |           |           |           |           |                    |\nData was represented using Median and Interquartile Range (IQR) or using frequency (percentage). All variables were compared between b, c, and d with either chi-square if categorical or Kruskal Walis if numerical, with Dunn test for post hoc analysis. Abbreviations: IQR: interquartile range. CI: cognitive impairment. MoCA: Montreal Cognitive Assessment. NoCI: no cognitive impairment. GCDR: Global Clinical Dementia Rating. Dem: Demented\nmeta-analysis done on 67 studies that MoCA has a sensitivity of 93% [ 31 ]. Additionally, in PDD screening for PDD and PD-MCI, MoCA is better than MMSE due to its better detection of early cognitive changes [ 32 ].\nRegarding identification of CI participants, MoCA showed moderate ability to detect CI with sensitivity of 77% (\nThese findings highlighted its ability to detect CI accurately but also underscored its ability to record high false positive rates with specificity of 69% (\na preferable and efficient tool for screening CI as some studies hinted [ 34 , 35 ].\nAlthough MoCA appears to be an effective screening tool for mild dementia, its diagnostic ability is limited as it showed PPV of only 59% for mild dementia (\nIt is important to note that although the MoCA scale showed limited ability to diagnose dementia, it showed great ability to exclude it (\n&lt;!-- image --&gt;", "doc_items_refs": ["#/tables/0", "#/texts/68", "#/texts/69", "#/texts/70", "#/texts/71", "#/texts/72", "#/texts/73", "#/texts/74", "#/pictures/3"], "page_nos": [1], "uuid": "bb4c4c61-7272-45b6-a71b-ea82c552833d"}
{"doc_id": "2025__Sensitivity_and_specificity_of_the_Montreal_cognitive_assessment_using_US_Nation__W4414443841", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Sensitivity_and_specificity_of_the_Montreal_cognitive_assessment_using_US_Nation__W4414443841.doctags", "chunk_id": 12, "source_chunk_idxs": [18], "num_tokens": 347, "text": "Discussion\n&lt;!-- image --&gt;\nFigure caption: Fig. 2 Results of receiver operating characteristic (ROC) analysis. A , NoCI (normal cognition patients) vs. CI. B , MCI vs. demented patients. C , Demented patients vs. non-demented (NoCI+CI)\nTable 2 Represents the area under the curve, sensitivity and specificity of recommended scores\n\n| Groups   | AUC   | SE    | Cutoff   |         |        |        |\n|----------|-------|-------|----------|---------|--------|--------|\n|          |       |       | Sens     | Spec    | Sens   | Spec   |\n| Dem      | vs.   | NoDem | 0.910    | 0.00266 | 0.9839 | 0.3712 |\n| Dem      | vs.   | CI    | 0.836    | 0.00433 | 0.9839 | 0.1286 |\n| NoCI     | vs.   | CI    | 0.800    | 0.00400 | 0.5269 | 0.8714 |\nNote. Dem: dementia ( n = 3792); NoDem: no dementia (CI+ NoCI; n = 12517); CI: cognitive impairment ( n = 4893); NoCI: referred patients no cognitive impairment ( n = 7624). AUC: area under the curve. SE: standard error. Sens: sensitivity. Spec: specificity", "doc_items_refs": ["#/pictures/4", "#/pictures/5", "#/texts/79", "#/tables/1", "#/texts/80"], "page_nos": [1], "uuid": "83464225-b1c5-4bf5-bec0-2c244fd54d17"}
{"doc_id": "2025__Sensitivity_and_specificity_of_the_Montreal_cognitive_assessment_using_US_Nation__W4414443841", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Sensitivity_and_specificity_of_the_Montreal_cognitive_assessment_using_US_Nation__W4414443841.doctags", "chunk_id": 13, "source_chunk_idxs": [19], "num_tokens": 493, "text": "Discussion\nTable 3 Represents MoCA scores with their sensitivity and specificity analyses\n\n| Cutoff Value a   | Sensitivity %   | Specificity %         | Specificity %   | Specificity %   | Specificity %   |\n|------------------|-----------------|-----------------------|-----------------|-----------------|-----------------|\n|                  |                 | CI + NoCI No Dementia | CI              | NoCI            |                 |\n| Dementia         |                 |                       |                 |                 |                 |\n| 18               | 65.48           | 93.33                 | 85.12           | 58.81           |                 |\n| 19               | 71.84           | 90.85                 | 80.01           | 65.48           |                 |\n| 20               | 77.74           | 87.27                 | 73.10           | 71.84           |                 |\n| 21               | 82.91           | 82.28                 | 64.21           | 77.74           |                 |\n| 22               | 88.61           | 76.18                 | 53.51           | 82.91           |                 |\n| 23               | 92.67           | 68.61                 | 42.47           | 88.61           |                 |\n| 24               | 95.31           | 59.33                 | 31.35           | 92.67           |                 |\n| 25               | 97.26           | 48.77                 | 21.30           | 95.31           |                 |\n| 26               | 98.39           | 37.12                 | 12.86           | 97.26           |                 |\n| CI               |                 |                       |                 |                 |                 |\n| 18               | 98.60           |                       |                 | 14.88           |                 |\n| 19               | 97.81           |                       |                 | 19.99           |                 |\n| 20               | 96.35           |                       |                 | 26.90           |                 |\n| 21               | 93.87           |                       |                 | 35.79           |                 |\n| 22               | 90.73           |                       |                 | 46.49           |                 |\n| 23               | 85.39           |                       |                 | 57.53           |                 |\n| 24               | 77.28           |                       |                 | 68.65           |                 |\n| 25               | 66.40           |                       |                 | 78.70           |                 |\n| 26               | 52.69           |                       |                 | 87.14           |                 |", "doc_items_refs": ["#/texts/84", "#/tables/2"], "page_nos": [1], "uuid": "f30daac5-ebe5-4a0f-888f-e06fff77543a"}
{"doc_id": "2025__Sensitivity_and_specificity_of_the_Montreal_cognitive_assessment_using_US_Nation__W4414443841", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Sensitivity_and_specificity_of_the_Montreal_cognitive_assessment_using_US_Nation__W4414443841.doctags", "chunk_id": 14, "source_chunk_idxs": [20], "num_tokens": 342, "text": "Discussion\nNote. Dem: dementia ( n = 3792); NoDem: no dementia (CI + NoCI; n = 12517); CI: cognitive impairment (n = 4893); NoCI: referred patients no cognitive impairment (n = 7624)\n$^{a}$MoCA below score\nTable 4 Represents summary of diagnostic data between three groups with highest Youden index\n\n| Groups   |       |   Cutoff Value a |   Sens % |   Spec % |   PPV % |   NPV % |\n|----------|-------|------------------|----------|----------|---------|---------|\n| NoCI     | CI    |               24 |       77 |       69 |      79 |      66 |\n| Dem      | CI    |               19 |       72 |       80 |      74 |      79 |\n| Dem      | NoDem |               21 |       83 |       82 |      59 |      94 |\n| Dem      | NoCI  |               22 |       89 |       83 |      83 |      94 |\nNote. Dem: dementia (n = 3792); NoDem: no dementia (CI + NoCI; n = 12517); CI: cognitive impairment (n = 4893); NoCI: referred patients no cognitive impairment (n = 7624). Sens: sensitivity. Spec: specificity. PPV: positive predictive value. NPV: negative predictive value\n$^{a}$MoCA below score", "doc_items_refs": ["#/texts/85", "#/texts/86", "#/texts/87", "#/tables/3", "#/texts/88", "#/texts/89"], "page_nos": [1], "uuid": "81bcb404-5502-422b-83ff-2dbcf488a718"}
{"doc_id": "2025__Sensitivity_and_specificity_of_the_Montreal_cognitive_assessment_using_US_Nation__W4414443841", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Sensitivity_and_specificity_of_the_Montreal_cognitive_assessment_using_US_Nation__W4414443841.doctags", "chunk_id": 15, "source_chunk_idxs": [21], "num_tokens": 431, "text": "Discussion\nTable 5 Represents cutoff scores with the highest Youden index\n\n| Cutoff Value a   | No Dem   | No Dem   | CI      | CI      | NoCI    | NoCI    |\n|------------------|----------|----------|---------|---------|---------|---------|\n|                  | PPV      | NPV      | PPV     | NPV     | PPV     | NPV     |\n|                  | %        | %        | %       | %       | %       | %       |\n| Dem              |          |          |         |         |         |         |\n| 19               |          |          | 74      | 79      |         |         |\n| 95% CI           |          |          | (72-75) | (77-80) |         |         |\n| 21               | 59       | 94       |         |         |         |         |\n| 95% CI           | (58-60)  | (93-95)  |         |         |         |         |\n| 22               |          |          |         |         | 83      | 94      |\n| 95% CI           |          |          |         |         | (81-84) | (93-95) |\n| CI               |          |          |         |         |         |         |\n| 24               |          |          |         |         | 79      | 66      |\n| 95% CI           |          |          |         |         | (78-80) | (65-67) |\nNote. Dem: dementia ( n = 3792); NoDem: no dementia (CI + NoCI; n = 12517); CI: cognitive impairment (n = 4893); NoCI: referred patients no cognitive impairment (n = 7624). PPV: positive predictive value. NPV: negative predictive value. CI: confidence interval\n$^{a}$MoCA below score\nMoCA for dementia diagnosis is as high as 99% highlighting its effectiveness in ruling out dementia [37]. Thus, MoCA can be confidently used to exclude dementia due to its high NPV and its significant accuracy [38].", "doc_items_refs": ["#/texts/90", "#/tables/4", "#/texts/91", "#/texts/92", "#/texts/95"], "page_nos": [1], "uuid": "7a408131-7606-4207-88b3-18bf19739ee8"}
{"doc_id": "2025__Sensitivity_and_specificity_of_the_Montreal_cognitive_assessment_using_US_Nation__W4414443841", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Sensitivity_and_specificity_of_the_Montreal_cognitive_assessment_using_US_Nation__W4414443841.doctags", "chunk_id": 16, "source_chunk_idxs": [22], "num_tokens": 398, "text": "Discussion\nKey finding of this study was that a cutoff score of 21 appeared the optimal threshold for detecting dementia with the highest Youden index. Equally, a Chinese crosssection study done on 7445 participants to determine cutoff scores of MoCA-P (Peking Medical Union College Hospital version of the MoCA) demonstrated that age group (80-89) years old was also 21 [39]. As expected, this used cutoff value succeeded as shown in a cross-section study done on 710 participants [38]. It is important to note that this variation can happen based on the population, setting and population's features that widely vary.\nThe study also exhibited that 24 is the optimal cutoff value to detect CI with maximum Youden index reflecting high effectiveness. It also showed valuable PPV (79%) and NPV (66%) indicating moderate ability to screen and rule out CI.\nThis study has several limitations. Its retrospective design depends on the quality and completeness of existing data, potentially introducing selection bias due to the specific inclusion criteria of participants from ADCs. The generalizability of findings is limited, as the study population may not reflect broader or more diverse groups. A large portion of the initial dataset was excluded, affecting the robustness of results. The identified MoCA cutoff scores may not be universally applicable, and the low PPV of the MoCA for mild dementia suggests limited diagnostic utility in similar prevalence settings. Exclusion of follow-up data prevents assessment of cognitive changes over time, and cultural and ethnic differences in cognitive performance were not addressed, further limiting the generalizability of the findings. Using NACC data, this study's cognitive classifications (NoCI, CI, Dem) are limited by inconsistencies with reported IADL independence. IADL limitations in some NoCI/ CI participants suggest potential misclassification due to NACC data variations, possibly affecting MoCA/GCR findings. Future studies should use more standardized assessments.", "doc_items_refs": ["#/texts/96", "#/texts/97", "#/texts/98"], "page_nos": [1], "uuid": "c68af890-7b29-4c39-87ef-e5f578ef9023"}
{"doc_id": "2025__Sensitivity_and_specificity_of_the_Montreal_cognitive_assessment_using_US_Nation__W4414443841", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Sensitivity_and_specificity_of_the_Montreal_cognitive_assessment_using_US_Nation__W4414443841.doctags", "chunk_id": 17, "source_chunk_idxs": [23], "num_tokens": 180, "text": "Conclusion\nThis study concluded that the MoCA is an effective tool for detecting mild dementia, with a sensitivity of 83% and a specificity of 82% at cutoff value of 21 and can be used to exclude dementia due to its high NPV (94%). These findings are consistent with the literature, where MoCA is frequently validated as a reliable screening tool for cognitive impairments. And its ability to detect MCI is moderate, showing a sensitivity of 77% at cutoff value of 24\namong normal population. Despite this, MoCA's specificity of 69% predispose to false positives for MCI.\nTaking the above results into account, one can conclude that MoCA can be useful in clinical settings to identify individuals requiring further diagnostic evaluation and confirm normal cognitive functioning. Further research is necessary to enhance its sensitivity for MCI and reduce false positives in dementia diagnosis.", "doc_items_refs": ["#/texts/100", "#/texts/102", "#/texts/103"], "page_nos": [1], "uuid": "1fb44292-3231-4b02-a047-3eca7c70e37d"}
{"doc_id": "2025__Sensitivity_and_specificity_of_the_Montreal_cognitive_assessment_using_US_Nation__W4414443841", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Sensitivity_and_specificity_of_the_Montreal_cognitive_assessment_using_US_Nation__W4414443841.doctags", "chunk_id": 18, "source_chunk_idxs": [24], "num_tokens": 368, "text": "Abbreviations\n| ADCs                              | Alzheimer's Disease                                                  |\n|-----------------------------------|----------------------------------------------------------------------|\n| ADRs                              | Alzheimer's Disease Centers                                          |\n| ADRC                              | Alzheimer's Disease Research Centers                                 |\n| AUC                               | Area Under the Curve                                                 |\n| CDR                               | Clinical Dementia Rating                                             |\n| CI                                | Cognitive Impairment                                                 |\n| DRS                               | Dementia Rating Scale                                                |\n| DSM-5                             | Diagnostic and Statistical Manual of Mental Disorders, Fifth Edition |\n| FAQ                               | Functional Activities Questionnaire                                  |\n| GCDR                              | Global Clinical Dementia Rating                                      |\n| IADL                              | Instrumental Activities of Daily Living                              |\n| MCI                               | Mild Cognitive Impairment                                            |\n| MMSE                              | Mini-Mental State Examination                                        |\n| MoCA                              | Montreal Cognitive Assessment                                        |\n| MoCA-B                            | Montreal Cognitive Assessment-Basic                                  |\n| MoCA-P                            | Peking Medical Union College Hospital version of the MoCA            |\n| NACC                              | National Alzheimer's Coordinating Center                             |\n| NDDs                              | Neurodegenerative diseases                                           |\n| NoCI                              | No Cognitive Impairment                                              |\n| NPV                               | Negative Predictive Value                                            |\n| PDD                               | Parkinson's Disease                                                  |\n| PD-MCI                            | Parkinson's Disease Dementia                                         |\n| PPV                               | Positive Predictive Value                                            |\n| Receiver Operating Characteristic | SCA                                                                  |\n| SLVD                              | Saint Louis University Mental Status Examination                     |\n| VDS                               | Vascular Dementia                                                    |", "doc_items_refs": ["#/tables/5"], "page_nos": [1], "uuid": "930968b0-ff94-4524-8fd8-a5043a324915"}
{"doc_id": "2025__Sensitivity_and_specificity_of_the_Montreal_cognitive_assessment_using_US_Nation__W4414443841", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Sensitivity_and_specificity_of_the_Montreal_cognitive_assessment_using_US_Nation__W4414443841.doctags", "chunk_id": 19, "source_chunk_idxs": [25], "num_tokens": 511, "text": "Acknowledgements\nThe NACC database is funded by NIA/NIH Grant U24 AG072122. NACC data are contributed by the NIA-funded ADRCs: P30 AG062429 (PI James Brewer, MD, PhD), P30 AG066468 (PI Slocar Lopez, MD), P30 AG062421 (PI Bradley Hyman, MD, PhD), P30 AG066509 (PI Thomas Grabowski, MD), P30 AG066514 (PI Mary Sano, PhD), P30 AG066530 (PI Helena Chui, MD), P30 AG066507 (MI Marilyn Albert, PhD), P30 AG060444 (PI John Morris, MD), P30 AG066518 (PI Jeffrey Kaye, MD), P30 AG066512 (PI Thomas Wisniewski, MD), P30 AG066462 (PI Scott Small, MD), P30 AG072979 (PI David Wolk, MD), P30 AG072972 (PI Charles DeCarli, MD), P30 AG072976 (PI Andrew Saykin, PsyD), P30 AG072975 (PI David Bennett, MD), P30 AG072978 (PI Neil Kowall, MD), P30 AG072977 (PI Robert Vassar, PhD), P30 AG06805 (PI Frank LaFerla, PhD), P30 AG062677 (PI Ronald Petersen, MD, PhD), P30 AG079280 (PI Eric Reiman, MD), P30 AG062422 (PI Gil Rabinovici, MD), P30 AG066511 (PI Allan Levey, MD, PhD), P30 AG072946 (PI Linda Van Eldik, PhD), P30 AG062715 (PI Sanjay Asthana, MD, FRCP), P30 AG072973 (PI Russell Swedlower, MD), P30 AG066506 (PI Todd Goldde, MD, PhD), P30 AG066508 (PI Stephen Strittmatter, MD, PhD), P30 AG066515 (PI Victor", "doc_items_refs": ["#/texts/106"], "page_nos": [1], "uuid": "0de799fe-bc01-4ff8-a35b-a492866bc67c"}
{"doc_id": "2025__Sensitivity_and_specificity_of_the_Montreal_cognitive_assessment_using_US_Nation__W4414443841", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Sensitivity_and_specificity_of_the_Montreal_cognitive_assessment_using_US_Nation__W4414443841.doctags", "chunk_id": 20, "source_chunk_idxs": [26, 27], "num_tokens": 399, "text": "Acknowledgements\nHenderson, MD, MS), P30 AG072947 (PI Suzanne Craft, PhD), P30 AG072931 (PI Henry Paulson, MD, PhD), P30 AG066546 (PI Sudha Seshadri, MD), P20 AG068024 (PI Erik Roberson, MD, PhD), P20 AG068053 (PI Justin Miller, PhD), P20 AG068077 (PI Gary Rosenberg, MD), P20 AG068082 (PI Angela Jefferson, PhD), P30 AG072958 (PI Heather Whitson, MD), P30 AG072959 (PI James Leverenz, MD). First and foremost, I would like to thank Allah, the Most Gracious and Most Merciful, for granting me the strength, patience, and guidance to complete this work. I am also deeply grateful to Dr. Mervat M. El-Sangidy for her valuable support and for clearly explaining this lecture to me at the very beginning, which greatly contributed to my understanding and progress.\n\nAuthor contributions\nY.A.I. conceptualized the study, designed the methodology, and performed the primary statistical analysis. H.A.A. contributed to the data curation, analysis, and interpretation, as well as the writing of the original draft. S.A.S. assisted in the literature review, data interpretation, and contributed to the manuscript's revision. N.M.A. and YA were involved in the data collection, managed the project, and provided critical feedback on the manuscript. All authors reviewed and approved the final version of the manuscript, with Y.A.I. and H.A.A. sharing equal contributions to this work. Y.A.I, N.M.A, and YA have revised the manuscript according to editor's recommendations.", "doc_items_refs": ["#/texts/106", "#/texts/111"], "page_nos": [1], "uuid": "f4e46e69-ce6b-48f3-bb67-d64ce093b538"}
{"doc_id": "2025__Sensitivity_and_specificity_of_the_Montreal_cognitive_assessment_using_US_Nation__W4414443841", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Sensitivity_and_specificity_of_the_Montreal_cognitive_assessment_using_US_Nation__W4414443841.doctags", "chunk_id": 21, "source_chunk_idxs": [28, 29, 30, 31, 32, 33], "num_tokens": 235, "text": "Funding\nThis research was funded by NIA/NIH Grant U24 AG072122.\n\nData availability\nAll data generated or analyzed during this study are included in this published article.\n\nEthics approval and consent to participate\nWritten informed consents were obtained from participants at each ADCR and approved by each ADCR's IRB. The need for ethics approval was waived as the data used in this study were obtained from a de-identified dataset, which does not meet the definition of human subjects'research under the U.S. Department of Health and Human Services regulations (45 CFR 46). Therefore, IRB approval was not required. This study was conducted in accordance with the Declaration of Helsinki. This study analysis was exempt from IRB review in accordance with federal regulation criteria.\n\nConsent for publication\nNot applicable.\n\nCompeting interests\nThe authors declare no competing interests.\n\nAuthor details\n$^{1}$Faculty of Medicine, Port Said University, Port Said, Egypt $^{2}$Medical Research Group of Egypt, Negida Academy, Arlington, MA, USA\nReceived: 22 August 2024 / Accepted: 10 April 2025\nPublished online: 23 September 2025", "doc_items_refs": ["#/texts/113", "#/texts/115", "#/texts/118", "#/texts/120", "#/texts/122", "#/texts/124", "#/texts/125", "#/texts/126"], "page_nos": [1], "uuid": "f75d6f68-d104-4fff-9105-1c690e5663fd"}
{"doc_id": "2025__Sensitivity_and_specificity_of_the_Montreal_cognitive_assessment_using_US_Nation__W4414443841", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Sensitivity_and_specificity_of_the_Montreal_cognitive_assessment_using_US_Nation__W4414443841.doctags", "chunk_id": 22, "source_chunk_idxs": [34], "num_tokens": 442, "text": "References\n- 1. Choonaar YE, Pillay V, Du Toit LC, Modi G, Naoido D, Ndesendo VM, Sibambam SR. Trends in the molecular pathogenesis and clinical therapeutics of common neurodegenerative disorders. Int J Mol Sci. 2009;10:2510-57. https://doi. org/10.3390/ijms10062510.\n- 2. Lamptey RNL, Chaulagain B, Trivedi R, Gothlaw A, Layek B, Singh J. A review of the common neurodegenerative disorders: current therapeutic approaches and the potential role of nanotherapeutics. Int J Mol Sci. 2022;23(3):1851. htt ps://doi.org/10.3390/ijms23031851. Published 2022 Feb 6.\n- 3. Martin JB. Molecular basis of the neurodegenerative disorders. N Engl J Med. 1999;340:1970-80. https://doi.org/10.1056/NEJM.19990624340507.\n- 4. American Psychiatric Association DS, American Psychiatric Association DS. Diagnostic and statistical manual of mental disorders: DSM-5. Washington, DC: American psychiatric association; 2013 May, p. 22.\n- 5. Hugo J, Ganguli M. Dementia and cognitive impairment: epidemiology, diagnosis, and treatment. Clin Geriatr Med. 2014;30(3):421-42. https://doi.org /10.1016/j.cger.2014.04.001.\n- 6. Morley J, Tumosa N. Saint Louis university mental status examination (SLUMS). Aging Successfully. 2002;12(1):4.\n- 7. Nasreddine ZS, Phillips NA, Bédirian V et al. The Montreal Cognitive Assessment, MoCA: a brief screening tool for mild cognitive impairment. http://www w.mocatest", "doc_items_refs": ["#/texts/128", "#/texts/129", "#/texts/130", "#/texts/131", "#/texts/132", "#/texts/133", "#/texts/134"], "page_nos": [], "uuid": "3cf6c2e3-9078-443a-91e8-a7c92add31c3"}
{"doc_id": "2025__Sensitivity_and_specificity_of_the_Montreal_cognitive_assessment_using_US_Nation__W4414443841", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Sensitivity_and_specificity_of_the_Montreal_cognitive_assessment_using_US_Nation__W4414443841.doctags", "chunk_id": 23, "source_chunk_idxs": [35], "num_tokens": 492, "text": "References\n- 8. Folstein MF, Folstein SE, McHugh PR. Mini-mental State. A practical method for grading the cognitive State of patients for the clinician. J Psychiatr Res. 1975;12(3):189-98. https://doi.org/10.1016/0022-3956(75)90026-6.\n- 9. Lucas JA, Ivnik RJ, Smith GE, Bohac DL, Tangalos EG, Kokmen E, Graff-Radford NR, Petersen RC. Normative data for the Mattis dementia rating scale. J Clin Exp Neuropsychol. 1998;2004(5):536-47.\n- 10. Sanford AM. Mild cognitive impairment. Clin Geriatr Med. 2017;33(3):325-37. https://doi.org/10.1016/j.cger.2017.02.005.\n- 11. Espino DV, Lichtenstein MJ, Palmer RF, Hazuda HP. Ethnic differences in MiniMental state examination (MMSE) scores: where you live makes a difference. J Am Geriatr Soc. 2001;49(5):538-48.\n- 12. Pinto TCC, Machado L, Bulacov TM, et al. Is the Montreal cognitive assessment (MoCA) screening superior to the Mini-Mental state examination (MMSE) in the detection of mild cognitive impairment (MCI) and Alzheimer's disease (AD) in the elderly? Int Psychogeriatr. 2019;31(4):491-504. https://doi. org/10.1017/S1041610218001370.\n- 13. Jongsiriyan Song, Limpawattana P. Mild cognitive impairment in clinical practice: A review Article. Am J Alzheimers Dis Other Demen. 2018;33(8):5007. https://doi.org/10.1177/1533317518791401.\n- 14. Geller R, Slicer K. Montreal cognitive assessment (MoCA). Clinical integration of neuropsychological test results. CRC; 2024. pp. 191-204.", "doc_items_refs": ["#/texts/135", "#/texts/136", "#/texts/137", "#/texts/138", "#/texts/139", "#/texts/140", "#/texts/141"], "page_nos": [], "uuid": "cd76eb83-b150-438a-93af-c79e750c8f65"}
{"doc_id": "2025__Sensitivity_and_specificity_of_the_Montreal_cognitive_assessment_using_US_Nation__W4414443841", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Sensitivity_and_specificity_of_the_Montreal_cognitive_assessment_using_US_Nation__W4414443841.doctags", "chunk_id": 24, "source_chunk_idxs": [36], "num_tokens": 472, "text": "References\n- 15. Ciesielska N, Sokolowski R, Mazur E, Podhrecka H, Polak-Szabela A, KędziorKornatska K. Is the Montreal cognitive assessment (MoCA) test better suited than the Mini-Mental state examination (MMSE) in mild cognitive impairment (MCI) detection among people aged over 60? Meta-analysis. Czy test Montreal cognitive assessment (MoCA) Može Być Skuteczniejszy Od Powszechnie Stosowanie Mini-Mental state examination (MMSE) W Rykwaniu Łągodnych Zaborze źń Fokjni ń Zpocznowych U Śobó Po. 60 roku. Życia? Metanaaliza. Psychiatr Pol. 2016;50(5):1039-52. https://doi.org/10.127 40/PP/45368.\n- 16. Julayanont P, Nasreddine ZS. Montreal Cognitive Assessment (MoCA): concept and clinical review. In: Cognitive screening instruments: A practical approach. 2017. P. 139-195.\n- 17. Julayanont P, Brousseau M, Chertkow H, Phillips N, Nasreddine ZS. Montreal cognitive assessment memory index score (MoCA-MIS) as a predictor of version from mild cognitive impairment to Alzheimer's disease. J Am Geriatr Soc. 2014;62(4):679-84.\n- 18. Ellison TS, Cappa SF, Garrett D, et al. Outcome measures for Alzheimer's disease: a global inter-social Delphi consensus. Alzheimers Dement. 2023;19(6):2707-29. https://doi.org/10.1002/alz.12945.\n- 19. Kil-Drori S, Bodenstein KC, Sun S, et al. Montreal cognitive assessment (MoCA) XpressO: validation of a digital self-administered cognitive Prescreening tool. J Am Geriatr Soc Published Online April. 2024;1. https://doi.org/10.1111/jgs.1890.", "doc_items_refs": ["#/texts/142", "#/texts/143", "#/texts/144", "#/texts/145", "#/texts/146"], "page_nos": [], "uuid": "88421f7a-5c80-4616-ac56-667fdb51c6ab"}
{"doc_id": "2025__Sensitivity_and_specificity_of_the_Montreal_cognitive_assessment_using_US_Nation__W4414443841", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Sensitivity_and_specificity_of_the_Montreal_cognitive_assessment_using_US_Nation__W4414443841.doctags", "chunk_id": 25, "source_chunk_idxs": [37], "num_tokens": 446, "text": "References\n- 20. Arevalo-Rodriquez I, Smailigic N, Roqué I, Figuis M, Ciapponi A, SanchezPerez E, Giannakou A, et al. Mini-Mental state examination (MMSE) for the detection of Alzheimer's disease and other dementias in people with mild cognitive impairment (MCI). Cochrane Database Syst Rev. 2015;2015(3):CD010783. https://doi.org/10.1002/14651858.CD010783.pub2. Published 2015 Mar 5.\n- 21. Nasreddine ZS, Phillips NA, Bédirian V et al. The Montreal Cognitive Assessment, MoCA: a brief screening tool for mild cognitive impairment [published correction appears in J Am Geriatr Soc. 2019;67(9):1991. doi: 10.1111/ jgs.15925. J Am Geriatr Soc. 2005;53(4):695-699. https://doi.org/10.1111/j. 32-5415.2005.53221.x\n- 22. Thissen AJAM, van Bergen F, de Jonghe JFM, Kessels RPC. Dautzenberg, PLJ (n.d.) Bruikhaerbein V aldeitite van de Nederlandse Versie van de Montreal Cognitive Assessment (MoCA-D) Bij Het Diagnosticeren van Mild Cognitive Impairment Applicability and Validity of the Dutch Version of the Montreal Cognitive Assessment (MoCA-D) in Diagnosing MCIA.\n- 23. Davis DHJ, Crevin St, Yip JLY, Noel-Storr AH, Brayne C, Cullum S. Montreal Cognitive Assessment for the diagnosis of Alzheimer's disease and other dementias. Cochrane Database Syst Rev. 2015;(10):CD010775 Published 2015 Oct 29. https://doi.org/10.1002/14651858.CD010775.pub2", "doc_items_refs": ["#/texts/147", "#/texts/148", "#/texts/149", "#/texts/150"], "page_nos": [], "uuid": "ce0a5d94-f388-492c-b27f-e0fd737d5d9d"}
{"doc_id": "2025__Sensitivity_and_specificity_of_the_Montreal_cognitive_assessment_using_US_Nation__W4414443841", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Sensitivity_and_specificity_of_the_Montreal_cognitive_assessment_using_US_Nation__W4414443841.doctags", "chunk_id": 26, "source_chunk_idxs": [38], "num_tokens": 285, "text": "References\n- 24. Waldron-Perrine B, Axelrod BN. Determining an appropriate cutting score for indication of impairment on the Montreal Cognitive Assessment. Int J Geriatr Psychiatry. 2012;27(11):1189194. http://ovidsp.ovid.com/ovidweb.cgi?&amp;T=JS &amp;PAGE=reference&amp;MODE=ovidclassic&amp;CSC=y&amp;NEWS=n&amp;D=mesx,prem,mesz ,medp&amp;SEARCH=222228412.ui.10.1002/gps.3768\n- 25. Yang Z, Slavin MJ, Sachdev P. Dementia in the oldest old. Nat Rev Neurol. 2013;9(7):382-93. https://doi.org/10.1038/nrneurol.2013.105.\n- 26. Sharma N, Chakrabarti S, Glover S. Gender differences in caregiving among family - caregivers of people with mental illnesses. World J Psychiatry. 2016;6(1):7-17. https://doi.org/10.5498/wjp.v6i.i1.7. Published 2016 Mar 22.", "doc_items_refs": ["#/texts/151", "#/texts/152", "#/texts/153"], "page_nos": [], "uuid": "bba74233-6dd0-438a-bd96-db705b9e57c2"}
{"doc_id": "2025__Sensitivity_and_specificity_of_the_Montreal_cognitive_assessment_using_US_Nation__W4414443841", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Sensitivity_and_specificity_of_the_Montreal_cognitive_assessment_using_US_Nation__W4414443841.doctags", "chunk_id": 27, "source_chunk_idxs": [39], "num_tokens": 457, "text": "References\n- 27. Wang G, Li W. Sex as a risk factor for developing cognitive impairments in National Alzheimer's coordinating center participants. J Alzheimers Dis Rep. 2021;5(1):1-6. https://doi.org/10.3233/ADR-200275. Published 2021 Jan 11.\n- 28. Weisenbach SL, Boore LA, Kales HC. Depression and cognitive impairment in older adults. Curr Psychiatry Rep. 2012;14(4):280-8. https://doi.org/10.1007/s 11920-012-0278-7.\n- 29. Song D, Li PWC, Yu DSF. The association between depression and mild cognitive impairment: A cross-sectional study. Int J Geriatr Psychiatry. 2018;33(4):672-4. https://doi.org/10.1002/gps.4798.\n- 30. Perini G, Cotta Samarino M, Sinforiani E, Bernini S, Petrachi R, Costa A. Cognitive impairment in depression: recent advances and novel treatments. Neuropsychiatr Dis Treat. 2019;15:1249-58. https://doi.org/10.2147/NDST.S199 746. Published 2019 May 10.\n- 31. Wang X, Li F, Gao Q, et al. Evaluation of the accuracy of cognitive screening tests in detecting dementia associated with Alzheimer's disease: A hierarchical bayesian latent class Meta-Analysis. J Alzheimers Dis. 2022;87(1):285-304. https://doi.org/10.3233/JAD-215394.\n- 32. Kasten M, Bruggemann N, Schmidt A, Klein C. Validity of the MoCA and MMSE in the detection of MCI and dementia in Parkinson disease. Neurology. 2010;75(5):478-9. https://doi.org/10.1212/WNL0b013e3181e7948a.", "doc_items_refs": ["#/texts/157", "#/texts/158", "#/texts/159", "#/texts/160", "#/texts/161", "#/texts/162"], "page_nos": [], "uuid": "7abe2eef-f029-429d-9a8a-d4b5c4a5e63f"}
{"doc_id": "2025__Sensitivity_and_specificity_of_the_Montreal_cognitive_assessment_using_US_Nation__W4414443841", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Sensitivity_and_specificity_of_the_Montreal_cognitive_assessment_using_US_Nation__W4414443841.doctags", "chunk_id": 28, "source_chunk_idxs": [40], "num_tokens": 512, "text": "References\n- 33. Kawada T. Montreal cognitive assessment (MoCA) and its memory tasks for detecting mild cognitive impairment. Neuro Sci. 2019;40(3):633. https://doi.o rg/10.1007/s10072-018-3616-7.\n- 34. Tsai JC, Chen CW, Chu H, et al. Comparing the sensitivity, specificity, and predictive values of the Montreal cognitive assessment and Mini-Mental state examination when screening people for mild cognitive impairment and dementia in Chinese population. Arch Psychiatr Nurs. 2016;30(4):486-91. http s://doi.org/10.1016/j.apnu.2016.01.015.\n- 35. Abd Razak MA, Ahmad NA, Chan YY, et al. Validity of screening tools for dementia and mild cognitive impairment among the elderly in primary health care: a systematic review. Public Health. 2019;169:84-92. https://doi.or g/10.1016/j.puhe.2019.01.001.\n- 36. Dautzenberg G, Limjer J, Beekman A. Clinical value of the Montreal cognitive assessment (MoCA) in patients suspected of cognitive impairment in old age psychiatry. Using the MoCA for triaging to a memory clinic. Cogn Neuropsychiatry. 2021;26(1):1-17. https://doi.org/10.1080/13546805.2020.1850434.\n- 37. Pang T, Xia B, Zhao X, et al. Cost-benefit and discriminant validity of a Stepwise dementia-case finding approach in an Asian older adult community. Gen Psychiatr. 2023;36(5):e101049. https://doi.org/10.1136/psych-psych2023-101 049. Published 2023 Oct 30.\n- 38. Dautzenberg G, Limjer J, Beekman A. Diagnostic accuracy of the Montreal cognitive assessment (MoCA) for cognitive screening in old age psychiatry: determining cutoff scores in clinical practice. Avoiding spectrum bias caused by healthy controls. Int J Geriatr Psychiatry. 2020;35(3):261-9. https://doi.org/ 10.1002/gps.5227.", "doc_items_refs": ["#/texts/163", "#/texts/164", "#/texts/165", "#/texts/166", "#/texts/167", "#/texts/168"], "page_nos": [], "uuid": "b70fada8-99e9-4220-b9cf-afedfc46042f"}
{"doc_id": "2025__Sensitivity_and_specificity_of_the_Montreal_cognitive_assessment_using_US_Nation__W4414443841", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Sensitivity_and_specificity_of_the_Montreal_cognitive_assessment_using_US_Nation__W4414443841.doctags", "chunk_id": 29, "source_chunk_idxs": [41, 42], "num_tokens": 100, "text": "References\n- 39. Tan JP, Li N, Gao J, et al. Optimal cutoff scores for dementia and mild cognitive impairment of the Montreal cognitive assessment among elderly and oldest-old Chinese population. J Alzheimers Dis. 2015;43(4):1403-12. https:// doi.org/10.3233/JAD-141278.\n\nPublisher's note\nSpringer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations.", "doc_items_refs": ["#/texts/169", "#/texts/171"], "page_nos": [1], "uuid": "55f60309-ce97-43bb-917d-80f54a4b64b5"}
