{"doc_id": "2025__Sleep_quality_mental_health_and_cognitive_function_among_older_adults_in_Chinese__W4415001897", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Sleep_quality_mental_health_and_cognitive_function_among_older_adults_in_Chinese__W4415001897.doctags", "chunk_id": 0, "source_chunk_idxs": [0, 1, 2, 3, 4, 5], "num_tokens": 251, "text": "&lt;!-- image --&gt;\n&lt;!-- image --&gt;\n\nOPEN ACCESS\nEdited By Shane Andrew Thomas, Federation University Australia, Australia\n\nREVIEWED BY\nDalia Perkumiene, Vytautas Magnus University, Lithuania Maura Pilotti, Prince Mohammad bin Fahd University, Saudi Arabia\n\n*CORRESPONDENCE\nWei Li\n822203867@qq.com\nRECEIVED 13 March 2025 ACCEPTED 18 September 2025\nPUBLISHED 09 October 2025\n\nCITATION\nFu W and Li W (2025) Sleep quality, mental health, and cognitive function among older adults in Chinese communities: a cross-sectional study. Front. Public Health 13:1592886. doi: 10.3389/fpubh.2025.1592886\n\nCOPYRIGHT\n© 2025 Fu and Li. This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s)\nare credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms.", "doc_items_refs": ["#/pictures/0", "#/pictures/1", "#/texts/1", "#/texts/3", "#/texts/5", "#/texts/6", "#/texts/7", "#/texts/8", "#/texts/10", "#/texts/12", "#/texts/13"], "page_nos": [1], "uuid": "b44c1a9a-0cb4-49d9-a17d-0b24657bb249"}
{"doc_id": "2025__Sleep_quality_mental_health_and_cognitive_function_among_older_adults_in_Chinese__W4415001897", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Sleep_quality_mental_health_and_cognitive_function_among_older_adults_in_Chinese__W4415001897.doctags", "chunk_id": 1, "source_chunk_idxs": [6, 7], "num_tokens": 358, "text": "Wangsheng Fu 1 and Wei Li 2*\n1 Department of General Psychiatric, The Seventh People's Hospital of Cixi City, Ningbo, China, 2 Department of Geriatric Psychiatry, Shanghai Mental Health Center, Shanghai Jiao Tong University School of Medicine, Shanghai, China\nBackground: Adequate and good sleep is essential for improving mental health and cognitive function in older adults. However, there is a lack of research on the relationship between sleep and psychiatric symptoms and cognitive function in the Chinese older adult population.\nMethods: A total of 621 community older adults aged 60 and older were included in the current study. The Pittsburgh Sleep Quality Index (PSQI), Geriatric Depression Scale (GDS), Self-rating anxiety scale (SAS), and Montreal Cognitive Assessment Scale (MoCA) were administered to all the participants. Based on PSQI, the research subjects were divided into the good sleep quality group and the bad sleep quality group. Moreover, 48 healthy individuals without mild cognitive impairment and dementia also accepted brain MR imaging.\nResults: The prevalence of poor sleep was 49.9%, and age, physical exercise, traumatic brain injury as well as family history of sleep disorders were associated with poor sleep ( p\nConclusion: About half of the older adults in the community have sleep problems. Poor sleep quality was associated with symptoms of anxiety and depression. Moreover, the cortical thickness of transverse temporal gyrus may be related to anxiety symptoms in older adults with poor sleep quality. This study indicates that a decline in sleep quality may increase the risk of anxiety and depression in patients, and transverse temporal gyrus may play an important regulatory role in the above process.\n\nKEYWORDS\nsleep quality, mental health, cognitive performance, community older adults, transverse temporal gyrus thickness", "doc_items_refs": ["#/texts/16", "#/texts/17", "#/texts/18", "#/texts/19", "#/texts/20", "#/texts/22"], "page_nos": [1], "uuid": "55072037-1c38-4c44-8a3c-375c715b920a"}
{"doc_id": "2025__Sleep_quality_mental_health_and_cognitive_function_among_older_adults_in_Chinese__W4415001897", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Sleep_quality_mental_health_and_cognitive_function_among_older_adults_in_Chinese__W4415001897.doctags", "chunk_id": 2, "source_chunk_idxs": [8], "num_tokens": 465, "text": "1 Introduction\nSleep-related complaints are so common among older adults that it can be difficult to distinguish whether the complaint is the result of normal aging or a disease process (1). In contrast to newborns, who can sleep 16-20 h a day, many older adults may struggle to get 8 h in one block (2). According to a review article, about 10% of adults suffer from insomnia, another 20% experience insomnia symptoms occasionally, and that figure will rise to 40% for older adults (3). If their sleep is disrupted, they are more likely to suffer from a variety of physical diseases, such as pain, asthma, diabetes, dementia, high blood pressure, immune disorders, physical disability, and gastroesophageal reflux disease (2). In addition, many mental disorders may also be related to sleep disorders. For example, research has found that there is a close correlation between emotional disorders or attention deficit hyperactivity disorder (ADHD) and the type of biological clock (4). A systematic review and meta-analysis indicated that sleep disorders increase the risk of developing dementia (5). Other mental disorders, such as anxiety, depression, and schizophrenia, can also be accompanied by sleep disorders (6-8).\nCognitive function is a high-level neural activity function of the human brain's functional cortex, which is used to acquire, transform and process external objective information. It mainly covers categories such as memory, calculation, spatial visual ability, and executive ability (9). The main symptoms of cognitive dysfunction include memory, vision impairment, and executive function disorders, while dementia is the ultimate outcome of severe cognitive impairment, which seriously affects the quality of life of patients and increases the burden on society and families (10). Previous studies have shown that sleep disorders can impair the cognitive abilities of the older adult population, which will increase the likelihood of motor and other traffic accidents, industrial accidents, medical errors, and decreased productivity at work (11). What is more serious is that sleep disorders can also increase the risk of developing dementia, for example, in Bloomberg et al. study, they found that suboptimal sleep were independently associated with worse cognitive performance and short sleep was also associated with faster cognitive decline (12).", "doc_items_refs": ["#/texts/28", "#/texts/29"], "page_nos": [1], "uuid": "55a51e15-a21e-416a-99aa-2eb291a5be7d"}
{"doc_id": "2025__Sleep_quality_mental_health_and_cognitive_function_among_older_adults_in_Chinese__W4415001897", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Sleep_quality_mental_health_and_cognitive_function_among_older_adults_in_Chinese__W4415001897.doctags", "chunk_id": 3, "source_chunk_idxs": [9], "num_tokens": 448, "text": "1 Introduction\nAt present, there are only a few studies on the sleep quality of the older adults community population in China. For example, Liu et al. found that depression moderated the relationship between poor sleep quality and frailty, reducing the relationship by 51.9% (13). In Li et al. study, they found that long sleep duration was significantly associated with poorer mental status and memory scores in Chinese older adults (4). In Li et al. study, they found that suboptimal sleep duration and poor quality were associated with poor cognitive performance in older adults (14). In addition, in Ren et al. study, they also found that sleep duration was associated with all-cause mortality in a J-shaped pattern in the older adult population in China (15). However, almost all the current similar studies were only phenomenological descriptions and seldom involve the exploration of mechanisms, thus greatly reducing the reliability of these studies.\nImaging is one of the most effective tools to study brain structure and function, and is widely used in clinical and scientific research institutions. In Zou et al. study, they found that patients with insomnia disorders showed decreased thalamic connectivity to the left amygdala, parahippocampal gyrus, putamen, pale cortex, and hippocampus during wakefulness and in all three non-REM sleep stages (16). In Bourgouin et al.'s study, they found that idiopathic rapid eye movement sleep\nbehavior disorder (iRBD) patients showed reduced cortical and subcortical gray matter (GM) volume in the caudate nucleus (17). In Ramduny et al. study, they found that inadequate sleep could cause brain ageing, with more atrophy of white and gray matter (18). Moreover, in Zhao et al. (19) and Lee et al.s (20) study, they also proved that transverse temporal gyrus thickness was associated with different sleep disorders. Thus, hippocampus, amygdala, white matter, gray matter, and transverse temporal gyrus thickness may develop as biomarkers for sleep disorders.", "doc_items_refs": ["#/texts/30", "#/texts/31", "#/texts/35"], "page_nos": [1], "uuid": "ae68b0f7-147d-449d-90cd-4d325d2602da"}
{"doc_id": "2025__Sleep_quality_mental_health_and_cognitive_function_among_older_adults_in_Chinese__W4415001897", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Sleep_quality_mental_health_and_cognitive_function_among_older_adults_in_Chinese__W4415001897.doctags", "chunk_id": 4, "source_chunk_idxs": [10, 11], "num_tokens": 445, "text": "1 Introduction\nIn the current study, we will conduct an investigation and research on the correlation between sleep quality and emotional symptoms among the older adults in Chinese communities. To further explain the related mechanism, we have also included magnetic resonance data. Our hypothesis was that the poorer the sleep quality of the older adults in the community, the more likely they were to have symptoms of anxiety and depression, and had poorer cognitive function. Moreover, it was possible that certain brain structures and cortices, such as the hippocampus, amygdala, white matter, gray matter, and transverse temporal gyrus thickness, played an important role in this process.\n\n2.1 Participants\nThe current cohort study was derived from the Brain Health Cohort study in Shanghai, 1 which has been described in detail in our previous study (21, 22). This cohort included a total of 621 community participants aged 60 years or older. The entry criteria were as follows: (1) aged 60 or more; (2) without severe medical conditions, such as infections, cancer; (3) without serious mental illness, such as severe and depression schizophrenia; (4) be willing to cooperate. Exclusion criteria were as follows: (1) aged below 60; (2) non-permanent residents of Shanghai; (3) impaired vision or hearing and unable to cooperate with the investigation; (4) refusal to cooperate. All eligible participants were required to complete a standard questionnaire, including general information data (e.g., age, education, gender), daily living habits (e.g., smoker, drinker, tea drinker, physical exercise) and disease related information (e.g., hypertension, heart disease, diabetes, hyperlipidemia, surgical history, traumatic brain injury, family history of dementia, and family history of sleep disorders). Moreover, they would also undergo a screening process that included physical and neurological examinations, sleep quality assessment, mental state assessment and cognitive assessment. To explore the mechanism of sleep quality affecting mental state and cognitive function, 48 healthy individuals without mild cognitive impairment and dementia accepted brain MR imaging (poor sleeper n = 22; good sleeper n = 26).", "doc_items_refs": ["#/texts/36", "#/texts/39"], "page_nos": [1], "uuid": "d43eda9a-fe89-498e-bfd6-d64719fd7673"}
{"doc_id": "2025__Sleep_quality_mental_health_and_cognitive_function_among_older_adults_in_Chinese__W4415001897", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Sleep_quality_mental_health_and_cognitive_function_among_older_adults_in_Chinese__W4415001897.doctags", "chunk_id": 5, "source_chunk_idxs": [12, 13], "num_tokens": 280, "text": "2.2 Sleep quality assessment\nIn the current study, we mainly used the Pittsburgh Sleep Quality Index (PSQI) to assess subjects' sleep quality. The\n1 http://www.shanghaibrainagingstudy.org/\nPittsburgh Sleep Quality Index (PSQI) is a tool used to assess two sleep domains: sleep quality and sleep disorders. It has a score range from 0 to 21. A score of 5 or more indicates poor overall sleep quality, while a score of\n\n2.3 Mental state assessment\nDepressive mood and anxiety symptoms were assessed using the geriatric Depression Scale (GDS) and the self-rating Anxiety Scale (SAS). GDS-15 is a useful tool for classifying depression in older adults as mild or severe. It is scored on a scale of 0-15, with a score of 5 or more being considered to have depressive symptoms (26). Similar to GDS, SAS is also a common tool for assessing anxiety symptoms in the older adult population (27). SAS is a norm-referenced scale which enjoys widespread use a screener for anxiety disorders. Its score range is 0-30 points. Generally, a score of 10 or more points is considered to be anxiety symptoms. At present, a number of studies have confirmed that SAS has good sensitivity and specificity, which can be applied in clinical and experimental studies (28).", "doc_items_refs": ["#/texts/41", "#/texts/42", "#/texts/45", "#/texts/47"], "page_nos": [1], "uuid": "76632a75-6bc0-47e4-98a8-cc531476cb73"}
{"doc_id": "2025__Sleep_quality_mental_health_and_cognitive_function_among_older_adults_in_Chinese__W4415001897", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Sleep_quality_mental_health_and_cognitive_function_among_older_adults_in_Chinese__W4415001897.doctags", "chunk_id": 6, "source_chunk_idxs": [14, 15], "num_tokens": 308, "text": "2.4 Cognitive assessment\nThe Montreal Cognitive Assessment Scale (MoCA) (29) was used to measure the subjects' overall cognitive function. This screening test consists of 30 items that measure multiple cognitive domains including naming, attention, calculation, abstract, orientation, memory, visual space, as well as language function, and it is one of the most common cognitive assessment tools. Compared with Mini-Mental State Examination (MMSE), MoCA is more sensitive and sensitive to screening for cognitive dysfunction (30).\n\n2.5 Magnetic resonance image acquisition and processing\nThe images were acquired by Siemens Magnetom Verio 3.0 T scanner (Siemens, Munich, Germany), which has been described in detail in our previous article (31, 32). In short, T1-weighted images were obtained from 176 sagittal sections using the threedimensional magnetization fast gradient echo acquisition sequence. The acquisition parameters were TE = 2.98 ms, TR = 2,300 ms, rotation Angle = 9°, and spatial resolution = 1 × 1 × 1.2 mm 3 . All structural MRI data were processed by using Clinica in FreeSurfer v6.0 (33), in the order of spatial registration, cortical thickness estimation, cortical surface segmentation extraction of subcortical structures, and segmentation into 46 global structures. Then hippocampus, amygdala, white matter, gray matter, and transverse temporal gyrus thickness for each individual were extracted directly using FreeSurfer.", "doc_items_refs": ["#/texts/49", "#/texts/51"], "page_nos": [1], "uuid": "f80afa55-905d-4200-8ca5-7a8079db0a94"}
{"doc_id": "2025__Sleep_quality_mental_health_and_cognitive_function_among_older_adults_in_Chinese__W4415001897", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Sleep_quality_mental_health_and_cognitive_function_among_older_adults_in_Chinese__W4415001897.doctags", "chunk_id": 7, "source_chunk_idxs": [16, 17, 18], "num_tokens": 395, "text": "2.6 Data analysis\nContinuous variables were expressed as mean ± standard deviation(SD), while categorical variables were expressed as frequencies (%). The single-sample Kolmogorov-Smirnov (KS) test was used to test whether these continuous variables conforming to normal distribution. Independent sample t test and non-parametric test were conducted for continuous variables conforming to normal distribution and not conforming to normal distribution, respectively. While Chi-square test ( χ $^{2}$) was used for categorical variables. Next, a multivariate logistic regression model was used to investigate the association between sleep quality and these possible influencing factors. Then, a general linear model, controlling for age and traumatic brain injury, was used to compare GDS scores, SAS scores, and MoCA scores between the poor and good sleepers. Finally, linear regression analysis was used to investigate the association between mood scores and sleep-related brain regions (the total score of GDS or SAS was used as the dependent variable, and the thickness of transverse temporal gyrus thickness on the left and right were used as the independent variable). Two-tailed tests were used at a significance level of p\n\n3 Results\nThere were statistically significant differences in age and traumatic brain injury ( p\n\n4 Discussion\nSleep disorders are a big concept and include insomnia, unconscious sleep, central narcolepsy, hypopnea syndrome, sleep apnea syndrome, central sleep apnea, daytime sleep wake disorder, and restless leg syndrome (34). As one of the most common health problems in today ' s society, sleep disorders have a high incidence among the older adults, seriously affecting the physical and mental health and quality of life of the older adults, and even aggravating the\n\nTABLE 1 Comparison of the demographic, lifestyle and cognitive characteristics of good sleepers and poor sleepers among the older adults in the community, based on the Pittsburgh Sleep Quality Index.", "doc_items_refs": ["#/texts/56", "#/texts/58", "#/texts/60", "#/texts/63", "#/tables/0"], "page_nos": [1], "uuid": "f4c570b9-de7f-4cc9-a2d0-2f765fd2e493"}
{"doc_id": "2025__Sleep_quality_mental_health_and_cognitive_function_among_older_adults_in_Chinese__W4415001897", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Sleep_quality_mental_health_and_cognitive_function_among_older_adults_in_Chinese__W4415001897.doctags", "chunk_id": 8, "source_chunk_idxs": [19], "num_tokens": 499, "text": "4 Discussion\n| Variables                                | Poor sleeper ( n = 310)   | Good sleeper ( n = 311)   |   X² or T | p      |\n|------------------------------------------|---------------------------|---------------------------|-----------|--------|\n| Age, years                               | 66.69 ± 8.49              | 65.02 ± 8.51              |     2.19  | 0.029* |\n| Education, years                         | 9.65 ± 3.29               | 10.08 ± 3.29              |    -1.478 | 0.140  |\n| Male, n (%)                              | 112(36.1)                 | 120(38.6)                 |     0.4   | 0.562  |\n| Smoker, n (%)                            | 56 (18.1)                 | 69 (22.2)                 |     1.641 | 0.230  |\n| Drinker, n (%)                           | 75 (24.2)                 | 66 (21.2)                 |     0.781 | 0.390  |\n| Tea drinker, n (%)                       | 131 (42.3)                | 138 (44.4)                |     0.283 | 0.627  |\n| Physical exercise, n (%)                 | 182 (58.7)                | 203 (65.3)                |     2.839 | 0.099  |\n| Hypertension, n (%)                      | 135 (43.5)                | 146 (46.9)                |     0.723 | 0.420  |\n| Heart disease, n (%)                     | 68 (21.9)                 | 56 (18.0)                 |     1.5   | 0.230  |\n| Diabetes, n (%)                          | 51 (16.5)                 | 42 (13.5)                 |     1.059 | 0.314  |\n| Hyperlipidemia, n (%)                    | 92 (29.7)                 | 76 (24.4)                 |     2.16  | 0.149  |", "doc_items_refs": ["#/tables/0"], "page_nos": [1], "uuid": "0496bc93-d2ef-475d-95ae-fd5a3641a97c"}
{"doc_id": "2025__Sleep_quality_mental_health_and_cognitive_function_among_older_adults_in_Chinese__W4415001897", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Sleep_quality_mental_health_and_cognitive_function_among_older_adults_in_Chinese__W4415001897.doctags", "chunk_id": 9, "source_chunk_idxs": [20], "num_tokens": 456, "text": "4 Discussion\n| Surgical history, n (%)                  | 131 (42.3)                | 116 (37.3)                |     1.594 | 0.219  |\n| Traumatic brain injury, n (%)            | 11 (3.5)                  | 3 (1.0)                   |     4.703 | 0.033* |\n| Family history of dementia, n (%)        | 20 (6.5)                  | 22 (7.1)                  |     0.095 | 0.873  |\n| Family history of sleep disorders, n (%) | 22 (7.1)                  | 11 (3.5)                  |     3.91  | 0.051  |\nTABLE 2 The influencing factors of poor sleep quality were investigated by binary logistics regression analysis.\n\n| Variables                         |      B |   S.E |   Wald |   df | p      |    OR | 95% Confidence interval   |\n|-----------------------------------|--------|-------|--------|------|--------|-------|---------------------------|\n| Age                               |  0.025 | 0.011 |  5.081 |    1 | 0.024* | 1.025 | 1.003-1.047               |\n| Physical exercise                 | -0.196 | 0.189 |  1.078 |    1 | 0.299  | 0.822 | 0.568-1.190               |\n| Traumatic brain injury            |  1.301 | 0.801 |  2.637 |    1 | 0.104  | 3.673 | 0.764-17.658              |\n| Family history of sleep disorders |  0.84  | 0.424 |  3.922 |    1 | 0.048* | 2.317 | 1.009-5.322               |", "doc_items_refs": ["#/tables/0", "#/texts/64", "#/tables/1"], "page_nos": [1], "uuid": "f8df38e9-fce2-47d8-ad97-0a193bdc9f62"}
{"doc_id": "2025__Sleep_quality_mental_health_and_cognitive_function_among_older_adults_in_Chinese__W4415001897", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Sleep_quality_mental_health_and_cognitive_function_among_older_adults_in_Chinese__W4415001897.doctags", "chunk_id": 10, "source_chunk_idxs": [21], "num_tokens": 332, "text": "4 Discussion\ncondition of the original disease. In the current study, we investigated the relationship between sleep quality, mental state and cognitive function among older adults in Chinese communities, and found that (1) nearly half of the older adults in the community had poor sleep quality; (2) advanced age and a family history of sleep disorders were strongly associated with poor sleep quality; (3) poor sleepers were likely to have more anxiety and depressive symptoms; (4)anxiety symptoms were positively correlated with the left transverse temporal gyrus thickness.\nBy using the Pittsburgh Sleep Quality Index (PSQI), we found that nearly half of the Chinese older adults in the community had poor sleep quality, and advanced age as well as family history of sleep disorders were major factors in poor sleep quality. Monane et al. (35) estimated that nearly half of people over the age of 65 suffered from insomnia. Moreover, Vitiello et al. also found that older women tend to report sleep disorders more frequently than older men (36), and hormone deficiencies were likely to play an important role in this process (37). So our findings were basically consistent. With the increase of age, the disturbance of sleep rhythm and the reduction of sleep demand often occur, which may lead to the occurrence of sleep disorders. Alternatively, in some patients, insomnia may be caused by an underlying medical condition or a side effect of medication (secondary insomnia) (38). What's more, genetics may play an important role in the onset and progression of sleep disorders. For example, Lane et al. identified 57 loci for self-reported", "doc_items_refs": ["#/texts/65", "#/texts/66"], "page_nos": [1], "uuid": "191cfb4c-496f-425b-9e10-935538f4a651"}
{"doc_id": "2025__Sleep_quality_mental_health_and_cognitive_function_among_older_adults_in_Chinese__W4415001897", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Sleep_quality_mental_health_and_cognitive_function_among_older_adults_in_Chinese__W4415001897.doctags", "chunk_id": 11, "source_chunk_idxs": [22], "num_tokens": 400, "text": "4 Discussion\nTABLE 3 Comparison of mental health status (anxiety, depression, and cognition) across sleep quality.\n\n| Variables   | Poor  sleeper  ( n = 310)   | Good  sleeper  ( n = 311)   |     F | p           |     |             |             |       |             |      |              |              |       |       |\n|-------------|-----------------------------|-----------------------------|-------|-------------|-----|-------------|-------------|-------|-------------|------|--------------|--------------|-------|-------|\n| SAS         | 33.85 ± 7.03                | 30.32 ± 6.25                | 7.037 | <0.001*<nl> | GDS | 3.58 ± 2.98 | 2.22 ± 2.80 | 6.385 | <0.001*<nl> | MoCA | 22.56 ± 4.71 | 22.78 ± 4.68 | 0.547 | 0.585 |\ninsomnia symptoms in the UK Biobank and validated their effects in other data (39). Therefore, we need to pay close attention to sleep problems in the older adult population in order to improve their quality of life.", "doc_items_refs": ["#/texts/70", "#/tables/2", "#/texts/71"], "page_nos": [1], "uuid": "7e43d8a4-af1b-4e86-9fb4-de641af511f5"}
{"doc_id": "2025__Sleep_quality_mental_health_and_cognitive_function_among_older_adults_in_Chinese__W4415001897", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Sleep_quality_mental_health_and_cognitive_function_among_older_adults_in_Chinese__W4415001897.doctags", "chunk_id": 12, "source_chunk_idxs": [23], "num_tokens": 147, "text": "4 Discussion\nNext, we explored the effects of sleep quality on anxiety symptoms, depressive symptoms, and cognitive function. We found that among older adults in neighborhoods with poor sleep quality, they had higher anxiety scores and depression scores, but there was no difference in overall cognitive function compared to older adults with better sleep quality. In a group of older adults Asian subjects, Yu et al. found that depression and anxiety were associated with some sleep-related problems (40). Among a general population, Matsui et al. found that both poorer sleep quality and shorter sleep duration were associated with poorer mental quality (41). Matsui et al. found\n\nTABLE 4 Comparison of brain structure and emotional symptom between poor sleeper and good sleeper.", "doc_items_refs": ["#/texts/72", "#/texts/75", "#/tables/3"], "page_nos": [1], "uuid": "533474dd-4201-427c-a03e-81e364bd6588"}
{"doc_id": "2025__Sleep_quality_mental_health_and_cognitive_function_among_older_adults_in_Chinese__W4415001897", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Sleep_quality_mental_health_and_cognitive_function_among_older_adults_in_Chinese__W4415001897.doctags", "chunk_id": 13, "source_chunk_idxs": [24], "num_tokens": 497, "text": "4 Discussion\n| Variables                                      | Poor sleeper ( n = 22)   | Good sleeper ( n = 26)   |   X 2 or T | p      |\n|------------------------------------------------|--------------------------|--------------------------|------------|--------|\n| Age, years                                     | 71.23 ± 7.58             | 72.69 ± 4.27             |     -0.842 | 0.404  |\n| Education, years                               | 8.05 ± 4.59              | 7.92 ± 3.48              |      0.107 | 0.915  |\n| Male,  n (%)                                   | 6 (27.3)                 | 9 (34.6)                 |      0.299 | 0.756  |\n| Whole brain volume, cm 3                       | 1389.12 ± 165.03         | 1412.92 ± 48.40          |     -0.702 | 0.486  |\n| Left hippocampus, cm 3                         | 3.53 ± 0.39              | 3.51 ± 0.33              |      0.149 | 0.882  |\n| Right hippocampus, cm 3                        | 3.76 ± 0.40              | 3.70 ± 0.46              |      0.428 | 0.671  |\n| Left amygdala, cm 3                            | 1.43 ± 0.20              | 1.45 ± 0.17              |     -0.421 | 0.676  |\n| Right amygdala, cm 3                           | 1.64 ± 0.24              | 1.60 ± 0.17              |      0.711 | 0.481  |\n| Total gray matter volume, cm 3                 | 541.28 ± 53.88           | 542.58 ± 29.60           |     -0.106 | 0.916  |\n| Total white matter volume, cm 3                | 5.93 ± 7.35              | 3.61 ± 3.60              |      1.426 | 0.161  |", "doc_items_refs": ["#/tables/3"], "page_nos": [1], "uuid": "58509a74-1f59-436f-8a71-1644c7c226ff"}
{"doc_id": "2025__Sleep_quality_mental_health_and_cognitive_function_among_older_adults_in_Chinese__W4415001897", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Sleep_quality_mental_health_and_cognitive_function_among_older_adults_in_Chinese__W4415001897.doctags", "chunk_id": 14, "source_chunk_idxs": [25], "num_tokens": 397, "text": "4 Discussion\n| Left transverse temporal gyri thickness, mm 3  | 2.29 ± 0.18              | 2.16 ± 0.19              |      2.425 | 0.019* |\n| Right transverse temporal gyri thickness, mm 3 | 2.30 ± 0.21              | 2.16 ± 0.17              |      2.606 | 0.012* |\n| SAS                                            | 0.34 ± 0.06              | 0.30 ± 0.06              |      2.293 | 0.028* |\n| GDS                                            | 5.18 ± 4.42              | 2.38 ± 3.31              |      2.505 | 0.016* |\n| MoCA                                           | 23.29 ± 4.28             | 23.50 ± 4.04             |     -0.176 | 0.861  |\n&lt;!-- image --&gt;\nthat the anxiety symptom clusters were differentially associated with specific sleep-related disorders, highlighting the complex relationship between anxiety and sleep in later life ( 41). Moreover, McKinnon et al. found that sleep disturbances seemed to predict depressive symptoms (42). So we know with some certainty that sleep problems may be associated with anxiety symptoms and mood symptoms. However, contrary to our expectations, we did not find an association between sleep problems and cognitive function, contrary to the studies by Liao et al. (10) and Guan et al. (43). The reasons may be related to the use of different assessment tools and group differences. Moreover, this might also be related to the fact that we only evaluated the overall cognitive function without specifically evaluating the cognitive function in specific domains. Additionally, when enrolling the above-mentioned population, such as in the study of the second part, we excluded patients with mild cognitive impairment and dementia, and all the subjects enrolled in the study were healthy people. This is also the core reason for the lack of cognitive differences.", "doc_items_refs": ["#/tables/3", "#/pictures/2", "#/texts/76"], "page_nos": [1], "uuid": "74aaaae1-5d05-4f3b-b19f-5a0bea5f31f8"}
{"doc_id": "2025__Sleep_quality_mental_health_and_cognitive_function_among_older_adults_in_Chinese__W4415001897", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Sleep_quality_mental_health_and_cognitive_function_among_older_adults_in_Chinese__W4415001897.doctags", "chunk_id": 15, "source_chunk_idxs": [26], "num_tokens": 370, "text": "4 Discussion\nFinally, we explored the links between sleep quality, mood symptoms, and brain structure. Through linear regression analysis, we found there was a positive correlation between the total score of SAS and the cortical thickness of the left transverse temporal gyrus. The transverse temporal gyrus, also known as the Heschl gyrus or Heschl cyclotron, is part of the larger region of the superior temporal gyrus. It includes the lower two-thirds of the primary auditory cortex, and the anterolateral subregion, which is important for pitch processing (44). In Jin et al.'s study, they found that the transverse temporal gyrus thickness was associated with posttraumatic stress disorder (PTSD) in patients with childhood trauma (45). In Qi et al. study, they found that the transverse temporal gyrus thickness was associated with PTSD symptom severity in Han Chinese adults who lost their only child (44). Moreover, in Cruz-Gomez et al. study, they also found that the right superior and transverse temporal gyri was associated with anxiety symptoms in patients with multiple sclerosis (MS) (46). Based on our and others' research conclusions, we speculate that\nthe cortical thickness of transverse temporal gyrus may be related to anxiety symptoms and may be a new therapeutic target for anxiety symptoms, but the above conclusions need to be further verified.\nWe must admit that our study has several limitations. Firstly, this was only a cross-sectional study, so it could not establish a causal link between sleep quality and mood symptoms; Secondly, the magnetic resonance data was relatively small, which might cause some deviation to the research results. Finally, the lack of assessments of cognitive function in specific areas may have influenced the results.", "doc_items_refs": ["#/texts/80", "#/texts/83", "#/texts/84"], "page_nos": [1], "uuid": "fddc1989-156a-4aca-a8b6-0db9ff9efca7"}
{"doc_id": "2025__Sleep_quality_mental_health_and_cognitive_function_among_older_adults_in_Chinese__W4415001897", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Sleep_quality_mental_health_and_cognitive_function_among_older_adults_in_Chinese__W4415001897.doctags", "chunk_id": 16, "source_chunk_idxs": [27, 28, 29, 30, 31], "num_tokens": 473, "text": "5 Ethics and data approval\nThis study was approved by the Ethics Committee of Shanghai Mental Health Center, and all subjects signed informed consent before the study began. The whole study was carried out in accordance with the principles of the Declaration of Helsinki.\n\n6 Conclusion\nNearly half (49.9%) of the older adults in Chinese communities suffer from poor sleep quality, which can lead to symptoms of anxiety and depression. In addition, the cortical thickness of transverse temporal gyrus ( T = 2.115, p = 0.042) may be related to anxiety symptoms in older adults with poor sleep quality.\n\nData availability statement\nThe original contributions presented in the study are included in the article/supplementary material, further inquiries can be directed to the corresponding author.\n\nEthics statement\nThe studies involving humans were approved by the Ethics Committee of Shanghai Mental Health Center. The studies were conducted in accordance with the local legislation and institutional requirements. The participants provided their written informed consent to participate in this study. Written informed consent was obtained from the individual(s), and minor(s)' legal guardian/next of kin, for the publication of any potentially identifiable images or data included in this article.\n\nReferences\n- 1. Feinsilver SH. Normal and abnormal sleep in the elderly. Clin Geriatr Med. (2021) 37:377-86. doi: 10.1016/j.cger.2021.04.001\n- 2. Gulia KK, Kumar VM. Sleep disorders in the elderly: a growing challenge. Psychogeriatrics. (2018) 18:155-65. doi: 10.1111/psyg.12319\n- 3. Morin CM, Jarrin DC. Epidemiology of insomnia: prevalence, course, risk factors, and public health burden. Sleep Med Clin. (2022) 17:173-91. doi: 10.1016/j.jsmc.2022.03.003\n- 4. Taillard J, Sagaspe P, Philip P, Bioulac S. Sleep timing, chronotype and social jetlag: impact on cognitive abilities and psychiatric disorders. Biochem Pharmacol. (2021) 191:114438. doi: 10.1016/j.bcp.2021.114438", "doc_items_refs": ["#/texts/86", "#/texts/88", "#/texts/90", "#/texts/92", "#/texts/94", "#/texts/95", "#/texts/96", "#/texts/97"], "page_nos": [1], "uuid": "d00c5237-8899-4c1a-a7b5-f894667b2e8b"}
{"doc_id": "2025__Sleep_quality_mental_health_and_cognitive_function_among_older_adults_in_Chinese__W4415001897", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Sleep_quality_mental_health_and_cognitive_function_among_older_adults_in_Chinese__W4415001897.doctags", "chunk_id": 17, "source_chunk_idxs": [32, 33, 34, 35], "num_tokens": 312, "text": "Author contributions\nWF: Writing -original draft, Methodology. WL: Conceptualization, Writing -original draft.\n\nFunding\nThe author(s) declare that financial support was received for the research and/or publication of this article. This study was supported by grants from the National Natural Science Foundation of China (82101564, 8001123, 82271607), The Clinical Research Center Project of Shanghai Mental Health Center (CRC2017ZD02), Shanghai Clinical Research Center for Mental Health (19MC1911100), the Cultivation of Multidisciplinary Interdisciplinary Project in Shanghai Jiaotong University (YG2019QNA10), the Feixiang Program of Shanghai Mental Health Center (2020-FX-03), Chinese Academy of Sciences (XDA12040101), Shanghai Clinical Research Center for Mental Health (SCRC-MH, 19MC1911100), the Shanghai Science and Technology Committee (20Y11906800).\n\nConflict of interest\nThe authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest.\n\nGenerative AI statement\nThe authors declare that no Gen AI was used in the creation of this manuscript.\nAny alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us.", "doc_items_refs": ["#/texts/102", "#/texts/104", "#/texts/106", "#/texts/108", "#/texts/109"], "page_nos": [1], "uuid": "93cbf023-c441-46e8-8486-f8a6cff52154"}
{"doc_id": "2025__Sleep_quality_mental_health_and_cognitive_function_among_older_adults_in_Chinese__W4415001897", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Sleep_quality_mental_health_and_cognitive_function_among_older_adults_in_Chinese__W4415001897.doctags", "chunk_id": 18, "source_chunk_idxs": [36], "num_tokens": 299, "text": "Publisher's note\nAll claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher.\n5. Shi L, Chen SJ, Ma MY, Bao YP, Han Y, Wang YM, et al. Sleep disturbances increase the risk of dementia: a systematic review and meta-analysis. Sleep Med Rev. (2018) 40:4-16. doi: 10.1016/j.smrv.2017.06.010\n- 6. Wong S, Fabiano N, Luu B, Seo C, Gupta A, Kim HK, et al. The effect of weighted blankets on sleep quality and mental health symptoms in people with psychiatric disorders in inpatient and outpatient settings: a systematic review and meta-analysis. J Psychiatr Res. (2024) 179:286-94. doi: 10.1016/j.jpsychires.2024.09.027\n- 7. Stafford A, Oduola S, Reeve S. Sleep and socio-occupational functioning in adults with serious mental illness: a systematic review. Psychiatry Res. (2024) 339:116111. doi: 10.1016/j.psychres.2024.116111", "doc_items_refs": ["#/texts/111", "#/texts/112", "#/texts/113", "#/texts/114"], "page_nos": [1], "uuid": "5f39f7b5-1e18-4ec4-87c2-784c0ac7fdc5"}
{"doc_id": "2025__Sleep_quality_mental_health_and_cognitive_function_among_older_adults_in_Chinese__W4415001897", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Sleep_quality_mental_health_and_cognitive_function_among_older_adults_in_Chinese__W4415001897.doctags", "chunk_id": 19, "source_chunk_idxs": [37], "num_tokens": 456, "text": "Publisher's note\n- 8. Zhang J, He M, Wang X, Jiang H, Huang J, Liang S. Association of sleep duration and risk of mental disorder: a systematic review and meta-analysis. Sleep Breath. (2024) 28:261-80. doi: 10.1007/s11325-023-02905-1\n- 9. Wesselius HM, han den Ende ES, Alsa J, ter Maaten JC, Schuit SCE, Stassen PM, et al. Quality and quantity of sleep and factors associated with sleep disturbance in hospitalized patients. JAMA Intern Med. (2018) 178:1201-8. doi: 10.1001/jamainterned.2018.2669\n- 10. Liao H, Liao S, Gao YJ, Mu JP, Wang X, Chen DS. Correlation between sleep time, sleep quality, and emotional and cognitive function in the elderly. Biomed Res Int. (2022) 2022:9709536. doi: 10.1155/2022/9709536\n- 11. Liu Y, Wheaton AG, Chapman DP, Cunningham TJ, Lu H,croft JB. Prevalence of healthy sleep duration among adults--United States, 2014. MMWR Morb Mortal Wkyl Rep. (2016) 65:137-41. doi: 10.15585/mmwr.mmwr.mm650a1\n- 12. Bloomberg M, Brocklebank L, Hamer M, Stepte A. Joint associations of physical activity and sleep duration with cognitive ageing: longitudinal analysis of an English cohort study. Lancet Healthy Longev. (2023) 4:e345-53. doi: 10.1016/S2666-7568(23)0003-1\n- 13. Liu X, Wang C, Qiao X, Si H, Jin Y. Sleep quality, depression and frailty among Chinese community-dwelling older adults. Geriatric Nurs. (2021) 42:714-20. doi: 10.1016/j.gerinurse.2021.02.020", "doc_items_refs": ["#/texts/117", "#/texts/118", "#/texts/119", "#/texts/120", "#/texts/121", "#/texts/122"], "page_nos": [], "uuid": "6eef4152-507f-4eff-b10e-fbd2bcf72c60"}
{"doc_id": "2025__Sleep_quality_mental_health_and_cognitive_function_among_older_adults_in_Chinese__W4415001897", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Sleep_quality_mental_health_and_cognitive_function_among_older_adults_in_Chinese__W4415001897.doctags", "chunk_id": 20, "source_chunk_idxs": [38], "num_tokens": 453, "text": "Publisher's note\n- 14. Li M, Wang N, Dupre ME. Association between the self-reported duration and quality of sleep and cognitive function among middle-aged and older adults in China. J Affect Disord. (2022) 304:20-7. doi: 10.1016/j.jad.2022.02.039\n- 15. Ren Y, Miao M, Yuan W, Sun J, Sun depression and all-cause mortality in the elderly in China: a population-based cohort study. BMC Geriatr. (2020) 20:541. doi: 10.1086/s12877-020-01962-5\n- 16. Zou G, Li Y, Liu J, Zhou S, Xu J, Qin L, et al. Altered thalamic connectivity in insomnia disorder during wakefulness and sleep. Hum Brain Mapp. (2021) 42:259-70. doi: 10.1002/hbm.2521\n- 17. Bourguin OA, Rahayel S, Gaubert M, Postuma RB, Montplaisir J, Carrier J, et al. Gray matter substrates of depressive and anxiety symptoms in idiopathic REM sleep behavior disorder. Parkinsonism Relat Disordered. (2019) 62:163-70. doi: 10.1016/j.parkrelis.2018.12.020\n- 18. Ramduny J, Bastani M, Huedepohl R, Sotrotopoulos SN, Chelaczl M. The association between inadequate sleep and accelerated brain aging. Neurobiological Aging. (2022) 114:1-14. doi: 10.1016/j.neurobiolaging.2022.002.005\n- 19. Zhao L, Wang E, Zhang X, Karama S, Khundampk B, Zhang H, et al. Cortical structural connectivity alterations in primary insomnia morphometric correlation analysis. Biomed Res Int. (2015) 2018:81595. doi: 10.1155/2015/81595", "doc_items_refs": ["#/texts/123", "#/texts/124", "#/texts/125", "#/texts/126", "#/texts/127", "#/texts/128"], "page_nos": [], "uuid": "9048be9e-2110-425c-9010-02c2e511a957"}
{"doc_id": "2025__Sleep_quality_mental_health_and_cognitive_function_among_older_adults_in_Chinese__W4415001897", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Sleep_quality_mental_health_and_cognitive_function_among_older_adults_in_Chinese__W4415001897.doctags", "chunk_id": 21, "source_chunk_idxs": [39], "num_tokens": 486, "text": "Publisher's note\n- 20. Lee MH, Sin S, Lee S, Park H, Waghul ME, Zimmerman ME, et al. Altered cortical structure network in children with obstructive sleep apnea. Sleep. (2022) 45:zsac030. doi: 10.1093/sleep/zsac030\n- 21. Li W, Yue L, Sun L, Xiao S. Elevated fasting plasma glucose is associated with an increased risk of MCI: a community-based cross-sectional study. Front Endocrinol. (2021) 12:739257. doi: 10.3389/fendo.2021.739257\n- 22. Li W, Yue L, Sun L, Xiao S. An increased aspasteolate to analinore aminotransferase ratio is associated with a higher risk of cognitive impairment. Front Med. (2022) 9:780174. doi: 10.3389/fmed.2022.780174\n- 23. Buseys DJ, Reindrochs CF, Monk TH, Berman SR, Kupfer DJ. The Pittsburgh sleep quality index: a new instrument for psychiatric practice and research. Psychiatry Res. (1989) 28:193-213.\n- 24. Mollayeva T, Thurjaharaj P, Burton K, Mollayeva S, Shapiro CM, Coltonario A. The Pittsburgh sleep quality index as a screening tool for sleep dysfunction in clinical and non-sleepalimics: a systematic review and meta-analysis. Sleep Med Rev. (2016) 25:52-73. doi: 10.1016/j.msr2015.01.019.000\n- 25. Farah NM, Saw Yee T, Mohd Rasdi HF. Self-reported sleep quality using the Malay version of the Pittsburgh sleep quality index (PSQI-MI) in Malaysian adults. Int J Environ Res Public Health. (2019) 16:4750. doi: 10.3390/jiperl62374750\n- 26. Shin C, Park MH, Lee SH, Ko YH, Kim HK, et al. Usefulness of the 15item geriatric depression scale (GDS-15) for classifying minor and major depressive", "doc_items_refs": ["#/texts/129", "#/texts/130", "#/texts/131", "#/texts/132", "#/texts/133", "#/texts/134", "#/texts/135"], "page_nos": [], "uuid": "4cf8fb40-3813-4a05-91e4-ca5ef1fa8332"}
{"doc_id": "2025__Sleep_quality_mental_health_and_cognitive_function_among_older_adults_in_Chinese__W4415001897", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Sleep_quality_mental_health_and_cognitive_function_among_older_adults_in_Chinese__W4415001897.doctags", "chunk_id": 22, "source_chunk_idxs": [40], "num_tokens": 512, "text": "Publisher's note\n- disorders among community-dwelling elders. J Affect Disord. (2019) 259:370-5. doi: 10.1016/j.jad.2019.08.053\n- 27. Jegede RO. Psychometric attributes of the self-rating anxiety scale. Psychol Rep. (1977) 40:303-6. doi: 10.2466/prp.1977.40.1.303\n- 28. Li H, Jin D, Qiao F, Chen J, Gong J. Relationship between the self-rating anxiety scale score and the success rate of black-slice computed tomography coronary angiography. Int J Psychiatry. (2016) 51:47-55. doi: 10.1177/0091217415621265\n- 29. Gierus J, Mosolek A, Koweszko T, Wnukiewicz P, Kozyra O, Szulc A. The Montreal cognitive assessment as a preliminary assessment tool in general psychiatry: validity of MoCA in psychiatric patients. Gen Hosp Psychiatry. (2015) 37:476-80. doi: 10.1016/j.genhosppsych.2015.0511\n- 30. Cieselsiek N, Sokolowski R, Mazur E, Podheurekah M, Polak-Szabela A, Kdzoridaniał Kowska K. Is the Montreal cognitive assessment (MoCA) test better suited than the mini-mental state examination (MMSE) in mild cognitive impairment (MCI) detection among people aged over 60? meta-analysis. Psychiatr Pol. (2016) 50:1039-52. doi: 10.12740/p/4536\n- 31. Lin S, Yang Y, Qi Q, Wei L, Jing N, Jie Z, et al. The beneficial effect of physical exercise on cognitive function in a non-dementia aging Chinese population. Front Aging Neurosci. (2019) 11:238. doi: 10.3389/fnag.2019.00238\n- 32. Li W, Yue L, Xiao S. Association between internet use, cognitive function, and Globus pallidus: volumes among the elderly among Chinese communities. Front Public Health. (2022) 10:886974. doi: 10.3389/fpubh.2022.886974", "doc_items_refs": ["#/texts/139", "#/texts/140", "#/texts/141", "#/texts/142", "#/texts/143", "#/texts/144", "#/texts/145"], "page_nos": [], "uuid": "07fcead3-5db8-4c5c-ae53-f30b433384e6"}
{"doc_id": "2025__Sleep_quality_mental_health_and_cognitive_function_among_older_adults_in_Chinese__W4415001897", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Sleep_quality_mental_health_and_cognitive_function_among_older_adults_in_Chinese__W4415001897.doctags", "chunk_id": 23, "source_chunk_idxs": [41], "num_tokens": 486, "text": "Publisher's note\n- 32. Dale M, Fischl B, Seni M. Cortical surface-based analysis. I. Segmentation and surface reconstruction. Neuroimage. (1999) 9:179-94. doi: 10.1006/jmar.1998.0395\n- 34. So JY, Warburton KM, Rosen IM. A guide to management of sleepiness in eskDP. Am J Kidney Dis. (2020) 75:782-72. doi: 10.1053/j.ajkd.2019.09.010\n- 37. Malign Me. Onniaism in the elderly J. Clin Psychiatry. (1992) 53:23-8.\n- 38. Vitilei M, Larsen LH, Moeke. AGE-related sleep change: gender and estrogen effects on subjective-objective sleep quality relationships of healthy, noncompromising older men and women. Psychosymb. (2004) 56:503-10. doi: 10.1016/S2200-3999/04)00023-6\n- 37. Mae KO. Repreductive hormones, aging, and sleep. Semin Reprod Endocrinol. (1999) 17:339-48. doi: 10.1055/s7-20010-16243\n- 38. Wolkove N, Elkholy O, Baltan M, Pawley M. Sleep and aging: 1. Sleep disorders commonly found in older people. CMAJ. (2007) 176:1299-304. doi: 10.1503/cjam.060792\n- 39. Lane JM, Jones SE, Dashti H, Woods AR, Aragam KG, He van Stees VT, et al. Biological clinical insights from genetics of insomnia symptoms. Nat Genet. (2019) 51:387-10. doi: 10.3815/j48.2019.361.0\n- 40. Yu J, Rawtaar I, Fam, J Jiang MJ, Feng L, Kua EH, et al. Sleep correlates of depression and anxiety in an elderly Asian population. Psychogeriatrics. (2016) 16:191-5. doi: 10.1111/psy.12138", "doc_items_refs": ["#/texts/146", "#/texts/147", "#/texts/148", "#/texts/149", "#/texts/150", "#/texts/151", "#/texts/152", "#/texts/153"], "page_nos": [], "uuid": "42ef425e-13b8-4b87-81fc-fdd82cd37216"}
{"doc_id": "2025__Sleep_quality_mental_health_and_cognitive_function_among_older_adults_in_Chinese__W4415001897", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Sleep_quality_mental_health_and_cognitive_function_among_older_adults_in_Chinese__W4415001897.doctags", "chunk_id": 24, "source_chunk_idxs": [42], "num_tokens": 471, "text": "Publisher's note\n- 41. Matsui K, Yoshike T, Nagao K, Utsumi T, Tsuru A, Otsuki R, et al. Association of Subjective Quality and mass of sleep with quality of life among a general population. Int Res J Environ Public Health. (2021) 28:1835. doi: 10.3390/jiperl231835128\n- 42. McKinnon AC, Beath AP, Naismith SL. Relationships between sleep quality, depressive symptoms and MCI diagnosis: a path analysis. I Affect Disord. (2019) 26:256-32. doi: 10.1016/j.jad.2022.05.045\n- 43. Guan Q, Hu X, Ma N, He H, Duan F, Li X, et al. Sleep quality, depression, and cognitive function in non-demented older adults. J Alzheimers Dis. (2020) 76:1637-50. doi: 10.3332/JAD-19099\n- 44. Qi R, Zao C, Surento W, Zhang L, Quiu L, Xia Z, et al. RORA rsou824924 polymorphism moderates the association between PTSD symptom severity and transverse temporal gyrus thorn. J Med Physiol. (2019) 28:1010/j.jad.2022.07.044\n- 45. Jin MJ, Jeon H, Hyun MH, Lee SH. Influence of childhood trauma and brain-derived neurotrophic factor V alley. J Med Physiol. (2019) 28:1010/j.jad.2022.07.044\n- 46. Cruz-Gomez JÁ, Forero L, Lozano-Soto E, Cano-Cano F, Sarnmartino F, Rashid-Ozamel. (2019) 16:32. Explain the clinical significance of a clinical study. J Am Physiol. (2019) 28:1010/j.jad.2022.07.044\n- 47. 8e1074. doi: 10.1212/NXI.000000000001074", "doc_items_refs": ["#/texts/154", "#/texts/155", "#/texts/156", "#/texts/157", "#/texts/158", "#/texts/159", "#/texts/160"], "page_nos": [], "uuid": "cb8a1fcd-37d3-4161-8c67-e31bbd6aeeee"}
