{"doc_id": "2025__Editorial_Decoding_vascular_aging_unraveling_the_enigma_of_pathological_conditio__W4414742927", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Editorial_Decoding_vascular_aging_unraveling_the_enigma_of_pathological_conditio__W4414742927.doctags", "chunk_id": 0, "source_chunk_idxs": [0, 1, 2, 3, 4, 5, 6], "num_tokens": 430, "text": "&lt;!-- image --&gt;\n&lt;!-- image --&gt;\n\nOPEN ACCESS\nEDITED AND REVIEWED BY Irena Levitan, University of Illinois Chicago, United States\n*CORRESPONDENCE\nMitra Esfandiarei,\nE mesfan@midwestern.edu\nRECEIVED 17 September 2025 ACCEPTED 22 September 2025 PUBLISHED 02 October 2025\n\nCITATION\nEsfandiarei M and Rahimian R (2025) Editorial: Decoding vascular aging: unraveling the enigma of pathological conditions and pre-mature vascular aging. Front. Physiol. 16:1707757. doi: 10.3389/fphys.2025.1707757\n\nCOPYRIGHT\n© 2025 Esfandiarei and Rahimian. This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms.\n\nMitra Esfandiarei 1,2,3* and Roshanak Rahimian 4\n1 Biomedical Sciences Program, College of Graduate Studies, Midwestern University, Glendale, AZ, United States, $^{2}$Department of Basic Medical Sciences, College of Medicine, University of Arizona, Phoenix, AZ, United States, $^{3}$Department of Anesthesiology, Pharmacology, and Therapeutics, Faculty of Medicine, University of British Columbia, Vancouver, BC, Canada, $^{4}$Department of Pharmaceutical Sciences, Thomas J. Long School of Pharmacy, University of the Pacific, Stockton, CA, United States\n\nKEYWORDS\nvascular aging, vascular disease, brian pathology, neurovascular disease biomarkers, pre-mature aging\n\nEditorial on the Research Topic\nDecoding vascular aging: unraveling the enigma of pathological conditions and pre-mature vascular aging", "doc_items_refs": ["#/pictures/0", "#/pictures/1", "#/texts/1", "#/texts/2", "#/texts/3", "#/texts/4", "#/texts/5", "#/texts/7", "#/texts/9", "#/texts/15", "#/texts/17", "#/texts/19"], "page_nos": [1], "uuid": "9798ba8c-79ef-4a61-9688-9c8c112b7fed"}
{"doc_id": "2025__Editorial_Decoding_vascular_aging_unraveling_the_enigma_of_pathological_conditio__W4414742927", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Editorial_Decoding_vascular_aging_unraveling_the_enigma_of_pathological_conditio__W4414742927.doctags", "chunk_id": 1, "source_chunk_idxs": [7], "num_tokens": 436, "text": "Introduction\nVascular aging represents a fundamental biological process and a key determinant of cardiovascular morbidity and mortality. Far from being solely determined by chronological age, process such as smooth muscle phenotypical switches, endothelial mechanotransduction, mitochondrial quality control, and immune cells response together with organ and tissue level mechanisms such as neurovascular coupling, blood-brain barrier integrity, and life-course exposures such as diet, sleep, and infection. The contributions to this Research Topic bridge basic, translational, and clinical sciences, offering novel perspectives on mechanisms underlying normal and premature vascular aging, emerging risk factors, and potential therapeutic strategies.\nIn this Research Topic, Kennedy et al. highlight how endothelial cells translate hemodynamic forces into genomic programs-and how this \"language of flow\" can be distorted in Hutchinson Gilford Progeria Syndrome (HGPS). They demonstrate that endothelial cells elongate poorly under laminar flow and mount a blunted, misdirected transcriptional response in which a cholesterol-homeostasis program and the atheroinflammatory lectin LGALS3 are aberrantly upregulated. Importantly, correction of upstream nuclear-lamina defect restores elements of the shear-stress response, thereby tying genotype to a failure of flow protection.\nIn parallel, Wendt et al. have shown that short ex vivo exposure of mouse thoracic aortas to oxidized low-density lipoprotein (oxLDL) reprograms vasoreactivity through lectin-like oxLDL receptor 1 (LOX-1) in an endothelium-dependent\nmanner, striking age- and sex-specific differences in stiffness, diameter, and vascular remodeling. The observed effects were attenuated by receptor inhibition. Collectively, these findings suggest that pro-aging inputs-nuclear-lamina pathology and oxidized lipids-disrupt endothelial sensing of both mechanical and chemical cues, thereby predisposing vessels toward dysfunction before structural disease becomes apparent.", "doc_items_refs": ["#/texts/21", "#/texts/22", "#/texts/23", "#/texts/26"], "page_nos": [1], "uuid": "9858c206-2272-4803-bc83-f279a24ef24b"}
{"doc_id": "2025__Editorial_Decoding_vascular_aging_unraveling_the_enigma_of_pathological_conditio__W4414742927", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Editorial_Decoding_vascular_aging_unraveling_the_enigma_of_pathological_conditio__W4414742927.doctags", "chunk_id": 2, "source_chunk_idxs": [8], "num_tokens": 468, "text": "Introduction\nMitochondrial pathways surface repeatedly as both drivers and sensors-of aging phenotypes. Luo et al. demonstrated that mitochondrial microRNAs (mitomiRs) regulate redox balance, apoptosis, mitophagy, calcium handling, and mitochondrial DNA (mtDNA) transcription-an epigenetic layer that may explain why the identical hemodynamic or inflammatory stressor yields different cellular fates with age. Extending this axis into vascular smooth muscle, Rothwell et al. showed that loss-of-function variants of POLG-encoded mitochondrial DNA polymerase (POLG), observed in hypertensive patients, reduce mtDNA copy number and, importantly, trigger secretion of a diffusive mitogen that accelerates proliferation in neighboring cells. They also showed that pharmacological probes such as wedelolate and MitoTEMPOL could temper this mitogenic drive. This \" mitochondrial-to-mitogen \" mechanism offers a structural path to drug-resistant hypertension: even modest mitochondrial impairment can broadcast a growth signal that remodels the arterial wall.\nVascular aging is inseparable from neurovascular aging. Two original studies quantify how systemic or traumatic perturbations imprint cerebrovascular structure and glial interfaces. A study by Curry-Koski et al. demonstrate that a well-established Marfan syndrome mouse model carrying a heterogeneous missense mutation in the gene encoding for fibrillin-1 protein exhibits reduced hippocampal microvascular density, increased blood-brain barrier permeability, and microglial activation at six months-mirroring phenotypes that typically emerge later-supporting a premature neurovascular aging trajectory in connective-tissue disease. Complementary mapping of astrocyte-vessel interactions after diffuse traumatic brain injury by Sabetta et al. reveal sex-dependent, long-lived alterations in Glial Fibrillary Acidic Protein (GFAP)positive processes contacting cortical vessels, patterns consistent with lingering barrier vulnerability and a cellular substrate for accelerated brain aging after injury. These data extend the focus beyond parenchymal pathology to the perivascular unit, reframing long-term cognitive risk as, in part, a vascular remodeling disease.", "doc_items_refs": ["#/texts/27", "#/texts/28"], "page_nos": [1], "uuid": "f8fe9dcd-8238-429a-a1af-8e75c2612432"}
{"doc_id": "2025__Editorial_Decoding_vascular_aging_unraveling_the_enigma_of_pathological_conditio__W4414742927", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Editorial_Decoding_vascular_aging_unraveling_the_enigma_of_pathological_conditio__W4414742927.doctags", "chunk_id": 3, "source_chunk_idxs": [9], "num_tokens": 346, "text": "Introduction\nAt the population interface, new analyses of sleep and postviral states anchor everyday exposures to measurable vascular aging. Martínez-García et al. report that in healthy adults, shorter sleep duration associates inversely with advanced glycation end-products measured by skin autofluorescence-an accessible marker of cumulative metabolic stress-even after adjustment, reinforcing insufficient sleep as a modifiable vascular risk exposure. Complementing this, Gómez-Sánchez et al. outline a prospective, multimodal protocol incorporating-vascular structure and function, endothelial biomarkers, physical activity, cognition, and mental health-to quantify persistent COVID (\"long COVID\") as a vascular-aging condition; notably, it integrates cfPWV/baPWV and the cardio-ankle vascular index with endothelial injury readouts in a 300-participant cohort. Together, these studies illustrate how behaviors and post-viral syndromes may accelerate the arterial\nage clock, and how acceleration can be quantified reproducibly in real-world settings.\nA field-level biometric map by Chen et al. highlights that scientific finding itself follows an \" aging \" pattern. Reviewing more than 1,600 articles at the interface of metabolomics and arterial stiffness, the report shows mature attention clustering around fattyacid pathways (including eicosatetraenoic acid and arachidonic acid), while bile-acid and microbiome-derived metabolites remain relatively underexplored. Most striking is the underrepresentation of early vascular aging cohorts in youth that warrant more studies and attention, if prevention is to remain a central focus.", "doc_items_refs": ["#/texts/29", "#/texts/33", "#/texts/34"], "page_nos": [1], "uuid": "9378fe72-50c5-44b9-bf38-f3a7f73eba5e"}
{"doc_id": "2025__Editorial_Decoding_vascular_aging_unraveling_the_enigma_of_pathological_conditio__W4414742927", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Editorial_Decoding_vascular_aging_unraveling_the_enigma_of_pathological_conditio__W4414742927.doctags", "chunk_id": 4, "source_chunk_idxs": [10], "num_tokens": 227, "text": "Introduction\nTaken together, three distinct themes emerge that integrate these diverse studies into a coherent framework: 1. endothelial centrality: from progerin-distorted shear responses to LOX-1-mediated oxidized-lipid effects, the endothelium emerges as a convergence point where mechanical and chemical stressors meet. Restoring \" healthy shear \" signaling-whether by correcting upstream genome architecture or blocking maladaptive receptors-is a credible antiving strategy; 2. mitochondrial control points: mitomiRs and POLG dysfunction demonstrate how mitochondrial information flow sets the tone of cellular stress responses and can propagate outward as paracrine growth cues that stiffen vessels; targeting mitochondrial redox and transcriptional crosstalk may yield outsized structural benefits; and 3. vulnerability of the neurovascular unit: premature aging in Marfan cerebrovasculature and sexdependent astrocyte-vessel remodeling after traumatic brain injury position the perivascular niche as a long-lived \" memory \" of systemic insults, with implications for dementia risk stratification and sex-tailored interventions.", "doc_items_refs": ["#/texts/35"], "page_nos": [1], "uuid": "700c7bc7-2ae8-48da-bf49-0962ca02bb0b"}
{"doc_id": "2025__Editorial_Decoding_vascular_aging_unraveling_the_enigma_of_pathological_conditio__W4414742927", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Editorial_Decoding_vascular_aging_unraveling_the_enigma_of_pathological_conditio__W4414742927.doctags", "chunk_id": 5, "source_chunk_idxs": [11], "num_tokens": 458, "text": "Prospective\nThese findings bring several priorities to our attention. In the field of vascular medicine, there is an emergent need to re-center on early vascular aging with youth and mid-life cohorts, combining pulse-wave-based measurements with endothelial injury panels and miRNA/mitomiR signatures to define targetable endpoints before wall stiffness is developed. We should also consider utilizing mechanotransduction therapeutics by translating genotype to flow-response insights into screens for compounds that restore shear-responsive transcripts (for example, suppressing maladaptive galectins) and by testing LOX-1 inhibitors in sex- and age-stratified designs aligned with ex vivo aorta data. Another innovative idea is to target mitochondria not only as power plants, but also as important information hubs, by developing mitomiR-guided interventions and evaluating anti-mitogenic, mito-active agents in structural hypertension models to interrupt smooth-muscle remodeling loops initiated by mitochondrial DNA stress. We should embed brain outcomes in vascular trials-adding barrier permeability and astrocyte-vessel interaction metrics, via advanced MRI and blood biomarkers, with sex as an important cofounder. It is also of great importance to give more credits to modifiable exposures such as sleep and infectious diseases, the same way we pay attention to diet and physical activity in the context of preventive medicine, understanding their contribution and impact on vascular function and structure over time.\nCollectively, these reports shift vascular aging research from static descriptors-thickness and stiffness-to dynamic, multi-scale pathophysiology that we can measure, modulate, and, crucially, modify early. By integrating mechanistic insights into endothelial shear programs, mitochondrial signaling, and lipid metabolism with translational models of progeria, Marfan syndrome, and traumatic brain injury-and grounding these findings in population-level factors such as sleep and post-COVID phenotyping-this Research Topic charts a roadmap to vascular rejuvenation that is both scientifically ambitious and clinically practical. Our thanks to the authors and reviewers for pushing the field toward integrated future.", "doc_items_refs": ["#/texts/37", "#/texts/40"], "page_nos": [1], "uuid": "c6f73796-96fa-4ea4-89d4-8bcba9805897"}
{"doc_id": "2025__Editorial_Decoding_vascular_aging_unraveling_the_enigma_of_pathological_conditio__W4414742927", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Editorial_Decoding_vascular_aging_unraveling_the_enigma_of_pathological_conditio__W4414742927.doctags", "chunk_id": 6, "source_chunk_idxs": [12, 13, 14, 15, 16], "num_tokens": 325, "text": "Author contributions\nME: Conceptualization, Investigation, Writing - original draft, Writing - review and editing. RR: Conceptualization, Investigation, Writing - original draft, Writing - review and editing.\n\nFunding\nThe author(s) declare that no financial support was received for the research and/or publication of this article.\n\nConflict of interest\nThe authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest.\nThe author(s) declared that they were an editorial board member of Frontiers, at the time of submission. This had no impact on the peer review process and the final decision.\n\nGenerative AI statement\nThe author(s) declare that Generative AI was used in the creation of this manuscript. The authors used Paperpal's generative AI tools within Microsoft Word to assist in revising the original manuscript. The tool was applied to enhance clarity, grammar, and overall readability; however, the core content and ideas remain the authors' own.\nAny alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us.\n\nPublisher's note\nAll claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher.", "doc_items_refs": ["#/texts/42", "#/texts/44", "#/texts/46", "#/texts/49", "#/texts/51", "#/texts/52", "#/texts/54"], "page_nos": [1], "uuid": "62e95f06-20c7-4056-b824-26b7b16486a5"}
