{"doc_id": "2025__The_need_for_dengue_and_chikungunya_awareness_among_mental_health_professionals___W4414397994", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__The_need_for_dengue_and_chikungunya_awareness_among_mental_health_professionals___W4414397994.doctags", "chunk_id": 0, "source_chunk_idxs": [0, 1, 2, 3, 4], "num_tokens": 371, "text": "&lt;!-- image --&gt;\n&lt;!-- image --&gt;\n\nOPEN ACCESS\nEdited by Paolo Vassalini, Sapienza University of Rome, Italy\nREVIEWED BY\nRoméo Médèssò Togan, University of Lomé, Togo\n*CORRESPONDENCE\nGuglielmo Lucchese\nguglielmo.lucchese@uni-greifswald.de\nRECEIVED 24 July 2025\nACCEPTED 02 September 2025\nPUBLISHED 22 September 2025\n\nCITATION\nLucchese G and Stufano A (2025) The need for dengue and chikungunya awareness among mental health professionals in Europe. Front. Psychiatry 16:1672597. doi: 10.3389/fpsyt.2025.1672597\n\nCOPYRIGHT\n© 2025 Lucchese and Stufano. This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication in this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms.\n\nThe need for dengue and chikungunya awareness among mental health professionals in Europe\nGuglielmo Lucchese 1,2* and Angela Stufano 3\n1 Department of Neurology, University of Greifswald, Greifswald, Germany, 2 Department of Experimental Medicine, University of Salento, College ISUFI, Lecce, Italy, 3 Department of Medical and Surgical Sciences, University of Foggia, Foggia, Italy\nKEYWORDS\ncognition, depression, postinfectious, Arbovirus, Togavirus, Flavivirus", "doc_items_refs": ["#/pictures/0", "#/pictures/1", "#/texts/1", "#/texts/2", "#/texts/3", "#/texts/4", "#/texts/5", "#/texts/6", "#/texts/7", "#/texts/8", "#/texts/9", "#/texts/11", "#/texts/13", "#/texts/17", "#/texts/18", "#/texts/19", "#/texts/20"], "page_nos": [1]}
{"doc_id": "2025__The_need_for_dengue_and_chikungunya_awareness_among_mental_health_professionals___W4414397994", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__The_need_for_dengue_and_chikungunya_awareness_among_mental_health_professionals___W4414397994.doctags", "chunk_id": 1, "source_chunk_idxs": [5], "num_tokens": 224, "text": "Introduction\nThe dynamics of dengue (DENV) and chikungunya (CHIKV) virus transmission across Europe are undergoing a significant transformation, spurred by both global warming and the expanding presence of Aedes albopictus, commonly known as the Asian tiger mosquito (1). A recent projection by Farooq et al. suggests that, under severe climate trajectories, the potential for outbreaks of these viruses could multiply nearly five times by the 2060s (1). This points toward a possible transition from occasional flare-ups to more entrenched, continuous transmission in certain parts of the European Union. Italy, in particular, stands out in newly released analyses covering the period from 2006 to 2023, marking it as a key European scenario for arboviral disease emergence (2). The research indicates that local outbreaks are closely tied to the introduction timing and geography of infected individuals. Nonetheless, the data confirm that environmental conditions-such as population density, favorable climate, and the pervasive establishment of Aedes albopictus -significantly contribute to sustained transmission.", "doc_items_refs": ["#/texts/22"], "page_nos": [1]}
{"doc_id": "2025__The_need_for_dengue_and_chikungunya_awareness_among_mental_health_professionals___W4414397994", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__The_need_for_dengue_and_chikungunya_awareness_among_mental_health_professionals___W4414397994.doctags", "chunk_id": 2, "source_chunk_idxs": [6], "num_tokens": 413, "text": "Introduction\nA third retrospective study analyzed chikungunya cases in mainland Europe over 16 years, combining epidemiological data, genomic surveillance, and clinical meta-analyses. From 2007-2022, 4,730 cases were reported across 22 countries, with the UK, France, Germany, and Italy accounting for most (3). The majority were travel-related, originating mainly from India, the Caribbean, and Southeast Asia, though several autochthonous outbreaks occurred in Italy (2007, 2017) and France (2014, 2017). Peaks in incidence aligned with summer travel seasons. Clinical manifestations were dominated by fever (97.6%), joint pain (94.3%), fatigue (63.5%), and rash (52.3%). Genomic analysis revealed two circulating genotypes, with II-ECSA predominant; the adaptive E1 A226V mutation was associated with outbreaks involving Ae. albopictus. While no cases were recorded in 2023, the study emphasizes that climate change, increased global mobility, and vector expansion keep Europe at risk. Indeed, a review just one year old compared southern and northern Europe with regard to climate change and spread of invasive Aedes mosquitoes, particularly Aedes albopictus (4). Climate change could facilitate future dengue (DENV) and chikungunya (CHIKV) outbreaks in northern Europe. Projections suggest that by mid-\nto late-century, environmental conditions will increasingly support the establishment of Aedes species in northern Europe. Evidence from southern Europe, where Ae. albopictus is already established, shows that local outbreaks tend to follow within a decade of mosquito settlement. Both viruses-though often mild-can lead to severe disease and high public health costs, especially in immunologically na¨ıve populations. Northern Europe is likely to face autochthonous outbreaks in the coming decades, making surveillance, diagnostic readiness, and climate change mitigation critical for prevention.", "doc_items_refs": ["#/texts/23", "#/texts/27"], "page_nos": [1]}
{"doc_id": "2025__The_need_for_dengue_and_chikungunya_awareness_among_mental_health_professionals___W4414397994", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__The_need_for_dengue_and_chikungunya_awareness_among_mental_health_professionals___W4414397994.doctags", "chunk_id": 3, "source_chunk_idxs": [7, 8], "num_tokens": 252, "text": "Introduction\nThese studies point to a growing likelihood of recurring DENV and CHIKV events in Europe, propelled by both climatic shifts and increased human mobility. This underscores the urgent need to strengthen early warning systems and monitoring efforts, especially in areas with ecological conditions conducive to virus persistence, even if they haven't seen previous outbreaks. Once largely confined to tropical zones, DENV and CHIKV have shown clear potential to establish footholds in new, temperate territories like Europe.\n\nAcute psychiatric manifestation of DENV and CHIKV infection\nPsychotic manifestations during or a few days after acute DENV infection have been described both in adult and pediatric patients (5-7). A recent review by D ' Souza and D ' Silva described depression, anxiety, mania, and psychosis in association with acute or subacute dengue fever and Dinakaran et al. highlighted anxiety and depression as most frequent psychiatric manifestations of the acute infection (8, 9). Similar reports of psychosis and mania during acute CHIKV infection exist (10, 11). These acute psychiatric manifestations of DENV and CHIKV might be due to encephalitis and encephalopathy (7, 12).", "doc_items_refs": ["#/texts/28", "#/texts/30"], "page_nos": [1]}
{"doc_id": "2025__The_need_for_dengue_and_chikungunya_awareness_among_mental_health_professionals___W4414397994", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__The_need_for_dengue_and_chikungunya_awareness_among_mental_health_professionals___W4414397994.doctags", "chunk_id": 4, "source_chunk_idxs": [9], "num_tokens": 375, "text": "Chronic psychiatric manifestations of DENV and CHIKV infection\nThe same reviews of observational studies showing psychiatric manifestation of acute dengue fever also describe long-term postinfectious psychiatric sequelae that might constitute an even heavier burden on mental health and are currently under investigated (8, 9, 13).\nSpecifically, D ' Souza and D ' Silva indicated as key predictors illness severity, thrombocytopenia, serotypes DENV-2 and DENV3, and hospitalization-related stress as key predictors of long-term prenatal consequences. Inflammatory cytokines and epigenetic alterations appear to be central to the proposed pathogenesis. They advocate for long-term psychiatric follow-up and integration of mental health screening in dengue management (8). Dinakaran et al. highlighted how various long-term neuropsychiatric manifestations associated with dengue, including anxiety, depression, mania, psychosis, and cognitive deficits may occur independent of encephalopathy. Mechanisms proposed include cytokine-mediated neuroinflammation, blood-brain barrier\ndisruption, and epigenetic changes such as histone deacetylase (HDAC) activation (9).\nCognition appears also to be chronically affected following DENV infection. A large-scale Taiwanese study (n=244,420) confirmed a modest but statistically significant increase in psychiatric disorders among dengue patients. A specific increases were noted for dementia. The risk was particularly pronounced in individuals over 60 and was evident across sexes (14).\nSimilarly, depression, anxiety, cognitive dysfunction, and even manic episodes have been reported in CHIKV-infected individuals (15). Studies have shown depression in over 44% of infected individuals in Mexico and memory complaints in 70% of elderly patients in Brazil (15).", "doc_items_refs": ["#/texts/32", "#/texts/33", "#/texts/36", "#/texts/37", "#/texts/38"], "page_nos": [1]}
{"doc_id": "2025__The_need_for_dengue_and_chikungunya_awareness_among_mental_health_professionals___W4414397994", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__The_need_for_dengue_and_chikungunya_awareness_among_mental_health_professionals___W4414397994.doctags", "chunk_id": 5, "source_chunk_idxs": [10], "num_tokens": 495, "text": "Chronic psychiatric manifestations of DENV and CHIKV infection\nEvidence from longitudinal studies specifically indicate high risk of psychiatric sequelae even years after acute infection. A prospective cohort study from Ecuador revealed that dengue survivors experience elevated symptoms of depression and stress in the early months post-infection. At three months, 44.4% of dengue cases had elevated DASS-21 depression scores compared to 17.1% of controls. Stress scores were also significantly higher. While most symptoms normalized over 12 months, neurocognitive testing at one year still showed diminished spatial working memory in cases compared to controls (13). Further longitudinal studies suggest depressive symptoms can persist or emerge years after infection, especially in individuals with chronic arthralgia (13). A nationwide longitudinal Taiwanese study analyzing over 45,000 DENV patients found significantly increased risks of depressive disorders across all timeframes post-infection:\nMechanistically, inflammatory cytokines such as IL-6 and TNF- α may be involved in neuropsychiatric effects (17). Routine psychiatric screening in CHIKV patients, especially older adults, are advocated and the lack of standardized management guidelines currently hinders optimal treatment (17). Farias et al. also highlight the psychiatric burden of CHIKV, citing case reports and small studies that document mood disorders like depression, anxiety, and bipolar exacerbations during the chronic phase (17). They again emphasize that persistent inflammatory states, particularly elevated IL-6, may contribute to psychiatric symptoms and call for urgent large-scale, longitudinal research to elucidate mechanisms and risk factors and to develop proper clinical management strategies (17). CHIKV just like DENV also seems to affect long-term cognitive functions. An empirical investigation on cognitive dysfunction post-CHIKV infection in older adults reveal that CHIKV infection is significantly associated with impairments in executive function, memory, and processing speed (18). About 20% of patients also reported depressive symptoms (18). This suggests that CHIKV ' s impact on mental health is not just transient but potentially long-lasting and functionally debilitating in older populations. The relevance of the cognitive impact of CHIKV in geriatric populations lies in a potential increase in dementia in a region like Europe, where the prevalence of cognitive impairment is rising because of population aging in spite of a falling incidence (19, 20).", "doc_items_refs": ["#/texts/39", "#/texts/40"], "page_nos": [1]}
{"doc_id": "2025__The_need_for_dengue_and_chikungunya_awareness_among_mental_health_professionals___W4414397994", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__The_need_for_dengue_and_chikungunya_awareness_among_mental_health_professionals___W4414397994.doctags", "chunk_id": 6, "source_chunk_idxs": [11, 12], "num_tokens": 293, "text": "Discussion\nThe recent and foreseeable increase in DENV and CHIKV cases in Europe requires better physician awareness and quicker case identification to enhance early detection and mitigate future risks. Among European physicians, psychiatrists especially need to be on the lookout because DENV and CHIKV may induce a wide array of psychiatric manifestations with a large degree of overlap with other secondary and primary mental health disorders. Prompt diagnosis of acute and chronic mental complications of DENV and CHIKV is of paramount importance for a variety of reasons. First, it allows to optimize the treatment of patients with DENV and CHIKV related mental health conditions that otherwise would remain etiologically uncertain. Second, it facilitates posthaste and effective implementation of public health measures. Finally, it permits the accumulation of data and knowledge on the etiopathogenesis and the mechanisms of arbovirus-induced mental health sequelae paving the way for therapeutic developments. Recommended measures for practicing mental health professionals include a thorough medical history including vaccinations, recent and remote clinical signs of infection, as well as travel and occupational history; careful evaluation of hematological, hepatic, renal, and inflammation laboratory parameters; prompt serological testing in suspected cases; and molecular testing in suspected acute cases.\n\nAuthor contributions\nGL: Conceptualization, Writing - original draft, Writing review &amp; editing. AS: Writing - original draft, Writing - review &amp; editing.", "doc_items_refs": ["#/texts/45", "#/texts/47"], "page_nos": [1]}
{"doc_id": "2025__The_need_for_dengue_and_chikungunya_awareness_among_mental_health_professionals___W4414397994", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__The_need_for_dengue_and_chikungunya_awareness_among_mental_health_professionals___W4414397994.doctags", "chunk_id": 7, "source_chunk_idxs": [13], "num_tokens": 468, "text": "References\n- 1. Farooq Z, Segelmark L, Rocklöv J, Lillepold K, Sweve MO, Brie OTJ, et al. Impact of climate and Aedes albopictus establishment on dengue and chikungunya outbreaks in Europe: a time-to-event analysis. Lancet Planet Health . (2025) 9:e374-83. doi: 10.1016/S2542-5196(25)00059-2\n- 2. Menegale F, Manica M, Del Manso M, Bella A, Zardini A, Gobbi A, et al. Risk assessment and perspectives of local transmission of chikungunya and dengue in Italy, a European fornerunner. Nat Commun . (2025) 16:6237. doi: 10.1038/s41467-02561109-1\n- 3. Liu Q, Shen H, Gu L, Yuan H, Zhu W. Chikungunya virus in Europe: A retrospective epidemiology study from 2007 to 2023. PloS Negt Trop Dis . (2025) 19: e0012904. doi: 10.1371/journal.pntd.0012904\n- 4. Laverdeur J, Desmecht D, Hayette M-P, Darcis G. Dengue and chikungunya: future threats for Northern Europe? Front Epidemiol . (2024) 4:1342723. doi: 10.3389/\n- 5. Bhatnagar R, Prasad P. Acute psychosis in a child with severe dengue. J Nepal Paediatr Soc . (2017) 37:273-5. doi: 10.3126/jnps.v3713.16481\n- 6. Elavia Z, Patra SS, Kumar S, Inban P, Yousuf M, Atha S, Hussi Y, et al. Acute psychosis and mania: an uncommon complication of dengue fever. Cureus . (2023) 15:e47425. doi: 10.7759/cureus.47425", "doc_items_refs": ["#/texts/49", "#/texts/50", "#/texts/51", "#/texts/52", "#/texts/53", "#/texts/54"], "page_nos": []}
{"doc_id": "2025__The_need_for_dengue_and_chikungunya_awareness_among_mental_health_professionals___W4414397994", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__The_need_for_dengue_and_chikungunya_awareness_among_mental_health_professionals___W4414397994.doctags", "chunk_id": 8, "source_chunk_idxs": [14, 15, 16, 17, 18], "num_tokens": 381, "text": "References\n- 7. Hussain H, Janaka KVC, Gunasekara H, Krishnan M, Perera I. Acute psychosis presenting with dengue fever complicated by dengue encephalitis. Cureus . (2024) 16: e55628. doi: 10.7759/cureus.55628\n- 8. D'Souza PR, D'Silva DS. Psychiatric sequelae of dengue: a review of the interface. J Trop Med . (2025) 2025:7136558. doi: 10.1155/jotm/7136558\n\nFunding\nThe author(s) declare financial support was received for the research and/or publication of this article. Support for the publication fee was provided by University of Greifswald's publication fund.\n\nConflict of interest\nThe authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest.\nThe author(s) declared that they were an editorial board member of Frontiers, at the time of submission. This had no impact on the peer review process and the final decision.\n\nGenerative AI statement\nThe author(s) declare that no Generative AI was used in the creation of this manuscript.\nAny alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us.\n\nPublisher's note\nAll claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher.", "doc_items_refs": ["#/texts/55", "#/texts/56", "#/texts/61", "#/texts/63", "#/texts/64", "#/texts/66", "#/texts/67", "#/texts/69"], "page_nos": [1]}
{"doc_id": "2025__The_need_for_dengue_and_chikungunya_awareness_among_mental_health_professionals___W4414397994", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__The_need_for_dengue_and_chikungunya_awareness_among_mental_health_professionals___W4414397994.doctags", "chunk_id": 9, "source_chunk_idxs": [19], "num_tokens": 477, "text": "Publisher's note\n- 9. Dinakaran D, Sreeeraj VS, Venkatasubramanian G. Dengue and psychiatry: manifestations, mechanisms, and management options. Indian J Psychol Med . (2022) 44:429-35. doi: 10.1177/02537176211022571\n- 10. Vembu K, Jha P, Paudel H. Chikungunya infection presenting as acute psychosis JGIM J gen intern med. J Gen Intern Med . (2015) 30(Suppl 2):45-551. doi: 10.1007/ s11606-01532-7130\n- 11. Soares DS, Fortaleza LY, Melo MC. Chikungunya-induced manic episode in a patient with no psychiatric history: a case report. Braz J Psychiatry . (2020) 00:000-0. doi: 10.1590/1516-4446-2020-0892\n- 12. Gérardin P, Couderc T, Bintner M, Tournebize P, Renouil M, Lémant J, et al. Chikungunya virus-associated encephalitis: a cohort study on La Reunion island, 20052009. Neurology . (2015) 86:94-102. doi: 10.1210/WNL.00000000002234\n- 13. Salazar Buenajo IP, Zurita Alvarado FA, Weyand I, Rosero Montezuma T, Tapia B, Solis Olive C, et al. Impact of dengue fever on depression, anxiety, and stress symptoms in Esmeraldas Province, Ecuador: a prospective cohort study. Trop Med Health . (2024) 52:63. doi: 10.1176/s41182-024-00625-0\n- 14. Lin HC, Chou HP, Chiang YC, Chang R, Chen YS, Juan YC. Neurological or psychiatric disorders after dengue fever. JAMA Netw . (2024) 7:e2410075. doi: 10.1001/jamanetworkopen.2024.10075", "doc_items_refs": ["#/texts/70", "#/texts/71", "#/texts/72", "#/texts/73", "#/texts/74", "#/texts/75"], "page_nos": []}
{"doc_id": "2025__The_need_for_dengue_and_chikungunya_awareness_among_mental_health_professionals___W4414397994", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__The_need_for_dengue_and_chikungunya_awareness_among_mental_health_professionals___W4414397994.doctags", "chunk_id": 10, "source_chunk_idxs": [20], "num_tokens": 423, "text": "Publisher's note\n- 15. Afroz O. Psychiatric manifestations of Chikungunya virus infection: An overlooked public health concern. Paris T Odoct . (2023). doi: 10.1177/004947552513349075\n- 16. Shih HI, Wyang YP, Chi CY, Chien YW. Risks of anxiety disorders, depressive disorders, and sleep disorders in patients with dengue fever: A nationwide, population-based cohort study. PloS Negt Trop Dis . (2024) 18:e0012239. doi: 10.1371/journal.pntd.0012239\n- 17. Farias LABG, Pires Neto RJ, Campos EM. Chikungunya fever and mental illness: a poorly understood relationship needing additional study. Braz J Psychiatry. (2019) 41:275-6. doi: 10.1590/0101-60830000000206\n- 18. Peixoto VGMNP, Azevedo JP, Luz KG, Dantas T, Batista RF, Carvalho FHC, et al. Cognitive dysfunction of Chikungunya virus infection in older adults. Front Psychiatry. (2022) 13:823218. doi: 10.3389/fpsyt.2022.823218\n- 19. Wolters FJ, Chibnik LB, Waziry R, Anderson R, Berr C, Beiser A, et al. Twentyseven-year time trends in dementia incidence in Europe and the United States: The Alzheimer Cohorts Consortium. Neurology. (2020) 95:e519-31. doi: 10.1212/ WNL.00000000000010022\n- 20. OECD. Health at a glance 2023: OECD indicators. Paris: OECD Publishing (2023). doi: 10.1787/7a7afb35-en", "doc_items_refs": ["#/texts/76", "#/texts/77", "#/texts/80", "#/texts/81", "#/texts/84", "#/texts/85"], "page_nos": []}
