{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 0, "source_chunk_idxs": [0, 1, 2], "num_tokens": 335, "text": "&lt;!-- image --&gt;\n&lt;!-- image --&gt;\n\nOPEN ACCESS\nEDITED BY\nMark Antoniou, Western Sydney University, Australia\nREVIEWED\nBY\nAlexandra Wolf, RIKEN Center for Advanced Intelligence Project (AIP), Japan Lifeng Tang, Ningbo Rehabilitation Hospital, China\n*CORRESPONDENCE\nRaffaela Maione 63 raffaela.maione@irccsme.it\nRECEIVED 06 June 2025 ACCEPTED 19 August 2025 PUBLISHED 09 September 2025\nMaggio MG, Maione R, Cotelli M, Bonasera P, Corallo F, Pistorino G, Luca A, Marra A, Quarartone A, Nicoletti A and Calabr GLYPH 20 (2025) Cognitive rehabilitation using virtual reality in subjective cognitive decline and mild cognitive impairment: a systematic review. Front. Psychol. 16:1641693. doi: 10.3389/fpsyg.2025.1641693\n\nCOPYRIGHT\n© 2025 Maggio, Maione, Cotelli, Bonasera, Corallo, Pistorino, Luca, Marra, Quarartone, Nicoletti and Calabr GLYPH 20. This is an open-access article distributed under the terms of the Creative Commons Attribution License (CC BY). The use, distribution or reproduction in other forums is permitted, provided the original author(s) and the copyright owner(s) are credited and that the original publication\nin this journal is cited, in accordance with accepted academic practice. No use, distribution or reproduction is permitted which does not comply with these terms.", "doc_items_refs": ["#/pictures/0", "#/pictures/1", "#/texts/1", "#/texts/2", "#/texts/3", "#/texts/4", "#/texts/5", "#/texts/6", "#/texts/7", "#/texts/8", "#/texts/9", "#/texts/11", "#/texts/12"], "page_nos": [1], "uuid": "90f42d80-b9e3-4654-b2c0-15c49c5c82f7"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 1, "source_chunk_idxs": [3], "num_tokens": 459, "text": "Cognitive rehabilitation using virtual reality in subjective cognitive decline and mild cognitive impairment: a systematic review\nMaria Grazia Maggio$^{1}$, Raffaela Maione$^{1}$*, Maria Cotelli$^{2}$, Piero Bonasera$^{1}$, Francesco Corallo$^{1}$, Giulia Pistorino$^{3}$, Antonina Luca$^{4}$, Angela Marra$^{1}$, Angelo Quartarone$^{1}$, Alessandra Nicoletti$^{5}$ and Rocco Salvatore Calabr GLYPH\n$^{1}$IRCCS Centro Neurolesi Bonino-Pulejo, Messina, Italy, $^{2}$Neuropsychology Unit, IRCCS Istituto Centro San Giovanni di Dio Fatebenefrateli, Brescia, Italy, $^{3}$Department of Medicine and Surgery, Università degli Studi di Messina, Messina, Italy, $^{4}$Department of Psychological Sciences and Techniques, Università degli Studi di Enna $^{*}$Kore, Enna, Italy, $^{5}$Department of Medical, Surgical Sciences and Advanced Technologies $^{*}$G.F. Ingrassia, University of Catania, Catania, Italy\nBackground: Mild Cognitive Impairment (MCI) and Subjective Cognitive Decline (SCD) are heterogeneous conditions that may indicate early dementia. Virtual Reality (VR) is emerging as a promising non-pharmacological tool for cognitive training. However, its effectiveness in these populations remains unclear. This systematic review examines the impact of VR-based cognitive interventions in individuals with SCD and MCI.\nMethods: A systematic review was conducted in accordance with PRISMA guidelines. Studies published between 2019 and 2025 investigating VR-based cognitive interventions in individuals diagnosed with SCD or MCI were identified through searches in PubMed, Scopus, Embase, and Web of Science. Eligible studies included randomized controlled trials (RCTs), experimental studies, and usability studies.", "doc_items_refs": ["#/texts/17", "#/texts/18", "#/texts/19", "#/texts/20"], "page_nos": [1], "uuid": "bc55646b-f127-4448-8838-9c17b3bf7137"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 2, "source_chunk_idxs": [4, 5], "num_tokens": 263, "text": "Cognitive rehabilitation using virtual reality in subjective cognitive decline and mild cognitive impairment: a systematic review\nResults: Nineteen studies met the inclusion criteria, including 14 RCTs, 2 usability studies, and 3 experimental studies. The majority of studies reported significant improvements in various cognitive domains, particularly memory, attention, and executive function, following VR-based interventions. Several studies also highlighted the positive impact of VR on user engagement and motivation, with high adherence and low dropout rates. However, there was considerable variability in intervention protocols, cognitive outcome measures, and participant characteristics. Most studies focused on individuals with MCI, while research on SCD populations remains limited and preliminary. Methodological quality varied, with some studies lacking adequate sample sizes or long-term follow-up.\nConclusion: VR-based cognitive interventions appear to be a feasible and potentially effective approach for enhancing cognitive function in individuals with MCI, with emerging evidence also supporting their use in SCD. Despite encouraging results, further high-quality, large-scale trials are needed to validate these findings, standardize intervention protocols, and explore longterm benefits.\nSystematic review registration: CRD42025644894.\n\nKEYWORDS\nmild cognitive impairment, subjective cognitive decline, virtual reality-based cognitive training, cognitive rehabilitation, neurorehabilitation, early diagnosis", "doc_items_refs": ["#/texts/21", "#/texts/22", "#/texts/23", "#/texts/27"], "page_nos": [1], "uuid": "3021aea1-74bd-4b29-a4d4-e24cb486f2b6"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 3, "source_chunk_idxs": [6], "num_tokens": 464, "text": "1 Introduction\nMild cognitive impairment (MCI) is considered an intermediate state between normal aging and dementia, characterized by cognitive deficits that do not yet significantly interfere with daily life (Sachdev et al., 2014). Among its subtypes, Amnestic MCI is particularly associated with Alzheimer's disease and has a higher likelihood of progressing to dementia, whereas other subtypes may remain stable or even show improvement over time (Duff, 2024).\nSubjective cognitive decline (SCD), characterized by self-reported cognitive difficulties despite normal performance on neuropsychological tests (Jessen et al., 2014) it is increasingly recognized as a potential precursor to MCI and dementia, particularly in individuals with biomarker evidence of AD pathology (Jessen et al., 2014; Jessen et al., 2020; Rabin et al., 2017; Reisberg et al., 2010).\nCognitive impairment, even in its early stages, is a growing public health concern, with MCI affecting approximately 15-20% of older adults and SCD reported by an even larger proportion (World Health Organization (WHO), 2021). SCD is particularly relevant as a potential warning sign of future decline. Studies estimate that 11.1% of individuals over 45 years old report SCD, with risk factors including aging, genetics, cardiovascular disease, diabetes, depression, and lifestyle factors (Bassett and Folstein, 1993; Bessi et al., 2018; Gjøra et al., 2021; Liu et al., 2025; Rabin et al., 2015).\nWhile SCD may remain stable or even improve, in some cases it represents the earliest detectable sign of underlying neurodegeneration, particularly in individuals with positive biomarkers for AD (Jessen et al., 2014). The transition from SCD to MCI is significant, marking the shift from subjective complaints to measurable cognitive deficits and highlighting the need for close monitoring of at-risk individuals (Rabin et al., 2017).\nAlthough not all individuals with SCD or MCI will progress to dementia, these conditions increase the risk of neurodegeneration, making early identification and intervention crucial (Jack et al., 2011).", "doc_items_refs": ["#/texts/29", "#/texts/30", "#/texts/31", "#/texts/32", "#/texts/33"], "page_nos": [1], "uuid": "94130d71-fde6-4701-a41c-15cfca1bb7d5"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 4, "source_chunk_idxs": [7], "num_tokens": 467, "text": "1 Introduction\nThe early identification of SCD and MCI may offer a crucial window for intervention. Timely monitoring and targeted strategies can help delay or mitigate disease progression, emphasizing the importance of addressing cognitive concerns at the earliest stages (Jack et al., 2011).\nAlthough individuals with SCD often maintain independence, many experiences daily challenges such as medication adherence, financial management, and household tasks (Tuokko and Smart, 2018). They also exhibit higher levels of distress, reduced social participation, and greater functional limitations, particularly in middle-aged adults (Wion et al., 2020).\nGiven the lack of disease-modifying treatments, there is a critical need for innovative non-pharmacological interventions aimed at maintaining cognitive function and delaying disease progression. In this context, VR-based cognitive interventions have gained attention for their ability to simulate real-world tasks, enhance cognitive engagement, and provide personalized, adaptive rehabilitation experiences (Yang et al., 2025). Virtual reality (VR) is an interactive computer-generated environment that simulates real-world settings,\nproviding multisensory stimulation through visual, auditory, and motion-based feedback (Tieri et al., 2018). VR provides different degrees of \"immersion\" and \"presence.\" Immersion refers to the objective perceptual experience determined by the system's features and the characteristics of the virtual task (i.e., the physical sensation of being in a virtual world). In contrast, presence is a subjective phenomenon, reflecting the user's perceived involvement and emotional activation during the virtual experience (Tieri et al., 2018; Riva et al., 2020; Maggio et al., 2024). Based on the degree of immersion, VR interventions can be classified into three main categories: fully immersive VR, which involves the use of headmounted displays (HMDs) or CAVE systems providing multisensory engagement; semi-immersive VR, which includes large screen-based simulations offering partial sensory involvement; and non-immersive VR, which refers to computer-based applications that offer minimal sensory integration and typically involve interaction through standard displays and interfaces (Tieri et al., 2018; Riva et al., 2020; Maggio et al., 2024).", "doc_items_refs": ["#/texts/34", "#/texts/35", "#/texts/36", "#/texts/40"], "page_nos": [1], "uuid": "c9dfd8eb-d0b1-4979-a527-1b8229bd8401"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 5, "source_chunk_idxs": [8, 9], "num_tokens": 478, "text": "1 Introduction\nUnlike traditional cognitive training, which often involves repetitive, abstract exercises, VR enables personalized, ecologically valid experiences that may mimic daily activities in a safe, controlled setting (Zhu et al., 2024). These features could enhance engagement, motivation, and adherence, key challenges in cognitive rehabilitation (Choi and Twamley, 2013).\nGiven the growing body of literature in the field, the present review seeks to address ongoing gaps focusing specifically on the feasibility, usability, and effectiveness of VR interventions in the earliest stages of cognitive decline, i.e., patients with SCD and MCI. Unlike previous meta-analyses, this systematic review provides an updated synthesis including the most recent studies published between 2019 and 2024 and highlights critical research gaps and future directions.\n\n2 Methods\nThis systematic review investigated the use of VR interventions in populations with SCD, or MCI. The review protocol was registered on PROSPERO (Registration ID: CRD42025644894), ensuring methodological transparency and adherence to systematic review guidelines. The review followed the Preferred Reporting Items for Systematic Reviews and Meta-Analyses (PRISMA) 2020 guidelines (Page et al., 2021) to ensure a rigorous and reproducible approach to study selection and data synthesis. A comprehensive literature search was conducted in PubMed, Scopus, Embase, and Web of Science, covering studies published between December 2019 and August 2025. To ensure a systematic and reproducible approach, a combination of Medical Subject Headings (MeSH) terms and free-text keywords was used. The following key MeSH terms and keywords were used:\n(\"Virtual Reality\"[MeSH] OR \"Virtual Reality Training\") AND (\"Neurorehabilitation\"[MeSH] OR \"Cognitive Rehabilitation\" OR \"Cognitive Training\") AND (\"Mild Cognitive Impairment\"[MeSH]\nOR \" Cognitive Decline \" OR \" Subjective Cognitive Decline \" ) AND (\" \"Cognition\"[MeSH] OR \" Executive Function \" OR \" Memory Disorders\"[MeSH] OR \" Attention\"[MeSH] OR \" Cognitive Dysfunction\"[MeSH]) AND (\" Quality of Life\"[MeSH] OR \" Activities of Daily Living\"[MeSH]).\nTo ensure methodological rigor, the study selection process followed the PICO model (Population, Intervention, Comparison, Outcome):", "doc_items_refs": ["#/texts/41", "#/texts/42", "#/texts/44", "#/texts/45", "#/texts/48", "#/texts/49"], "page_nos": [1], "uuid": "4289a8bb-2aed-4cb1-aebb-13a6cdf81102"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 6, "source_chunk_idxs": [10], "num_tokens": 461, "text": "2 Methods\n- · Population (P): Adults diagnosed with SCD, or MCI. Studies including mixed populations were considered only if data for SCD or MCI could be separately extracted.\n- · Intervention (I): VR-based interventions designed to improve cognitive, emotional, social, or functional outcomes. These included immersive VR (full 3D environments), semi-immersive VR (screen-based simulations), and non-immersive VR (computer-assisted cognitive training with VR elements). Only interventions involving VR, defined as interactive environments with a degree of immersion, were included. Serious Games without immersive VR components were excluded.\n- · Comparator (C): Studies comparing VR interventions with non-VR interventions (e.g., conventional cognitive training, standard physical therapy, traditional rehabilitation) or standard care were included. Studies without explicit comparators were considered if they provided pre- and post-intervention measures.\n- · Outcome (O): The primary outcomes assessed were cognitive improvements (e.g., changes in memory, attention, and executive functions) and emotional or functional enhancements (e.g., quality of life, social engagement, and daily functional abilities). Secondary outcomes included feasibility, and user satisfaction with VR interventions.\nStudies were included if they investigated VR-based interventions aimed at enhancing cognitive, emotional, social, or functional outcomes in adults diagnosed with SCD or MCI. Only studies published in the last 5 years (2019 -2024) were considered eligible. Regarding study design, randomized controlled trials (RCTs), non-randomized controlled trials, cohort studies, case-control studies, and cross-sectional studies were included. Only studies published in English were considered. No restrictions were applied based on open-access availability, as full texts were retrieved through institutional access.\nStudies were excluded if they focused on paediatric populations, involved animal models, or did not include a VR intervention as the primary treatment. Additional exclusions applied to case reports, systematic reviews, meta-analyses, conference abstracts, study protocols, and proof-of-concept studies. Articles published outside the predefined timeline, those without full-text availability, or those lacking sufficient data were also removed.", "doc_items_refs": ["#/texts/50", "#/texts/51", "#/texts/52", "#/texts/53", "#/texts/54", "#/texts/55"], "page_nos": [1], "uuid": "e243b086-f8ba-4cee-b036-a7a757fd6209"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 7, "source_chunk_idxs": [11], "num_tokens": 423, "text": "2 Methods\nThe study selection process adhered to the PRISMA guidelines (Page et al., 2021) and was conducted using a blinded approach via Rayyan, a web-based tool designed for systematic reviews (Ouzzani et al., 2016). The use of Rayyan ensured that two independent reviewers (RM, RC) screened titles and abstracts separately in blinded manner, meaning they were unaware of each other's decisions, thereby minimizing selection bias. During the first phase, studies were assessed based on predefined inclusion and exclusion criteria, and\nthose clearly not meeting the eligibility requirements were excluded. In the second phase, full-text articles were reviewed with the blinding still in place. After the selection process was completed, blinding was removed, and a third reviewer (MGM) resolved any conflicts where consensus had not been reached. The level of agreement between the two primary reviewers regarding study inclusion was 80%, as estimated by Rayyan. Any discrepancies were discussed, and MGM acted as a tiebreaker when necessary. The entire study selection process was documented using a PRISMA flow diagram.\nFollowing study selection, data extraction was performed independently by RM and RC using a structured extraction form in Microsoft Excel, with all entries cross-checked for accuracy. Extracted data included key study characteristics such as author information, publication year, country, and study design, along with participant details including sample size, mean age, sex distribution, and cognitive status (SCD, or MCI). Information about VR interventions was systematically collected, detailing the type of VR system used (immersive, semi-immersive, or non-immersive), as well as session duration, frequency, and intervention length. When applicable, comparator conditions, such as non-VR interventions or standard care, were also documented. Primary outcomes related to cognitive, emotional, social, and functional improvements were recorded alongside usability measures, including dropout rates and potential adverse effects such as byersickness. Any discrepancies in data extraction were resolved through discussion, with MGM consulted when needed.", "doc_items_refs": ["#/texts/56", "#/texts/60", "#/texts/61"], "page_nos": [1], "uuid": "c49cfd33-24fa-4355-b608-3fd88b72f195"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 8, "source_chunk_idxs": [12], "num_tokens": 282, "text": "2 Methods\nThe risk of bias in randomized controlled studies was assessed using the Cochrane Risk of Bias (RoB2) tool, while the ROBINS-I tool was employed for non-randomized studies included in this review. Additionally, the overall quality of evidence for each outcome was evaluated using the GRADE (Grading of Recommendations, Assessment, Development, and Evaluation) framework (Guyatt et al., 2008) which considers factors such as risk of bias, inconsistency, indirectness, imprecision, and publication bias to provide a comprehensive evaluation of the strength of evidence.\nAs this systematic review did not involve meta-analysis due to the heterogeneity of study designs, intervention protocols, and outcome measures, data were synthesized using a qualitative narrative synthesis approach. The synthesis was structured according to the Synthesis Without Meta-analysis (SWiM) framework (Campbell et al., 2020) to ensure transparency and consistency in data interpretation. The findings were categorized based on key themes, including cognitive outcomes, emotional and psychological effects, functional improvements, and feasibility of VR interventions. Studies were grouped according to the type of VR intervention (immersive, semi-immersive, patient population (SCD, or MCI), and intervention setting (clinical, community, home-based). Results were summarized in tabular form, displaying key study characteristics, intervention details, and outcomes.", "doc_items_refs": ["#/texts/62", "#/texts/63"], "page_nos": [1], "uuid": "4849734c-7e74-4005-bcd3-a3560e68ae96"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 9, "source_chunk_idxs": [13], "num_tokens": 270, "text": "3 Results\nThe study selection process followed a systematic approach using predefined eligibility criteria before importing references into Rayyan for screening and deduplication. Initially, 3,203 articles were identified through database searches (PubMed, Scopus, Embase and Web of Science). After applying the eligibility criteria,\nwhich included language restrictions (English), publication timeframe (2019 -2024), target population (SCD, and MCI), and intervention type (VR-based cognitive training), a total of 141 was deemed relevant for further screening. Using Rayyan, references were managed, screened, and deduplicated. Out of the 141, 84 studies were imported for screening, and 36 duplicates were identified and removed. Following the title and abstract screening, 23 studies were selected for full-text analysis. However, four articles were excluded due to the unavailability of full-text access, which resulted in missing critical information necessary for inclusion. This systematic review ultimately included 19 studies, consisting of 14 RCTs, 2 usability studies, and 3 experimental studies (Figure 1, Table 1, Supplementary Table 1) (Haddaway et al., 2022).\nTo ensure robustness, the risk of bias assessment integrated into the synthesis, highlighting whether higher-quality studies report consistent or conflicting findings.", "doc_items_refs": ["#/texts/65", "#/texts/68", "#/texts/69"], "page_nos": [1], "uuid": "6460ef8c-c32c-43f5-82fe-f330aab31b69"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 10, "source_chunk_idxs": [14], "num_tokens": 326, "text": "3 Results\nThe Cochrane Risk of Bias 2 (RoB 2) tool (Sterne et al., 2019) was applied to assess the quality of the randomized controlled trials (RCTs) included in this review. A total of 13 RCTs (Buele et al., 2024; Choi and Lee, 2019; De Simone et al., 2023; Goumopoulos et al., 2023; Kwan et al., 2024; Liao et al., 2019; Manenti et al., 2020; Park, 2024; Sasaninezhad et al., 2024; Torpil et al., 2021; Yang et al., 2022; Zheng et al., 2025; Liao et al., 2020) were identified and evaluated using RoB2. This tool examines bias across five key domains: (1) bias arising from the randomization process, (2) deviations from intended interventions, (3) missing outcome data, (4) measurement of outcomes, and (5) selection of reported results. Each study was classified as having low risk of bias (green), some concerns (yellow), or high risk of bias (red) (Figure 2).\nThe assessment revealed that most studies demonstrated a low risk of bias across all domains, supporting the reliability of their findings. However, some studies showed some concerns in specific\n&lt;!-- image --&gt;\n0.5\n\nTABLE 1 Studies included in the analysis.\n| Author information     | Type of study                         | Sample characteristic                                                                                                                                                                                                                                                                       | Aim                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                | Outcome measures                                                                                                                                                                                                                                                                                                                                                                                            | Main findings                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    |", "doc_items_refs": ["#/texts/70", "#/texts/71", "#/pictures/2", "#/texts/76", "#/texts/79", "#/tables/0", "#/tables/0"], "page_nos": [1], "uuid": "037bd6fb-7cf7-4d51-a3c0-8b0eae52d0c0"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 11, "source_chunk_idxs": [15], "num_tokens": 512, "text": "3 Results\n|------------------------|---------------------------------------|---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|--------------------------------------------------------------------------------------------------------------------------------------------------------------", "doc_items_refs": ["#/tables/0"], "page_nos": [1], "uuid": "0896e6ec-23d0-4e22-90ee-069c237d7334"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 12, "source_chunk_idxs": [16], "num_tokens": 3, "text": "3 Results\n-", "doc_items_refs": ["#/tables/0"], "page_nos": [1], "uuid": "3794dc37-7caa-4173-8ee2-5f3a5d5dd000"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 13, "source_chunk_idxs": [17], "num_tokens": 512, "text": "3 Results\n---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|--------------------------------------------------------------------------------------------------------------------------------------------------------", "doc_items_refs": ["#/tables/0"], "page_nos": [1], "uuid": "d9f8e468-654d-4458-84e8-d017ce535cf5"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 14, "source_chunk_idxs": [18], "num_tokens": 3, "text": "3 Results\n-", "doc_items_refs": ["#/tables/0"], "page_nos": [1], "uuid": "d66d9aaa-975c-46cd-8ca5-643f8dc7d5aa"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 15, "source_chunk_idxs": [19], "num_tokens": 512, "text": "3 Results\n----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------", "doc_items_refs": ["#/tables/0"], "page_nos": [1], "uuid": "705bba00-0467-4cc1-bafc-26a0d3108a75"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 16, "source_chunk_idxs": [20], "num_tokens": 460, "text": "3 Results\n-\n------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|", "doc_items_refs": ["#/tables/0", "#/tables/0"], "page_nos": [1], "uuid": "0d520d78-fa21-4240-8464-8bda6e0b334a"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 17, "source_chunk_idxs": [21], "num_tokens": 272, "text": "3 Results\n| Neumann et al. (2021)  | Observational cross- sectional survey | N = 210; 105 participants with TBI: 60 men (39.0 ± 14.4) and 45 women (40.5 ± 12.9); 105 controls without TBI: 57 men (42.2 ± 15.1) and 48 women (39.3 ± 2.0)                                                                                                                               | The aim is to investigate gender differences in social inferencing deficits following traumatic brain injury (TBI) and to assess the likelihood of men and women experiencing impairment, while controlling for potential confounding factors.                                                                                                                                                                                                                                                                                     | Awareness of Social Inference Test (TASIT): Assesses affect recognition and theory of mind through three subtests: Emotion Evaluation Test (EET) (0-28), Social Inference-Minimal (SI-M) (0-60), Social Inference-Enriched (SI-E) (0-64); Stroop Color-Word Interference Test; Controlled Oral Word Association Test (COWAT); State-Trait Anxiety Inventory (STAI); Patient Health Questionnaire-9 (PHQ-9). | Comparing sex differences within the sample with TBI, women outperformed men on all 3 tasks. Although the initial findings indicated sex differences in emotion perception and mental state                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                      |", "doc_items_refs": ["#/tables/0"], "page_nos": [1], "uuid": "64d44afc-e926-4421-963d-c9fb98e47b53"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 18, "source_chunk_idxs": [22], "num_tokens": 446, "text": "3 Results\n| Teterina et al. (2023) | Observational cohort study            | N = 276,812 patients aged 16-64 years from the National Ambulatory Care Reporting System (NACRS) and Discharge Abstract Database (DAD) datasets. The majority of the records (87%) were sourced from NACRS, with a slightly higher proportion of males (55.5%) compared to females (44.5%). | The aim of this article is to investigate the roles of sex (biological and characteristics) and gender (social characteristics) in predicting outcomes after traumatic brain injury (TBI), specifically focusing on early mortality and discharge location. The study also aims to develop a method for measuring gender independently of sex, using a gender score to separate the effects of sex and gender on TBI outcomes, and to assess how these factors influence early mortality and discharge decisions after severe TBI. | No clinical tests were directly administered; instead, ICD-10-CA diagnostic codes, demographic data (age, sex, sexuality, income), comorbidities (ADG score), injury severity, and discharge outcomes were used. A gender score was derived using logistic regression based on diagnostic patterns to estimate gender- related characteristics.                                                             | Sex (biological characteristics) significantly impacted early (30- day) mortality after severe traumatic brain injury (TBI), with males having a higher risk of early mortality compared to females, as indicated by a rate ratio of 1.54 (95% CI: 1.24-1.91). Gender (social characteristics) had a stronger influence than sex on discharge location after severe TBI. Individuals exhibiting more \"woman-like\" characteristics were less likely to be discharged to rehabilitation and more likely to be discharged home, with an odds ratio of 0.54 (95% CI: 0.32-0.88). The study developed a method to measure gender independently of sex, which allows for a better understanding of how both sex and gender contribute to TBI outcomes. |\n(Continued)\n\nTABLE 1 (Continued)\n| Author  information             | Type of study                                       | Sample characteristic                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                              | Aim                                                                                                                                                                                                                                                                                                                   | Outcome measures                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                            | Main findings                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 |", "doc_items_refs": ["#/tables/0", "#/texts/80", "#/texts/84", "#/tables/1", "#/tables/1"], "page_nos": [1], "uuid": "0e96fb73-f6ac-45a2-8100-8557bda972f8"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 19, "source_chunk_idxs": [23], "num_tokens": 512, "text": "3 Results\n|---------------------------------|-----------------------------------------------------|-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------", "doc_items_refs": ["#/tables/1"], "page_nos": [1], "uuid": "af9360c2-aed9-4221-bbb0-12ee7bdf9457"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 20, "source_chunk_idxs": [24], "num_tokens": 3, "text": "3 Results\n-", "doc_items_refs": ["#/tables/1"], "page_nos": [1], "uuid": "e7af92f3-4e1d-4b43-b78d-78ca1ee9b240"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 21, "source_chunk_idxs": [25], "num_tokens": 512, "text": "3 Results\n--------------------------------------------------------------------------------------------------------------|-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|---------------------------------------------------------------------------------------", "doc_items_refs": ["#/tables/1"], "page_nos": [1], "uuid": "7508abcd-9487-447e-92eb-2dcd8845b95c"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 22, "source_chunk_idxs": [26], "num_tokens": 3, "text": "3 Results\n-", "doc_items_refs": ["#/tables/1"], "page_nos": [1], "uuid": "3773b281-2a42-4d4e-9873-6449f56b9532"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 23, "source_chunk_idxs": [27], "num_tokens": 512, "text": "3 Results\n-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|----------------------------------------------------------------------------------------", "doc_items_refs": ["#/tables/1"], "page_nos": [1], "uuid": "3e332921-2659-46a9-be09-c835a41dace6"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 24, "source_chunk_idxs": [28], "num_tokens": 3, "text": "3 Results\n-", "doc_items_refs": ["#/tables/1"], "page_nos": [1], "uuid": "8661274f-6eee-41b7-80cc-6e9c6dd0cb6d"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 25, "source_chunk_idxs": [29], "num_tokens": 512, "text": "3 Results\n------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------", "doc_items_refs": ["#/tables/1"], "page_nos": [1], "uuid": "ac510675-201c-4503-8529-df2611d12a0c"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 26, "source_chunk_idxs": [30], "num_tokens": 369, "text": "3 Results\n-\n---------------------------------------|\n| Wagberg et al.  (2023)          | Retrospective  observational study                  | N = 595 patients who had suffered  from mild traumatic brain injury  (mTBI). Time Since Injury: Seven to  eight years after the mild TBI. 40% of  females and 29% of males reporting  post-concussion symptoms. The study  includes a broad age range, with a  difference observed in the age group  of 25-49 years, where women showed  a higher level of disability compared  to men. Some participants had  experienced repeated mTBI, and the  study examined the outcomes of  those with multiple TBIs compared to  those with a single mTBI. | The aim of the study is to evaluate  post-traumatic brain injury (TBI)  symptoms and disabilities seven to eight  years after mild TBI (mTBI), with  specific objectives to assess gender and  age differences, and to examine whether  repeated TBI leads to the deterioration  of symptoms and function.            | Rivermead Post-Concussion Symptoms  Questionnaire (RPQ); Glasgow Outcome  Scale Extended (GOSE).                                                                                                                                                                                                                                                                                                                                                                                                                            | Findings suggest the importance of considering gender and  repeated TBI when planning rehabilitation and follow-up care for  mTBI patients. 34% of patients reported symptoms, with more  women (40%) affected than men (29%). Women had higher  disability levels, with 31% not fully returning to daily life  compared to 17% of men. The biggest difference was in the 25-49  age group. Patients with repeated TBIs had worse outcomes, with  31% not fully returning to daily life, compared to 21% for those  with a single TBI.                                                                                                                        |", "doc_items_refs": ["#/tables/1", "#/tables/1", "#/tables/1"], "page_nos": [1], "uuid": "a0ece8be-c183-45b9-a031-1369d8ad1395"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 27, "source_chunk_idxs": [31], "num_tokens": 236, "text": "3 Results\n| Staflslien and  Turkstra (2020) | Experimental study  with a between- subjects design | N = 68  34 males (mean age = 20.91 years,  SD = 0.75, range = 18-25) and 34  females (mean age = 19.53 years,  SD = 1.58, range = 18-21), recruited  from university students and other  young adults in a midwestern city.                                                                                                                                                                                                                                                                                                                        | The aim of the study was to examine  sex-based differences in expectations  for social communication behaviors. It  was expected that both men and women  would have higher expectations for  women's social communication  behavior compared to men's, with  women having the highest expectations  for other women. | La Trobe Communication Questionnaire  (LCQ).                                                                                                                                                                                                                                                                                                                                                                                                                                                                                | Women were more critical than men when judging social  behaviors, regardless of whether the individual being judged was  male or female. The study highlights the importance of  considering both the sex of the participant and the sex of the rater  in social outcome research related to TBI. The findings suggest that  sex-based differences in social evaluations may impact clinical  settings, where female clinicians often assess male patients.                                                                                                                                                                                                   |", "doc_items_refs": ["#/tables/1"], "page_nos": [1], "uuid": "5d9d944e-82de-4aec-b7c5-c84181827447"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 28, "source_chunk_idxs": [32], "num_tokens": 418, "text": "3 Results\n| Adamson et al.  (2021)          | Observational cross- sectional study                | N = 53  32 adults (16 females) with mild-to- severe traumatic brain injuries (TBI)  and 21 neurologically healthy controls  (11 females). Most TBI patients were  from Santa Clara Valley Medical  Center (28 civilians), with the rest  from Veterans Affairs Palo Alto  Health Care System (4 veterans).                                                                                                                                                                                                                                         | The aim of the study was to explore sex  differences in cortical thickness and  diffusion properties in patients with  traumatic brain injury (TBI), and to compare these measures between TBI  patients and neurologically healthy  controls.                                                                        | Ohio State University Traumatic Brain  Injury Identification Method (OSU TBI- ID); Post Traumatic Stress Disorder PTSD  Checklist (PCL-5); Trail Making Test B  (TMTB); California Verbal Learning Test  (CVLT); Repeatable Battery for the  Assessment of Neuropsychological Status  (RBANS); Wechsler Test of Adult Reading  (WTAR); Mini-Mental State Exam  (MMSE); select subtests from WAIS-IV  (Digit Symbol, Digit Span); Semi- Structured Interview (assessed post- concussive symptoms based on ICD-10  criteria). | Findings contribute to understanding sex differences in brain  structure and their implications for TBI rehabilitation. Patients  with TBI showed greater cortical thinning in both hemispheres  compared to healthy controls. Healthy females had significantly  greater cortical (Adamson et al., 2021) compared to healthy males.  However, this difference was less pronounced in the TBI group.  There were no significant sex differences in diffusion properties  (FA) among the participants. Moderate correlations were found  between cortical thickness, diffusion properties, and cognitive  performance, as assessed by the Trail Making Test B. |\n(Continued)\n103389/fppy.2025.1641693\n40\n\nTABLE 1 (Continued)\n| Author information   | Type of study            | Sample characteristic                                                                                                                                                                                                                               | Aim                                                                                                                                                                                                                           | Outcome measures                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                             | Main findings                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                     |", "doc_items_refs": ["#/tables/1", "#/texts/85", "#/texts/87", "#/texts/89", "#/texts/91", "#/tables/2", "#/tables/2"], "page_nos": [1], "uuid": "49230e57-f37e-42b9-8fe8-43e79eeeea82"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 29, "source_chunk_idxs": [33], "num_tokens": 512, "text": "3 Results\n|----------------------|--------------------------|-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------", "doc_items_refs": ["#/tables/2"], "page_nos": [1], "uuid": "841ac099-520b-4bd3-b463-90e7ae4eed6d"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 30, "source_chunk_idxs": [34], "num_tokens": 3, "text": "3 Results\n-", "doc_items_refs": ["#/tables/2"], "page_nos": [1], "uuid": "27e40dda-8ed7-4dbc-afcd-5064073e0a78"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 31, "source_chunk_idxs": [35], "num_tokens": 512, "text": "3 Results\n---------|--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------", "doc_items_refs": ["#/tables/2"], "page_nos": [1], "uuid": "9a1321fe-2de9-4a67-8714-110f21b2ab8d"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 32, "source_chunk_idxs": [36], "num_tokens": 3, "text": "3 Results\n-", "doc_items_refs": ["#/tables/2"], "page_nos": [1], "uuid": "e253a338-e548-4c71-bb04-e799cc0c406d"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 33, "source_chunk_idxs": [37], "num_tokens": 512, "text": "3 Results\n-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|------------------------------------------------------------------------------------------------------------------------------------", "doc_items_refs": ["#/tables/2"], "page_nos": [1], "uuid": "d13ad1a7-f23c-4bc0-81a0-196788b0a528"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 34, "source_chunk_idxs": [38], "num_tokens": 3, "text": "3 Results\n-", "doc_items_refs": ["#/tables/2"], "page_nos": [1], "uuid": "9707826c-bc49-48c8-aa55-5a092a7b6f1b"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 35, "source_chunk_idxs": [39], "num_tokens": 512, "text": "3 Results\n------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------", "doc_items_refs": ["#/tables/2"], "page_nos": [1], "uuid": "d79c6795-9951-44e8-9699-ce6f21e15719"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 36, "source_chunk_idxs": [40], "num_tokens": 51, "text": "3 Results\n-\n-----------------------------------------------|", "doc_items_refs": ["#/tables/2", "#/tables/2"], "page_nos": [1], "uuid": "5df20f27-c2f3-48c6-ba3f-8b63fe384689"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 37, "source_chunk_idxs": [41], "num_tokens": 490, "text": "3 Results\n| Levy et al. (2023)   | Prospective cohort study | N = 108 68 adults with mild traumatic brain injury (mTBI) and 40 with general trauma (TC group), recruited from The Alfred Hospital and Royal Melbourne Hospital between December 2016 and January 2020. They were assessed 6-10 weeks post-injury. | the study was to examine self-reported cognitive symptoms in individuals with mild traumatic brain injury (mTBI) and trauma controls (TCs), and to explore psychological distress and gender as predictors of these symptoms. | Cognitive Complaint After Mild Closed Head Injury (CCAMCHI) scale; A-B Neuropsychological Assessment Schedule (ABNAS); Cognitive subscale of the Riverhead Post-Concussion Symptoms questionnaire (RPQ); Inventory of Depressive Symptomatology (IDS; 30-item version); Beck Anxiety Inventory (BAI); PTSD Checklist for DSM-5 (PCL-5); Short-Form McGill Pain Questionnaire (SF-MPQ-2); Multidimensional Fatigue Inven tory (MFI); Weschler Test of Adult Reading (WTAR); Symbol Digit Modalities Test (SDMT); Digit Span subtest from the Weschler Adult Intelligence Scale, Fourth Edition (WAIS- IV); Rey Auditory Verbal Learning Test (RAVLT); Trail Making Test-Part B (TMT-B); Controlled Oral Word Association Test (COWAT)- letters F, A, and S. Measures were completed in the following order: SDMT, WTAR, RAVLT, DS, TMT B, COWAT-FAS, RPQ, ABNAS, CCAMCHI, MFI, IDS, BAI, PCL-5, and SF-MPQ-2. | Individuals with mTBI reported significantly higher subjective cognitive symptoms compared to trauma controls (TCs). Psychological distress and gender were significant predictors of subjective cognitive symptoms in the mTBI group. Specifically: · Higher psychological distress was associated with greater cognitive symptoms. · Females reported more severe cognitive symptoms than males. The findings suggest that mTBI-specific factors underlie the elevation in subjective cognitive symptoms, distinct from general post-concussion symptoms. These findings highlight the importance of considering gender and psychological distress when addressing cognitive symptoms in individuals with mTBI. |", "doc_items_refs": ["#/tables/2"], "page_nos": [1], "uuid": "7f63f564-1bcd-4f3b-a2ec-41831094bf61"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 38, "source_chunk_idxs": [42], "num_tokens": 211, "text": "3 Results\nareas. In particular, Sasaninezhad et al. (2024) exhibited some concerns regarding the randomization process, raising questions about allocation concealment or baseline imbalances. Additionally, the study did not provide clear information on deviations from the intended interventions, making it difficult to assess whether variations in protocol implementation may have influenced the results. De Simone et al. (2023) showed some concerns in the selection of reported results, suggesting a potential risk of selective reporting, which could impact the interpretation of the study's findings. Yang et al. (2022) also had unclear information regarding deviations from intended interventions, limiting the ability to determine whether protocol adherence was consistent across participants.\nDespite these concerns, the overall risk of bias was low for the majority of the included RCTs, suggesting that the findings of these studies provide robust evidence for the efficacy and feasibility of VR-based interventions in individuals with SCD, or MCI. Nonetheless, caution should be taken when interpreting results from studies with identified methodological limitations.", "doc_items_refs": ["#/texts/95", "#/texts/96"], "page_nos": [1], "uuid": "efdea1a9-36d7-4ad9-becd-acb6dad39845"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 39, "source_chunk_idxs": [43], "num_tokens": 497, "text": "3 Results\nFor non-randomized studies, including cohort and case-control studies, the Risk of Bias in Non-randomized Studies of Interventions (ROBINS-I) tool (Sterne et al., 2016) was employed to assess methodological quality across seven key domains: (1) bias due to confounding, (2) bias due to selection of participants, (3) bias in classification of interventions, (4) bias due to deviations from intended interventions, (5) bias due to missing data, (6) bias in measurement of outcomes, and (7) bias in selection of the reported result. Each study was classified as having low risk (green) or moderate risk (yellow) of bias in the respective domains (Figure 3). A total of five non-randomized studies (Arlati et al., 2021; Baldimsi et al., 2023; Cabinio et al., 2020; Latella et al., 2024; Tuena et al., 2024) were assessed using the ROBINS-I framework. The majority of studies exhibited low risk of bias across most domains, supporting the reliability of their findings. However, some concerns were noted in certain areas. Tuena et al. (2024) exhibited moderate risk of bias due to missing outcome data and selection of reported results, suggesting potential limitations in data completeness and transparency in reporting findings. Cabinio et al. (2020) also presented moderate risk in missing outcome data, which may impact the reliability of the reported conclusions. Arlati et al. (2021) had moderate concerns regarding deviations from intended interventions, indicating possible inconsistencies in the application of the intervention that could introduce variability in the study outcomes.\nDespite these minor concerns, the overall risk of bias was predominantly low, reinforcing the credibility of the included non-randomized studies. However, the presence of moderate bias in some domains suggests that results should be interpreted with caution, particularly concerning intervention classification and data completeness.\nIn addition to evaluating the risk of bias using the RoB 2 tool for RCTs and the ROBINS-I tool for non-randomized studies, we also assessed the overall quality of evidence using the GRADE (Grading of Recommendations, Assessment, Development, and Evaluation) framework. The GRADE approach considers five key factors: risk of bias, inconsistency, indirectness, imprecision, and publication bias.", "doc_items_refs": ["#/texts/97", "#/texts/98", "#/texts/99"], "page_nos": [1], "uuid": "31a6cf72-bf6a-474f-a53a-22966a25e680"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 40, "source_chunk_idxs": [44], "num_tokens": 136, "text": "3 Results\nFor each outcome, we assigned a quality rating (high, moderate, or low) based on these criteria. The final assessment is summarized in Table 2.\nThe GRADE assessment revealed variability in the overall quality of evidence across different outcomes. The quality of evidence for MCI was low, reflecting a combination of well-conducted RCTs, intervention study, experimental study and feasibility and usability study. Evidence for using VR in SCD showed moderate overall value, except for indirectness. The strength of evidence was evaluated using standardized GRADE criteria, considering factors such as study design, sample size, risk of bias, and the reproducibility of results (see Table 2).", "doc_items_refs": ["#/texts/100", "#/texts/104"], "page_nos": [1], "uuid": "aa6d68f0-85d7-4474-b7d6-88bc8a24d324"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 41, "source_chunk_idxs": [45], "num_tokens": 507, "text": "3 Results\nThe studies investigated VR-based interventions in populations with SCD and MCI, assessing their effects on cognitive function, daily activities, emotional well-being, usability, and adherence. Among the studies analysed, the majority were randomized controlled trials (RCTs) ( n = 15), while five were non-RCTs, including usability, feasibility, and intervention studies (Arlati et al., 2021; Baldimsi et al., 2023; Cabinio et al., 2020; Latella et al., 2024; Tuena et al., 2024). The total sample size across the RCTs was 1,175 participants, with individual studies ranging from 21 to 293 participants. The non-RCT studies included an additional 384 participants, bringing the total sample size to 1,559 individuals. Most studies focused on MCI, with only one study (Arlati et al., 2021) also including individuals with SCD. The majority utilized immersive VR systems, such as headmounted displays (HMDs) and motion controllers, including Oculus Quest/Oculus Go (Buele et al., 2024; De Simone et al., 2023; Yang et al., 2022; Zheng et al., 2025; Baldimsi et al., 2023; Tuena et al., 2024), and HTC Vive (Kwan et al., 2024; Arlati et al., 2021). Some studies used semi-immersive VR, relying on screen-based simulations (Park, 2024; Sasaninezhad et al., 2024) or non-immersive VR, such as VR cognitive training (Latella et al., 2024) and Microsoft Kinect (Liao et al., 2019; Torpil et al., 2021). One study combined VR with neurofeedback using functional near-infrared spectroscopy (fNIRS) (Park, 2024). Cabinio et al. (2020) used a touchscreen interface to assess cognitive abilities in a virtual home environment. Training durations varied from a single session (Cabinio et al., 2020) to 5 months (Latella et al., 2024), with most studies lasting between 4 to 12 weeks. The number of participants in each study was generally balanced across intervention and control groups, ensuring methodological rigor.", "doc_items_refs": ["#/texts/105"], "page_nos": [1], "uuid": "1bcead18-1c3d-43da-a8f9-6df56a7cc9e8"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 42, "source_chunk_idxs": [46], "num_tokens": 497, "text": "3 Results\nThe majority of the studies (17 out of 18) focused on individuals with MCI, assessing the effects of VR-based cognitive and physical training on executing function, memory, and daily functioning (Buele et al., 2024; Choi and Lee, 2019; De Simone et al., 2023; Goumopoulos et al., 2023; Kwan et al., 2024; Liao et al., 2019; Manenti et al., 2020; Park, 2024; Sasaninezhad et al., 2024; Torpil et al., 2021; Yang et al., 2022; Zheng et al., 2025; Liao et al., 2020). In contrast, only one study (Arlati et al., 2021) investigated the application of VR interventions in individuals with SCD.\nSeveral RCTs have demonstrated the effectiveness of VR-based training in enhancing cognitive and functional outcomes in MCI. Zheng et al. (2025) reported significant improvements in cognition and instrumental ADL following VR interventions. Moreover, Liao et al. (2020, 2019) found that cognitive-motor training improved dual-task performance, balance, and cognitive flexibility. Similarly, Yang et al. (2022) showed that VR-based dual-task exercises enhanced both cognitive and physical health. Expanding on these findings, Kwan et al. (2024) and Park (2024) further explored VR-based dual-task interventions, emphasizing that simultaneous cognitive and motor training strengthens cognitive-motor interactions\n&lt;!-- image --&gt;\n&lt;!-- image --&gt;\nFIGURE 3\nRisk of bias assessment for non-randomized studies using the ROBINS-I tool. Most studies showed low to moderate risk across evaluated domains.\nand promotes neuroplasticity. In addition to its role in dual-task training, VR has been compared to traditional cognitive exercises, showing comparable or even superior efficacy. De Simone et al. (2023) reported that VR-based executive function training led to superior memory and problem-solving improvements in Parkinson's disease with MCI compared to placebo-controlled interventions. Similarly, Goumopoulos et al. (2023) found that a VR-based cognitive training platform (COGNIPLAT) was more effective than usual care in enhancing attention, processing speed, and executive function.", "doc_items_refs": ["#/texts/106", "#/texts/107", "#/pictures/3", "#/pictures/4", "#/texts/110", "#/texts/111", "#/texts/117"], "page_nos": [1], "uuid": "98dacc0a-3f01-4e43-9c48-f56e8a2071be"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 43, "source_chunk_idxs": [47], "num_tokens": 407, "text": "3 Results\nBeyond cognitive benefits, several studies investigated the acceptability, and usability of VR interventions. De Luca et al. (2024) found that VR training was highly usable, with strong engagement levels. Moreover, Choi and Lee (2019) and Tuena et al. (2024) emphasized that VR usability depends on individual cognitive profiles, with older adults benefiting from task customization to improve engagement.\nLastly, Cabinio et al. (2020) and Liao et al. (2019) explored the use of VR navigation aids to enhance spatial memory recall. Their findings suggested that VR-based spatial training may improve functional abilities in individuals with MCI, offering a potential intervention for early cognitive decline.\nNotably, only one study focused on SCD. Arlati et al. (2021) and Baldimtsi et al. (2023) investigated the feasibility and early effects of VR-based cognitive training, assessing usability and engagement. Their results indicated that immersive VR cognitive stimulation improved spatial navigation and executive function. However, some participants required additional guidance to navigate more complex VR tasks, highlighting the need for tailored support in this population.\nOverall, VR interventions showed strong potential for cognitive training, particularly in executive function, memory, and cognitivemotor integration. Studies highlighted the importance of personalization, usability optimization, and long-term follow-ups to maximize clinical impact. While VR-based cognitive training shows promise as an early intervention for SCD, further research is needed to determine whether it can effectively prevent or slow cognitive decline in this population.\nGiven the heterogeneity of the included interventions, it is also important to consider how the degree of VR immersion and the specific cognitive content may have influenced the observed outcomes. Across the included studies, interventions employing fully immersive VR systems (e.g., head-mounted displays) tended to report greater improvements in cognitive outcomes compared to semi-immersive or non-immersive systems, although findings were not entirely consistent", "doc_items_refs": ["#/texts/118", "#/texts/119", "#/texts/120", "#/texts/121", "#/texts/122"], "page_nos": [1], "uuid": "85d3cfb6-c00f-4c48-afce-8a98e042fcae"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 44, "source_chunk_idxs": [48], "num_tokens": 212, "text": "3 Results\n(Buele et al., 2024; Choi and Lee, 2019; De Simone et al., 2023; Goumopoulos et al., 2023; Kwan et al., 2024; Manenti et al., 2020; Park, 2024; Sasaninezhad et al., 2024; Torpil et al., 2021; Yang et al., 2022; Zheng et al., 2025; Liao et al., 2020; Arlati et al., 2021; Baldimtsi et al., 2023; Cabinio et al., 2020; Latella et al., 2024; Tuena et al., 2024). Importantly, the therapeutic content appeared to play a decisive role: studies targeting memory and executive functions showed more robust benefits than those focused on general cognitive stimulation or attention alone. These observations suggest that both the degree of immersion and the specificity of the cognitive tasks may modulate the effectiveness of VR-based interventions.", "doc_items_refs": ["#/texts/123"], "page_nos": [1], "uuid": "fd25b999-b964-4e93-be21-5598fff138cf"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 45, "source_chunk_idxs": [49], "num_tokens": 377, "text": "4 Discussion\nThe present systematic review underscores the potential role of VR-based interventions in individuals experiencing cognitive decline (Figure 4).\nCompared to previous systematic reviews and meta-analyses (Kim et al., 2019; Voinescu et al., 2024) focusing primarily on MCI and dementia, this review expands the scope by also including SCD as a prodromal phase and highlights feasibility and usability as critical outcomes for the future application of VR interventions. The findings suggested that VR interventions can enhance cognitive functions, particularly memory, attention, and executive functions, while also promoting engagement and adherence through their immersive and interactive nature. Furthermore, VR has shown potential in addressing emotional and psychological well-being, reducing anxiety, and improving mood, which are critical aspects in the early stages of cognitive decline (Buele et al., 2024; Choi and Lee, 2019; De Simone et al., 2023; Goumopoulos et al., 2023; Kwan et al., 2024; Liao et al., 2019; Manenti et al., 2020; Park, 2024; Sasaninezhad et al., 2024; Torpil et al., 2021; Yang et al., 2022; Zheng et al., 2025; Liao et al., 2020). Notably, while VR provides an innovative and engaging medium, its therapeutic efficacy appears to be primarily driven by the specific cognitive content delivered within the VR environment, such as memory training, executive function exercises, and spatial navigation tasks. Therefore, VR could be conceptualized as a therapeutic delivery platform rather than an intervention in itself. Moreover, most VR-based interventions have been tested in individuals with MCI (Buele et al., 2024; Choi and Lee, 2019; De Simone et al., 2023;", "doc_items_refs": ["#/texts/125", "#/texts/126"], "page_nos": [1], "uuid": "beab375a-a934-439e-876f-05cb0b3ecd80"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 46, "source_chunk_idxs": [50], "num_tokens": 356, "text": "4 Discussion\nTABLE 2 GRADE (grading of recommendations, assessment, development, and evaluation) evaluation of the studies.\n\n| Outcome   | Study  design                                                                         | Risk  of bias   | Inconsistency   | Indirectness   | Imprecision   | Publication  bias   | Overall  quality of  evidence   |\n|-----------|---------------------------------------------------------------------------------------|-----------------|-----------------|----------------|---------------|---------------------|---------------------------------|\n| MCI       | RCT,  intervention  study,  experimental  study and  feasibility and  usability study | Low             | Serious         | Serious        | Low           | Low                 | Low                             |\n| SCD       | Usability and  acceptance  study                                                      | Low             | Not serious     | Serious        | Serious       | Low                 | Low-Moderate                    |\nRCT, Randomized Controlled Trial; MCI, Mild Cognitive Impairment; SCD, Subjective Cognitive Decline.", "doc_items_refs": ["#/texts/127", "#/tables/3", "#/texts/128"], "page_nos": [1], "uuid": "328296b2-997a-4328-8907-187da6e7dcde"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 47, "source_chunk_idxs": [51], "num_tokens": 463, "text": "4 Discussion\nGoumopoulos et al., 2023; Kwan et al., 2024; Liao et al., 2019; Manenti et al., 2020; Park, 2024; Sasaninezhad et al., 2024; Torpil et al., 2021; Yang et al., 2022; Zheng et al., 2025; Liao et al., 2020) with only one study explicitly focused on SCD (Arlati et al., 2021), highlighting a gap in research that warrants further exploration. This is consistent with broader literature trends, where VR has been primarily investigated in individuals with MCI. In contrast, its application in the very earliest stage, SCD, remains largely unexplored. The concentration of studies on MCI suggests that researchers view this stage as particularly amenable to cognitive interventions, as individuals retain sufficient cognitive resources to engage and benefit from digital and immersive rehabilitation tools. The concentration of studies in MCI suggests that researchers consider this stage particularly responsive to cognitive interventions, as individuals retain sufficient cognitive resources to engage and benefit from digital and immersive rehabilitation tools. In patients with MCI, the included studies demonstrated that VR-based cognitive and cognitive-motor interventions produced significant improvements in executive function, memory, and dual-task performance (Buele et al., 2024; Choi and Lee, 2019; De Simone et al., 2023; Goumopoulos et al., 2023; Kwan et al., 2024; Liao et al., 2019; Manenti et al., 2020; Park, 2024; Sasaninezhad et al., 2024; Torpil et al., 2021; Yang et al., 2022; Zheng et al., 2025; Liao et al., 2020). These findings are consistent with the existing literature on VR applications in neurorehabilitation, where similar results have been reported in several neurological conditions (Maggio et al., 2023; Morone et al., 2014). In fact, it has been demonstrated that VR-based cognitivemotor training improved executive function and motor performance in stroke survivors, suggesting that the integration of physical activity", "doc_items_refs": ["#/texts/134"], "page_nos": [1], "uuid": "fc846d80-a8ca-45b7-95b2-c3d999039efc"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 48, "source_chunk_idxs": [52], "num_tokens": 412, "text": "4 Discussion\nwith cognitive exercises in a VR environment may promote neuroplasticity. While both physical activity and cognitive exercises have established benefits, VR uniquely supports their integration within ecologically valid, adaptive environments. This multimodal stimulation may better approximate real-world cognitive-motor demands, enhancing the transferability of skills to daily life. Similarly, VR-based cognitive-motor exercises could improve executive control and divided attention, further reinforcing the interconnected nature of cognition and movement in neurodegenerative conditions (Choi and Lee, 2019; De Simone et al., 2023; Goumopoulos et al., 2023; Kwan et al., 2024; Liao et al., 2019; Manenti et al., 2020; Park, 2024; Sasaninezhad et al., 2024; Torpil et al., 2021; Zheng et al., 2025; Specht et al., 2023; Yang et al., 2022). Regarding the degree of immersion, fully immersive VR systems (e.g., head-mounted displays) have been associated with greater improvements in cognitive outcomes compared to semi-immersive or non-immersive systems. However, immersion alone is not necessarily the key therapeutic factor. Instead, its clinical relevance lies in the ability to foster embodied cognition, enhance attentional engagement, and simulate real-life complexity in a controlled and adaptable environment (Tieri et al., 2018; Maggio et al., 2022). This supports more effective generalization of skills beyond the training context. Nonetheless, across the reviewed studies, therapeutic content, particularly programs targeting memory and executive functions, emerged as a more critical determinant of outcomes than immersion per se. Thus, VR-based interventions appear to be most effective when they combine meaningful cognitive content with interactive, ecologically valid environments. However, therapeutic content emerged as a more critical determinant of\n&lt;!-- image --&gt;", "doc_items_refs": ["#/texts/135", "#/pictures/5"], "page_nos": [1], "uuid": "671f7924-3606-4753-8fde-a32db2a21945"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 49, "source_chunk_idxs": [53], "num_tokens": 508, "text": "4 Discussion\noutcomes. Indeed, interventions focused on memory and executive functions yielded the most consistent cognitive benefits across studies, independent of the level of immersion. Therefore, VR-based interventions appear to be particularly effective when combining cognitive and physical training. Some studies included in our review demonstrated that MCI participants engaged in VR-based dual-task training showed better cognitive and motor outcomes than those undergoing traditional interventions (Liao et al., 2019; Yang et al., 2022). Moreover, alterations in gait parameters have been consistently observed in individuals with dementia, including reduced gait speed, increased stride time variability, and impaired gait stability, especially under dual-task conditions (Chiaramonte and Cioni, 2021). These motor deficits are closely linked to cognitive dysfunction and significantly increase the risk of falls during activities of daily living. Addressing both cognitive and motor domains through integrated interventions, such as VR-based dual-task training, may therefore represent a promising strategy to enhance functional independence and reduce fall risk in this population. Importantly, while neurophysiological and behavioral data (e.g., EEG, eye-tracking, gait metrics) can be collected without VR, their interpretation gains depth when situated within interactive, goal-oriented VR tasks. This positions VR not merely as a stimulating modality, but as a comprehensive, data-rich ecosystem that supports both intervention and evaluation, enabling closed-loop, adaptive neurorehabilitation. Recent studies leveraging machine learning have demonstrated that the contextualization of such data enhances diagnostic precision and personalization of interventions (Rutkowski et al., 2023; Wolf et al., 2023; Alahmadi et al., 2024). Unlike traditional platforms, VR allows for the simultaneous capture and contextualization of behavioral and physiological data during dynamic task engagement, potentially uncovering patterns that are invisible in static or laboratory-based assessments. These findings are in line with findings by Tieri et al. (2018), who highlighted that VR ability to integrate movement and cognition within interactive environments leads to superior functional improvements compared to traditional paper-based or computerebased exercises. Indeed, VR environments, by eliciting real-time responses, engage sensorimotor networks that are largely ignored in conventional cognitive training. This targeted multisensory stimulation can promote neuroplastic changes, presumably offering benefits in the early stages of cognitive decline. Riva et al. (2020) further argued that VR can enhance", "doc_items_refs": ["#/texts/140"], "page_nos": [1], "uuid": "1badf521-1dcf-4ca6-9ac4-608224fe7b97"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 50, "source_chunk_idxs": [54], "num_tokens": 221, "text": "4 Discussion\nneuroplasticity by immersing individuals in ecologically valid scenarios that simulate real-life cognitive challenges, a mechanism that was also supported by the studies included in our review, particularly those evaluating VR-based training in daily activities.\nA further noteworthy result is the high level of adherence and engagement reported in VR-based training for MCI participants. VR interventions were consistently rated as engaging, motivating, and enjoyable across the studies included in this review. This supports previous literature, where Fusco and Tieri (2022) and Drigas and Sideraki (2024) highlighted that the interactive nature of VR, combined with personalized feedback, significantly improves patient adherence to rehabilitation protocols. Furthermore, Riva et al. (2020) suggested that VR promotes a greater sense of presence and immersion, which may drive motivation and increase the likelihood of sustained cognitive benefits. However, while adherence rates were high, our review also identified potential usability challenges, particularly in older adults who are unfamiliar with digital technologies. Tuena et al. (2024) found that although VR interventions", "doc_items_refs": ["#/texts/140", "#/texts/141"], "page_nos": [1], "uuid": "fce69dcc-b47f-4953-9eb6-1b8076223bfe"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 51, "source_chunk_idxs": [55], "num_tokens": 303, "text": "4 Discussion\nwere generally well accepted, some participants required assistance with navigation, calibration, and interaction with virtual environments. These findings are consistent with previous studies by Baragash et al. (2022), who indicated that technology adaptation and task simplification are essential to optimize VR usability for older adult populations. Furthermore, our review reinforces the idea that VR can improve patient engagement and motivation, a theme consistently reported in the literature. However, while VR offers clear advantages over traditional rehabilitation approaches, our results, consistent with those of Tieri et al. (2018), Riva et al. (2020), and Maggio et al. (2023) highlighted the importance of personalization, usability optimization, and strategies to mitigate cybersickness and cognitive overload in older adults. Nonetheless, translating VR-based interventions into routine clinical practice requires addressing realworld barriers, including the availability of trained personnel, cost of equipment, and digital literacy of older adults. More feasible adoption may occur within longevity clinics or specialized neurorehabilitation units, where resources and workflows allow for more innovative and individualized care models (Wilding et al., 2024). Overall, these findings support the emerging view that VR should not be conceived as a stand-alone solution, but as a hybrid platform, technologically rich, clinically adaptable, and capable of evolving into a mainstay of precision neurorehabilitation in older populations.", "doc_items_refs": ["#/texts/144"], "page_nos": [1], "uuid": "338099b9-be7f-4d0c-b00b-bfc9c62134e2"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 52, "source_chunk_idxs": [56], "num_tokens": 212, "text": "4 Discussion\nFinally, compared to MCI, VR-based interventions for SCD remain significantly underexplored, despite growing interest in early cognitive interventions. Our review included only one study explicitly targeting individuals with SCD, which focused on VR usability and engagement rather than cognitive outcomes. This reflects the broader gap in the literature, where very early cognitive decline is often overlooked, with research primarily focusing on interventions for diagnosed neurological conditions. However, as SCD is increasingly recognized as a precursor to MCI and dementia, future research should focus on whether early VR-based cognitive training can effectively delay or mitigate cognitive decline in at-risk populations. Arlati et al. (2021) and Baldimtsi et al. (2023) demonstrated that immersive VR interventions are feasible, well-tolerated, and engaging in individuals with SCD, with some preliminary evidence of improvements in spatial navigation and executive function. Nonetheless, more longitudinal and adequately powered studies are needed to determine their long-term efficacy on cognitive trajectories in this population.", "doc_items_refs": ["#/texts/145"], "page_nos": [1], "uuid": "86ef9de2-d1b2-4355-bfc0-6296068b7ae5"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 53, "source_chunk_idxs": [57], "num_tokens": 341, "text": "5 Strengths and limitations of the study\nThis systematic review has several strengths that contribute to a comprehensive and in-depth assessment of VR interventions in MCI and SCD, as a prodromal phase. A major strength of this review is its rigorous methodology and adherence to the PRISMA guidelines, which ensure transparent study selection, unbiased data extraction, and structured synthesis of findings. By incorporating multiple study designs, including RCTs, non-RCTs, and feasibility assessments, this review provides a broader perspective on VR interventions. This is particularly relevant in neurorehabilitation, where usability and adherence to interventions are as crucial as clinical efficacy, especially in populations experiencing cognitive decline.\nAn important distinguishing feature of this review is its specific focus on both MCI and SCD populations, explicitly considering SCD\nas a critical early stage of cognitive decline where preventive strategies may be most effective. Unlike prior meta-analyses predominantly focused on MCI and dementia, this review emphasizes feasibility, usability, and the integration of cognitive and physical tasks within VR interventions, offering new clinical insights relevant for early-stage intervention. Furthermore, the inclusion of studies published between 2019 and 2024 ensures an up-to-date synthesis of the most recent evidence.\nAnother significant strength of this review is that it identifies critical gaps in the literature, particularly the limited number of studies targeting SCD and the lack of long-term follow-up. By identifying these research gaps, the review offers important directions for clinical practice and highlights priorities for future preventive interventions. Furthermore, the review addresses the need for standardized protocols and better tailoring of VR activities for individuals with cognitive impairment, emphasizing translational relevance for real-world application.", "doc_items_refs": ["#/texts/147", "#/texts/148", "#/texts/152", "#/texts/153"], "page_nos": [1], "uuid": "9faa3959-7178-40ca-8b20-e629ab2f018c"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 54, "source_chunk_idxs": [58], "num_tokens": 510, "text": "5 Strengths and limitations of the study\nDespite these strengths, this review also has several limitations. To critically appraise the strength of the evidence, we performed a GRADE assessment. For studies involving participants with MCI, the overall certainty of evidence was rated as low, primarily due to concerns regarding inconsistency and improvement. Despite a low risk of bias across most studies, variability in intervention protocols and outcome measures, coupled with small sample sizes, limited the strength of conclusions. For SCD, the overall certainty was rated as low to moderate, reflecting the feasibility and usability focus of the included studies, with limited generalizability to cognitive efficacy. These ratings highlight that while VR-based interventions appear promising, current evidence remains preliminary and should be interpreted with caution. Future research employing standardized methodologies and larger samples is needed to strengthen the evidence base. Indeed, a major limitation is the heterogeneity of the included studies, particularly in intervention protocols, types of VR systems, outcome measures, and follow-up periods. The lack of standardized methodologies across studies limited our ability to directly compare interventions or conduct a meta-analysis. This reflects a broader issue within the current literature on VR interventions, rather than a limitation specific to this review. Additionally, while we included studies with both cognitive and motor training components, there was substantial variability in task design, exposure time, and assessment tools, making it difficult to determine which specific aspects of VR training contributed most to cognitive and functional improvements. Moreover, the variability in the definition of MCI across the included studies created challenges in the interpretation and comparison of findings. In most cases, MCI was conceptualized as an early stage of dementia in older adults, with little consideration for its potential heterogeneity across different neurological conditions. Only one study explicitly addressed MCI in Parkinson's disease, but even in this case, the criteria were not clearly defined. The lack of a unified definition raises concerns about the generalizability of conclusions and represents an important area for methodological improvement in future research. To address the heterogeneity of the included studies, we opted for a structured synthesis based on target populations (e.g., MCI, SCD, mixed samples) and outcome domains (e.g., cognitive, motor, usability). While this approach does not allow for quantitative aggregation of results, it provides a narrative framework for interpreting the effects of different VR protocols. Future meta-analyses may explore moderators such as immersion level, training duration, or task", "doc_items_refs": ["#/texts/154"], "page_nos": [1], "uuid": "af445654-6d7d-4765-ad10-a5470f99cfc9"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 55, "source_chunk_idxs": [59], "num_tokens": 266, "text": "5 Strengths and limitations of the study\ncomplexity to identify which intervention features yield the most benefit.\nWhile VR interventions have primarily been studied in MCI populations, their application in SCD remains largely unexplored. Given that SCD may represent an early indicator of neurodegeneration in a subset of individuals, VR-based cognitive training could serve as a preventive strategy, enhancing cognitive resilience before measurable deficits emerge. Our findings underscore the urgent need for specifically designed trials in SCD populations to establish the feasibility, effectiveness, and clinical relevance of VR interventions at this very early stage of cognitive decline.\nAnother limitation is that most studies did not include long-term follow-up assessments, making it unclear whether the cognitive and functional benefits of VR training persist over time. To date, only one study (Sasaninezhad et al., 2024) reported outcomes at a 3-month follow-up, but its small sample size limits the generalizability of these findings. This is a common problem in VR research, as highlighted by previous reviews (Zhu et al., 2024; Choi and Twamley, 2013; Fusco and Tieri, 2022) and highlights the need for longitudinal studies to assess the duration and stability of VR-induced cognitive benefits over time.", "doc_items_refs": ["#/texts/157", "#/texts/158", "#/texts/159"], "page_nos": [1], "uuid": "e1979605-2469-445b-a155-e72a08bcb3d4"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 56, "source_chunk_idxs": [60], "num_tokens": 470, "text": "6 Future prospectives\nVR holds significant potential as an innovative tool for cognitive rehabilitation in individuals with MCI and SCD (Buele et al., 2024; Choi and Lee, 2019; De Simone et al., 2023; Goumopoulos et al., 2023; Kwan et al., 2024; Liao et al., 2029; Manenti et al., 2030; Park; 2024; Sasaninezhad et al., 2024; Toril et al., 2021; Yang et al., 2022; Zheng et al., 2025; Liao et al., 2020; Arlati et al., 2021). Its ability to simulate real-world environments in an immersive and interactive manner could enhance cognitive engagement, facilitate neuroplasticity, and improve adherence compared to traditional interventions (Maggio et al., 2023). VR-based cognitive training may be particularly beneficial in strengthening executive functions, memory retention, and cognitive-motor coordination, which are critical in delaying functional decline (Buele et al., 2024; Choi and Lee, 2019; De Simone et al., 2023; Goumopoulos et al., 2023; Kwan et al., 2024; Liao et al., 2019; Manenti et al., 2020; Park, 2024; Sasaninezhad et al., 2024; Toril et al., 2021; Yang et al., 2022; Zheng et al., 2025; Liao et al., 2020). Additionally, dual-task VR paradigms could offer a unique advantage in training multitasking abilities and compensatory cognitive strategies, with potential applications in early dementia prevention (Brugada-Ramentol et al., 2022). Beyond cognitive enhancement, VR could serve as a diagnostic and prognostic tool, allowing for the assessment of subtle impairments in spatial navigation, attention, and executive function, which are often the earliest markers of neurodegeneration (Brugada-Ramentol et al., 2022). The integration of biomarkers such as EEG and fMRI with VR-based assessments could further refine early detection and intervention strategies.", "doc_items_refs": ["#/texts/161"], "page_nos": [1], "uuid": "0a52d1b7-6b8b-439e-a9a9-6a41ba190871"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 57, "source_chunk_idxs": [61], "num_tokens": 387, "text": "6 Future prospectives\nAs emphasized in this systematic review, significant gaps remain in the current body of research, particularly regarding the limited number of VR-based interventions specifically targeting SCD, the lack of long-term follow-up assessments, and the absence of biomarker integration. Future research should explore personalized VR interventions by adapting difficulty levels based on the performance of MCI and SCD patients and integrating real-time neurofeedback to optimize therapeutic outcomes. In particular, preventive strategies for\nSCD populations should be prioritized, given the potential for early cognitive training to delay or mitigate neurodegenerative processes. Given the current lack of studies on VR-based interventions in SCD, future research should prioritize assessing their efficacy and long-term benefits, particularly in home-based settings in which early, preventive cognitive training could be most impactful. Expanding home-based VR solutions and incorporating tele-rehabilitation models could enhance accessibility and ensure continuity of care. Finally, standardizing VR protocols and validating their efficacy through large-scale clinical trials will be essential for establishing VR as a mainstream approach in cognitive rehabilitation and dementia prevention.\nNotably, one area that has not been extensively addressed in the studies included in this review but is gaining attention in the broader literature is the integration of neurophysiological markers into VR-based cognitive training. Recent studies (Drigas and Sideraki, 2024; Baragash et al., 2022) discussed the potential of using EEG-based neurofeedback in VR rehabilitation, allowing for real-time monitoring of brain activity and personalized training adjustments. Although none of the studies included in our review incorporated neurophysiological markers, future research should explore whether VR-based cognitive training can produce measurable changes in brain function, thereby supporting its role in enhancing neuroplasticity and cognitive reserve.", "doc_items_refs": ["#/texts/162", "#/texts/166", "#/texts/167"], "page_nos": [1], "uuid": "3a5743fc-1be3-4515-b1bd-73846d22eff8"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 58, "source_chunk_idxs": [62], "num_tokens": 406, "text": "6 Future prospectives\nHowever, while the review highlights the high adherence rates and levels of engagement of VR interventions, usability challenges persist in older adults and individuals with cognitive impairments. Moreover, while many of the reviewed studies reported promising feasibility and adherence to VR-based interventions, these results were mostly obtained in highly structured clinical or research environments. Participants were often pre-selected based on their ability to tolerate and engage with the technology, benefiting from close supervision and technical support. As such, these findings may not fully translate to real-world conditions, where many individuals with cognitive decline face challenges such as limited digital literacy, physical or sensory impairments, and socioeconomic barriers. Moreover, while most of the VR interventions included in this review were delivered in seated or low mobility settings and are therefore compatible with the use of assistive devices such as wheelchairs, few studies explicitly reported on participants with severe mobility limitations or advanced frailty. Importantly, the feasibility of VR is highly dependent on the type of system used: non-immersive or semi-immersive platforms are often specifically designed to accommodate users with reduced mobility. Nonetheless, future studies should more systematically assess accessibility and usability in populations with diverse physical capabilities, ensuring that adaptive solutions are in place for those with significant motor impairments. To advance the clinical utility and equity of VR interventions, future trials should prioritize ecological designs that assess usability and engagement in home-based or minimally supervised settings. Integration with tele-rehabilitation platforms, simplified user interfaces, and tailored onboarding protocols could facilitate broader access and sustained adherence among diverse and at-risk populations. Addressing these usability issues is crucial to ensure that VR interventions are accessible, acceptable, and scalable for real-world clinical application in vulnerable populations. These efforts will help ensure that VR-based cognitive training is not only effective in principle but also grounded in the embodied realities of aging.\nIn addition, while the review refers to cognitive benefits across the included studies, few works explicitly delineate the theoretical", "doc_items_refs": ["#/texts/168", "#/texts/169"], "page_nos": [1], "uuid": "40b3a7bc-6341-4408-beaf-e6b64dc585da"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 59, "source_chunk_idxs": [63, 64], "num_tokens": 385, "text": "6 Future prospectives\nframeworks or cognitive mechanisms underlying these outcomes. VR-based interventions often involve tasks that stimulate domains such as attention, working memory, executive functions, and spatial navigation through goal-oriented, multisensory, and interactive activities. However, the extent to which specific cognitive processes are targeted remains inconsistently reported. Future research should more clearly define the cognitive constructs being trained, align intervention designs with established cognitive models, and employ standardized neuropsychological measures to assess domain-specific effects. Clarifying these mechanisms will help establish the cognitive specificity and clinical relevance of VR-based training protocols.\nFinally, future research should incorporate critical perspectives from the field of gerontology. As highlighted by Peine et al. (2015) and Peine and Neven (2021) the widely promoted \" triple-win narrative,\" which assumes equal benefits for technology developers, policymakers, and older users, often overlooks the practical, economic, and socio-cultural barriers that hinder widespread adoption in real-world contexts. A more nuanced understanding of these dynamics could help move beyond a simplistic technologycapetolerance model and support the development, implementation, and dissemination of VR interventions that are both accessible and sustainable for older adults.\n\n7 Conclusion\nThis systematic review provides relevant evidence that VR-based interventions could be effective for cognitive rehabilitation in individuals with early cognitive impairment. The major evidence was observed for MCI, where VR interventions could improve executive function, memory, and cognitive-motor performance. In the few studies of SCD, VR was well tolerated and engaging, although further research is needed to assess its long-term impact on preventing cognitive decline. In conclusion, VR represents a promising tool for cognitive rehabilitation in individuals with MCI and SCD, but further refinement of intervention protocols, adaptation to different cognitive stages, and integration into clinical practice are needed to maximize its potential benefits.", "doc_items_refs": ["#/texts/173", "#/texts/174", "#/texts/176"], "page_nos": [1], "uuid": "7955ecc1-0753-430e-b33d-bb5d7ebe4a11"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 60, "source_chunk_idxs": [65, 66, 67, 68, 69], "num_tokens": 251, "text": "Data availability statement\nThe original contributions presented in the study are included in the article/Supplementary material, further inquiries can be directed to the corresponding author.\n\nAuthor contributions\nMM: Conceptualization, Data curation, Formal analysis, Investigation, Methodology, Supervision, Validation, Writing - original draft. RM: Conceptualization, Data curation, Formal analysis, Investigation, Software, Validation, Writing - original draft. MC: Writing - original draft. PB: Data curation, Investigation, Writing original draft. FC: Writing - original draft. GP: Writing - original draft. AL: Conceptualization, Supervision, Writing - original draft. AM: Writing - original draft. AQ: Funding acquisition, Writing - original draft. AN: Conceptualization, Supervision, Writing - original draft.\nRC: Formal analysis, Investigation, Project administration, Software, Supervision, Writing - original draft.\n\nFunding\nThe author(s) declare that no financial support was received for the research and/or publication of this article.\n\nConflict of interest\nThe authors declare that the research was conducted in the absence of any commercial or financial relationships that could be construed as a potential conflict of interest.\n\nGenerative AI statement\nThe authors declare that no Gen AI was used in the creation of this manuscript.", "doc_items_refs": ["#/texts/178", "#/texts/180", "#/texts/183", "#/texts/185", "#/texts/187", "#/texts/189"], "page_nos": [1], "uuid": "8cfecbfd-8483-4dc1-ab9b-f2f63755f6f8"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 61, "source_chunk_idxs": [70], "num_tokens": 505, "text": "References\nAdamson, M. M., Main, K., Harris, O. A., and Kang, X. (2021). Sex differences in cortical thickness and diffusion properties in patients with traumatic brain injury: a pilot study. Brain Inj. 36, 488-502.\nAlahmadi, T. J., Rahman, A. U., Alhababi, Z. A., Ali, S., and Alkahtani, H. K. (2024). Prediction of mild cognitive impairment using EEG signal and BiLSTM network. Mach. Learn. Sci. Technol . 5:502028, doi: 10.1088/2632-2155/ad38fe\nArlati, S, Di Santo, S. G., Franchini, F., Mondellini, M., Filippietti, B., Luchi, M., et al. (2021). Acceptance and usability of immersive virtual reality in older adults with objective and subjective cognitive decline. J. Alzheimers Dis. J. AD 1025-1038. doi: 10.3233/JAD-201431\nBaldimtsi, E., Mazoukidis, C., Karathani, E. M., Verykouki, E., Hassandra, M., Galianis, E., et al. (2023). Effects of virtual reality physical and cognitive training intervention on cognitive abilities of elders with mild cognitive impairment. J. Alzheimers Dis. Rep. 7, 1475-1490. doi: 1032/33AD/R-230099\nBaragash, R. S., Aldowah, H., and Ghazal, S. (2022). Virtual and augmented reality applications to improve older adults' quality of life: a systematic mapping review and future directions. Digit. Health 8: 2055207262211321009. doi: 10.1177/2055207262211321009\nBassett, S. S., and Folstein, M. F. (1993). Memory complaint, memory performance, and psychiatric diagnosis: a community study. J. Geriatric Psychiatry Neurol. 6, 105-111. doi: 1011/0778919889300062007", "doc_items_refs": ["#/texts/191", "#/texts/192", "#/texts/193", "#/texts/194", "#/texts/195", "#/texts/196"], "page_nos": [1], "uuid": "5bb7af89-0f19-4743-9edc-3f0f51e352b0"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 62, "source_chunk_idxs": [71], "num_tokens": 498, "text": "References\nBessi, V., Mazezo, S., Padiglioni, S., Piccini, C., Namcia, B., Sorbi, S. et al. (2018). From subjective cognitive decline to Alzheimer's disease: the predictive role of neuropsychological assessment, personality traits, and cognitive reserve. A 7-year follow-up study. J Alzheimer's Dis 63, 1523-1535. doi: 10.3233/JAD-171180\nBrugada-Ramentol, V., Bozorghadez, A., and Jalali, H. (2022). Enhance VR: a multisensory approach to cognitive training and monitoring. Front Digit Health. 4:916052. doi: 10.3389/fdgth.2020.916052\nBuele, J., Aviles-Castillo, E., Del-Valle-Soto, C., Avarelás, J., and Palacios-Navarro, G. (2024). Effects of a dual intervention (motor and virtual reality-based cognitive) on cognition in patients with mild cognitive impairment: a single-blind, randomized controlled trial. J. NeuroEng. Rehabil. 21:130. doi: 10.1186/s12984-024-01422-w\nCabinio, M., Rossetto, F., Isernia, S., Saibene, F. L., Di Cesare, M., Borgnis, F. et al. (2020). The use of a virtual reality platform for the assessment of the memory decline and the hippocampal neural injury in subjects with mild cognitive impairment: the validity of Smart aging serious game (SASG) J. Clin. Med. 9:1355. doi: 10.3390/jcmn9051355\nCampbell, M., McKenzie, J. E., Sowden, A., Katikredi, S. V., Brenan, S. E., Ellis, S., et al. (2020). Synthesis without meta-analysis (SWiM) in systematic reviews: reporting guideline. BMJ 368:16890. doi: 10.1136/bmj.l6890", "doc_items_refs": ["#/texts/197", "#/texts/198", "#/texts/199", "#/texts/200", "#/texts/201"], "page_nos": [1], "uuid": "8ff6de03-fd60-4a81-b3cc-d4b2af48ec92"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 63, "source_chunk_idxs": [72, 73], "num_tokens": 233, "text": "References\nChiaramonte, R., and Cioni, M. (2021). Critical spatiotemporal gait parameters for individuals with dementia: a systematic review and meta-analysis. Hong Kong Physiother. J. 41, 1-14. doi: 10.1142/S101370252130001X\nChoi, W., and Lee, S. (2019). The effects of virtual kayak paddling exercise on postural balance, muscle performance, and cognitive function in older adults with mild cognitive\nAny alternative text (alt text) provided alongside figures in this article has been generated by Frontiers with the support of artificial intelligence and reasonable efforts have been made to ensure accuracy, including review by the authors wherever possible. If you identify any issues, please contact us.\n\nPublisher's note\nAll claims expressed in this article are solely those of the authors and do not necessarily represent those of their affiliated organizations, or those of the publisher, the editors and the reviewers. Any product that may be evaluated in this article, or claim that may be made by its manufacturer, is not guaranteed or endorsed by the publisher.", "doc_items_refs": ["#/texts/202", "#/texts/203", "#/texts/206", "#/texts/208"], "page_nos": [1], "uuid": "35a187c8-2783-4fff-b243-c111470d5a10"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 64, "source_chunk_idxs": [74], "num_tokens": 488, "text": "Supplementary material\nThe Supplementary material for this article can be found online at: https://www.frontiersin.org/articles/10.3389/fpsyg.2025.1641693/ full#supplementary-material\nimpairment: a randomized controlled trial. J. Aging Phys. Act. 27, 861-870. doi: 10.1123/japa.2018-0020\nChoi, J., and Twamley, E. W. (2013). Cognitive rehabilitation therapies for Alzheimer's disease: a review of methods to improve treatment engagement and self-efficacy. Neuropsychol. Rev. 23, 48-62. doi: 10.1007/s11065-013-9227-4\nDe Luca, R., Gangemi, A., Maggio, M. G., Bonanno, M., Calderone, A., Mazzurco Masi, V. M., et al. (2024). Effects of virtual rehabilitation training on post-stroke executive and practices skills and drama expression symptoms: a quasi-randomised clinical trial. Diagn. Basel. Switzer. 14:1892. doi: 10.3390/diagnostics14171892\nDe Simone, M. S., Costa, A., Tierei, G., Tagliieri, S., Cona, Giorenzo, E., et al. (2023). The effectiveness of an immersive virtual reality and telemedicine-based cognitive intervention on prospective memory in Parkinson's disease patients with mild cognitive impairment and healthy aged individuals: design and preliminary baseline results of a placebo-controlled study. Front. Psychol. 14:1268337. doi: 10.3389/fpsyg.2023.1268337\nDrigs, A., and Sideraki, A. (2024). Brain neuropathic leveraging virtual reality and brain-computer interface Technologies. Sensors 24:5725. doi: 10.3390/s24177525\nDuff, K. (2024). Mild cognitive impairment. Neurol. Clin. 42, 781-792. doi: 10.1016/j.jnl.2020.6427.005", "doc_items_refs": ["#/texts/210", "#/texts/211", "#/texts/212", "#/texts/213", "#/texts/214", "#/texts/215", "#/texts/216"], "page_nos": [1], "uuid": "97e698c0-7361-4e46-a7ba-a74bd52048bc"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 65, "source_chunk_idxs": [75], "num_tokens": 453, "text": "Supplementary material\nFusco, 5.007, and A, Tierei, G. (2022). Challenges and perspectives for clinical applications of immersive and non-immersive virtual reality. J. Clin. Med. 11:4540. doi: 10.3390/jcmnl154540\nGiøra, L., Strand, B., Hergh, S., Borz, T., Brezhakus, H., Engedal, K., et al. (2021). Current and future prevalence estimates of mild cognitive impairment, dementia, and its subtypes in a population-based sample of people 70 years and older in Norway: the HUNDT study. J. Alzheimer's Dis 79, 1213-1226. doi: 10.3392/JAD-201725\nGoumapoulos, C., Skikos, G. and Frounta, M. (2023). Feasibility and effects of cognitive training with the COIGNIATPLAT game platform in elderly with mild cognitive impairment: pilot replacement randomized controlled trial. Games Health J. 12, 414-425. doi: 10.1089/g4h.2023.0029\nGuyatt, G. H., Oxman, A. D., Vist, G. E., Kunz, R., Falk-Yctter, Y., Alonso-Coello, P., et al. (2008). GRADE: an emerging consensus on rating quality of evidence and strength of recommendations. BMJ 336, 924-26. doi: 10.1136/bmj.39489.470347.AD\nHaddaway, N. R., Page, M. J., Pritchard, C. C., and McGuinness, L. A. (2022). PRISMA2020: an R package and sony app for producing PRISMA 20-compliant flow diagrams, with interactivity for optimised digital transparency and open synthesis. Campbell Syst. 19: e1812.doi: 10.1002/cl2.1230", "doc_items_refs": ["#/texts/217", "#/texts/218", "#/texts/219", "#/texts/220", "#/texts/221"], "page_nos": [1], "uuid": "d56bf9cc-abe9-4ec1-b7dc-04f3a424f5d3"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 66, "source_chunk_idxs": [76], "num_tokens": 473, "text": "Supplementary material\nJack, C. R., Albert, M., Knopman, D. S., McKhann, G. M., Sperling, R. A., Carillo, M., et al. (2011). Introduction to revised criteria for the diagnosis of Alzheimer's disease: national institution on aging and the Alzheimer association workgroups. Alzheimers Dement. J. Alzheimers Assoc. 7, 257-262. doi: 10.1016/j.jalz.2011.03.004\nJessen, F., Amariglio, R. E., Buckley, R. F., van der Flier, W. M., Han, Y., Molinuevo, J. L., et al. (2020). The characterisation of subjective cognitive decline. Lancet Neuro. 19, 271-278. doi: 10.1016/S1474-442(19)30368-0\nJessen, F., Amariglio, R. E., van Boxtel, M., Bretele, M., Ceccaldi, M., Chételat, G., et al. (2014). A conceptual framework for research on subjective cognitive decline in preclinical Alzheimer ' s disease. Alzheimers D. 10, 844 -852. doi: 10.1016/j.jalz.2014.01.001\nKim, O., Pang, Y, and Kim, J. H. (2019). The effectiveness of virtual reality for people with mild cognitive impairment or dementia: a metaanalysis. BMC Psychiatry 19 :219. doi: 10.1186/s12888-019-2180-x\nKwan, R. Y. C., Liu, J., Sin, O. S. K., Fong, K. N. K., Qin, J., Wong, J. C. Y., et al. (2024). Effects of virtual reality motor-cognitive training for older people with cognitive frailty: Multicentered randomized controlled trial. J. Med. Internet Res. 26 :e57809. doi: 10.2196/57809", "doc_items_refs": ["#/texts/222", "#/texts/223", "#/texts/228", "#/texts/229", "#/texts/230"], "page_nos": [1], "uuid": "f33bb54a-5626-4965-b776-c2a69b958b4c"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 67, "source_chunk_idxs": [77], "num_tokens": 496, "text": "Supplementary material\nLatella, D., Formica, C., Ielo, A., Grioli, P., Marra, A., Costanzo, D., et al. (2024). A feasibility and usability study of a virtual reality (VESA 2D) for cognitive rehabilitation in patients with mild cognitive impairment: an ecological approach. Front. Psychol. 15 :1402894. doi: 10.3389/fpsyg.2024.1402894\nLevy, A. M., Saling, M. M., and Anderson, J. F. I. (2023). Psychological distress and gender predict cognitive complaint after adult cognitive mild traumatic brain injury in pre-morbidly healthy adults. Neuropsychol. Rehabil. 34 , 721 -741. doi: 10.1080/09602011.2023.2236348\nLiao, Y. Y., Chen, I. H., Lin, Y. J., Chen, Y., and Hsu, W. C. (2019). Effects of virtual reality-based physical and cognitive training on external objective and dual-task goal performance in older adults with mild cognitive impairment: a randomized control trial. Front. Aging Neurosci. 11 :162. doi: 10.3389/fnagi.2019.00162\nLiao, Y. Y., Tseng, H. Y., Lin, Y. J., Wang, C. J., and Hsu, W. C. (2020). Using virtual reality-based training to improve cognitive function, instrumental activities of daily living and neural efficiency in older adults with mild cognitive impairment. Eur. J. Phys. Rehabil. Med. 56 , 47 -57. doi: 10.23736/S1873-9087.059984 -9\nLiu, Q., Chen, B., Wang, Q., Xu, D., Yang, M., Lin, G., et al. (2025). Sex differences in the relationship between olfactory and cognitive impairment among subjects with subjective cognitive decline and mild cognitive impairment. Biol. Sex Differ. 16 :12. doi: 10.1186/s13293-025-00691-x", "doc_items_refs": ["#/texts/231", "#/texts/232", "#/texts/233", "#/texts/234", "#/texts/235"], "page_nos": [1], "uuid": "786db56f-7f2b-4a2f-8c37-dc32a15d0faa"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 68, "source_chunk_idxs": [78], "num_tokens": 442, "text": "Supplementary material\nMaggio, M. G., Baglio, F., Arcuri, F., Borgnis, G., Contrada, M., Diaz, M. D. M., et al. (2024). Cognitive telehabilitation: an experiment consent paper on current evidence and future perspective. Front. Neurol. 15 :1338873. doi: 10.3389/fou.2024.1338873\nMaggio, M. G., Cezar, R. P., Milardi, D., Borzelli, D., De Marchis, C., D'Avila, E., et al. (2023). Do patients with neurological disorders benefit from immersive virtual reality? A scoring preview on the emerging use of the computer-assisted rehabilitation environment. Eur. J. Phys. Rehabil. Med. 60 , 37 -43. doi: 10.23736/S1873-9087.23.08025-5\nMaggio, M. G., Piazzaitt, D., Andaloro, A., Latella, D., Sciarone, F., Casella, C., et al. (2022). Embodied cognition in neurodegenerative disorders: what do we know so far? A narrative review focusing on the mirror neuron system and clinical applications. J. Clin. Neurosci. 98 , 66 -72. doi: 10.1016/j.jocon.2022.1028\nManenti, R., Gobbi, E., Baglio, F., Macis, A., Ferrari, C., Pagnioli, L. et al. (2020). Effectiveness of an innovative cognitive treatment and telehabilitation on subjects with mild cognitive impairment: a multicenter, randomized, active-controlled study. Front. Aging Neurosci. 12 :589858. doi: 10.3389/fnagi.2020.5895988", "doc_items_refs": ["#/texts/236", "#/texts/237", "#/texts/238", "#/texts/239"], "page_nos": [1], "uuid": "38b41138-303f-4d6e-9713-2401eb7809d1"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 69, "source_chunk_idxs": [79], "num_tokens": 489, "text": "Supplementary material\nMorone, G., Tranctamano, M., Iosa, M., Shofany, J., Emma, A., Musico, M., et al. (2014). The efficacy of balance training with video game-based therapy in subacute stroke: patients a randomized controlled trial. Bio. Med. Res. Int. 2014 :580861. doi: 10.1155/2014/58086\nNeumann, D., Sander, A. M., Perkins, S. M., Bhamidipalli, S. S., and Hammond, F. M. (2021). Negative attribution bias and related risk factors after brain injury. J. Head Trauma Rehabil. 36 , E61 -70.\nOuzani, M., Hammady, F., Fedorowitz, Z., and Elmgardam, A. (2016). Rayyan-a web and mobile app for systematic reviews. Syst. Rev. 5 :210, doi: 10.1186/s1363-016-0384-4\nPage, M. J., McKenzie, J. E., Bossuyt, P. M., Borton, R., Hoffmann, T. C., Mulrow, C., D., et al. (2021). The PRISMA 2020 statement: an updated guideline for reporting systematic reviews. BJM: n71 . doi: 10.1136/bmnj.n71\nPark, J. H. (2024). Is virtual reality-based cognitive training in parallel with functional near-infrared spectroscopy-derived neurofeedback beneficial to improve cognitive function in older adults with mild cognitive impairment? Disabil. Rehabil. 47 , 1717 -24. doi: 10.1080/09638288.2024.2380483\nPeine, A., Faulkner, A., Jager, B., and Moors, E. (2015). Science, technology and the grand challenge ' age of ageing - understanding the social-material constitution of later life. Technol. Forecast. Soc. Change 93 , 1 -9. doi: 10.1016/j.techfore.2014.11.010", "doc_items_refs": ["#/texts/240", "#/texts/241", "#/texts/242", "#/texts/243", "#/texts/244", "#/texts/245"], "page_nos": [1], "uuid": "6eb0b0ae-6459-4efa-a5b3-2c0af9de9af2"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 70, "source_chunk_idxs": [80], "num_tokens": 410, "text": "Supplementary material\nPeine, A., and Neven, L. (2021). The co-constitution of ageing and technology - a model and agenda. Ageing Soc. 41 , 2845 -2866. doi: 10.1017/S0144486X20000641\nRabin, L. A., Smart, C. M., and Amargiarli, R. E. (2017). Subjective cognitive decline in preclinical Alzheimer ' s disease. Annu. Rev. Clin. Psychol. 13 , 369 -396. doi: 10.1146/annurev-clinpsy-032816-045136\nRabin, L. A., Smart, C. M., Crane, P. K., Amargiarli, R. E., Berman, L. M., Boada, M., et al. (2015). Subjective cognitive decline in older adults: an overview of self-report measures used across 19 international research studies. J Alzheimer ' s Dis 48 , S63 -S86. doi: 10.3233/JAD-150154\nReisberg, B., Shulman, M. B., Torossian, C., Leng, L., and Zhu, W. (2010). Outcome over seven years of healthy adults with and without subjective cognitive impairment. Alzheimers Dement. 6 , 11 -24. doi: 10.1016/j.jalz.2009.10.002\nRiva, G., Mancuso, V., Cavedoni, S., and Stramba-Badiale, C. (2020). Virtual reality in neurorehabilitation: a review of its effects on multiple cognitive domains. Expert Rev. Med. Devices, 17 , 1035 -1061. doi: 10.1080/17434440.2020.1825939", "doc_items_refs": ["#/texts/246", "#/texts/247", "#/texts/248", "#/texts/252", "#/texts/253"], "page_nos": [1], "uuid": "0a9a811e-ae18-482c-bfc5-fb99a39b8cc4"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 71, "source_chunk_idxs": [81], "num_tokens": 427, "text": "Supplementary material\nRutkowski, T. M., Abe, M. S., Komendzinski, T., Sugimoto, H., Narebski, S., and Otake-Matsura, H. (2023). Machine learning approach for early onset dementia neurobiomarker using EEG network topology features. Front. Hum. Neurosci. 17 :1155194. doi: 10.3389/fnhum.2023.1155194\nSachdev, P. S., Blacker, D., Blazer, D. G., Ganguli, M., Jeste, D. V., Paulsen, J. S., et al. (2014). Classifying neurocognitive disorders: the DSM-5 approach. Nat. Rev. Neurol. 10 , 362 -10. doi: 10.1080/17434440.201.1481.13\nSasaninezhad, M., Moradi, A., Farahimanesh, S., Choobin, M., H. M., and Almasi-Doghoea, M. (2024). Enhancing cognitive flexibility and working memory in individuals with mild cognitive impairment: exploring the impact of virtual reality on daily life activities. Gerri. Nat. J. 56 , 32 -39. doi: 10.1016/j.gerin.2023.12.008\nSpecht, J., Stegmann, B., Gross, H., and Krakov, D. (2023). Cognitive training with head-mounted display virtual reality in neuroheurological: Pilot randomized controlled online. Trial JMR Series 15:e4411.e4516.45816\nStafens, E. D., and Turkstra, L. S. (2020). Sex-based differences in expectations for social training. B. Inria. 98 , 1456 -1756.", "doc_items_refs": ["#/texts/254", "#/texts/255", "#/texts/256", "#/texts/257", "#/texts/258"], "page_nos": [1], "uuid": "3cab0bc8-e0e0-4d88-8924-d2f8cbb7619b"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 72, "source_chunk_idxs": [82], "num_tokens": 440, "text": "Supplementary material\nSteele, J., Aner, H. M., Ana, Reeves, C. A., Reves, C. B., Savici'o, J., Berkman, N. D., Viswanathan, M. (2016). et al. (2023). ROBINS-I: a tool for assessing risk of bias in nonrandomised studies of interventions. BMJ 355 :i4919. doi: 10.1136/bmj.44919\nSteele, J. A., Savici, J., Povec, M., J. El, B. Gré, Alzner, S. W., Boclenne, S. W., Bouson, L., et al. , 2014) over a structured dose of risk assessing or random bias in studies. BMJ 366 :1498. doi: 10.1186/mjl.4898\nTertela, U. Saxhalla, M. S., Veza, T., Chan, V., Patelon, A., and Escobar, M. (2023). Gender versus sex in predicting other brains: injury to complex trauma brain injury: a complex study utilizing a database. Sci. Rep. 13 :184350. doi: 10.1038/f41598-02345-683-2\nTieri, G., Morone, G., Paolucci, S., and Iosa, M. (2024). Fiction, and nostalgia: and fallacies. Expert Rev. Med. Devices, 15 :107 -117. doi: 10.1080/17434440.2018.142513\nPorb, S.; Bahai, S., and Puj, H. (2021). The effectiveness of a virtual reality-based cognitive impairment paradigm: a systematic review. Front. Psychol. 14 :1197567. doi: 10.3389/fpsyg.2023.1197567", "doc_items_refs": ["#/texts/259", "#/texts/260", "#/texts/261", "#/texts/262", "#/texts/263"], "page_nos": [1], "uuid": "5a596675-db58-4637-9748-80517bc49a97"}
{"doc_id": "2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444", "source_path": "/home/paul/DocsToKG/Data/DocTagsFiles/2025__Cognitive_rehabilitation_using_virtual_reality_in_subjective_cognitive_decline_a__W4414218444.doctags", "chunk_id": 73, "source_chunk_idxs": [83], "num_tokens": 358, "text": "Supplementary material\nNeurol, C. J., Dostino, S., Goulde, K. M., Pedroli, E., Stramba-Badiale, M., and Riva, G. (2024). Sensitivity of a blind, single-tuned controltrial. Games Health J. 10 , 109 -114. International Agency for Research on Cancer (IARC).\nYang, J. G., Thapa, N., Park, H. J., Bae, S., Pol, Berk, J. P., Morla, B.Purina, 19. Ed. 10.3392/Jad-240134. 10.3390/jperich19201300\nYang, J. G., Thapa, N., Park, H. J., Bae, S., Pol, Berk, J., and Neurospatial: a cognitive and physical brain injury: a systematic review and a controlled study. Neuroch. Paper. 20 :2102. doi: 10.3392/jch0319.puba\nMaggio, M. G., Piazzaitt, D., and Sander, A. M., 2014. 10.1016/j.jamda.2024.105397\nMaggio, M. G., Piazzaitt, D., and Sander, A. M., 2014. 10.1016/j.jamda.2024.105397\nMaggio, M. G., Piazzaitt, D., and Sander, A. M., 2014. 10.1016/j.jamda.2024.105505", "doc_items_refs": ["#/texts/264", "#/texts/265", "#/texts/266", "#/texts/267", "#/texts/268", "#/texts/269"], "page_nos": [1], "uuid": "82a5a85f-c3b7-4717-b4d6-13a58de56ed9"}
